{
  "meta": {
    "part": 4,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 4 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "incomplete-plc-documentation": {
      "title": "Unvollständige SPS/Industrial Control Systems (ICS) Dokumentation (BSI G 0.19)",
      "description": "Speicherprogrammierbare Steuerungen (SPS) und andere industrielle Kontrollsysteme (ICS) sind oft unvollständig dokumentiert, sodass nicht alle Produktfunktionen bekannt sind. In der Dokumentation fehlen häufig Informationen über genutzte Dienste, Protokolle, Kommunikationsports und die Berechtigungsverwaltung.",
      "impact": "Dieser Mangel an Dokumentation erschwert die Bedrohungsanalyse erheblich, da kritische Schnittstellen, Funktionen und Sicherheitsmechanismen übersehen werden können. Mögliche Bedrohungen werden möglicherweise nicht identifiziert oder im Sicherheitskonzept berücksichtigt. Darüber hinaus wird es schwierig oder unmöglich, auf neu entdeckte Schwachstellen zu reagieren, wenn die betroffenen Komponenten und ihre Konfigurationen nicht ordnungsgemäß dokumentiert sind, was zu Beeinträchtigungen der Integrität, Verfügbarkeit und Vertraulichkeit führen kann.",
      "asvs": "Abgeleitet aus den BSI IT-Grundschutz-Katalogen, Gefährdung G 0.19 (Fehlende oder unzureichende Dokumentation) in Anwendung auf den Baustein APP.4.4 (SPS) oder neuere Bausteine wie IND.2 (Industrie-IT).",
      "action": "Vollständige und genaue Systemdokumentation sicherstellen",
      "mitigation": "Erstellen und pflegen Sie eine umfassende Dokumentation für alle SPS/ICS-Komponenten. Diese muss alle Netzwerkschnittstellen, Protokolle, Ports und Dienste sowie das vollständige Autorisierungs- und Authentifizierungskonzept umfassen. Nutzen Sie Netzwerk-Scanning- und Asset-Inventarisierungstools, um Systemeigenschaften zu ermitteln und zu überprüfen. Härten Sie Systeme, indem Sie alle ungenutzten und undokumentierten Dienste und Ports deaktivieren. Überprüfen und aktualisieren Sie die Dokumentation regelmäßig, insbesondere nach Systemänderungen.",
      "check": "Gibt es eine vollständige technische Dokumentation für das SPS/ICS-Asset? Listet sie alle Kommunikationsverbindungen, Protokolle und Ports korrekt auf? Ist das Berechtigungs- und Authentifizierungsmodell klar definiert?",
      "detectionLogic": "Erkennt automatisch technische Assets, die SPS/ICS repräsentieren (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit basiert auf der Anzahl und dem Schweregrad der Modellierungsfehler. Eine Verbindung mit einem ",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn das Modell lediglich unvollständig ist, während die tatsächliche Dokumentation korrekt und umfassend ist. Dies muss außerhalb des Tools überprüft werden."
    },
    "unsuitable-apps-bsi-threat": {
      "title": "Ungeeignete oder @Maintenance:Unmaintained Anwendungen (BSI-Gefährdung)",
      "description": "Die Wahl der Anwendungen hat erhebliche Auswirkungen auf die Informationen, die sie verarbeiten, die mobilen Geräte, auf denen sie laufen, und oft auch auf die Institution",
      "impact": "Die Verwendung ungeeigneter oder @Maintenance:Unmaintained Anwendungen kann zur Beeinträchtigung der Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der beteiligten Daten und Systeme führen. ",
      "asvs": "BSI IT-Grundschutz SYS.2.2.2 Mobile Device Management (MDM)",
      "action": "Einen Prozess zur Überprüfung und zum Lebenszyklusmanagement für Anwendungen etablieren",
      "mitigation": "Implementieren Sie einen formellen Prozess zur Überprüfung und Genehmigung aller Anwendungen, insbesondere auf mobilen Geräten. Dieser Prozess sollte eine Sicherheitsüberprüfung beinhalten, ",
      "check": "Gibt es eine dokumentierte Richtlinie für die Auswahl und Genehmigung von Drittanbieter-Anwendungen? Werden alle mobilen Anwendungen vor der Bereitstellung auf Sicherheit und Support überprüft? ",
      "detectionLogic": "Diese Regel wird für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn ein formeller, effektiver Prozess zur Überprüfung und zum Lebenszyklusmanagement für alle Drittanbieter-Anwendungen vorhanden ist, "
    },
    "excessive-mobile-app-permissions": {
      "title": "Übermäßige Berechtigungen für mobile Apps (BSI APP.1.2)",
      "description": "Mobile Anwendungen benötigen bestimmte Berechtigungen, um auf Gerätefunktionen und -dienste zuzugreifen, wie z. B. Internetkonnektivität, Standortdaten oder das Adressbuch. ",
      "impact": "Die Ausnutzung übermäßiger Berechtigungen kann zu Datenschutzverletzungen, unbefugter Datenänderung oder -löschung und finanziellen Verlusten führen. ",
      "asvs": "MASVS-V2.1: Die App fordert nur die minimal erforderlichen Berechtigungen an.",
      "action": "Prinzip der geringsten Rechte für App-Berechtigungen anwenden",
      "mitigation": "Stellen Sie sicher, dass die mobile Anwendung nur die absolut minimal erforderlichen Berechtigungen für ihre Funktionalität anfordert. ",
      "check": "Gibt es eine dokumentierte Begründung für jede Berechtigung, die die mobile App anfordert? Verwendet die App Laufzeitanfragen für sensible Berechtigungen? ",
      "detectionLogic": "Dieses Risiko wird für alle ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn eine gründliche Überprüfung bestätigt, dass alle angeforderten Berechtigungen minimal, begründet und für die App notwendig sind"
    },
    "malicious-mobile-app-sys2.4": {
      "title": "Risiko durch bösartige mobile Apps (BSI SYS.2.4)",
      "description": "Obwohl einige App-Store-Betreiber die von ihnen angebotenen Apps überprüfen, können diese dennoch Sicherheitslücken oder absichtlich implementierte bösartige Funktionen enthalten. ",
      "impact": "Wenn eine bösartige App installiert wird, kann dies zu unbefugtem Zugriff auf sensible Daten, Datenmanipulation, Dienstunterbrechung und Kompromittierung des gesamten Geräts führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.2.4 (Clients unter Android), insbesondere Anforderung SYS.2.4.A5 ",
      "action": "App-Quellen einschränken und Anwendungen überprüfen",
      "mitigation": "Setzen Sie eine Richtlinie durch, die nur die Installation von Anwendungen aus überprüften, vertrauenswürdigen Quellen (z. B. offizielle Unternehmens- oder öffentliche App-Stores) erlaubt. ",
      "check": "Gibt es eine Richtlinie, die die Installation von Apps auf vertrauenswürdige Quellen beschränkt? Wird diese Richtlinie technisch durch eine MDM/MAM-Lösung durchgesetzt? ",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Dieses Risiko könnte für eine App aus einem offiziellen Store gemeldet werden, bei der die Organisation einen starken, aber nicht modellierten, manuellen Überprüfungsprozess hat. "
    },
    "vulnerable-@Maintenance:Unmaintained-software": {
      "title": "Schwachstellen in @Maintenance:Unmaintained Software",
      "description": "Softwarekomponenten (z. B. Anwendungen, Bibliotheken oder Systeme), die von ihren Entwicklern nicht mehr gewartet werden, stellen ein erhebliches Sicherheitsrisiko dar. ",
      "impact": "Die erfolgreiche Ausnutzung von Schwachstellen in @Maintenance:Unmaintained Software kann zu einer vollständigen Kompromittierung des betroffenen Assets führen",
      "asvs": "V14.2.1: Ein Inventar aller Softwarekomponenten und ihrer Versionen wird gepflegt.",
      "action": "Patch- und Schwachstellenmanagement für alle Komponenten implementieren",
      "mitigation": "Etablieren Sie einen robusten Patch- und Schwachstellenmanagementprozess. Führen Sie ein vollständiges Inventar aller Software-Assets und ihrer Abhängigkeiten (eine Software Bill of Materials - SBOM). ",
      "check": "Gibt es einen dokumentierten Prozess zur Verfolgung und Anwendung von Sicherheitspatches? Gibt es ein vollständiges Softwareinventar (SBOM)? ",
      "detectionLogic": "Diese Regel wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das mit dem Tag `@Maintenance:Unmaintained` gekennzeichnet ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist deutlich erhöht, wenn das Asset dem Internet zugewandt oder anderweitig in einem Netzwerk exponiert ist. ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn der Tag `@Maintenance:Unmaintained` falsch angewendet wird oder wenn effektive, verifizierte kompensierende Kontrollen (wie virtuelles Patchen) vorhanden, aber nicht modelliert sind."
    },
    "insecure-local-data-storage-on-client": {
      "title": "Unsichere lokale Datenspeicherung auf dem Client-Gerät",
      "description": "Einige Anwendungen speichern Daten auf dem Client-Gerät, wie z. B. Benutzerprofile oder Dokumente. Wenn diese Daten unzureichend geschützt sind, können andere Anwendungen auf demselben Gerät möglicherweise darauf zugreifen. Dies gilt sowohl für absichtlich gespeicherte Daten als auch für temporäre Daten, wie z. B. von der Anwendung zwischengespeicherte Informationen. ",
      "impact": "Ein unzureichender Schutz lokal gespeicherter Daten kann zu Verletzungen der Vertraulichkeit (unbefugter Zugriff durch andere Apps oder Angreifer mit physischem Gerätezugriff), der Integrität (unbefugte Änderung) und der Verfügbarkeit (Datenverlust bei Geräteausfall oder -verlust) führen. Dies kann zur Offenlegung sensibler Informationen und zu dauerhaftem Datenverlust führen, wenn keine Sicherung vorhanden ist.",
      "asvs": "OWASP MASVS V2: MSTG-STORAGE-1, MSTG-STORAGE-2",
      "action": "Sichere Speicherung und Sicherung für clientseitige Daten implementieren",
      "mitigation": "Nutzen Sie plattformeigene sichere Speichermechanismen (z. B. iOS Keychain, Android Keystore). Verschlüsseln Sie alle sensiblen Daten, bevor Sie sie auf dem Client-Gerät lokal speichern. Im Threagile-Modell wird dies durch das Setzen des ",
      "check": "Überprüfen Sie technische Assets vom Typ Client, die Daten speichern. Verifizieren Sie, dass das ",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche Client-Assets (z. B. mobile Apps, Desktop-Clients) ausgelöst, die Daten speichern. Ein Risiko wird generiert, wenn die Daten unverschlüsselt gespeichert werden (",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeits- und Verfügbarkeitsbewertungen der auf dem Client gespeicherten Daten-Assets bestimmt. ",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn die gespeicherten Daten nicht sensibel und von Natur aus öffentlich sind, was eine Verschlüsselung unnötig macht. Das Verfügbarkeitsrisiko kann fälschlicherweise ausgelöst werden, wenn ein Sicherungsmechanismus vorhanden ist, aber nicht über das "
    },
    "unwanted-data-leakage-via-app-metadata": {
      "title": "Unerwünschter Datenabfluss über App-Metadaten (BSI APP.4.2)",
      "description": "Apps auf Client-Geräten (z. B. Mobiltelefone, Desktops) sammeln oft umfangreiche Metadaten über ihre Nutzung. ",
      "impact": "Dritte könnten diese gesammelten Metadaten analysieren, um sensible Informationen abzuleiten, selbst wenn die App keinen direkten Zugriff darauf hat. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium, Baustein APP.4 Mobile Geräte, insbesondere zur Behandlung der Gefährdung ",
      "action": "App-Berechtigungen einschränken und Client-Geräte verwalten",
      "mitigation": "Verwalten und beschränken Sie die Berechtigungen, die Anwendungen auf Client-Geräten, insbesondere mobilen Apps, gewährt werden, streng. ",
      "check": "Gibt es Richtlinien zur Verwaltung von App-Installationen und -Berechtigungen auf Client-Geräten? Wird eine Mobile Device Management (MDM) oder eine ähnliche Endpunktschutzlösung verwendet? Werden die Benutzer über diese Risiken geschult?",
      "detectionLogic": "Dieses Risiko wird automatisch für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als Client-Systeme identifiziert werden (z. B. mobile Apps, Browser, Desktop-Clients, IoT-Geräte). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei mobilen und IoT-Technologien höher eingestuft. Die Auswirkung wird durch die Vertraulichkeitsanforderungen des technischen Assets bestimmt, ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn robuste Geräteverwaltungslösungen vorhanden sind, die App-Berechtigungen und Datenexfiltration effektiv einschränken, das entsprechende Asset im Modell jedoch nicht als solches gekennzeichnet wurde."
    },
    "@System:UCC-availability-dependencies": {
      "title": "Verfügbarkeitsrisiko für @System:UCC-Dienste aufgrund kritischer Abhängigkeiten (BSI APP.3.2.A5)",
      "description": "@System:UCC (Unified Communications and Collaboration)-Dienste haben oft hohe Verfügbarkeitsanforderungen. Ihre Funktionalität hängt jedoch von verschiedenen anderen IT-Systemen ab. ",
      "impact": "Wenn eine kritische Abhängigkeit eines @System:UCC-Dienstes ausfällt, ist die Verfügbarkeit des Dienstes beeinträchtigt. Dies kann kommunikationsabhängige Geschäftsprozesse behindern. ",
      "asvs": "BSI IT-Grundschutz APP.3.2.A5 (Hochverfügbarkeit von @System:UCC-Diensten) und CON.1 (Notfallmanagement).",
      "action": "Auf Ausfallsicherheit auslegen und kritische Abhängigkeiten verwalten",
      "mitigation": "Identifizieren Sie alle kritischen Abhängigkeiten für @System:UCC-Dienste. Implementieren Sie für jede Abhängigkeit Maßnahmen zur Ausfallsicherheit. ",
      "check": "Sind alle Abhängigkeiten für den @System:UCC-Dienst dokumentiert? Sind die Abhängigkeiten auf hohe Verfügbarkeit ausgelegt? ",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von Assets erkannt, die als `@System:UCC-service` getaggt sind. Die Regel analysiert dann ihre Kommunikationsverbindungen auf kritische Abhängigkeiten: ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeitsanforderung des @System:UCC-Dienstes selbst bestimmt (z. B. führt `mission-critical` Verfügbarkeit zu `very-high` Auswirkung). ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht die vollständige Ausfallsicherheit eines abhängigen Dienstes. Beispielsweise könnte ein Asset, das einen Authentifizierungsanbieter darstellt, im Diagramm ein einzelner Knoten sein, in der Realität jedoch einen hochverfügbaren Cluster repräsentieren. Dieses Risiko sollte anhand der detaillierten Architektur der abhängigen Dienste validiert werden."
    },
    "inadequate-planning-of-@System:UCC-systems-app-3-2-a5": {
      "title": "Unzureichende Planung von @System:UCC-Systemen (BSI APP.3.2.A5)",
      "description": "Wenn ein Unified Communications and Collaboration (@System:UCC)-System nicht entsprechend seiner tatsächlichen und zukünftigen Nutzung geplant wird, kann die Funktionalität aller @System:UCC-Dienste erheblich beeinträchtigt werden. Wenn sich Nutzungsmuster ändern oder die Anzahl der Benutzer zunimmt, kann ein ursprünglich geeigneter Plan unzureichend werden, was zu Leistungseinbußen oder Dienstausfällen führt. Dies gilt insbesondere für die Netzwerkkapazität und die Rechenleistung der Endgeräte.",
      "impact": "Dies kann zu einer schwerwiegenden Verschlechterung oder einem vollständigen Ausfall von Kommunikationsdiensten (Sprache, Video, Messaging) führen und Geschäftsprozesse stören. Beispielsweise können Videokonferenzen unter Ruckeln, Tonaussetzern oder visuellen Artefakten leiden, und Echtzeitkommunikation kann unbrauchbar werden. Dies wirkt sich direkt auf die betriebliche Effizienz, die Zusammenarbeit und die Verfügbarkeit des Systems aus.",
      "asvs": "BSI IT-Grundschutz APP.3.2: Unified Communications and Collaboration, Anforderung APP.3.2.A5: Planung des @System:UCC-Einsatzes",
      "action": "Umfassende @System:UCC-Planung und Kapazitätsmanagement sicherstellen",
      "mitigation": "@System:UCC-Implementierungen müssen sorgfältig auf der Grundlage der aktuellen und prognostizierten Nutzung geplant werden, einschließlich Benutzerzahlen, Funktionsumfang und Verkehrsmustern. Die Netzwerkinfrastruktur muss bewertet und für den @System:UCC-Verkehr dimensioniert werden, insbesondere für Echtzeitdienste wie Video und Sprache. Die Fähigkeiten der Endgeräte müssen berücksichtigt werden, wobei die Verwendung von leistungsschwachen Geräten (wie bestimmten Thin Clients) für leistungsintensive Aufgaben vermieden werden sollte. Die Systemleistung und -kapazität sollten regelmäßig überwacht und überprüft werden.",
      "check": "Gibt es einen formellen Kapazitäts- und Nutzungsplan für das @System:UCC-System? Wurde das Netzwerk explizit für den @System:UCC-Verkehr dimensioniert? Sind die Mindesthardwareanforderungen für Client-Geräte dokumentiert und werden sie durchgesetzt? Wird die Systemleistung aktiv überwacht?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Teil eines @System:UCC-Systems identifiziert werden (gekennzeichnet mit `@System:UCC`). Das Risiko wird erhöht, wenn diese Systeme hohe Verfügbarkeitsanforderungen haben. Ein spezifisches Risiko wird auch generiert, wenn Clients mit begrenzter Rechenleistung (gekennzeichnet mit `@ThinClient`) sich mit @System:UCC-Systemen verbinden, da dies zu Leistungsproblemen auf der Client-Seite führen kann, was effektiv zu einem Denial-of-Service für diesen Benutzer führt.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn unternehmenskritische @System:UCC-Dienste ohne spezifische Kapazitätsplanung eingesetzt werden oder wenn sie auf leistungsschwachen Clients basieren. Die Auswirkung steht in direktem Zusammenhang mit der Verfügbarkeitsanforderung des @System:UCC-Systems und den davon abhängigen Geschäftsprozessen. Ein Ausfall einer unternehmenskritischen Kollaborationsplattform hat eine sehr hohe Auswirkung.",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn eine umfassende Kapazitätsplanung und Leistungstests bereits durchgeführt wurden, auch wenn das Modell Tags wie `@ThinClient` verwendet oder ein @System:UCC-System als unternehmenskritisch kennzeichnet. Das Modell enthält keine Daten über Netzwerkbandbreite oder spezifische Client-Hardwaremodelle. Die Überprüfung erfordert die Einsicht in Netzwerkdiagramme, Kapazitätspläne und Client-Hardwarespezifikationen."
    },
    "misconfiguration-of-services": {
      "title": "Fehlkonfiguration von Diensten",
      "description": "Eine große Anzahl von Funktionen und Diensten impliziert oft eine Vielzahl von Konfigurationsoptionen. Diese Komplexität kann zu Fehlkonfigurationen führen, insbesondere in Systemen wie denen für Unified Communications and Collaboration (@System:UCC), wie vom BSI zitiert. Benutzer können bei der Konfiguration ihrer eigenen Clients überfordert sein, und Administratoren können kritische Fehler bei der Änderung zentraler Einstellungen einführen, insbesondere wenn das Identity and Access Management (IAM)-Konzept unzureichend ist. Solche Fehlkonfigurationen können auch zu unzureichend eingeschränkten Berechtigungen für externe Teilnehmer führen.",
      "impact": "Fehlkonfigurationen können zu einer Reihe negativer Ergebnisse führen, einschließlich teilweiser oder vollständiger Dienstunverfügbarkeit (Denial of Service), Datenverlust und Sicherheitsverletzungen. Insbesondere können sie zu unbeabsichtigter Informationsweitergabe (z. B. ein Konferenzsystem, das Anrufe automatisch annimmt), Informationslecks an unbefugte externe Parteien oder Datenmanipulation führen.",
      "asvs": "OWASP ASVS V1.11.1 (war V14.2.1): Die Anwendung ist für alle Komponenten im Stack gehärtet und sicher konfiguriert.",
      "action": "Sichere Konfigurations-Baselines und ein robustes IAM-Konzept implementieren und durchsetzen",
      "mitigation": "Definieren Sie gehärtete Sicherheits-Baselines für alle Systemkomponenten und überprüfen Sie diese regelmäßig. Verwalten Sie Konfigurationen mit versionierter Infrastructure-as-Code (IaC) mit automatisiertem Linting und obligatorischen Peer-Reviews. Implementieren Sie ein robustes Identity and Access Management (IAM)-Konzept, das auf dem Prinzip der geringsten Rechte für Administratoren und Endbenutzer basiert. Für benutzerkonfigurierbare Clients bieten Sie vernünftige, standardmäßig sichere Einstellungen und klare Anleitungen. Berechtigungen für externe oder Gastbenutzer müssen streng auf das absolut Notwendige beschränkt sein.",
      "check": "Sind sichere Konfigurations-Baselines definiert, versioniert und werden sie automatisch durchgesetzt? Gibt es einen formellen Prozess zur Überprüfung und Genehmigung von Konfigurationsänderungen? Existiert ein klares IAM-Konzept, das das Prinzip der geringsten Rechte durchsetzt? Sind die Standardberechtigungen für externe Teilnehmer explizit definiert und restriktiv?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die ein hohes Potenzial für Fehlkonfigurationen aufweisen. Dazu gehören: 1. Assets, die benutzerseitige Clients darstellen, die von Endbenutzern falsch konfiguriert werden könnten. 2. Komplexe Backend-Systeme, insbesondere solche mit kundenspezifisch entwickelten Teilen. 3. Assets, die eingehende Kommunikation von externen Entitäten oder über Vertrauensgrenzen hinweg mit schwacher oder fehlender Autorisierung akzeptieren, was auf eine potenzielle Fehlkonfiguration von IAM oder Zugriffskontrolle hinweist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird für kundenspezifisch entwickelte Komponenten und für Dienste, die externen Benutzern mit schwachen Zugriffskontrollen ausgesetzt sind, als höher eingestuft. Die Auswirkung leitet sich direkt aus den Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten ab. Eine Fehlkonfiguration eines Systems, das ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage von Architekturmustern und Asset-Eigenschaften generiert, nicht auf der tatsächlichen Live-Konfiguration des Systems. Ein Asset könnte gemeldet werden, aber perfekt konfiguriert und nach Best Practices verwaltet sein. Eine manuelle Überprüfung der Konfiguration und der Betriebsprozesse ist erforderlich, um dieses Risiko zu bestätigen oder zu verwerfen."
    },
    "misuse-of-administrative-privileges-on-@System:UCC-systems": {
      "title": "Missbrauch von administrativen Rechten auf @System:UCC-Systemen (BSI APP.3.2)",
      "description": "Aufgrund ihrer zugewiesenen administrativen Rechte können Administratoren potenziell tiefgreifende Änderungen an Unified Communications and Collaboration (@System:UCC)-Diensten vornehmen. ",
      "impact": "Die unbefugte oder missbräuchliche Verwendung von administrativen Rechten kann zu Verletzungen der Vertraulichkeit (z. B. Offenlegung privater Chats/Dateien), der Integrität (z. B. unbefugte Änderung von Daten) und der Verfügbarkeit (z. B. böswillige Änderung von Routing-Konfigurationen zur Störung von Diensten wie Telefonie) führen. ",
      "asvs": "BSI IT-Grundschutz Baustein APP.3.2 Unified Communications und Collaboration (@System:UCC)",
      "action": "Strenge Zugriffskontrolle, Überwachung und Protokollierung für administrative Rollen auf @System:UCC-Systemen implementieren",
      "mitigation": "Setzen Sie das Prinzip der geringsten Rechte für alle administrativen Konten auf @System:UCC-Systemen durch. Verwenden Sie dedizierte, separate Konten für administrative Aufgaben im Gegensatz zur täglichen Nutzung. ",
      "check": "Werden administrative Rechte auf @System:UCC-Systemen nach dem Prinzip der geringsten Rechte vergeben? Werden alle administrativen Aktionen protokolliert? Werden diese Protokolle regelmäßig auf verdächtige Aktivitäten überprüft? Werden separate Konten für den administrativen Zugriff verwendet?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Teil eines @System:UCC-Systems identifiziert werden (z. B. Mailserver, Dateiserver, Webanwendungen, Message Queues) und mit administrativen Rollen getaggt sind. ",
      "riskAssessment": "Die Auswirkung hängt direkt von den Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen des @System:UCC-Systems und der von ihm verarbeiteten Daten ab. Ein System, das ",
      "falsePositives": "Ein Risiko könnte als Fehlalarm gemeldet werden, wenn das Modell kompensierende Kontrollen nicht erfasst, wie z. B. ein strikt durchgesetztes Vier-Augen-Prinzip für alle administrativen Änderungen oder eine automatisierte Echtzeit-Überprüfung, die bösartige Aktionen blockieren kann."
    },
    "unintentional-disclosure-via-@System:UCC-client": {
      "title": "Unbeabsichtigte Informationsweitergabe über @System:UCC-Client",
      "description": "Moderne Unified Communications and Collaboration (@System:UCC)-Clients bieten eine breite Palette an Funktionen, was sie für viele Benutzer komplex und unübersichtlich machen kann. ",
      "impact": "Die falsche Verwendung von @System:UCC-Clients kann zu schwerwiegenden Verletzungen der Vertraulichkeit und Verstößen gegen interne Richtlinien führen. Sensible Informationen können unbefugten Personen, sowohl intern als auch extern, zugänglich gemacht werden, was zu Reputationsschäden, dem Verlust von Wettbewerbsvorteilen und potenziellen rechtlichen oder regulatorischen Strafen führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz SYS.3.2.2 Unified Communications und Collaboration, insbesondere Anforderung SYS.3.2.2.A5 ",
      "action": "Benutzerschulungen implementieren und @System:UCC-Dienstkonfiguration härten",
      "mitigation": "Eine Kombination aus Benutzerbewusstsein und technischen Kontrollen ist erforderlich. ",
      "check": "Werden Benutzer regelmäßig in sicheren @System:UCC-Praktiken geschult? Gibt es klare Richtlinien für den Umgang mit Daten auf @System:UCC-Plattformen? Sind @System:UCC-Dienste mit sicheren Standardeinstellungen konfiguriert (z. B. standardmäßig private Teamräume)? Bietet die Benutzeroberfläche des Clients klare Warnungen und Indikatoren, um Benutzerfehler zu vermeiden?",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets ausgelöst, die Clients darstellen (z. B. Desktop, Mobile App, Browser) und explizit als für Unified Communications and Collaboration verwendet identifiziert sind durch das ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird aufgrund der inhärenten Komplexität funktionsreicher @System:UCC-Clients und häufiger Lücken im Benutzerbewusstsein als hoch angesehen. Die Auswirkung wird durch die Sensibilität der Daten bestimmt, die das Client-Asset verarbeiten soll, sowie der Daten, die es verarbeitet. Ein Client, der zur Besprechung von ",
      "falsePositives": "Das Risiko könnte geringer sein als berechnet, wenn die Organisation ein außergewöhnlich robustes und effektives Benutzerschulungsprogramm für ihre @System:UCC-Tools hat oder wenn die spezifische Client-Anwendung ein sehr einfaches, intuitives Design hat, das die Wahrscheinlichkeit von Benutzerfehlern minimiert."
    },
    "unwanted-disclosure-via-@System:UCC-services": {
      "title": "Unerwünschte Offenlegung von Informationen über @System:UCC-Dienste (BSI OPS.2.2, OPS.1.1.5)",
      "description": "Unified Communications and Collaboration (@System:UCC)-Dienste sammeln und zeigen oft Benutzerdaten an, wie z. B. Präsenzstatus, Aktivitätszeitstempel und sogar detaillierte Analysen von Gesprächen und Inhalten. Dies kann zur Erstellung von Benutzerprofilen und zur unbeabsichtigten Offenlegung persönlicher oder sensibler Informationen führen. ",
      "impact": "Die unbeabsichtigte Offenlegung von Informationen kann zu Datenschutzverletzungen führen, die eine Verhaltens- und Leistungsüberwachung von Mitarbeitern ermöglichen. Sie kann auch persönliche Beziehungen, Arbeitsgewohnheiten und Details einer Person offenlegen",
      "asvs": "BSI IT-Grundschutz Baustein OPS.2.2.A15 (Schutz der Privatsphäre der Benutzer in Groupware) und OPS.1.1.5.A7 (Schulung für Benutzer von Videokonferenzsystemen).",
      "action": "Implementieren und Durchsetzen von datenschutzfreundlichen Konfigurationen und Benutzerschulungen für @System:UCC-Dienste.",
      "mitigation": "Konfigurieren Sie @System:UCC-Dienste technisch so, dass die Datenerfassung und -exposition minimiert wird. Beschränken Sie die Sichtbarkeit des Präsenzstatus, deaktivieren oder begrenzen Sie Aktivitätsprotokollierungs- und Analysefunktionen und erzwingen Sie die Verwendung von virtuellen Hintergründen oder Hintergrundunschärfe in Videokonferenzen. ",
      "check": "Werden die Datenschutzeinstellungen von @System:UCC überprüft und auf ein ",
      "detectionLogic": "Dieses Risiko wird für Assets ausgelöst, die als Unified Communications and Collaboration (@System:UCC)-Komponenten identifiziert wurden. Dazu gehören sowohl serverseitige Assets (wie Webanwendungen, Mailserver oder Message Queues), die Benutzerdaten aggregieren könnten, als auch clientseitige Assets (wie mobile Apps oder Browser), die den Benutzer offenlegen könnten",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei Client-Anwendungen aufgrund der Häufigkeit der Umgebungsbelichtung in Videoanrufen als hoch und bei Serveranwendungen, die umfangreiche Kollaborationsfunktionen bieten, als wahrscheinlich angesehen. Die Auswirkung wird durch die Vertraulichkeit der Daten-Assets bestimmt, die von dem Asset verarbeitet oder über seine Kommunikationsverbindungen übertragen werden. Daten mit höherer Vertraulichkeit führen zu einer höheren Auswirkungsbewertung.",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn das identifizierte Asset ein @System:UCC-Tool mit sehr begrenzter Funktionalität ist (z. B. ein einfacher reiner Text-Chat ohne Präsenz) oder wenn nachweislich starke technische und organisatorische Datenschutzkontrollen vorhanden und wirksam sind."
    },
    "@System:UCC-service-interaction-risk-app-5-3": {
      "title": "Funktionsbeeinträchtigung durch Interaktion von @System:UCC-Diensten (BSI APP.5.3.T5)",
      "description": "@System:UCC (Unified Communications and Collaboration)-Dienste können miteinander interagieren und dadurch die Funktionalität einschränken. ",
      "impact": "Wenn @System:UCC-Dienste sich gegenseitig stören oder das Client-System überlasten, ist ihre Verfügbarkeit beeinträchtigt. Dies kann Geschäftsprozesse stören, Mitarbeiter daran hindern, Aufgaben zu erledigen, und zu einem Produktivitätsverlust führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein APP.5.3 @System:UCC-Clients (Edition 2022)",
      "action": "@System:UCC-Dienste isolieren oder gemeinsam genutzte Ressourcen verwalten",
      "mitigation": "Um Konflikte zu vermeiden, führen Sie kritische @System:UCC-Dienste auf dedizierten Clients oder in isolierten Umgebungen (z. B. virtuelle Maschinen) aus. ",
      "check": "Sind mehrere technische Assets mit ",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Konflikts wird als ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die @System:UCC-Anwendungen speziell dafür entwickelt wurden, ohne Konflikte zusammenzuarbeiten, oder wenn das zugrunde liegende Betriebssystem und die Hardware über ein robustes Ressourcenmanagement verfügen, das Konkurrenzprobleme verhindert. "
    },
    "uncontrolled-desktop-sharing": {
      "title": "Unkontrollierte Desktop- oder Anwendungsfreigabe (BSI CON.3.A13)",
      "description": "Wenn Desktop- oder Bildschirminhalte mit anderen Teilnehmern in einem Gespräch (z. B. Videokonferenz, Fernwartung) geteilt werden, kann die Kontrolle an andere Benutzer übertragen werden. ",
      "impact": "Wenn ein Angreifer oder unbefugter Teilnehmer die Kontrolle über einen Benutzer erlangt",
      "asvs": "BSI IT-Grundschutz CON.3.A13 Fernsteuerung von Clients",
      "action": "Funktionen zur Remote-Desktop-Freigabe einschränken oder kontrollieren",
      "mitigation": "Wenn die Fernsteuerungsfunktion erforderlich ist, sollte sie in Kollaborationstools standardmäßig deaktiviert sein. ",
      "check": "Ist die Fernsteuerungsfunktionalität in Kollaborations- und Bildschirmfreigabe-Tools standardmäßig deaktiviert? Werden Benutzer über die Risiken dieser Funktion geschult? ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets vom Typ Client ausgelöst, die als von einem Menschen genutzt markiert sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jedes Client-System als höher eingestuft, da die Schwachstelle aus dem Benutzerverhalten und gängigen Anwendungsfunktionen resultiert. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Fernsteuerungsfunktion nachweislich durch technische Kontrollen (z. B. GPO, MDM-Richtlinien) deaktiviert ist. "
    },
    "@System:UCC-impersonation-risk": {
      "title": "Identitätsmissbrauchsrisiko in Unified Communications and Collaboration (@System:UCC)-Diensten",
      "description": "Die Einführung neuer Unified Communications and Collaboration (@System:UCC)-Dienste, die oft externen Parteien die Kontaktaufnahme ermöglichen, schafft neue Angriffsvektoren. ",
      "impact": "Erfolgreicher Identitätsmissbrauch kann zur unbefugten Offenlegung sensibler oder vertraulicher Informationen, zur Manipulation von Geschäftsprozessen und zu Finanzbetrug führen. ",
      "asvs": "V4.1 Identitäts- und Verifizierungsanforderungen",
      "action": "Identitätsprüfung und Benutzerbewusstsein für Kommunikationsplattformen stärken",
      "mitigation": "Implementieren Sie eine mehrschichtige Verteidigung. Aus technischer Sicht stellen Sie sicher, dass jede Benutzeroberfläche (UI) Kommunikationen, die von externen Quellen stammen, klar und unmissverständlich kennzeichnet. ",
      "check": "Sind alle eingehenden Kommunikationen von externen Quellen in der Benutzeroberfläche klar und deutlich als solche gekennzeichnet? ",
      "detectionLogic": "Dieses Risiko wird für kommunikationsorientierte technische Assets (wie Webanwendungen, Message Queues oder Mailserver) ausgelöst, die der Interaktion von weniger vertrauenswürdigen Quellen ausgesetzt sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn die Kommunikationsplattform direkt dem Internet ausgesetzt ist und eine starke Authentifizierung für eingehende Interaktionen fehlt. ",
      "falsePositives": "Ein technisches Asset könnte fälschlicherweise gemeldet werden, wenn es über robuste, nicht umgehbare Kontrollen zur Unterscheidung und Kennzeichnung externer Kommunikationen verfügt, die im Bedrohungsmodell erfasst sind. "
    },
    "lack-of-maintenance-ops1.1.2": {
      "title": "Mangel an regelmäßiger Wartung (BSI OPS.1.1.2)",
      "description": "Wenn Systeme, Anwendungen oder Hardwarekomponenten nicht regelmäßig gewartet werden, können sie fehlerhaft funktionieren, schlecht performen oder vollständig ausfallen. ",
      "impact": "Das Versäumnis, regelmäßige Wartung durchzuführen, beeinträchtigt in erster Linie die **Verfügbarkeit** des betroffenen Assets und kann auch dessen **Integrität** (z. B. durch Datenkorruption oder Leistungsabfall) beeinträchtigen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.2 (Ordnungsgemäßer Betrieb), insbesondere Anforderung OPS.1.1.2.A11 (Wartung und Instandsetzung von IT-Komponenten).",
      "action": "Einen regelmäßigen Wartungsplan erstellen und dokumentieren",
      "mitigation": "Definieren, dokumentieren und implementieren Sie einen formellen Wartungsplan für alle im Geltungsbereich befindlichen technischen Assets. Dieser Plan sollte Wartungsaufgaben (z. B. Patchen, Zustandsprüfungen, Kapazitätsüberwachung, Hardwareinspektion), Häufigkeiten und verantwortliches Personal festlegen. ",
      "check": "Gibt es einen dokumentierten Wartungsplan für das Asset? Sind Wartungsaktivitäten protokolliert und nachprüfbar? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das nicht explizit ausgeschlossen ist (wie serverlose Plattformen oder externe Entitäten) und keinen `maintenance`-Tag hat. ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Ausfalls aufgrund mangelnder Wartung steigt mit dem Alter des Assets",
      "falsePositives": "Ein Risiko könnte für ein Asset gemeldet werden, das tatsächlich gut gewartet wird, aber den entsprechenden Tag im Modell nicht hat. "
    },
    "insufficient-machine-interface-protection": {
      "title": "Unzureichender Schutz von Maschinenschnittstellen (BSI-basiert)",
      "description": "Wenn die Schnittstellen einer Maschine (z. B. ein IoT-Gerät, ein industrielles Kontrollsystem oder ein Mainframe) unzureichend geschützt sind, ",
      "impact": "Erfolgreiche Manipulation kann zur Manipulation der Maschine führen",
      "asvs": "Nicht direkt anwendbar, da ASVS auf Webanwendungen ausgerichtet ist. Das Äquivalent im Bereich der industriellen Kontrollsysteme (ICS) ist IEC 62443, insbesondere Konzepte zu Zonen- und Leitungs-Grenzen und Zugriffskontrolle.",
      "action": "Alle Maschinenschnittstellen härten und schützen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen zur Maschine, insbesondere solche, die für Konfiguration, Steuerung oder Verwaltung verwendet werden, angemessen geschützt sind. ",
      "check": "Überprüfen Sie alle eingehenden Kommunikationsverbindungen zu Assets, die als physische Maschinen identifiziert wurden. Verwenden welche unverschlüsselte Protokolle? Ist die Authentifizierung und/oder Autorisierung auf ",
      "detectionLogic": "Diese Regel wird für technische Assets ausgelöst, die physische Maschinen darstellen (d. h. `machine: physical`), insbesondere solche mit Technologien wie `IoT-device` oder `mainframe`. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist erhöht, wenn die unsichere Schnittstelle über eine Netzwerk-Vertrauensgrenze hinweg zugänglich ist. Die Auswirkung korreliert direkt mit der ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn starke kompensierende Kontrollen im Modell erfasst sind, wie z. B. dass sich die Maschine in einem physisch sicheren, luftisolierten Netzwerk befindet."
    },
    "manipulation-of-safety-instrumented-system": {
      "title": "Manipulation eines sicherheitsgerichteten Systems (basierend auf NAMUR NA 163)",
      "description": "Die Manipulation des Anwendungsprogramms auf einem Logiksystem innerhalb eines sicherheitsgerichteten Systems (SIS) stellt ein erhebliches Risiko dar. Im Gegensatz zu Standard-IT- oder OT-Komponenten kann eine Kompromittierung eines SIS schwerwiegende Folgen für die Sicherheit von Personen, der Umwelt und physischen Anlagen haben. ",
      "impact": "Eine erfolgreiche Manipulation kann zu einer Reihe von Ergebnissen führen, von Betriebsausfällen (Fehlauslösung) bis hin zum vollständigen Versagen der Sicherheitsfunktionen, was potenziell zu katastrophalen physischen Schäden, Umweltschäden oder dem Verlust von Menschenleben führen kann, wenn ein gefährliches Ereignis eintritt.",
      "asvs": "Abgeleitet von BSI-Empfehlungen und den NAMUR NA 163-Richtlinien für die Sicherheit von industriellen Kontrollsystemen.",
      "action": "Eine Defense-in-Depth-Sicherheitsarchitektur für OT/ICS-Umgebungen implementieren",
      "mitigation": "Ein mehrschichtiger Sicherheitsansatz ist erforderlich. Dies umfasst eine strikte Netzwerksegmentierung zur Isolierung des SIS, robuste Zugriffskontrollmechanismen (sowohl physisch als auch logisch) für den Logik-Controller und eine kontinuierliche Integritätsüberwachung des Anwendungsprogramms. ",
      "check": "Ist das SIS-Netzwerksegment von den Unternehmens- und anderen Kontrollnetzwerken isoliert? Ist der Zugriff auf den Logik-Controller",
      "detectionLogic": "Diese Regel wird bei technischen Assets ausgelöst, die als Kernlogik-Controller für sicherheitsgerichtete Systeme identifiziert sind und mit dem ",
      "riskAssessment": "Das Risiko wird in drei Kategorien bewertet:\n",
      "falsePositives": "Das Risiko kann überbewertet sein, wenn das Asset falsch getaggt ist oder wenn umfangreiche, nicht modellierte kompensierende Kontrollen vorhanden sind (z. B. separate physische Sicherheitsrelais, redundante diverse Systeme)."
    },
    "inadequate-monitoring-of-it-infrastructure": {
      "title": "Unzureichende Überwachung der unterstützenden IT-Infrastruktur auf Sicherheitsereignisse",
      "description": "Eine Schlüsselfunktion von Automatisierungssystemen ist die Überwachung der Betriebszustände des zu automatisierenden Prozesses (z. B. Füllstände, Temperatur). ",
      "impact": "Das Versäumnis, die IT-Infrastruktur zu überwachen, verhindert die frühzeitige Erkennung von Sicherheitsvorfällen, Systemausfällen oder Leistungseinbußen. Dies kann dazu führen, dass erfolgreiche Angriffe unbemerkt bleiben, Ausfallzeiten verlängert werden und eine forensische Analyse unmöglich wird, was letztendlich die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und seiner Daten beeinträchtigt.",
      "asvs": "BSI IT-Grundschutz DER.1: Detektion von sicherheitsrelevanten Ereignissen",
      "action": "Umfassende Sicherheitsüberwachung und Protokollierung implementieren",
      "mitigation": "Stellen Sie sicher, dass alle kritischen IT-Infrastrukturkomponenten (Server, Netzwerkgeräte, Anwendungen, Datenbanken) sicherheitsrelevante Protokolle generieren. Diese Protokolle sollten zentral gesammelt, korreliert und von einem Security Information and Event Management (SIEM)-System oder einer dedizierten Überwachungslösung überwacht werden. Definieren und implementieren Sie Warnmeldungen für verdächtige Aktivitäten, Sicherheitsereignisse und kritische Systemzustandsindikatoren. Stellen Sie sicher, dass die Überwachungssysteme selbst gesichert und hochverfügbar sind. Modellieren Sie diese Überwachungssysteme und die Kommunikationsverbindungen von den überwachten Assets zu ihnen.",
      "check": "Werden sicherheitsrelevante Ereignisse von allen kritischen Infrastrukturkomponenten protokolliert? Gibt es ein zentrales Protokollierungs- und Überwachungssystem? Gibt es definierte Alarmregeln für Sicherheitsereignisse? Sind Mitarbeiter für die Reaktion auf diese Alarme zuständig? Ist diese Architektur im Bedrohungsmodell abgebildet?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Überwachung durch Mechanismen erreicht wird, die nicht im Modell dargestellt sind, wie z. B. hostbasierte Agenten, die an eine SaaS-Plattform berichten, die nicht"
    },
    "undocumented-@SystemType:OT-remote-access": {
      "title": "Undokumentierter oder nicht verwalteter Fernwartungszugriff in einer @SystemType:OT/@SystemType:ICS-Umgebung",
      "description": "Fernwartungszugänge in der Betriebstechnologie (@SystemType:OT) sind oft zahlreich und vielfältig und werden von verschiedenen internen und externen Parteien verwaltet. Diese Komplexität kann zu einem unvollständigen oder ungenauen Inventar der Zugangspunkte führen. Wenn undokumentierte Fernzugriffspfade existieren, können sie nicht kontrolliert, überwacht oder gesichert werden. Unbefugte Benutzer könnten Zugriff erlangen und physische Prozesse direkt manipulieren, was zu Gerätefehlfunktionen, Produktionsstillständen oder sogar zu physischen Schäden für das Personal vor Ort führen kann. Dieses Risiko wird oft verstärkt, wenn Anbieter ",
      "impact": "Ein ausgenutzter, nicht verwalteter Fernzugriff kann die Integrität und Verfügbarkeit von industriellen Kontrollsystemen (@SystemType:ICS) direkt beeinträchtigen. Dies kann zu erheblichen Betriebsstörungen, Schäden an Maschinen, Produktionsausfällen und schweren Gesundheits- und Sicherheitsvorfällen führen. Es stellt ein kritisches Versagen bei der Trennung von IT- und @SystemType:OT-Netzwerken dar.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium, insbesondere den Konzepten in IND.1 (Industrielles Kontrollsystem) und IND.2 (Fernwartung von industriellen Komponenten). Diese Regel behandelt die Bedrohung durch nicht verwaltete Fernverbindungen (IND.2.4.A1, IND.2.4.A2).",
      "action": "Ein umfassendes Inventar und Management von Fernzugangspunkten einrichten und pflegen",
      "mitigation": "Etablieren Sie einen strengen Prozess zur Autorisierung, Dokumentation und Bereitstellung aller Fernzugriffe auf die @SystemType:OT-Umgebung. Führen Sie ein vollständiges und aktuelles Inventar aller Fernzugriffsverbindungen, einschließlich ihres Zwecks, Eigentümers und ihrer Sicherheitskontrollen. Jeder Zugriff sollte über ein kontrolliertes Gateway oder ",
      "check": "Gibt es ein vollständiges, aktuelles Inventar aller Fernwartungszugänge in die @SystemType:OT-Zone? Wird jeder Fernzugriff über ein sicheres, überwachtes Gateway erzwungen? Werden Sicherheitskontrollen wie VPN, IP-Filterung und starke Authentifizierung für alle Fernverbindungen durchgesetzt? Sind die Standard-Herstellereinstellungen für den Fernzugriff deaktiviert oder geändert?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, die von außerhalb einer als ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn mehrere Sicherheitskontrollen fehlen (z. B. kein VPN und schwache Authentifizierung). Die Auswirkung wird durch die Kritikalität des Ziel-@SystemType:OT-Assets bestimmt. Wenn das Asset einen Prozess mit hohen Integritäts- oder Verfügbarkeitsanforderungen steuert (z. B. unternehmenskritisch), wird die Auswirkung als sehr hoch eingestuft, was das Potenzial für physische Schäden oder Sicherheitsvorfälle widerspiegelt.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn kompensierende Kontrollen existieren, die nicht modelliert sind (z. B. eine Hardware-Firewall, die IP-Filterung durchsetzt, die nicht als "
    },
    "unmanaged-dependencies-between-@SystemType:OT-and-it": {
      "title": "Nicht verwaltete Abhängigkeiten zwischen @SystemType:OT und Büro-IT (BSI @SystemType:ICS-Stil)",
      "description": "Industrielle Kontrollsysteme (@SystemType:ICS) und Betriebstechnologie (@SystemType:OT) sind oft auf unterbrechungsfreie Echtzeit-Datenflüsse angewiesen. ",
      "impact": "Wenn Abhängigkeiten zwischen @SystemType:OT und Büro-IT nicht berücksichtigt werden und dadurch Sicherheitslücken nicht geschlossen werden, können sich Sicherheitsvorfälle (insbesondere Verfügbarkeitsausfälle) schnell auf die gesamte @SystemType:OT ausbreiten. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Allgemeine @SystemType:ICS-Komponente), insbesondere Gefährdung T 0.40 ",
      "action": "Verbindungen zwischen @SystemType:OT und Büro-IT segmentieren und kontrollieren",
      "mitigation": "Segmentieren Sie das @SystemType:OT-Netzwerk streng vom Büro-IT-Netzwerk mithilfe von Firewalls, Datendioden oder anderem Perimeterschutz. Jede Kommunikation, die diese Grenze überschreitet, muss explizit definiert, überwacht und gesichert werden. ",
      "check": "Gibt es Kommunikationsverbindungen zwischen Assets, die als ",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von Kommunikationsverbindungen erkannt, die von einem technischen Asset, das als ",
      "riskAssessment": "Die Auswirkung wird hauptsächlich durch die Verfügbarkeitsbewertung des Ziel-@SystemType:OT-Assets bestimmt. Eine Abhängigkeit von einem IT-Dienst mit geringer Verfügbarkeit für ein ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Netzwerksegmentierung durch eine Komponente außerhalb des Geltungsbereichs (z. B. eine nicht in Threagile modellierte Firewall) gehandhabt wird, die das Risiko effektiv mindert. Das Tagging "
    },
    "inadequately-regulated-@SystemType:OT-remote-access": {
      "title": "Unzureichend geregelter @SystemType:OT-Fernzugriff (BSI CON.6)",
      "description": "Der @SystemType:OT-Fernwartungszugriff hat eine sehr große potenzielle Nutzerbasis außerhalb der betreibenden Institution. Gleichzeitig ist die nahtlose Verfügbarkeit von Echtzeitdaten in einem industriellen Kontrollsystem (@SystemType:ICS) unerlässlich. Allgemeine Regelungen für den Büro-IT-Fernzugriff sind für @SystemType:OT oft ungeeignet oder lassen zu viel Spielraum. Dieser Mangel an spezifischen, restriktiven Regeln für den @SystemType:OT-Fernzugriff kann zu schweren Sicherheitslücken führen.",
      "impact": "Wenn die Nutzung des @SystemType:OT-Fernzugriffs unzureichend geregelt ist, können die Betreiber nicht kontrollieren, wer den Zugang nutzt oder wie er genutzt wird. Dies kann zu unbefugtem Zugriff, der Weitergabe von Anmeldeinformationen an unbekannte Dritte und Schwierigkeiten bei der forensischen Analyse während Sicherheitsvorfällen führen, was potenziell kostspielige Produktionsausfälle verlängert. Wenn Zugriffspfade mit der Standard-Büro-IT geteilt werden, können inkonsistente Sicherheitskonfigurationen entstehen, die den strengeren Anforderungen der @SystemType:OT-Umgebung nicht genügen und kritische Infrastrukturen Bedrohungen aus dem Unternehmensnetzwerk aussetzen.",
      "asvs": "BSI IT-Grundschutz CON.6 Fernwartung",
      "action": "Strenge vertragliche und technische Kontrollen für den @SystemType:OT-Fernzugriff implementieren",
      "mitigation": "Erzwingen Sie dedizierte, isolierte Zugriffspfade für alle @SystemType:OT-Fernwartungen. Verwenden Sie einen Bastion-Host oder Jump-Server als einzigen, kontrollierten Einstiegspunkt. Fordern Sie eine starke Multi-Faktor-Authentifizierung (MFA/2FA) für alle Fernzugriffe. Stellen Sie sicher, dass alle Verbindungen über VPN und ein verschlüsseltes Protokoll verschlüsselt sind. Wenden Sie das Prinzip der geringsten Rechte für die Autorisierung an. Alle Fernzugriffssitzungen müssen detailliert protokolliert und auf verdächtige Aktivitäten überwacht werden. Diese technischen Anforderungen sollten Teil einer formellen, dokumentierten Vereinbarung mit jedem Drittanbieter sein.",
      "check": "Gibt es eine dokumentierte Richtlinie speziell für den @SystemType:OT-Fernzugriff? Ist der Zugriff streng auf dedizierte Pfade beschränkt, getrennt von der Unternehmens-IT? Ist eine Zwei-Faktor-Authentifizierung zwingend erforderlich? Ist die Verbindung sowohl durch ein VPN als auch durch ein verschlüsseltes Protokoll gesichert? Werden Sitzungen protokolliert und überwacht?",
      "detectionLogic": "Diese Regel identifiziert Fernwartungskommunikationsverbindungen von externen Entitäten zu technischen Assets innerhalb einer @SystemType:OT-Umgebung. Sie prüft dann auf gängige Sicherheitsschwächen, wie unzureichende Authentifizierung (n@SystemType:OT 2FA), fehlende VPN-Verschlüsselung oder die Verwendung unverschlüsselter Protokolle. Sie erkennt auch architektonische Mängel, bei denen eine einzelne externe Entität einen Zugriffspfad zu sowohl @SystemType:OT- als auch Standard-Büro-IT-Umgebungen hat, was die erforderliche Netzwerksegmentierung verletzt.",
      "riskAssessment": "Die Auswirkung jeder Schwäche im @SystemType:OT-Fernzugriff wird als Hoch oder Sehr-Hoch bewertet, abhängig von den Verfügbarkeits- und Integritätsanforderungen des Ziel-@SystemType:OT-Assets, was das Potenzial für physische Schäden oder Produktionsstillstände widerspiegelt. Die Wahrscheinlichkeit wird basierend auf der erkannten Schwäche bewertet; geteilte Zugriffspfade werden als Sehr wahrscheinlich als Pivot-Vektor ausgenutzt, während fehlende technische Kontrollen als Wahrscheinlich angesehen werden.",
      "falsePositives": "Das Modell repräsentiert möglicherweise komplexe Netzwerkarchitekturen nicht vollständig, wie z. B. einen gut konfigurierten Bastion-Host, der das Risiko eines geteilten Zugriffspfads mindert. Solche kompensierenden Kontrollen sollten manuell überprüft werden, bevor das Risiko akzeptiert wird."
    },
    "uncontrolled-@SystemType:OT-remote-maintenance": {
      "title": "Unkontrollierte Fernwartung in @SystemType:OT-Umgebungen",
      "description": "Daten und Konfigurationseinstellungen innerhalb eines industriellen Kontrollsystems (@SystemType:ICS) sowie Personal vor Ort, Eigentum und Produktionsprozesse können durch jeden Zugriff aus anderen Zonen gefährdet werden, der nicht angemessen vom internen Personal vor Ort kontrolliert wird oder unzureichend gesichert ist. Insbesondere haben Mitarbeiter von externen Wartungsdienstleistern, Integratoren und Herstellerfirmen das notwendige Fachwissen über die zu wartende Anlage, Maschine oder Komponente, sind sich aber oft der potenziellen schädlichen Auswirkungen einer spezifischen Fernwartungssitzung auf das Gesamtsystem nicht bewusst.",
      "impact": "Wenn die Prozesse und Inhalte von @SystemType:OT-Fernwartungssitzungen von den Betreibern nicht angemessen kontrolliert werden können, werden Konfigurationsfehler mit hohem Risikopotenzial sowie unbeabsichtigtes oder vorsätzliches Fehlverhalten von Wartungspersonal möglicherweise nicht schnell genug erkannt oder nachverfolgt. Dies kann zu Ausfällen oder Manipulationen von Echtzeit-Datenströmen führen oder die unbemerkte Ausbreitung von Malware im gesamten @SystemType:OT-Netzwerk ermöglichen. Die Folgen können von der Schädigung von Leib und Leben des Betriebspersonals vor Ort über hohe finanzielle Verluste durch Produktionsausfälle bis hin zur Zerstörung ganzer Anlagen reichen. Auch die Offenlegung von Betriebsgeheimnissen ist möglich. Des Weiteren kann die Integrität der hergestellten Produkte beeinträchtigt werden (z. B. durch Manipulation von Rezepturen), was zu Reputationsschäden führen kann.",
      "asvs": "BSI IT-Grundschutz @SystemType:ICS.S.5 Fernwartung, BSI-CS 108",
      "action": "Kontrollierten und überwachten Fernwartungszugriff implementieren",
      "mitigation": "Alle Fernwartungszugriffe auf @SystemType:OT/@SystemType:ICS-Umgebungen, insbesondere von externen Entitäten, müssen über ein kontrolliertes und überwachtes Gateway (z. B. einen Jump-Host oder Bastion-Host) geleitet werden. Implementieren Sie einen strengen Genehmigungsprozess für jede Wartungssitzung (z. B. ",
      "check": "Werden alle Fernwartungszugriffe von externen Parteien protokolliert und überwacht? Gibt es einen formellen Genehmigungsprozess für die Initiierung einer Fernsitzung? Ist der Zugriff nur auf die notwendigen Komponenten und Zeiträume beschränkt? Werden sichere Protokolle und VPNs für alle Fernverbindungen in die @SystemType:OT-Umgebung erzwungen?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, die von einem ",
      "riskAssessment": "Die Wahrscheinlichkeit wird standardmäßig als hoch für jeden direkten externen Wartungszugriff auf ein @SystemType:OT-System angesehen, da das Potenzial für unüberwachte, unkoordinierte Aktionen erheblich ist. Die Auswirkung leitet sich aus der Verfügbarkeits- und Integritätsbewertung des Ziel-@SystemType:OT-Assets ab, da Ausfälle oder Manipulationen die Produktion stoppen oder Geräte zerstören können. Wenn das Ziel-Asset ",
      "falsePositives": "Ein Risiko könnte ein Fehlalarm sein, wenn das Modell eine direkte Verbindung zeigt, diese aber in Wirklichkeit durch eine zentrale, vollständig kontrollierte und überwachte Fernzugriffslösung verläuft, die nicht explizit als separates Asset modelliert ist. In solchen Fällen kann das Risiko mit Begründung akzeptiert werden."
    },
    "direct-access-to-@SystemType:ICS-@SystemType:OT-from-less-trusted-networks": {
      "title": "Direkter IP-Zugriff auf @SystemType:ICS/@SystemType:OT-Systeme aus weniger vertrauenswürdigen Netzwerken (BSI CON.6)",
      "description": "Daten innerhalb eines industriellen Kontrollsystems (@SystemType:ICS) sowie Personal vor Ort, Eigentum und Produktionsprozesse sind grundsätzlich durch direkten IP-basierten Zugriff aus anderen Zonen und Netzwerken gefährdet. Dies wird durch Faktoren wie die deutlich längeren Patch-Zyklen in @SystemType:OT im Vergleich zur Büro-IT verschärft. Darüber hinaus stammen Fernwartungszugriffe auf ein @SystemType:ICS oft aus Netzwerken, die nicht vollständig vertrauenswürdig sind, einschließlich nicht nur externer Netzwerke von Drittanbietern, sondern auch anderer Zonen innerhalb der Organisation",
      "impact": "Direkter Zugriff auf ein @SystemType:ICS aus anderen Zonen und Netzwerken, zum Beispiel über eine lokale Verbindung oder VPN, kann Malware einschleusen und gezielte Angriffe erleichtern. Dies kann zu physischen Schäden an Personen, erheblichen finanziellen Verlusten durch Produktionsausfälle und der Exfiltration vertraulicher Informationen wie Betriebsgeheimnissen führen.",
      "asvs": "BSI IT-Grundschutz CON.6 (Industrielle Kontrollsysteme)",
      "action": "Strenge Netzwerksegmentierung und Zugriffskontrolle für @SystemType:ICS/@SystemType:OT-Umgebungen implementieren",
      "mitigation": "Verbieten Sie die direkte Kommunikation von weniger vertrauenswürdigen Netzwerken (wie Büro-IT) zur @SystemType:OT/@SystemType:ICS-Netzwerkzone. Alle Fernzugriffe müssen über einen gehärteten Bastion-Host (Jump-Server) in einer dedizierten demilitarisierten Zone (DMZ) vermittelt werden. Erzwingen Sie strenge Firewall-Regeln, um sicherzustellen, dass nur autorisierter und notwendiger Verkehr in die @SystemType:OT-Zone gelangen kann, basierend auf dem Prinzip der geringsten Rechte. Verwenden Sie sichere Protokolle für alle Fernzugriffe und überwachen Sie alle Verbindungen, die die Grenze zur @SystemType:OT-Umgebung überschreiten.",
      "check": "Gibt es direkte Kommunikationsverbindungen von Assets in Büro-/Unternehmensnetzwerken zu Assets innerhalb der @SystemType:OT/@SystemType:ICS-Vertrauensgrenze? Wird jeder Fernwartungszugriff über einen gehärteten Jump-Host erzwungen? Sind Firewall-Regeln vorhanden, um den Verkehr in die @SystemType:OT-Zone streng zu kontrollieren?",
      "detectionLogic": "Diese Regel sucht nach Kommunikationsverbindungen, die von einer Nicht-@SystemType:OT-Netzwerkgrenze direkt in eine @SystemType:OT-Netzwerkgrenze übergehen und auf ein als ",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Bewertungen des Ziel-@SystemType:OT-Assets bestimmt und spiegelt das Potenzial für physische Schäden, Produktionsstillstände oder Datendiebstahl wider. Die Wahrscheinlichkeit wird für Fernwartungsverbindungen (",
      "falsePositives": "Eine direkte Verbindung könnte als Risiko gemeldet werden, auch wenn sie durch eine externe, nicht modellierte Firewall mit sehr strengen Regeln gesichert ist. Dieses Risiko ist am genauesten, wenn Vertrauensgrenzen korrekt modelliert sind, um die Trennung zwischen @SystemType:OT- und Unternehmensnetzwerken darzustellen."
    },
    "insecure-alternative-remote-access-@SystemType:OT": {
      "title": "Unsicherer alternativer Fernwartungszugriff auf @SystemType:OT/@SystemType:ICS-Umgebungen",
      "description": "In industriellen Umgebungen werden oft alternative Fernwartungszugänge eingerichtet, um Zuverlässigkeit und Leistung zu gewährleisten, insbesondere bei Vorfällen, bei denen der primäre Zugang ausfallen oder zu langsam sein könnte. Diese sekundären Zugriffspfade (z. B. über ein Mobilfunkmodem) bieten eine schnelle Möglichkeit, entfernte Systeme zu verwalten. Solche alternativen Zugangspunkte können jedoch besonders anfällig für Angriffe sein, wenn sie nicht mit der gleichen Sorgfalt wie primäre Systeme implementiert werden.",
      "impact": "Wenn ein alternativer Fernzugriffspfad die Anforderungen der Institution nicht vollständig erfüllt",
      "asvs": "BSI IT-Grundschutz CON.1: Allgemeiner Fernzugriff. Das beschriebene Szenario ist ein klassisches Beispiel für die Umgehung von Standard-Sicherheitskontrollen aus betrieblicher Bequemlichkeit, ein Hauptanliegen in der @SystemType:ICS-Sicherheit.",
      "action": "Alle Fernwartungszugriffspfade sichern und härten",
      "mitigation": "Stellen Sie sicher, dass alle Fernzugriffspfade, einschließlich alternativer und Notfallpfade, denselben strengen Sicherheitsrichtlinien unterliegen. Dazu gehören die Erzwingung starker Multi-Faktor-Authentifizierung (MFA), die Verwendung verschlüsselter Protokolle (z. B. innerhalb eines robusten VPN), die Implementierung strenger IP-basierter Zugriffskontrolllisten (Firewalls) und die Weiterleitung des Verkehrs über einen Bastion-Host oder Jump-Server. Alle Zugriffsversuche sollten protokolliert und aktiv überwacht werden. Alternativer Zugriff sollte standardmäßig deaktiviert und nur bei expliziter Anforderung aktiviert werden.",
      "check": "Sind alle Fernzugriffspfade zu @SystemType:OT-Netzwerken, einschließlich Alternativen, vollständig dokumentiert? Erzwingen sie alle MFA, starke Ende-zu-Ende-Verschlüsselung und strenge Zugriffskontrollen? Wird der gesamte Fernzugriffsverkehr protokolliert und auf Anomalien überwacht?",
      "detectionLogic": "Diese Regel sucht nach Kommunikationsverbindungen, die als ",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit der Kritikalität des Ziel-@SystemType:OT-Assets. Der Zugriff auf ein unternehmenskritisches System kann eine ",
      "falsePositives": "Das Modell könnte kompensierende Kontrollen erfassen (z. B. eine separate, nicht modellierte Hardware-Firewall), die das Risiko mindern. Eine Verbindung könnte als alternativ gekennzeichnet sein, aber dennoch vollständig gesichert sein, was zu einem Fehlalarm führen würde. Manuelle Überprüfung der Verbindung"
    },
    "insecure-@SystemType:OT-remote-maintenance-access": {
      "title": "Unsicherer Fernwartungszugriff in @SystemType:OT/@SystemType:ICS-Umgebungen (BSI CON.1-Stil)",
      "description": "Dezentrale Infrastrukturen von industriellen Kontrollsystemen (@SystemType:ICS) weisen oft zahlreiche Fernwartungszugänge verschiedener Hersteller auf, von denen viele proprietäre Lösungen verwenden. Diese Komplexität erschwert ein ordnungsgemäßes zentrales Sicherheitsmanagement. Wenn sich diese @SystemType:OT-Fernzugangspunkte in offen zugänglichen Bereichen befinden oder nur durch schwache, vom Hersteller bereitgestellte Sicherheitskomponenten geschützt sind, die den Anforderungen der Organisation nicht genügen",
      "impact": "Die erfolgreiche Ausnutzung eines unsicheren Fernzugriffs kann Angreifern ermöglichen, Steuerungsprozesse zu manipulieren, physische Abläufe zu stören, Geräteschäden zu verursachen und Sicherheitssysteme zu kompromittieren. Dies bedroht direkt die Integrität und Verfügbarkeit der @SystemType:OT-Umgebung, was zu Produktionsausfällen, finanziellen Schäden und potenziellen physischen Verletzungen führen kann.",
      "asvs": "BSI IT-Grundschutz CON.1: Fernzugriff",
      "action": "Gehärtete und zentralisierte Fernzugriffslösung implementieren",
      "mitigation": "Alle Fernwartungszugriffe auf @SystemType:OT-Umgebungen sollten über einen zentralisierten, gehärteten Bastion-Host oder Jump-Server geleitet werden. Erzwingen Sie eine starke, Multi-Faktor-Authentifizierung (MFA) für alle Fernzugriffe. Verwenden Sie verschlüsselte Protokolle (z. B. VPN, SSH-Tunnel) für den gesamten Kommunikationsweg. Sichern Sie jede Hardware, die Fernzugriffsmöglichkeiten bietet, physisch. Deaktivieren oder ersetzen Sie schwache, herstellerseitige Standard-Anmeldeinformationen und Sicherheitseinstellungen durch Konfigurationen, die den internen Sicherheitsrichtlinien entsprechen. Implementieren Sie eine strikte Netzwerksegmentierung und Firewall-Regeln, um den Zugriff vom Bastion-Host nur auf die notwendigen Zielsysteme und Ports zu beschränken.",
      "check": "Werden alle @SystemType:OT-Fernzugangspunkte zentral inventarisiert und verwaltet? Ist eine starke MFA für alle Fernverbindungen erforderlich? Sind alle Fernsitzungen Ende-zu-Ende verschlüsselt? Sind die Fernzugangspunkte physisch gesichert? Wurden die Standard-Anmeldeinformationen und -Einstellungen des Herstellers geändert?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen von externen Entitäten zu technischen Assets, die als ",
      "riskAssessment": "Die Auswirkung wird durch die Integritäts- und Verfügbarkeitsbewertung des Ziel-@SystemType:OT-Assets bestimmt, da diese in einer @SystemType:ICS-Umgebung von größter Bedeutung sind. Ein Verstoß gegen ein ",
      "falsePositives": "Ein Modell erfasst möglicherweise nicht alle kompensierenden Kontrollen, wie z. B. eine separate, nicht modellierte Firewall-Appliance, die den Zugriff einschränkt. Das Risiko könnte gemeldet werden, auch wenn die Verbindung nur in stark kontrollierten, temporären Wartungsfenstern verwendet wird."
    },
    "insecure-@SystemType:OT-remote-maintenance-access-@SystemType:ICS-3-a5": {
      "title": "Unsicherer @SystemType:OT-Fernwartungszugriff (BSI @SystemType:ICS.3.A5)",
      "description": "Aufgrund langer Lebenszyklen in industriellen Umgebungen werden @SystemType:OT-Fernwartungslösungen oft ein Jahrzehnt oder länger verwendet und können aufgrund ihres Alters Sicherheitslücken aufweisen. ",
      "impact": "Wenn @SystemType:OT-Fernwartungszugänge nicht angemessen gesichert sind, erleichtert dies den unbefugten Zugriff auf ein industrielles Kontrollsystem (@SystemType:ICS) und andere Netzwerke und Systeme sowohl innerhalb als auch außerhalb der @SystemType:OT-Umgebung. ",
      "asvs": "BSI IT-Grundschutz @SystemType:ICS.3.A5: Unsicherer Fernwartungszugriff",
      "action": "@SystemType:OT-Fernwartungszugriff sichern, inventarisieren und regelmäßig überprüfen",
      "mitigation": "Führen Sie ein vollständiges Inventar aller Fernwartungszugänge für @SystemType:OT-Systeme. Deaktivieren Sie alle ungenutzten oder unbekannten Zugänge sofort. ",
      "check": "Gibt es ein vollständiges Inventar aller @SystemType:OT-Fernwartungszugänge? Sind alle Verbindungen verschlüsselt und verwenden sie eine starke Authentifizierung? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als `@SystemType:OT-system` getaggt sind und einen unsicheren Fernzugriff haben. ",
      "riskAssessment": "Die Auswirkung wird durch die Integritäts- und Verfügbarkeitsbewertung des @SystemType:OT-Assets bestimmt, da Manipulation und Denial-of-Service die Hauptbedrohungen sind. Ein Asset mit ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle kompensierenden Kontrollen, wie z. B. eine zwischengeschaltete Firewall oder einen Bastion-Host, der die Verbindung sichert. "
    },
    "improper-handling-of-physical-environments": {
      "title": "Unsachgemäßer Umgang mit physischen Umgebungen (basierend auf BSI-Empfehlungen)",
      "description": "Basierend auf BSI-Empfehlungen entsteht eine häufige Schwachstelle, wenn Mitarbeiter es versäumen, physische Räume nach der Nutzung zu sichern. ",
      "impact": "Dies kann zur unbefugten Offenlegung vertraulicher Informationen führen, was gegen Datenschutzbestimmungen verstößt und zu Reputations- oder finanziellen Schäden führen kann. ",
      "asvs": "BSI IT-Grundschutz INF.1 Allgemeines Gebäude, insbesondere INF.1.A15 Fremdnutzung von Räumen und INF.1.A16 Ordnung und Sauberkeit.",
      "action": "Klare Richtlinien für „Clear Desk“ und „Clear Room“ festlegen, kommunizieren und durchsetzen.",
      "mitigation": "Definieren und kommunizieren Sie klare Regeln zur Sicherung physischer Arbeitsumgebungen, insbesondere von gemeinsam genutzten Räumen wie Besprechungsräumen. Dazu gehören Richtlinien zum Schließen von Türen/Fenstern, zum Löschen von Whiteboards und zur Sicherung von Dokumenten. ",
      "check": "Gibt es etablierte ",
      "detectionLogic": "Dieses organisatorische Risiko wird durch die Identifizierung technischer Assets erkannt, die explizit als physische Maschinen modelliert sind (`machine: physical`) oder sich in gemeinsam genutzten physischen Räumen befinden (z. B. mit `@Location:MeetingRoom` getaggt). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell kann die tatsächliche Umsetzung physischer Sicherheitsrichtlinien oder die Wirksamkeit von Mitarbeiterschulungen nicht überprüfen. Dieses Risiko sollte anhand der Organisation überprüft werden"
    },
    "incompatible-hardware-interfaces-sys-1-7": {
      "title": "Inkompatible Hardwareschnittstellen (BSI SYS.1.7)",
      "description": "Mobile IT-Systeme werden zunehmend in unterschiedlichen Umgebungen eingesetzt. Ein häufiges Problem ist die Unfähigkeit, diese Systeme wie geplant zu nutzen, aufgrund physischer Inkompatibilität mit fremden IT-Systemen. ",
      "impact": "Die primäre Auswirkung ist ein Verlust der Verfügbarkeit, der Benutzer daran hindert, ihre Aufgaben auszuführen. Dies kann Geschäftsprozesse erheblich stören. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.1.7 Mobiler Arbeitsplatz, insbesondere in Bezug auf die allgemeinen Betriebsrisiken in unterschiedlichen Umgebungen.",
      "action": "Hardwarekompatibilität für mobile Assets sicherstellen",
      "mitigation": "Etablieren Sie einen Standard für Hardwareschnittstellen auf allen unternehmenseigenen mobilen Geräten. ",
      "check": "Sind mobile Assets (wie Laptops) mit standardisierten, modernen Schnittstellen ausgestattet? Wird den Benutzern mobiler Assets ein Standard-Adapterkit ausgehändigt? ",
      "detectionLogic": "Dieses Risiko gilt für technische Assets, die physisch mobil sind und in verschiedenen Umgebungen verwendet werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko könnte für ein mobiles Asset gemeldet werden, bei dem die Organisation bereits robuste Minderungsmaßnahmen implementiert hat (z. B. die Bereitstellung von Universal-Dongles für alle Mitarbeiter). "
    },
    "improper-physical-cabling": {
      "title": "Unsachgemäße physische Verkabelung in gemeinsam genutzten Räumen",
      "description": "In Räumen mit häufig wechselnder Nutzung, wie Besprechungs-, Veranstaltungs- oder Schulungsräumen, werden die Geräteaufstellung und die Verkabelung oft verändert. ",
      "impact": "Physische Schäden an IT-Systemen, die durch Stolpern über unsichere Kabel verursacht werden, können zu einem direkten Verlust der Verfügbarkeit für diese Systeme führen (z. B. Laptops, Projektoren, Netzwerkgeräte). ",
      "asvs": "BSI IT-Grundschutz: INF.6 Verkabelung (insbesondere INF.6.A4 Ordnungsgemäße Leitungsführung) und INF.5 Raum und Schrank.",
      "action": "Sichere und ordnungsgemäße Verkabelungspraktiken sicherstellen",
      "mitigation": "In allen gemeinsam genutzten Räumen sicherstellen, dass Strom- und Datenanschlüsse günstig gelegen sind, um die Notwendigkeit langer Kabelwege zu minimieren. ",
      "check": "Führen Sie physische Inspektionen von Besprechungs-, Veranstaltungs- und Schulungsräumen durch. Gibt es lose Kabel, die Stolperfallen auf dem Boden bilden? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets identifiziert, die sich innerhalb von Vertrauensgrenzen befinden, die als gemeinsam genutzte Räume getaggt sind (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte für ein Gerät gemeldet werden, das dauerhaft und sicher in einem gemeinsam genutzten Raum installiert ist (z. B. ein in einem Rack montierter Switch in einem Schrank). "
    },
    "theft-of-it-equipment-in-meeting-rooms": {
      "title": "Diebstahl von IT-Ausrüstung aus Besprechungs-/Veranstaltungsräumen (BSI INF.5.G1)",
      "description": "Wenn Datenträger, IT-Systeme, Zubehör, Software oder Daten, die manchmal dauerhaft in einem Besprechungs-, Veranstaltungs- oder Schulungsraum installiert sind, gestohlen werden, ",
      "impact": "Der Diebstahl von Ausrüstung führt zu direkten finanziellen Kosten für Ersatz und Wiederherstellung. Er verursacht einen Verlust der Verfügbarkeit für den Raum und die zugehörigen Geschäftsfunktionen. ",
      "asvs": "BSI IT-Grundschutz-Kompendium 2023: INF.5 Raum und Schrank",
      "action": "Physische Sicherheitsmaßnahmen für Assets in gemeinsam genutzten/öffentlichen Räumen implementieren",
      "mitigation": "Sichern Sie alle IT-Assets in Besprechungs-, Veranstaltungs- oder Schulungsräumen physisch. Verwenden Sie für mobile Geräte wie Laptops Kensington-Schlösser oder sichere Aufbewahrungsschränke. ",
      "check": "Gibt es Richtlinien und Verfahren für die physische Sicherheit von Assets in Gemeinschaftsbereichen wie Besprechungsräumen? Müssen Geräte wie Laptops gesichert werden, wenn sie unbeaufsichtigt gelassen werden? ",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die mit einem Tag gekennzeichnet sind, der angibt, dass sie sich in einem gemeinsam genutzten physischen Raum wie einem Besprechungsraum (`@Physical@Location:MeetingRoom`) befinden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn der spezifische getaggte Ort außergewöhnlich starke, durchgesetzte und geprüfte physische Sicherheitskontrollen hat, die im Modell erfasst sind. "
    },
    "unauthorized-disclosure-of-confidential-information": {
      "title": "Unbefugte Offenlegung vertraulicher Informationen (basierend auf BSI G 2.4)",
      "description": "Vertrauliche Informationen können durch technische Fehler, Unachtsamkeit, Unwissenheit oder vorsätzliche böswillige Handlungen offengelegt werden. Diese Informationen können sich auf verschiedenen Medien befinden, wie z. B. auf internen Speichern in IT-Systemen (z. B. Festplatten), auf Wechseldatenträgern (z. B. USB-Laufwerke) oder während der Übertragung über ein Netzwerk. Wenn Informationen unbefugt gelesen oder offengelegt werden, kann dies schwerwiegende Folgen für die Organisation haben.",
      "impact": "Die unbefugte Offenlegung von Informationen kann zu schwerwiegenden Konsequenzen führen, wie z. B. Gesetzesverstößen (z. B. @DataType:PII), Wettbewerbsnachteilen, Verlust des Kundenvertrauens und direkten finanziellen Verlusten.",
      "asvs": "OWASP ASVS V4.0.3: V4.1 (Datenklassifizierung), V4.2 (Datenschutz)",
      "action": "Verschlüsselung von ruhenden und übertragenen sensiblen Daten durchsetzen",
      "mitigation": "Für ruhende Daten stellen Sie sicher, dass alle technischen Assets, die `vertrauliche` oder `streng vertrauliche` Daten speichern, eine starke, moderne Verschlüsselung verwenden. Dies kann durch transparente Festplatten-/Dateisystemverschlüsselung, Datenbankverschlüsselung oder anwendungsseitige Verschlüsselung erreicht werden. Das Asset",
      "check": "Überprüfen Sie die Asset-Konfigurationen, um zu verifizieren, dass `encryption` für gespeicherte sensible Daten aktiviert ist. Analysieren Sie die Kommunikationsverbindungen im Modell, um sicherzustellen, dass die Protokolle bei der Übertragung sensibler Daten verschlüsselt sind (z. B. `https`, `ldaps`). Penetrationstests und Netzwerkverkehrsanalysen können diese Kontrollen im laufenden System bestätigen.",
      "detectionLogic": "Diese Regel löst Risiken für zwei Hauptbedingungen aus: 1. Ein technisches Asset (insbesondere ein `datastore`) speichert `vertrauliche` oder `streng vertrauliche` Daten, aber seine `encryption`-Eigenschaft ist auf `none` gesetzt. 2. Eine Kommunikationsverbindung überträgt `vertrauliche` oder `streng vertrauliche` Daten, verwendet aber ein unverschlüsseltes Protokoll.",
      "riskAssessment": "Die Auswirkung ist direkt mit der Vertraulichkeitsstufe der beteiligten Daten verbunden (`Hoch` für vertraulich, `Sehr Hoch` für streng vertraulich). Die Wahrscheinlichkeit wird als `Sehr Wahrscheinlich` angesehen, wenn sensible Daten ohne Verschlüsselung gehandhabt werden, da dies eine direkte und ausnutzbare Schwachstelle darstellt. Die Gesamtschwere wird aus diesen Faktoren berechnet.",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn die Verschlüsselung von einer zugrunde liegenden Plattform- oder Hardware-Schicht übernommen wird, die explizit modelliert ist (z. B. ein verschlüsseltes Dateisystem auf der Host-VM). In solchen Fällen sollte das Asset"
    },
    "bsi-unregulated-vehicle-comms": {
      "title": "Offenlegung vertraulicher Informationen über ungeregelte fahrzeuginterne Netzwerke (BSI 2.1)",
      "description": "Wenn nicht oder nur unzureichend geregelt ist, welche Informationen über von Fahrzeugen für Nutzer bereitgestellte Netzwerke (z. B. @Network:WLAN oder Bluetooth) übertragen und verarbeitet werden dürfen und welche Schutzmaßnahmen zu ergreifen sind, können vertrauliche Informationen offengelegt werden. Wenn die Regeln zur Sicherung und Nutzung dieser Netzwerke unzureichend sind, könnten sensible Informationen wie personenbezogene Daten offengelegt werden.",
      "impact": "Unbefugte Offenlegung von vertraulichen oder personenbezogenen Daten, die über fahrzeuginterne Netzwerke übertragen werden, was zu Datenschutzverletzungen, Compliance-Verstößen, Reputationsschäden und potenziellen finanziellen Verlusten führt.",
      "asvs": "BSI IT-Grundschutz Kompendium 2023, Baustein INF.11: Allgemeines Fahrzeug",
      "action": "Sichere Konfigurationsrichtlinien für fahrzeuginterne Netzwerke definieren und durchsetzen",
      "mitigation": "Legen Sie klare Richtlinien für alle fahrzeuginternen Kommunikationsschnittstellen (@Network:WLAN, Bluetooth usw.) fest. Die Richtlinien müssen die zur Übertragung zulässigen Datentypen spezifizieren, eine starke Authentifizierung und Verschlüsselung (z. B. WPA3 für Wi-Fi, sicheres Pairing für Bluetooth) erfordern und sichere Standardkonfigurationen vorschreiben. Diese Richtlinien müssen durchgesetzt und regelmäßig überprüft werden. Kommunikationsverbindungen im Modell sollten verschlüsselte Protokolle verwenden.",
      "check": "Gibt es dokumentierte Richtlinien für die Nutzung fahrzeuginterner Netzwerke? Verwenden alle modellierten Kommunikationsverbindungen vom Fahrzeug-Asset verschlüsselte Protokolle? Ist eine Authentifizierung für Verbindungen erforderlich?",
      "detectionLogic": "Wird für jedes ",
      "riskAssessment": "Die Auswirkung hängt direkt von der Vertraulichkeit der vom Fahrzeug-Asset übertragenen Daten ab. Die Wahrscheinlichkeit ist ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das "
    },
    "cable-fire-bsi-inf-1": {
      "title": "Kabelbrand (BSI INF.1)",
      "description": "Kabelbrände können erhebliche Schäden an einem Informationssystem verursachen. Ein Brand kann Kurzschlüsse verursachen, Leiter unterbrechen, zum Ausfall von Schutzeinrichtungen führen und aggressive, korrosive Gase aus Isoliermaterialien freisetzen, die langfristige Schäden an elektronischen Bauteilen verursachen.",
      "impact": "Die primäre Auswirkung ist ein Verlust der Verfügbarkeit für alle betroffenen physischen Assets und die Kommunikationsverbindungen, von denen sie abhängen, was potenziell zu einem vollständigen Dienstausfall führen kann. Sekundäre Auswirkungen umfassen den Verlust der Integrität durch Datenkorruption aufgrund von Kurzschlüssen oder abrupten Stromausfällen und potenziellen Verlust der Vertraulichkeit, wenn physische oder logische Sicherheitskontrollen (z. B. Firewalls, Zugangssysteme) infolgedessen ausfallen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.1 (Allgemeines Gebäude) Anforderung INF.1.A17 (Brandschutz in Gebäuden).",
      "action": "Physische und umweltbezogene Kontrollen für den Brandschutz implementieren",
      "mitigation": "Stellen Sie sicher, dass angemessene Brandschutzmaßnahmen vorhanden sind, wie z. B. die Verwendung von feuerhemmender Verkabelung (z. B. Plenum-zertifiziert), die Aufrechterhaltung eines ordnungsgemäßen Kabelmanagements zur Vermeidung von Überhitzung und die Durchführung regelmäßiger Inspektionen von elektrischen Systemen. Implementieren und testen Sie regelmäßig Brandmelde- (z. B. Rauch-/Wärmemelder) und -löschanlagen (z. B. Inertgas-Löschanlagen in Serverräumen). Stellen Sie die physische Trennung von redundanten Systemen und Kabelwegen sicher, um die Auswirkungen eines lokalen Brandes zu minimieren.",
      "check": "Sind Brandmelde- und -löschanlagen installiert und werden sie regelmäßig getestet? Wird in kritischen Bereichen feuerhemmende Verkabelung verwendet? Sind redundante Systeme und ihre Verkabelung physisch getrennt? Gibt es einen dokumentierten Brandschutz- und Evakuierungsplan?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets vom Typ ",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit der Kritikalität der Verfügbarkeit und Integrität des betroffenen physischen Assets. Ein Brand, der ein ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm oder gemindert betrachtet werden, wenn der physische Standort über zertifizierte, regelmäßig gewartete Brandmelde- und -löschanlagen verfügt und wenn eine angemessene feuerhemmende Infrastruktur nachweislich vorhanden ist. Dem Modell fehlt typischerweise der Einblick in diese spezifischen physischen Kontrollen."
    },
    "wiretapping-or-cable-manipulation": {
      "title": "Abhören oder physische Manipulation von Datenkabeln (BSI INF.5)",
      "description": "Das Abhören von Datenkabeln ist eine erhebliche Bedrohung für die Informationssicherheit. Kein Kabel ist vollständig immun gegen Abhören; ",
      "impact": "Erfolgreiche Abhörangriffe beeinträchtigen die Vertraulichkeit aller über die betroffene Leitung übertragenen Daten. ",
      "asvs": "BSI IT-Grundschutz-Kompendium: INF.5 Verkabelung, Gefährdungen INF.5.G5 Abhören der Kommunikationsverbindungen und INF.5.G6 Manipulation oder Zerstörung der Kommunikationsverbindungen.",
      "action": "Ende-zu-Ende-Verschlüsselung verwenden und die physische Sicherheit der Verkabelung gewährleisten",
      "mitigation": "Die wirksamste technische Gegenmaßnahme ist die konsequente Verwendung starker, Ende-zu-Ende-verschlüsselter Protokolle (z. B. TLS, IPsec/VPN) für alle Datenübertragungen. ",
      "check": "Ist das Kommunikationsprotokoll verschlüsselt? Sind die über die Verbindung übertragenen Daten sensibel? Sind die physischen Wege für die Verkabelung gegen unbefugten Zugriff gesichert?",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen, die prozesslokal sind. Sie löst ein Risiko für jede Verbindung aus, die ein unverschlüsseltes Protokoll verwendet. ",
      "riskAssessment": "Die Wahrscheinlichkeit eines physischen Angriffs wird für Verbindungen, die Vertrauensgrenzen überschreiten, als höher angesehen. Die Auswirkung wird auf der Grundlage der höchsten Vertraulichkeit, ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn der physische Pfad des Kabels nachweislich sicher ist (z. B. innerhalb eines bewachten Rechenzentrums), "
    },
    "inadequate-physical-capacity-planning": {
      "title": "Unzureichende Kapazitätsplanung für die physische Infrastruktur",
      "description": "Wenn Rechenzentren, Serverräume oder andere physische Hosting-Umgebungen geplant werden, basieren die Entwürfe oft ausschließlich auf den aktuellen Bedürfnissen. ",
      "impact": "Wenn die physische Infrastruktur das erforderliche Wachstum nicht unterstützen kann, kann es unmöglich werden, neue Systeme bereitzustellen oder bestehende zu skalieren, was sich direkt auf die Dienstverfügbarkeit auswirkt. ",
      "asvs": "BSI IT-Grundschutz: INF.1 Allgemeines Gebäude",
      "action": "Skalierbarkeit und zukünftiges Wachstum in die Planung der physischen Infrastruktur einbeziehen",
      "mitigation": "Planen Sie während der Planung und des Ausbaus von physischen Standorten wie Rechenzentren explizit zukünftiges Wachstum ein. ",
      "check": "Gibt es eine Dokumentation für die Strom-, Netzwerk- und Kühlkapazität des physischen Standorts? War zukünftiges Wachstum eine spezifizierte Anforderung während des Designs? Gibt es etablierte Verfahren zur Kapazitätsüberwachung und -überprüfung?",
      "detectionLogic": "Diese Regel wird für physische, on-premise oder dedizierte Hoster-Netzwerkvertrauensgrenzen ausgelöst, die nicht explizit als für Wachstum konzipiert gekennzeichnet sind. ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Verfügbarkeitsanforderung der technischen Assets innerhalb der Grenze bestimmt; wenn unternehmenskritische Systeme nicht skaliert werden können, ist die Auswirkung sehr hoch. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein physischer Standort implizit skalierbar ist, auch ohne entsprechendes Tag, oder wenn er Legacy-Systeme ohne absehbares Wachstum beherbergt. Manuelle Überprüfung des Standorts"
    },
    "improper-cabling-documentation-inf5": {
      "title": "Unsachgemäße Dokumentation der physischen Verkabelung (BSI INF.5)",
      "description": "Wenn der genaue Verlauf von physischen Netzwerkkabeln aufgrund unzureichender Dokumentation unbekannt ist, können diese Kabel bei Bau-, Umzugs- oder Wartungsarbeiten versehentlich beschädigt werden. ",
      "impact": "Versehentliche Schäden an undokumentierter physischer Verkabelung können zu einem Denial-of-Service (DoS) für alle Systeme und Anwendungen führen, die von der betroffenen Netzwerkverbindung abhängen, was potenziell zu größeren Geschäftsstörungen führen kann. ",
      "asvs": "BSI IT-Grundschutz Baustein INF.5 Verkabelung, Anforderung INF.5.A10 Dokumentation der passiven Netzkomponenten.",
      "action": "Umfassende Verkabelungsdokumentation erstellen und pflegen",
      "mitigation": "Erstellen und pflegen Sie eine detaillierte, genaue und aktuelle Dokumentation aller physischen Netzwerkkabel, einschließlich präziser Kabelwege, Patchpanels, Steckdosen und Anschlusspunkte. ",
      "check": "Gibt es einen vollständigen und aktuellen Verkabelungsplan für die gesamte physische Netzwerkinfrastruktur? Sind alle physischen Kabel und Anschlusspunkte deutlich beschriftet? ",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen ausgelöst, die wahrscheinlich eine physische, on-premise Verkabelung darstellen, aber nicht explizit als dokumentiert gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit von versehentlichen Schäden ist in Umgebungen höher, die häufigen physischen Änderungen unterliegen (z. B. Bauarbeiten, Büroumgestaltungen, Hardwareänderungen). ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn eine umfassende Verkabelungsdokumentation existiert, diese Tatsache aber nicht durch ein Tag im Bedrohungsmodell erfasst ist. "
    },
    "unsecured-network-or-power-distributors": {
      "title": "Ungesicherte Netzwerk- oder Stromverteiler in zugänglichen Bereichen",
      "description": "Gelegentlich werden Stromversorgungs- oder Datennetzwerkverteiler ohne Schlösser in allgemein zugänglichen Bereichen installiert. ",
      "impact": "Physische Manipulation an ungesicherten Verteilern kann einen Denial-of-Service verursachen und kritische Geschäftsprozesse unterbrechen, die von der betroffenen Netzwerk- oder Strominfrastruktur abhängen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.5 (Physische und Umgebungssicherheit), Anforderung INF.5.A10 (Schutz der technischen Infrastruktur).",
      "action": "Physische Infrastrukturkomponenten sichern",
      "mitigation": "Stellen Sie sicher, dass alle Strom- und Datennetzwerkverteiler (z. B. Patchpanels, Server-Racks, Sicherungskästen), die sich in zugänglichen oder halböffentlichen Bereichen befinden, in abschließbaren Schränken oder Räumen installiert sind. ",
      "check": "Sind alle physischen Netzwerk- und Stromverteilungspunkte in zugänglichen Bereichen gegen unbefugten Zugriff gesichert? ",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche physische Assets (`machine: physical`) ausgelöst, die mit `@PhysicalSecurity:Insufficient` getaggt sind. ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeitsanforderungen des physischen Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Ein physischer Server, der unternehmenskritische Anwendungen hostet, stellt ein sehr hohes Risiko dar, wenn er offline genommen wird. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn kompensierende Kontrollen existieren, die nicht modelliert sind (z. B. ständige Überwachung des Bereichs) oder wenn das "
    },
    "unprotected-cables": {
      "title": "Risiko durch beschädigte ungeschützte Kabel",
      "description": "Wenn ein Kabel ungeschützt verlegt wird, erhöht sich das Risiko, dass es absichtlich oder unabsichtlich beschädigt wird. ",
      "impact": "Schäden an physischen Kabeln können zu einem Denial-of-Service (DoS) führen, indem die Netzwerkverbindung zwischen kritischen Systemen unterbrochen wird. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.5 (Verkabelung), der Anforderungen an eine sichere physische Netzwerkinfrastruktur detailliert beschreibt.",
      "action": "Sichere Kabelführung und physischen Schutz gewährleisten",
      "mitigation": "Kabel sollten durch physisch sichere Bereiche geführt werden (z. B. abgeschlossene Serverräume, geschützte Kabelkanäle, Doppelböden). ",
      "check": "Sind Netzwerkkabel für kritische Systeme auf ihrer gesamten Länge physisch geschützt? Ist der Zugang zu Serverräumen und Verteilerschränken kontrolliert? Gibt es regelmäßige physische Inspektionen der Infrastruktur?",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen zwischen zwei technischen Assets generiert, die beide als `physische` Maschinen gekennzeichnet sind und sich innerhalb derselben On-Premise-Vertrauensgrenze (`network-on-prem` oder `network-dedicated-hoster`) befinden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell geht von einem Standardniveau des physischen Risikos für On-Premise-Verbindungen aus. "
    },
    "power-supply-fluctuation-inf2.4": {
      "title": "Spannungsschwankungen (BSI INF.12 2.6)",
      "description": "Schwankungen der Versorgungsspannung, wie Überspannungen, Spannungsabfälle oder Brownouts, können in allen Bereichen von elektrischen Netzen auftreten. ",
      "impact": "Wenn IT-Systeme von Spannungsschwankungen betroffen sind, ist ihre Verfügbarkeit direkt bedroht, was zu Dienstunterbrechungen und potenziellem Hardwareausfall führen kann. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.12 (Verkabelung) Abschnitt 2.6 (Spannungsschwankungen, Überspannung, Unterspannung) und den Anforderungen INF.12.A4 (EMV-gerechte Stromversorgung) und INF.12.A7 (Überspannungsschutz).",
      "action": "Stromaufbereitung und @Backup:Target implementieren",
      "mitigation": "Schützen Sie sensible und kritische IT-Systeme mit einer unterbrechungsfreien Stromversorgung (USV), um eine kurzfristige @Backup:Target-Stromversorgung zu gewährleisten und vor Spannungsschwankungen zu schützen. ",
      "check": "Sind kritische Server und Netzwerkkomponenten an eine USV angeschlossen? Ist die Kapazität der USV für die angeschlossene Last ausreichend? ",
      "detectionLogic": "Dieses Risiko gilt für alle im Geltungsbereich befindlichen technischen Assets, die auf physischen oder virtuellen Maschinen laufen, da sie auf eine stabile Stromversorgung angewiesen sind. ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsanforderungen des betroffenen Assets bestimmt. Ein Asset mit ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn sich ein Asset in einem Rechenzentrum mit zertifizierter hochverfügbarer Strominfrastruktur befindet, die explizit mit einem Tag modelliert ist, "
    },
    "improper-use-of-power-strips-inf5": {
      "title": "Unsachgemäße Verwendung von Steckdosenleisten (BSI INF.12)",
      "description": "Die Verwendung von minderwertigen Steckdosenleisten oder das Hintereinanderschalten mehrerer Leisten (",
      "impact": "Ein durch fehlerhafte Steckdosenleisten verursachter Brand kann zu katastrophalem Datenverlust, Zerstörung von Hardware und langanhaltender Dienstunverfügbarkeit führen. ",
      "asvs": "N/A (physisches Sicherheitsrisiko). Siehe BSI IT-Grundschutz INF.12: Verkabelung.",
      "action": "Ordnungsgemäße Stromverteilung und Verkabelung sicherstellen",
      "mitigation": "Verwenden Sie nur hochwertige, zertifizierte (z. B. CE, VDE) Steckdosenleisten, die für die erforderliche Last geeignet sind. Verbieten Sie strikt die Praxis des Hintereinanderschaltens von Steckdosenleisten (",
      "check": "Sind irgendwo in der Einrichtung Steckdosenleisten in Reihe geschaltet? Sind die verwendeten Steckdosenleisten zertifiziert und von hoher Qualität? ",
      "detectionLogic": "Dies ist ein physisches, betriebliches Risiko. Es kann nicht allein durch die Analyse eines logischen Modells erkannt werden. ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der **Verfügbarkeits-** und **Integritäts-** Bewertung des physischen Assets ab. Eine physische Maschine, die unternehmenskritische Dienste hostet, wird durch einen Brand eine viel höhere Auswirkung erleiden. ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn die Organisation nachweisen kann, dass strenge Strommanagement- und Verkabelungsrichtlinien durchgesetzt werden, einschließlich der ausschließlichen Verwendung hochwertiger Hardware und regelmäßiger Inspektionen. "
    },
    "impermissible-network-connection": {
      "title": "Unzulässige Kabel- oder Netzwerkverbindung (BSI G 0.23)",
      "description": "In einigen Fällen werden physische Kabelverbindungen oder Netzwerkverbindungen zwischen IT-Systemen oder anderen technischen Komponenten hergestellt, die nicht vorgesehen und unzulässig sind und Sicherheitskontrollen umgehen. ",
      "impact": "Solche unzulässigen Verbindungen können unbefugten Zugriff auf Datennetzwerke, IT-Systeme, Informationen oder Anwendungen ermöglichen und dabei vorgesehene Sicherheitsprüfpunkte wie WAFs oder API-Gateways umgehen. ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5 Netzwerkarchitektur und -design, insbesondere Anforderung A.12 Netzwerksegmentierung.",
      "action": "Architektonische Netzwerksegmentierung und Zugriffskontrolle durchsetzen",
      "mitigation": "Stellen Sie sicher, dass hochwertige Assets oder Backend-Dienste nicht direkt von Komponenten zugänglich sind, die nicht als vertrauenswürdige Vermittler (z. B. API-Gateways, WAFs, Anwendungsserver) vorgesehen sind. ",
      "check": "Überprüfen Sie Netzwerkdiagramme und Firewall-/Netzwerkrichtlinien-Konfigurationen. Umgehen irgendwelche Kommunikationsverbindungen etablierte Sicherheitskontrollen wie API-Gateways oder WAFs, um direkt auf Backend-Datenbanken oder -Dienste zuzugreifen? ",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn eine Kommunikationsverbindung direkt zu einem sensiblen Backend-Asset (wie einer Datenbank, einem Webdienst oder einem Mainframe) von einer Quelle aus besteht, die kein anerkannter Vermittler oder Sicherheitskontrollpunkt ist (wie ein WAF, Reverse Proxy oder Gateway). ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist höher, wenn das Quell-Asset der unzulässigen Verbindung weniger vertrauenswürdigen Zonen (z. B. dem Internet oder einem Client-Netzwerk) ausgesetzt ist. ",
      "falsePositives": "Legitime "
    },
    "crosstalk-on-communication-lines-inf5": {
      "title": "Übersprechen auf Kommunikationsleitungen (BSI INF.12 – Leitungsbeeinträchtigungen/Übersprechen)",
      "description": "Die elektrische Signalübertragung in Kommunikationskabeln kann durch elektrische und magnetische Felder negativ beeinflusst werden. ",
      "impact": "Übersprechen kann Daten während der Übertragung beschädigen oder verändern, was zu einem Integritätsverlust führt. In schweren Fällen kann es die Kommunikation vollständig unterbrechen und einen Denial-of-Service (Verfügbarkeit) verursachen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.12 (Verkabelung), insb. 2.9 Leitungsbeeinträchtigungen (Übersprechen) und den Anforderungen INF.12.A1, INF.12.A2, INF.12.A9.",
      "action": "Abgeschirmte/Glasfaser-Verkabelung und ordnungsgemäße Trennung verwenden",
      "mitigation": "Verwenden Sie hochwertige, abgeschirmte Kabel (z. B. S/FTP Cat. 6a oder höher), die für die Datenrate und die Umgebung geeignet sind. ",
      "check": "Verwenden Kommunikationsverbindungen abgeschirmte Twisted-Pair- (STP/FTP) oder Glasfaserkabel? Ist die Kabelkategorie für die erforderliche Bandbreite ausreichend? Sind Datenkabel physisch von Stromkabeln getrennt und im Modell über `cabling:shielded` oder `cabling:fiber-optic` dokumentiert?",
      "detectionLogic": "Dieses Risiko wird für Netzwerkkommunikationsverbindungen ausgelöst, die nicht prozesslokal sind und nicht explizit als abgeschirmte oder Glasfaserkabel gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn bereits eine geeignete Verkabelung (z. B. Glasfaser, abgeschirmtes Kupfer) verwendet wird, dies aber nicht im Modell dokumentiert ist. "
    },
    "inf13-unclear-or-missing-requirements": {
      "title": "Unklare oder fehlende TGM-Anforderungen während der Planung (BSI INF.13 §2.1)",
      "description": "Wenn Stakeholder, Nutzergruppen oder „Bedarfsträger“ während der Planung und Entwicklung nicht klar definiert sind, bleiben ihre konkreten Ziele und Bedürfnisse unbekannt. Infolgedessen kann das System ohne die notwendigen Betriebs- und Sicherheitsanforderungen implementiert werden, was zu einer Diskrepanz zwischen dem, was benötigt wird, und dem, was gebaut wird, führt.",
      "impact": "Ein System, das auf unklaren Anforderungen basiert, kann Geschäftsziele verfehlen und Sicherheitslücken enthalten. Fehlende Spezifikationen für Rollen, Datenhandhabung oder Compliance können zu schwacher Autorisierung, Protokollierung, Validierung und Überwachung führen – was Vertraulichkeit, Integrität und Verfügbarkeit beeinträchtigt. Zu den Folgen gehören Datenschutzverletzungen, Missbrauch, Ausfallzeiten, Kosten und mögliche regulatorische Strafen.",
      "asvs": "V1.1: Führen Sie eine Liste von Sicherheitsanforderungen, die aus den Geschäftsanforderungen abgeleitet sind.",
      "action": "Bedarfsträger frühzeitig identifizieren und messbare Anforderungen dokumentieren",
      "mitigation": "Identifizieren und involvieren Sie alle relevanten Stakeholder-Gruppen (z. B. Gebäudebetrieb, Mieter, Sicherheit, Recht/Compliance, IT/OT). Erheben und validieren Sie funktionale, nicht-funktionale und Sicherheitsanforderungen; erfassen Sie Schnittstellen zu TGA/GA-Systemen; und pflegen Sie eine lebende Dokumentation. Verwenden Sie User Stories, Abuse/Misuse Cases und Akzeptanzkriterien. Überprüfen und baselinen Sie die Anforderungen vor der Implementierung und bei jeder Änderung.",
      "check": "Sind alle Bedarfs- und Betriebsorganisationen mit Ansprechpartnern benannt? Gibt es einen baselinierten, zugänglichen und aktuellen Anforderungssatz (einschließlich Sicherheits- und Betriebsanforderungen)? Sind Schnittstellen und Verantwortlichkeiten dokumentiert? Gibt es einen Änderungsprozess für Anforderungen?",
      "detectionLogic": "Melden Sie einen Befund für technische Assets am Einstiegspunkt (internet-facing, Webanwendungen oder Webdienste, die keine Entwicklungswerkzeuge sind), die keine eingehende Kommunikation von einer externen Entität haben. Das Fehlen eines modellierten externen Akteurs deutet darauf hin, dass Stakeholder-Interaktionen und Anforderungen für diesen Einstiegspunkt nicht erfasst oder validiert wurden.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn einem primären Einstiegspunkt modellierte Benutzer/Stakeholder fehlen. Die Auswirkung skaliert mit den CIA-Bewertungen des Assets: Je kritischer das Asset, desto schwerwiegender wird die Entwicklung des falschen Verhaltens.",
      "falsePositives": "Möglich, wenn das Modell unvollständig ist, während der reale Anforderungsprozess gründlich war, oder wenn das Asset ein Backend ohne direkte Stakeholder-Interaktion ist. Validieren Sie durch Überprüfung von Planungsdokumenten, Stakeholder-Registern und vereinbarten Anforderungs-Baselines."
    },
    "incomplete-external-service-documentation": {
      "title": "Unvollständige Dokumentation für externe Dienste (BSI TGM-Stil)",
      "description": "In komplexen Systemen sind viele externe Dienstleister beteiligt. Wenn die Dokumentation von Verantwortlichkeiten, Ansprechpartnern und Service Level Agreements (SLAs) unvollständig oder unzugänglich ist, kann dies bei Vorfällen zu vermeidbaren Verzögerungen führen, beispielsweise wenn ein kritisches System ausfällt. ",
      "impact": "Das Versäumnis, externe Dienstdetails ordnungsgemäß zu dokumentieren, kann die Verfügbarkeit durch Verzögerung der Reaktion auf Vorfälle erheblich beeinträchtigen. Es kann auch zu Nichteinhaltung rechtlicher oder vertraglicher Anforderungen führen und die Systemintegrität gefährden, wenn unzertifizierte oder anfällige Dienste verwendet werden. In Szenarien kritischer Infrastrukturen könnte dies sogar ein Sicherheitsrisiko darstellen.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium 2023, Baustein ORP.2 (Lieferantenbeziehungen), der Anforderungen zur Überwachung, Steuerung und Überprüfung von Dienstleistungen von Lieferanten abdeckt.",
      "action": "Umfassende Dokumentation für Drittanbieterdienste und Zertifizierungen erstellen und pflegen.",
      "mitigation": "Führen Sie ein zentrales, zugängliches Verzeichnis aller externen Dienstleister. Dokumentieren Sie für jeden Anbieter Notfallkontaktdaten, Eskalationsverfahren und vereinbarte SLAs. ",
      "check": "Gibt es ein zentrales Verzeichnis für Dienstleisterverträge und SLAs? Sind Notfallkontakte und Eskalationsverfahren dokumentiert und für das Incident-Response-Team zugänglich? Gibt es ein System zur Verfolgung der Gültigkeit und Erneuerungsdaten von Zertifizierungen für alle externen Dienste?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die höchste CIA-Anforderung des externen Dienstes selbst oder aller Assets, mit denen er kommuniziert, bestimmt. Wenn ein unternehmenskritisches System von einem externen Dienst mit schlechter Dokumentation abhängt, ist die Auswirkung eines Ausfalls sehr hoch. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Organisation eine ausgezeichnete, gut gepflegte Dokumentation für alle ihre Dienstleister hat, dies aber nicht im Modell durch die Minderungs-Tags widergespiegelt wurde. Das Risiko dient als Anstoß, diese externen Prozesse zu überprüfen."
    },
    "compromise-of-physical-safety-interfaces": {
      "title": "Kompromittierung von Schnittstellen zu cyber-physischen Sicherheitssystemen",
      "description": "Technische Gebäudemanagement (TGM)-Systeme bieten oft Schnittstellen zu Bereichen, die besonderen Schutz erfordern, wie z. B. sicherheitsgerichtete Systeme (SIS), Sicherheitsdienste oder Brandmeldeanlagen. Wenn diese Schnittstellen kompromittiert werden – sei es absichtlich oder unabsichtlich – kann dies zu Rechtsverstößen führen und eine direkte Gefahr für Leib und Leben darstellen.",
      "impact": "Eine Kompromittierung dieser kritischen Schnittstellen kann schwerwiegende physische Folgen haben. Beispielsweise das Deaktivieren einer Brandmeldeanlage ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.3.2 Gebäudeautomations- und -steuerungssysteme (früher CON.6).",
      "action": "Kommunikationskanäle zu cyber-physischen Systemen sichern",
      "mitigation": "Kommunikationsverbindungen zu cyber-physischen Systemen müssen robust gesichert werden. Dazu gehört die Verwendung von starker ",
      "check": "Sind Kommunikationsverbindungen zu Assets, die als ",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen von einem beliebigen Standard-technischen Asset zu einem spezialisierten Asset, das als ",
      "riskAssessment": "Die Auswirkung der Kompromittierung eines physischen Sicherheitssystems wird immer als ",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn kompensierende Kontrollen existieren, die nicht modelliert sind, wie z. B. ein physisch isoliertes und gesichertes "
    },
    "inadequate-monitoring-of-critical-systems": {
      "title": "Unzureichende Überwachung kritischer Systeme (BSI INF.13 · OPS.1.1.5)",
      "description": "Wenn kritische Systeme (z. B. Technische Gebäudeautomation, TGA) nicht ausreichend überwacht werden, können sicherheitsrelevante Ereignisse wie Fehlfunktionen oder Angriffe unentdeckt bleiben oder zu spät erkannt werden. Geringfügige Probleme können zu größeren Vorfällen eskalieren, die den Betrieb und die Sicherheit beeinträchtigen.",
      "impact": "Unerkannte Ausfälle können zu langanhaltenden Ausfallzeiten, physischen Schäden an der Infrastruktur oder sogar zu Gefahren für Leib und Leben führen. Dies beeinträchtigt hauptsächlich die Verfügbarkeit und Integrität. Beispiel: Ein unbemerkter Heizungsausfall bei Minusgraden kann schwere Folgeschäden verursachen.",
      "asvs": "BSI IT-Grundschutz / Bausteine INF.13 (TGM) & OPS.1.1.5 (Monitoring und Logging)",
      "action": "Umfassende Überwachung und automatisierte Alarmierung für alle kritischen TGA/OT-Systeme einrichten",
      "mitigation": "Überwachen Sie Ausfälle, Anomalien und Sicherheitsereignisse kontinuierlich über eine zentrale Überwachungslösung. Implementieren Sie eine automatisierte Alarmierung an das Bereitschafts-/Betriebsteam, definieren Sie Schwellenwerte und Eskalationspfade und testen Sie regelmäßig sowohl die Überwachungsabdeckung als auch die Alarmzustellung.",
      "check": "Senden alle als kritische Systeme identifizierten Assets (z. B. IoT-Geräte, TGA-Systeme) Überwachungsdaten an ein dediziertes ",
      "detectionLogic": "Diese Regel meldet technische Assets, die kritische physische/Steuerungssysteme sind (Technologie = IoTDevice oder explizit getaggt mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine Überwachungsverbindung modelliert ist. Die Auswirkung leitet sich von den Verfügbarkeits-/Integritätsbewertungen des Assets ab: Wichtig → Mittel, Kritisch → Hoch, Missionskritisch → Sehr Hoch.",
      "falsePositives": "Das Bedrohungsmodell ist möglicherweise unvollständig: Ein Überwachungssystem und Datenflüsse könnten in der Realität existieren, sind aber nicht dokumentiert. Validieren Sie dies mit den Betriebs-/TGM-Verantwortlichen vor der Behebung."
    },
    "inadequate-dedicated-iam-for-segregated-environment": {
      "title": "Schwaches dediziertes IAM in einer getrennten TGM-Umgebung",
      "description": "Wenn Teile der technischen Gebäudeumgebung (TGM/TGA/GA) in einer getrennten Zone mit einem separaten Identity & Access Management (IAM) betrieben werden, können Schwächen in diesem dedizierten IAM (z. B. geteilte Konten, fehlende MFA, langsame JML-Handhabung) einen einzigen Fehlerpfad zur gesamten Zone öffnen. Dies steht im Einklang mit BSI INF.13 (Technisches Gebäudemanagement) und ORP.4 (Identitäts- und Berechtigungsmanagement).",
      "impact": "Die Kompromittierung des dedizierten IAM ermöglicht einen breiten unbefugten Zugriff auf TGM/TGA-Assets und gefährdet die Vertraulichkeit (z. B. Pläne/BIM), Integrität (Steuerungsparameter) und Verfügbarkeit (Gebäudefunktionen: HVAC, Alarme). Die Auswirkungen können auf sicherheitsrelevante Systeme und gesetzliche Verpflichtungen übergreifen.",
      "asvs": "OWASP ASVS V2 (Authentifizierung), V4 (Zugriffskontrolle)",
      "action": "Das dedizierte IAM härten und steuern: nur eindeutige Identitäten, MFA, Joiner-Mover-Leaver automatisieren, regelmäßige Zugriffsüberprüfungen und SoD für privilegierte Operationen.",
      "mitigation": "Wiederverwendung von geteilten/Dienstkonten verbieten; MFA für Administratoren und Operationen mit hoher Auswirkung erzwingen; robuste, automatisierte JML-Workflows mit sofortiger De-Provisionierung implementieren; vierteljährliche Zugriffsüberprüfungen planen; IAM-Protokolle in SIEM integrieren; PAM für privilegierten Zugriff verwenden; Break-Glass-Konten mit strengen Kontrollen und Überwachung pflegen; Identitäten kontinuierlich mit Wahrheitsquellen abgleichen.",
      "check": "Wird ein separates IAM für die getrennte TGM-Grenze verwendet? Werden eindeutige Identitäten und MFA erzwungen? Ist JML mit rechtzeitiger Widerrufung automatisiert? Sind regelmäßige (z. B. vierteljährliche) Zugriffsüberprüfungen dokumentiert? Sind geteilte Konten technisch blockiert und wird PAM für Admins erzwungen? Ist der Notfallzugriff (",
      "detectionLogic": "Erkennt Vertrauensgrenzen, die mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist standardmäßig ",
      "falsePositives": "Geringeres Risiko, wo das dedizierte IAM eindeutige Konten und MFA erzwingt, PAM verwendet, JML mit sofortiger Widerrufung automatisiert, regelmäßige Abgleiche und Zugriffsüberprüfungen durchführt, in SIEM integriert ist und SoD anwendet. In solch ausgereiften Setups kann der Befund informativ sein."
    },
    "inadequate-planning-of-building-automation-inf4-g1": {
      "title": "Unzureichende Planung der Gebäudeautomation (BSI INF.14 – Unzureichende Planung der GA)",
      "description": "Gebäudeautomationssysteme (GA) koordinieren und steuern die technische Gebäudeausrüstung (TGA). Laut BSI kann eine mangelhafte Planung dieser Systeme, wie z. B. eine unzureichende Redundanz für zentrale Steuerungen, zu Ausfällen mit erheblichen Folgen führen. Die Komplexität der Integration heterogener Systeme (z. B. HVAC, Zutrittskontrolle, Brandmeldeanlagen) und mehrerer Dienstleister verschärft dieses Risiko.",
      "impact": "Ein Ausfall aufgrund schlechter Planung kann zu einem Denial-of-Service für kritische Gebäudefunktionen führen, was zu Sachschäden (z. B. durch ausgefallene Klimasteuerung), finanziellen Verlusten, Störungen des Geschäftsbetriebs und sogar zu Personenschäden (z. B. durch Einsperren bei einem Ausfall des Zutrittskontrollsystems) führen kann. Dies beeinträchtigt direkt die Verfügbarkeit der gesteuerten Systeme und der physischen Umgebung.",
      "asvs": "BSI IT-Grundschutz Baustein INF.14: Gebäudeautomation, Gefährdung: Unzureichende Planung der GA.",
      "action": "Umfassende und widerstandsfähige Planung für Gebäudeautomationssysteme sicherstellen",
      "mitigation": "Die Planung von Gebäudeautomationssystemen (GA) muss gründlich sein und IT-Sicherheit, Facility Management und andere Stakeholder einbeziehen. Ein zentraler Aspekt ist die Implementierung von Redundanz für alle kritischen Komponenten, um einzelne Ausfallpunkte zu vermeiden. Das Modell sollte dies widerspiegeln, indem das ",
      "check": "Gibt es ein detailliertes Planungs- und Architekturdokument für das Gebäudeautomationssystem? Enthält es ein Redundanzkonzept für kritische Komponenten (z. B. Steuerungen)? Ist das entsprechende technische Asset im Modell als ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Gebäudeautomationssteuerung identifiziert wird (über das Tag `@AssetType:BuildingAutomationController`), das nicht als redundant markiert ist (`redundant: false`). Das Fehlen geplanter Redundanz für eine so zentrale Steuerungskomponente ist ein direkter Indikator für dieses Risiko.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der ",
      "falsePositives": "Ein Risiko könnte ein Fehlalarm sein, wenn das Asset nicht kritisch ist und sein vorübergehender Ausfall akzeptabel ist. Dies sollte durch eine niedrige Verfügbarkeitsbewertung (z. B. "
    },
    "improper-subsystem-integration-in-building-automation": {
      "title": "Unsachgemäße Integration von Subsystemen in der Gebäudeautomation (BSI IND.2.2)",
      "description": "Wenn ein Subsystem (z. B. Zutrittskontrolle, Klimasensor, HVAC-Einheit) falsch oder unzureichend in das zentrale Gebäudeautomationssystem integriert ist, kann die Funktionalität des gesamten Systems beeinträchtigt werden. ",
      "impact": "Ein Betriebsausfall in der Gebäudeautomation kann direkte physische Folgen haben. Dazu gehören Ausfälle bei der Steuerung von Heizung, Lüftung, Beleuchtung oder physischen Zugangssystemen. ",
      "asvs": "BSI IT-Grundschutz Baustein IND.2.2: Gebäudeautomation",
      "action": "Robuste Integration, Kommunikationsprotokolle und Fehlerbehandlung sicherstellen",
      "mitigation": "Verwenden Sie standardisierte, robuste und widerstandsfähige Kommunikationsprotokolle (z. B. BACnet/SC, OPC UA) für die Integration von Subsystemen. ",
      "check": "Sind die Kommunikationsprotokolle zwischen der zentralen Steuerung und ihren Subsystemen dokumentiert und standardisiert? Gibt es eine Überwachung und Alarmierung bei Kommunikationsausfällen? Wie verhält sich das System, wenn ein Subsystem nicht verfügbar ist? Werden Daten von Subsystemen validiert, bevor darauf reagiert wird?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als zentrale Steuerungen fungieren (z. B. mit ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung hängt von der Widerstandsfähigkeit der Integration ab. Sie wird für proprietäre oder nicht authentifizierte Protokolle als höher angesehen. ",
      "falsePositives": "Das Modell kann die Widerstandsfähigkeit oder spezifische Fehlerbehandlungsfähigkeiten der implementierten Kommunikationslogik nicht vollständig bewerten. Eine Verbindung könnte als riskant eingestuft werden, aber die Anwendungsschicht könnte robuste Prüfungen haben. Dies erfordert eine manuelle Überprüfung des Systems"
    },
    "outdated-or-unsupported-components": {
      "title": "Verwendung veralteter oder nicht unterstützter Komponenten",
      "description": "Viele Systeme, insbesondere in spezialisierten Umgebungen wie der Gebäudeautomation (GA/TGA), verwenden Komponenten (Hardware oder Software), die vom Hersteller nicht mehr unterstützt werden. Dies kann auf das Alter, fehlende Hersteller-Patches oder inhärente Designbeschränkungen (z. B. unsichere Protokolle aufgrund begrenzter Rechenressourcen) zurückzuführen sein. Diese Komponenten haben oft bekannte, ungepatchte Schwachstellen, was ein erhebliches Sicherheitsrisiko darstellt.",
      "impact": "Die Ausnutzung von Schwachstellen in nicht unterstützten Komponenten kann zu einer vollständigen Kompromittierung des Assets führen. Dies kann zu unbefugtem Datenzugriff, Manipulation von Systemfunktionen (z. B. Manipulation von Gebäudesteuerungen) oder der Nutzung des kompromittierten Assets als Ausgangspunkt für weitere Angriffe im Netzwerk führen. Dies bedroht direkt die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und der von ihm verarbeiteten Daten.",
      "asvs": "OWASP Top 10 A06:2021 - Anfällige und veraltete Komponenten",
      "action": "Einen Prozess für das Schwachstellen- und Lebenszyklusmanagement implementieren",
      "mitigation": "Führen Sie ein vollständiges Inventar aller Hardware- und Softwarekomponenten, einschließlich Version und Support-Status (d. h. eine Software/Hardware Bill of Materials). Überwachen Sie proaktiv auf neue Schwachstellen in diesen Komponenten. Wenden Sie Sicherheitspatches zeitnah an. Erstellen Sie für Komponenten, die End-of-Life (@Maintenance:Unmaintained) sind oder nicht mehr unterstützt werden, einen Ersatzplan. Wenn ein sofortiger Ersatz nicht möglich ist, wenden Sie kompensierende Kontrollen an, wie z. B. Netzwerksegmentierung, strikte Zugriffskontrolle, virtuelles Patchen mit einem WAF/IPS und erweiterte Überwachung.",
      "check": "Gibt es ein vollständiges Inventar der Komponenten (SBOM/HBOM)? Gibt es einen Prozess zur Überwachung und Verwaltung von Schwachstellen? Werden End-of-Life-Komponenten identifiziert und einem Risikomanagement unterzogen (Ersatz oder kompensierende Kontrollen)?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit als `@Unsupported-Component` getaggt ist. Es wird auch für Assets vom Typ `IoT-Gerät` ausgelöst, die unverschlüsselte Kommunikationsprotokolle über ein Netzwerk verwenden, da dies stark auf ein veraltetes oder unsicheres Design hindeutet.",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jede Komponente, die bekanntermaßen nicht unterstützt wird, als hoch eingestuft, da Schwachstellen oft öffentlich bekannt und ungepatcht sind. Die Auswirkung leitet sich von den Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten ab. Nicht unterstützte Komponenten, die dem Internet ausgesetzt sind, stellen ein kritisches Risiko dar.",
      "falsePositives": "Ein Asset könnte als nicht unterstützt getaggt sein, aber effektive kompensierende Kontrollen haben (wie z. B. in einem vollständig luftisolierten Netzwerk), die im Modell nicht vollständig widergespiegelt sind, was das praktische Risiko verringert."
    },
    "misconfiguration-of-building-automation-inf14": {
      "title": "Fehlkonfiguration der Gebäudeautomation (BSI INF.14)",
      "description": "Gebäudeautomationssysteme (BA), auch als ",
      "impact": "Je nachdem, welcher Bereich der Gebäudeautomation fehlkonfiguriert ist, kann es zu Störungen im Geschäftsbetrieb, unbefugtem physischen Zugang zu geschützten Bereichen, Schäden an IT-Systemen (z. B. durch Überhitzung) und in schweren Fällen zu Gebäudeschäden oder Personenschäden kommen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.14 Gebäudeautomation.",
      "action": "Sicheres Konfigurationsmanagement für Gebäudeautomationssysteme implementieren und durchsetzen.",
      "mitigation": "Definieren und erzwingen Sie sichere Konfigurations-Baselines für alle BA-Komponenten, die auf ihre spezifische Funktion zugeschnitten sind. Implementieren Sie einen strengen Änderungsmanagement- und Überprüfungsprozess für alle Konfigurationsänderungen. Verwenden Sie nach Möglichkeit dedizierte Testumgebungen, um Änderungen und Software-/Firmware-Updates zu validieren. Stellen Sie sicher, dass die Aktualisierungsverfahren zuverlässig sind und dokumentierte Rollback-Pläne haben. Überprüfen Sie die Konfigurationen regelmäßig anhand der definierten Baselines.",
      "check": "Gibt es dokumentierte sichere Konfigurationsstandards für alle Gebäudeautomationssysteme? Gibt es einen formellen Änderungskontrollprozess für diese Systeme? Werden Protokolle von BA-Systemen auf Anomalien oder unbefugte Änderungen überwacht? Ist das für die Konfiguration zuständige Personal ausreichend geschult?",
      "detectionLogic": "Sucht nach technischen Assets, die Gebäudeautomationskomponenten repräsentieren (z. B. Assets vom Technologietyp ",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit den Verfügbarkeits- und Integritätsanforderungen des gesteuerten physischen Prozesses. Jedes Potenzial für Personenschäden (z. B. bei Zugangskontroll- oder Brandbekämpfungssystemen) impliziert die höchste Auswirkung. Die Wahrscheinlichkeit ist bei komplexen oder benutzerdefinierten Systemen erhöht, bei denen Konfigurationsfehler wahrscheinlicher sind, insbesondere angesichts der im BSI-Quelltext erwähnten Schwierigkeit von vollständigen Tests.",
      "falsePositives": "Dieses Risiko ist abstrakt, da das Modell den tatsächlichen Konfigurationszustand in der realen Welt nicht überprüfen kann. Ein durch diese Regel identifiziertes Asset könnte perfekt konfiguriert und verwaltet sein. Dieses Risiko dient als Erinnerung, die Konfigurationsmanagementprozesse für alle kritischen BA-Systeme zu überprüfen und zu verifizieren."
    },
    "manipulation-of-ga-tga-interfaces": {
      "title": "Manipulation von Schnittstellen zwischen Gebäudeautomation (GA) und technischer Gebäudeausrüstung (TGA) (BSI G 0.23)",
      "description": "Manipulierte Schnittstellen zwischen Gebäudeautomationssystemen (GA) und gekoppelter technischer Gebäudeausrüstung (TGA), wie Sensoren und Aktoren, können zu fehlerhaften Reaktionen im Automatisierungssystem führen. ",
      "impact": "Eine erfolgreiche Manipulation dieser Schnittstellen kann die physische Sicherheit direkt gefährden. Dies kann zu unbefugtem Zugang zu Einrichtungen, zur Deaktivierung von Sicherheitssystemen (wie Alarmen oder Kameras) oder zur gefährlichen Manipulation von Umgebungskontrollen (HVAC, Brandbekämpfung) führen. ",
      "asvs": "BSI IT-Grundschutz INF.14 & APP.5.3: Gebäudeautomation / Gebäudemanagementsysteme",
      "action": "Sichere, authentifizierte und integritätsgeschützte Kommunikation implementieren",
      "mitigation": "Alle Kommunikationen zwischen Gebäudeautomationskomponenten (Steuerungen, Sensoren, Aktoren) müssen gegen Manipulation geschützt werden. Verwenden Sie kryptografisch sichere, gegenseitig authentifizierte Protokolle wie TLS (z. B. HTTPS, MQTTS, WSS), um sowohl die Vertraulichkeit als auch die Integrität der übertragenen Daten zu gewährleisten. ",
      "check": "Sind die Kommunikationsverbindungen zwischen physischen Steuerungssystemen und ihren Sensoren/Aktoren verschlüsselt (z. B. mit TLS)? Wird eine starke gegenseitige Authentifizierung zwischen den Komponenten erzwungen? Sind Nachrichten signiert oder anderweitig geschützt, um Manipulationen zu verhindern?",
      "detectionLogic": "Diese Regel erkennt Kommunikationsverbindungen zwischen GA-Steuerungen und TGA-Endpunkten. Ein Risiko wird ausgelöst, wenn eine Verbindung eine Steuerung mit einem Sensor oder Aktor verbindet und das Protokoll unverschlüsselt ist oder die Authentifizierung deaktiviert ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als sehr wahrscheinlich angesehen, wenn der Kommunikationskanal ungeschützt ist, da dies eine triviale Nachrichten-Injektion oder -Änderung durch einen Angreifer mit Netzwerkzugriff ermöglicht. ",
      "falsePositives": "Eine gemeldete Verbindung kann ein Fehlalarm sein, wenn Integritätskontrollen auf der Anwendungsebene implementiert sind (z. B. signierte Payloads) und außerhalb des Modells dokumentiert sind"
    },
    "inadequate-protection-of-building-automation-networks": {
      "title": "Unzureichender Schutz von Gebäudeautomationsnetzwerken (GA) (BSI INF.14)",
      "description": "Gebäudeautomationssysteme (GA) bestehen oft aus zahlreichen miteinander verbundenen Komponenten wie IoT-Geräten, Sensoren und Aktoren, die über verschiedene Netzwerkprotokolle (LAN, WLAN, Bluetooth) kommunizieren. ",
      "impact": "Ein Angreifer, der einen ungeschützten Netzwerkzugangspunkt zu einem GA-System ausnutzt, kann schweren Schaden anrichten. Dazu gehören Denial-of-Service (DoS)-Angriffe, Manipulation oder Sabotage von physischen Steuerungen (z. B. HVAC, Beleuchtung, Zugang), Datenexfiltration (z. B. Standort von Personen) und die Einschleusung von Malware. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.14: Gebäudeautomation, z. B. INF.14.A6 (Separierung von Netzen der GA).",
      "action": "Netzwerkzugang zu Gebäudeautomationskomponenten sichern",
      "mitigation": "Alle Netzwerkkommunikationen mit GA-Komponenten müssen gesichert werden. Erzwingen Sie eine starke Authentifizierung für alle Zugriffsversuche. ",
      "check": "Sind alle Netzwerkverbindungen zu Gebäudeautomationskomponenten authentifiziert und verschlüsselt? Ist das GA-Netzwerk ordnungsgemäß von anderen Netzwerken segmentiert? ",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das als `IoTDevice` identifiziert wird (oder als Teil eines Gebäudeautomationssystems getaggt ist) und Daten über eine Kommunikationsverbindung unter riskanten Bedingungen empfängt. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko könnte als Fehlalarm gemeldet werden, wenn kompensierende Kontrollen außerhalb des modellierten Bereichs existieren, wie z. B. eine physische Netzwerkisolation, die nicht durch eine Vertrauensgrenze im Modell dargestellt ist."
    },
    "insecure-control-elements": {
      "title": "Unsichere Steuerelemente (physischer Zugang)",
      "description": "Wenn leicht zugängliche Steuerelemente (z. B. an der Wand montierte Touchpanels, Konsolen für das Pfortenpersonal) unzureichend gesichert sind, können sie zum Angriff auf verbundene Systeme genutzt werden. Dies schließt die Ausnutzung fehlender Authentifizierung zur Bedienung des Geräts oder die Verwendung ungeschützter physischer Anschlüsse (wie LAN oder USB) ein, um unbefugten Zugriff zu erlangen.",
      "impact": "Ein Angreifer kann unbefugte Kontrolle über Gebäudeautomations- oder andere Systeme erlangen und potenziell sichere Türen öffnen, Alarme deaktivieren oder Umgebungskontrollen manipulieren. Dies kann zu physischen Sicherheitsverletzungen, zur Kompromittierung von Vermögenswerten in gesicherten Bereichen und zur Störung des Betriebs führen. Es stellt eine direkte Bedrohung für die Integrität und Verfügbarkeit der gesteuerten Systeme dar.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz CON.1: Allgemeines Gebäude, insbesondere Anforderung CON.1.A15 (Schutz vor unbefugtem Zugriff), die die Sicherung von Zugangspunkten und Steuerungssystemen in einer physischen Umgebung abdeckt.",
      "action": "Physische Steuerelemente und ihre Schnittstellen sichern",
      "mitigation": "Beschränken oder überwachen Sie den physischen Zugang zu Steuerelementen. Erzwingen Sie eine starke, obligatorische Authentifizierung für alle Operationen am Steuerelement. Deaktivieren oder schützen Sie alle ungenutzten physischen Anschlüsse (USB, LAN usw.). Stellen Sie sicher, dass die Kommunikation vom Steuerelement zum gesteuerten System verschlüsselt und ordnungsgemäß autorisiert ist.",
      "check": "Befinden sich die Steuerelemente in physisch sicheren, überwachten Bereichen? Erfordert die Verwendung des Steuerelements eine Authentifizierung (z. B. PIN, Karte, Biometrie)? Sind alle physischen Anschlüsse am Gerät gegen unbefugte Nutzung gesichert? Ist die Kommunikation vom Gerät zum Backend sicher?",
      "detectionLogic": "Diese Regel wird bei technischen Assets ausgelöst, typischerweise vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als sehr wahrscheinlich angesehen, wenn ein Gerät physisch zugänglich ist und seine Steuerfunktionen keine Authentifizierung erfordern. Die Auswirkung wird durch die Kritikalität (CIA) des technischen Assets bestimmt, mit dem das unsichere Steuerelement kommuniziert. Die Steuerung eines unternehmenskritischen Systems hat eine höhere Auswirkung als die Steuerung eines nicht kritischen.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn andere kompensierende physische Kontrollen vorhanden sind, die nicht modelliert sind (z. B. ständige menschliche Überwachung, Videoüberwachung). Das Vorhandensein des Tags `@PhysicalAccess:Unrestricted` ist eine Behauptung, die gegen die reale Einsatzumgebung validiert werden muss."
    },
    "insecure-mobile-interface-on-ba-component": {
      "title": "Unsichere Mobilfunk-Schnittstelle an einer Gebäudeautomations- (BA) / OT-Komponente",
      "description": "Gebäudeautomations- (BA) oder OT-Komponenten sind oft über Mobilfunk-Schnittstellen mit externen Herstellern oder Dienstleistern verbunden. ",
      "impact": "Eine erfolgreiche Ausnutzung kann zu unbefugtem Zugriff auf das gesamte Gebäudeautomationsnetzwerk führen. Dies ermöglicht einem Angreifer, physische Systeme (z. B. HVAC, Beleuchtung, physische Zugangskontrollen) zu manipulieren, einen Denial-of-Service zu verursachen oder sensible Betriebsdaten zu exfiltrieren. Dies beeinträchtigt die Integrität und Verfügbarkeit der kontrollierten Umgebung und kann als Einstiegspunkt für weitere Angriffe auf verbundene IT-Systeme dienen.",
      "asvs": "BSI IT-Grundschutz: IND.2.2 Industrielle IT-Komponenten, NET.3.3 Mobilfunknetze; OWASP IoT Top 10: Unsichere Netzwerkdienste, Unsichere Kommunikation",
      "action": "Schnittstellen für die Fernkommunikation sichern",
      "mitigation": "Stellen Sie sicher, dass jede Kommunikation über mobile oder andere öffentliche Netzwerke stark verschlüsselt ist, indem Sie Standardprotokolle wie TLS verwenden oder sie in einem VPN kapseln. ",
      "check": "Überprüfen Sie die Konfiguration aller BA/OT-Komponenten mit Fernzugriffsfunktionen. Ist das Kommunikationsprotokoll verschlüsselt? Ist eine Authentifizierung erforderlich und ist sie stark? Befindet sich die Komponente in einem ordnungsgemäß segmentierten Netzwerk? Ist die Schnittstelle nur bei Bedarf aktiv?",
      "detectionLogic": "Diese Regel prüft technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn die Verbindung sowohl Verschlüsselung als auch Authentifizierung vermissen lässt, da dies eine weit offene Tür darstellt. Die Auswirkung wird durch die Kritikalität des OT-Geräts selbst und, was noch wichtiger ist, der Assets, mit denen es ein Netzwerk teilt, bestimmt, da die primäre Bedrohung die laterale Bewegung in das GA-Netzwerk ist.",
      "falsePositives": "Ein Risiko könnte fälschlicherweise gemeldet werden, wenn die mobile Kommunikation durch einen zugrunde liegenden Mechanismus gesichert ist, der nicht explizit in Threagile modelliert ist, wie z. B. ein vom Anbieter bereitgestelltes privates APN mit integrierter Sicherheit oder ein VPN auf Hardware-Ebene. Die Komponente könnte sich auch in einem vollständig isolierten, nicht kritischen Testnetzwerk befinden, in dem das Risiko akzeptabel ist."
    },
    "fire-and-smoke-damage-inf5": {
      "title": "Brand- und Rauchschäden (BSI INF.5)",
      "description": "Gebäude, Einrichtungen und IT-Systeme können durch Feuer schwer beschädigt werden, und Menschen können schwer verletzt oder getötet werden. ",
      "impact": "Ein Brand kann zur vollständigen Zerstörung von IT-Assets und Einrichtungen führen, was zu einem langfristigen, katastrophalen Verlust der Verfügbarkeit und Integrität von Systemen und Daten führt. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.5 (Brandschutz)",
      "action": "Umfassende Brandschutzmaßnahmen implementieren",
      "mitigation": "Implementieren Sie eine mehrschichtige Brandschutzstrategie, die Folgendes umfasst: organisatorische Maßnahmen (z. B. Brandschutzvorschriften, Rauchverbote), ",
      "check": "Sind Brandmelder und automatische Alarmsysteme installiert und werden sie regelmäßig getestet? Gibt es eine geeignete Feuerlöschanlage (z. B. Sprinkler, gasbasiert) für den Serverraum/das Rechenzentrum? ",
      "detectionLogic": "Dies ist ein physisches Risiko, das für alle im Geltungsbereich befindlichen technischen Assets gilt, die sich in on-premise Vertrauensgrenzen (`type: network-on-prem`) befinden oder explizit als physische Maschinen modelliert sind (`machine: physical`). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird im Allgemeinen als ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage des physischen Standorts eines Assets generiert, wie im Modell definiert. Es kann nicht automatisch den spezifischen Brandschutzlevel des Gebäudes oder Raums kennen. "
    },
    "damage-from-lightning-strikes-inf3": {
      "title": "Schäden an IT-Systemen durch Blitzeinschläge (in Anlehnung an BSI INF.3)",
      "description": "Während Gewittern stellen Blitzeinschläge eine erhebliche Bedrohung für Gebäude und IT-Ausrüstung dar. Ein Einschlag kann Spannungen von mehreren hunderttausend Volt und Ströme von bis zu 200.000 Ampere erreichen. ",
      "impact": "Die Zerstörung oder Beschädigung von physischer Hardware (Server, Netzwerkkomponenten usw.) führt zu einem direkten Verlust der Verfügbarkeit für die technischen Assets, die darauf laufen. ",
      "asvs": "BSI IT-Grundschutz Baustein INF.3 Blitz- und Überspannungsschutz",
      "action": "Umfassenden Blitz- und Überspannungsschutz implementieren",
      "mitigation": "Für alle physischen Standorte, die IT-Assets beherbergen, muss ein umfassendes Blitz- und Überspannungsschutzkonzept implementiert werden. Dies umfasst ein äußeres Blitzschutzsystem (z. B. Blitzableiter) zum Schutz vor direkten Einschlägen und ein inneres Überspannungsschutzsystem (mit Überspannungsschutzgeräten - SPDs) auf verschiedenen Stufen des Stromverteilungssystems zur Minderung induzierter Überspannungen. ",
      "check": "Gibt es ein dokumentiertes Blitz- und Überspannungsschutzkonzept für den physischen Standort? Sind die Assets in Einrichtungen mit angemessenen äußeren und inneren Schutzmaßnahmen untergebracht? Gibt es einen definierten Prozess für die regelmäßige Inspektion und Wartung dieser Systeme?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die auf physischen, virtuellen oder containerbasierten Maschinen innerhalb einer On-Premises- oder dedizierten Hosting-Vertrauensgrenze laufen. ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsbewertung des betroffenen technischen Assets bestimmt. Ein Ausfall eines unternehmenskritischen Assets stellt eine sehr hohe Auswirkung dar. ",
      "falsePositives": "Das Modell spiegelt möglicherweise nicht die physischen Schutzmaßnahmen eines spezifischen Rechenzentrums genau wider. Ein Asset, das in einem "
    },
    "water-damage-physical-infrastructure": {
      "title": "Wasserschäden an der physischen Infrastruktur (BSI INF.1 T 0.5)",
      "description": "Wasser kann Schäden an einem Gebäude und seinen Einrichtungen verursachen. Die Quelle kann extern sein, wie starker Regen, Sturmfluten oder Überschwemmungen, ",
      "impact": "Wenn die physische IT-Infrastruktur durch Wasser beschädigt wird, kann dies zu einem vollständigen Verlust der Verfügbarkeit für die betroffenen technischen Assets führen. ",
      "asvs": "Nicht anwendbar. Dies ist eine physische und umweltbedingte Bedrohung, die außerhalb des Geltungsbereichs des OWASP Application Security Verification Standard (ASVS) liegt.",
      "action": "Physische und umweltbezogene Schutzmaßnahmen implementieren",
      "mitigation": "Stellen Sie sicher, dass Serverräume und Rechenzentren in Bereichen mit geringem Überschwemmungsrisiko liegen (z. B. nicht in Kellern). ",
      "check": "Befindet sich die IT-Ausrüstung in einem Gebäudebereich, der vor Überschwemmungen und Wasserlecks geschützt ist? Sind Umgebungssensoren wie Wassermelder vorhanden? ",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset ausgelöst, das explizit als ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die Verfügbarkeitsanforderungen des betroffenen physischen Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn der spezifische Standort über fortschrittliche, bewährte Umgebungskontrollen gegen Wasserschäden verfügt, die nicht im Bedrohungsmodell erfasst sind."
    },
    "elemental-damage-natural-disasters": {
      "title": "Elementarschäden und Naturkatastrophen (BSI INF.1.G4)",
      "description": "Je nach Standort ist ein Gebäude unterschiedlichen Risiken durch Elementarschäden und Naturkatastrophen ausgesetzt. Ursachen für Naturkatastrophen können seismische (Erdbeben), klimatische (Überschwemmungen, Erdrutsche, Tsunamis) oder vulkanische Phänomene sein. Auch extreme Wetterereignisse wie Hurrikane oder starke Regenfälle stellen eine erhebliche Bedrohung dar. Dieses Risiko befasst sich mit der potenziellen Beschädigung oder Zerstörung der physischen Infrastruktur, in der IT-Anlagen untergebracht sind.",
      "impact": "Die primäre Auswirkung betrifft die Verfügbarkeit aller technischen Anlagen und Daten, die sich am betroffenen physischen Standort befinden. Physische Zerstörung kann zu einem Totalausfall von Diensten und Geschäftsabläufen führen. Sekundäre Auswirkungen könnten die Verletzung der Vertraulichkeit oder Integrität sein, wenn physische Sicherheitskontrollen während oder nach dem Ereignis kompromittiert werden, was zu Datenverlust oder -exposition führen kann.",
      "asvs": "BSI IT-Grundschutz INF.1: Gebäude",
      "action": "Standortspezifische Umweltrisiken bewerten und Schutzmaßnahmen umsetzen",
      "mitigation": "Führen Sie eine gründliche Risikobewertung für den physischen Standort jedes Rechenzentrums oder Gebäudes durch, das kritische Anlagen beherbergt. Dies umfasst die Überprüfung offizieller Karten auf Überschwemmungsgebiete, seismische Zonen und historische Wetterdaten. Basierend auf der Bewertung implementieren Sie geeignete bauliche und organisatorische Schutzmaßnahmen, wie z. B. Sumpfpumpen, verstärkte Strukturen, Feuerlöschanlagen und die Gewährleistung von Strom-/Netzwerkredundanz. Ein umfassender und getesteter Business Continuity and Disaster Recovery Plan (BCP/DRP) ist unerlässlich, einschließlich geografisch getrennter (Off-Site) Datensicherungen und möglicherweise eines @SystemType:OT/kalten sekundären Betriebsstandorts.",
      "check": "Wurde für alle physischen Standorte eine standortspezifische Risikobewertung für Naturkatastrophen durchgeführt? Sind physische Schutzmaßnahmen entsprechend den identifizierten Risiken vorhanden? Gibt es einen getesteten Notfallwiederherstellungsplan, der den Verlust des primären Standorts berücksichtigt?",
      "detectionLogic": "Dieses Risiko wird für jede physische Vertrauensgrenze (Typen ",
      "riskAssessment": "Die Wahrscheinlichkeit hängt stark von der geografischen Lage des physischen Standorts ab, die dem Modell unbekannt ist. Ein allgemeiner ",
      "falsePositives": "Dieses Risiko kann für einen Standort gemeldet werden, der über ausgezeichnete, nicht modellierte physische Schutzmaßnahmen verfügt. Das Modell hat keine Kenntnis von spezifischen Bauvorschriften, Hochwasserschutzmauern oder seismischen Nachrüstungen. Die Überprüfung erfordert Kenntnisse des physischen Standorts"
    },
    "environmental-hazard-to-building-inf1": {
      "title": "Umweltgefährdung für Gebäude (BSI INF.1)",
      "description": "Gebäude können durch Ereignisse in ihrer unmittelbaren Umgebung beschädigt werden, wie z. B. das Austreten giftiger Substanzen. ",
      "impact": "Dies kann zu einem teilweisen oder vollständigen Ausfall der in dem betroffenen Gebäude untergebrachten IT-Systeme führen, was hauptsächlich deren **Verfügbarkeit** beeinträchtigt. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.1 (Gebäudesicherheit)",
      "action": "Einen sicheren Standort wählen und physische sowie organisatorische Schutzmaßnahmen umsetzen",
      "mitigation": "Die Standortwahl für Rechenzentren oder Serverräume sollte Umweltrisiken berücksichtigen (z. B. Überschwemmungen, Nähe zu gefährlichen Industrieanlagen). ",
      "check": "Wurde der physische Standort des Rechenzentrums auf Umweltrisiken geprüft? Gibt es Notfall- und Evakuierungspläne? Werden kritische Systeme an einem separaten, geografisch entfernten physischen Standort repliziert?",
      "detectionLogic": "Dieses Risiko wird automatisch für jede Vertrauensgrenze vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist standortabhängig, wird aber für ein generisches Modell im Allgemeinen als **Unwahrscheinlich** angesehen, da große Katastrophen für die meisten Standorte kein alltägliches Ereignis sind. ",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein oder eine geringere Schwere haben, wenn der spezifische Standort als risikoarm bekannt ist (z. B. nicht in einer Aue, weit entfernt von industriellen Gefahren) oder wenn umfangreiche physische Schutzmaßnahmen und Redundanzpläne bereits vorhanden sind, die möglicherweise nicht vollständig im Bedrohungsmodell erfasst sind."
    },
    "unauthorized-physical-access": {
      "title": "Unbefugter physischer Zugang zu Gebäuden/Räumen",
      "description": "Unbefugtes Betreten von Gebäuden oder Räumen ermöglicht Diebstahl, Manipulation oder Zerstörung von Informationen, IT-Systemen oder Komponenten. ",
      "impact": "Kompromittierungen des physischen Zugangs bedrohen direkt die Vertraulichkeit (Datendiebstahl), Integrität (Manipulation von Daten/Systemen) und Verfügbarkeit (Diebstahl/Zerstörung von Hardware) der betroffenen Assets und der von ihnen unterstützten Geschäftsprozesse.",
      "asvs": "BSI IT-Grundschutz INF.1 Allgemeines Gebäude — insbesondere INF.1.A6 (Geschlossene Fenster und Türen), INF.1.A7 (Zutrittsregelung und -kontrolle), INF.1.A27 (Einbruchschutz).",
      "action": "Physische Zugangskontrolle implementieren und durchsetzen",
      "mitigation": "Setzen Sie mehrschichtige physische Zugangskontrollen für alle Bereiche ein, die IT-Assets enthalten: sichere Türen/Schlösser, elektronische Zugangskontrolle (z. B. Schlüsselkarten), Besuchermanagement, Überwachung/Monitoring, wo angemessen, und gesicherte Racks oder Räume für hochwertige Assets. ",
      "check": "Sind physische Zugangsrichtlinien dokumentiert, durchgesetzt und geprüft? Sind sensible Bereiche durch geeignete Barrieren (Türen/Schlösser) und Zugangskontrollmechanismen geschützt? Werden Zugangsereignisse protokolliert und überprüft?",
      "detectionLogic": "Wird für alle im Geltungsbereich befindlichen technischen Assets mit dem Maschinentyp ",
      "riskAssessment": "Die Auswirkung leitet sich von der höchsten CIA-Anforderung des physisch zugänglichen Assets und der von ihm verarbeiteten/gespeicherten Daten ab. ",
      "falsePositives": "Assets können gemeldet werden, auch wenn sie sich in hochsicheren Bereichen befinden (z. B. Tresor, DC-Cage), wenn dieses Detail im Modell nicht vorhanden ist. "
    },
    "inf1-non-compliance-during-development": {
      "title": "Nichteinhaltung von Sicherheitsanforderungen während der Entwicklung (Analogie zu BSI INF.1)",
      "description": "Bei der Erstellung eines IT-Systems müssen zahlreiche Gesetze, Normen und interne Richtlinien beachtet werden (z. B. Datenschutz, Architektursicherheit, physische/Umweltsicherheit). Wenn diese Vorschriften während der Entwicklung verletzt werden, bleibt dies möglicherweise lange unbemerkt, kann aber katastrophale Folgen haben, beispielsweise wenn Sicherheitskontrollen nicht wie spezifiziert implementiert oder sichere Programmierpraktiken ignoriert werden.",
      "impact": "Die Nichteinhaltung von Sicherheitsanforderungen und -vorschriften während der Entwicklung kann kritische Schwachstellen einführen. Dies kann zu Datenlecks, Systemausfällen, unbefugtem Zugriff und Nichteinhaltung gesetzlicher oder vertraglicher Verpflichtungen (z. B. Umgang mit PII, PCI-DSS) führen, was zu erheblichen finanziellen Verlusten, Reputationsschäden und rechtlichen Strafen führen kann.",
      "asvs": "V1: Anforderungen an Architektur, Design und Bedrohungsmodellierung",
      "action": "Einen sicheren Softwareentwicklungslebenszyklus (SDLC) etablieren und durchsetzen",
      "mitigation": "Integrieren Sie Sicherheit in jede Phase des Entwicklungslebenszyklus. Definieren Sie klare Sicherheitsanforderungen, Architekturprinzipien und sichere Programmierstandards auf der Grundlage relevanter Gesetze und Best Practices. Verwenden Sie eine Kombination aus automatisierten Sicherheitstests (SAST, DAST, IAST, SCA) innerhalb der CI/CD-Pipeline und manueller Überprüfung (Peer-Reviews, Security Walkthroughs, Penetrationstests), um die Einhaltung sicherzustellen. Bieten Sie Entwicklern kontinuierliche Schulungen zu sicheren Programmierpraktiken und den spezifischen Anforderungen, die für das Projekt gelten.",
      "check": "Gibt es einen dokumentierten Secure SDLC? Sind Sicherheitsanforderungen explizit definiert und nachverfolgt? Sind automatisierte Sicherheitsscanning-Tools in den Build-Prozess integriert? Gibt es Aufzeichnungen über sicherheitsfokussierte Code-Reviews und Penetrationstests für kundenspezifisch entwickelte Komponenten?",
      "detectionLogic": "Von dieser Regel verwendete Heuristik: (1) Das Asset muss im Geltungsbereich sein (outOfScope === false). (2) Das Asset muss kundenspezifisch entwickelte Teile enthalten (customDevelopedParts === true). (3) Die Wahrscheinlichkeit wird auf VeryLikely erhöht, wenn das Asset internet-facing ist (internet === true), ansonsten Likely. (4) Die Auswirkung leitet sich vom Asset ab",
      "riskAssessment": "Wahrscheinlichkeit: mindestens ",
      "falsePositives": "Projekte mit einem ausgereiften und durchgesetzten Secure SDLC (Nachweis: Anforderungsnachverfolgbarkeit, SAST/DAST/IAST/SCA-Gates, Code-Reviews, Pentest-Berichte) können in der Praxis trotz kundenspezifischer Entwicklung ein geringes Risiko darstellen. Behandeln Sie solche Fälle als akzeptabel mit dokumentierter Begründung."
    },
    "inadequate-cable-and-pipe-seals-inf2": {
      "title": "Unzureichende Kabel- und Rohrabdichtungen (Brandschotten) (BSI INF.2)",
      "description": "In jedem Gebäude, das IT beherbergt, müssen zahlreiche Kabel und Rohre für Strom, Daten, Wasser und Heizung durch brandgeschützte Wände und Böden geführt werden. ",
      "impact": "Das Versäumnis, Kabel- und Rohrdurchführungen ordnungsgemäß abzudichten, kann zu katastrophalen Brand- und Rauchschäden führen, was zu einem vollständigen Verlust der Verfügbarkeit für die betroffenen IT-Systeme führt. ",
      "asvs": "Dies ist eine physische und umweltbezogene Kontrolle, die nicht vom OWASP ASVS abgedeckt wird. Es entspricht direkt dem BSI IT-Grundschutz, Baustein INF.2: Gebäude.",
      "action": "Zertifizierte Brandschutzabdichtungen implementieren und regelmäßig überprüfen",
      "mitigation": "Stellen Sie sicher, dass alle Kabel- und Rohrdurchführungen durch brandgeschützte Barrieren mit zertifizierten Brandschutzsystemen (Brandschotten) abgedichtet sind. ",
      "check": "Sind alle Kabel- und Rohrdurchführungen durch brandgeschützte Wände und Böden mit geeigneten, zertifizierten Brandschutzabdichtungen versiegelt? ",
      "detectionLogic": "Dieses Risiko wird für jede on-premise Netzwerk-Vertrauensgrenze ausgelöst (",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die physischen Brandschutzabdichtungen tatsächlich vorhanden und ordnungsgemäß gewartet sind, das Modell aber nicht mit dem "
    },
    "power-outage-bsi-inf4": {
      "title": "Stromausfall / Verlust der Stromversorgung (BSI INF.4)",
      "description": "Bei einem Stromausfall können ganze Gebäude oder Teile davon unbenutzbar werden. Nicht nur offensichtliche, direkte Stromverbraucher wie IT-Systeme oder Beleuchtung sind von der Stromversorgung abhängig, sondern alle Infrastruktureinrichtungen sind direkt oder indirekt von Elektrizität abhängig. Dazu gehören Aufzüge, Klimaanlagen, Alarmanlagen, Sicherheitsschlösser, automatische Türen und sogar Wasserpumpen. Ein Stromausfall stellt eine grundlegende Bedrohung für die Verfügbarkeit aller am selben Ort befindlichen Systeme dar.",
      "impact": "Ein Stromausfall beeinträchtigt direkt die Verfügbarkeit aller abhängigen IT-Systeme und der physischen Infrastruktur. Dies kann zu einem vollständigen Stillstand des Geschäftsbetriebs, der Unmöglichkeit, physische Standorte zu betreten, und dem Ausfall von Sicherheits- und Schutzsystemen führen, was zu erheblichen betrieblichen und finanziellen Verlusten führt.",
      "asvs": "BSI IT-Grundschutz Baustein INF.4: Elektrische Energieversorgung",
      "action": "Redundante Stromversorgung und Notfallplanung sicherstellen",
      "mitigation": "Mindern Sie das Risiko von Stromausfällen durch die Implementierung von unterbrechungsfreien Stromversorgungen (USV) für kritische Systeme und Notstromgeneratoren für längere Ausfälle. Für Assets, die in Cloud-Umgebungen gehostet werden, ist der Anbieter",
      "check": "Sind kritische On-Premises-Assets und die Rechenzentren, die sie hosten, durch USV und/oder Notstromgeneratoren geschützt? Ist dieser Schutz dokumentiert und wird er regelmäßig getestet? Bietet der Cloud-Anbieter für in der Cloud gehostete Assets",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die auf physischen oder virtuellen Maschinen innerhalb von On-Premises- oder dedizierten Hosting-Provider-Vertrauensgrenzen laufen. Das Risiko wird als gemindert betrachtet, wenn das Asset, seine enthaltende Vertrauensgrenze (oder eine übergeordnete Grenze) oder seine gemeinsam genutzte Laufzeitumgebung mit `@redundant-power`, `@ups-protected` oder `@generator-@Backup:Target` getaggt ist. Das Risiko wird nicht auf serverlose oder containerisierte Assets innerhalb von Cloud-Provider-Grenzen angewendet, da Strom als Teil des verwalteten Dienstes angenommen wird.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Stromausfalls, der einen Ausfall verursacht, wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn Stromredundanzmaßnahmen (USV, Generatoren) vorhanden sind, aber nicht im Modell über die angegebenen Tags dokumentiert sind. Es könnte auch fälschlicherweise für Assets innerhalb eines Rechenzentrums ausgelöst werden, das eine zertifizierte Hochverfügbarkeit aufweist, die im Modell nicht erfasst ist."
    },
    "insecure-directory-service-deployment": {
      "title": "Unsichere Bereitstellung eines Verzeichnisdienstes aufgrund unzureichender Härtung",
      "description": "Die Sicherheit von Verzeichnisdiensten (wie LDAP) hängt stark von der Sicherheit des zugrunde liegenden Betriebssystems und seines Dateisystems ab. ",
      "impact": "Ein schlecht konfigurierter oder gehärteter Verzeichnisdienst kann kompromittiert werden, was zu unbefugtem Zugriff, Privilegienerhöhung im gesamten Netzwerk, ",
      "asvs": "Bezieht sich auf Konfigurations- und Härtungs-Best-Practices, ähnlich im Prinzip den CIS Benchmarks für Betriebssysteme und Verzeichnisdienste. Dies ist eher ein betriebliches und architektonisches Risiko als eine spezifische Anwendungsschwachstelle.",
      "action": "Betriebssystem- und Anwendungshärtung für Verzeichnisdienste anwenden",
      "mitigation": "Stellen Sie sicher, dass das Betriebssystem, das den Verzeichnisdienst hostet, gemäß etablierten Sicherheits-Baselines (z. B. CIS Benchmarks) gehärtet ist. ",
      "check": "Sind das Betriebssystem und die Verzeichnisdienstanwendung gemäß einer dokumentierten Baseline gehärtet? Sind die Dateisystemberechtigungen restriktiv? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset vom Technologietyp `LDAP-Server` oder `Identity-Store-LDAP` ausgelöst, das nicht explizit als gehärtet getaggt ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für Verzeichnisdienste in komplexen Umgebungen (d. h. mit vielen Kommunikationsverbindungen) als höher angesehen, da die Wahrscheinlichkeit eines Konfigurationsfehlers steigt. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das System in der Realität ordnungsgemäß gehärtet ist, dies aber nicht im Modell durch den Tag `@Hardened:OS-for-Directory-Service` widergespiegelt wird."
    },
    "improper-directory-service-partitioning-and-replication": {
      "title": "Unsachgemäße Partitionierung und Replikation von Verzeichnisdiensten (BSI APP.2.1.A8)",
      "description": "Die Partitionierung ermöglicht es, die Verzeichnisdaten eines Verzeichnisdienstes in einzelne Bereiche (Partitionen) aufzuteilen, ",
      "impact": "Schlecht geplante Partitionierung und Replikation können zu Datenverlust, Dateninkonsistenzen, schlechter Verfügbarkeit des Verzeichnisdienstes, ",
      "asvs": "BSI IT-Grundschutz APP.2.1 Allgemeiner Verzeichnisdienst, insbesondere Anforderung APP.2.1.A8 (Planung von Partitionierung und Replikation).",
      "action": "Einen strategischen Partitionierungs- und Replikationsplan entwickeln und einhalten.",
      "mitigation": "Ein robuster Plan für Partitionierung und Replikation muss vor der Bereitstellung erstellt werden. Dieser Plan sollte das Partitionierungsschema definieren, ",
      "check": "Gibt es eine dokumentierte Partitionierungs- und Replikationsstrategie für den Verzeichnisdienst? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als `LDAP Server` oder `Identity Store LDAP` identifiziert wurde, da diese Technologien ",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der inhärenten Komplexität der Verwaltung verteilter Datenspeicher als `Wahrscheinlich` angesehen. ",
      "falsePositives": "Dieses Risiko könnte für sehr einfache, einzelinstanzielle, nicht replizierte Verzeichnisdienste als Fehlalarm betrachtet werden. "
    },
    "incorrectly-administered-access-rights": {
      "title": "Falsch verwaltete Zugriffsrechte (Verletzung des Prinzips der geringsten Rechte)",
      "description": "Zugriffsrechte auf IT-Systeme, Anwendungen und gespeicherte Daten dürfen nur in dem für die zugewiesenen Aufgaben erforderlichen Umfang gewährt werden (Prinzip der geringsten Rechte). Dies gilt auch für Berechtigungen für Benutzer und Gruppen, die von einem Verzeichnisdienst verwaltet werden. Wenn diese Rechte falsch verwaltet werden, kann dies zu Sicherheitsschwachstellen führen, wenn übermäßige Berechtigungen erteilt werden. Falsche oder inkonsistente Zugriffsrechte, insbesondere wenn keine Autorisierung für einen Datenfluss erzwungen wird, können die Sicherheit des gesamten Systems erheblich gefährden.",
      "impact": "Die Nichteinhaltung des Prinzips der geringsten Rechte kann Angreifern oder böswilligen Insidern den unbefugten Zugriff auf Daten und Funktionen ermöglichen. Wenn administrative Rechte falsch zugewiesen werden, kann das gesamte administrative Konzept untergraben werden, was potenziell zu einer vollständigen Kompromittierung des Systems führen kann. Dies bedroht direkt die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und seiner Daten und kann weitere Angriffe ermöglichen.",
      "asvs": "BSI IT-Grundschutz CON.8: Berechtigungskonzept, OWASP ASVS V4.0.3-4.1: Anforderungen zur Überprüfung der Zugriffskontrolle",
      "action": "Überprüfen und Durchsetzen des Prinzips der geringsten Rechte",
      "mitigation": "Implementieren Sie ein feingranulares Autorisierungskonzept auf der Grundlage von Rollen und Verantwortlichkeiten (RBAC). Überprüfen und auditieren Sie regelmäßig alle Zugriffsrechte, insbesondere administrative Privilegien. Vermeiden Sie nach Möglichkeit gemeinsam genutzte technische Benutzer mit weitreichenden Berechtigungen; bevorzugen Sie die Weitergabe der Endbenutzeridentität zur Rechenschaftspflicht. Kommunikationsverbindungen zu sensiblen Assets müssen einen definierten und durchgesetzten Autorisierungsmechanismus haben (z. B. vermeiden Sie ",
      "check": "Gibt es ein dokumentiertes Autorisierungskonzept? Basieren die Zugriffsrechte auf dem Prinzip der geringsten Rechte? Werden Berechtigungen, insbesondere für Administratoren, regelmäßig überprüft? Erzwingen Kommunikationsverbindungen zu Datenspeichern und sensiblen Komponenten eine Autorisierung?",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn eine Kommunikationsverbindung keine Autorisierung erzwingt (d. h. `authorization: none`), wenn auf ein technisches Asset zugegriffen wird. Das Risiko wird erhöht, wenn das Ziel-Asset ein Datenspeicher oder eine andere sensible Komponente (wie ein Identitätsanbieter) ist und Daten mit hohen Vertraulichkeits- oder Integritätsanforderungen verarbeitet.",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Bewertung des Ziel-Assets bestimmt. Ein Mangel an Autorisierung für einen Datenspeicher mit ",
      "falsePositives": "Ein Befund könnte ein Fehlalarm sein, wenn der Zielendpunkt absichtlich öffentlich und nur lesbar ist und keine sensiblen Informationen enthält. Darüber hinaus könnten einige Anwendungen die Autorisierung intern auf eine Weise durchsetzen, die nicht im Modell widergespiegelt ist"
    },
    "bsi-app-2-1-insecure-directory-service-access": {
      "title": "Unsicherer Zugriff auf den Verzeichnisdienst (basierend auf BSI APP.2.1)",
      "description": "In vielen Fällen müssen andere Anwendungen wie Internet- oder Intranetanwendungen auf den Verzeichnisdienst zugreifen. ",
      "impact": "Wenn ein Angreifer diese Fehlkonfigurationen ausnutzen kann, könnte er unbefugten Zugriff erlangen, Privilegien erhöhen oder Anmeldeinformationen durch Abhören des Netzwerks abfangen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein APP.2.1 (Allgemeiner Verzeichnisdienst). Relevante OWASP ASVS v4.0.3 Anforderungen umfassen V2.3.1 (sicherer Transport), V4.1.1 (geringste Rechte) und V4.2.1 (zentralisierte Zugriffskontrolle).",
      "action": "Konfiguration und Kommunikation des Verzeichnisdienstes sichern",
      "mitigation": "Stellen Sie sicher, dass jede Kommunikation mit dem Verzeichnisdienst ein verschlüsseltes Protokoll verwendet (z. B. LDAPS oder LDAP mit STARTTLS). ",
      "check": "Sind alle Kommunikationsverbindungen zum Verzeichnisdienst verschlüsselt? Ist eine Authentifizierung für jeden Zugriff erforderlich (d. h. kein ",
      "detectionLogic": "Diese Regel prüft alle Assets, die als Verzeichnisdienst fungieren (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch bei unauthentifiziertem Zugriff und bei unverschlüsselter Kommunikation über Vertrauensgrenzen hinweg. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die unverschlüsselte/unauthentifizierte Kommunikation streng innerhalb eines physisch oder logisch isolierten und vertrauenswürdigen Netzwerksegments stattfindet, in dem Abhören als undurchführbar angesehen wird (z. B. über den localhost-Loopback). Sich jedoch allein auf Netzwerkkontrollen zu verlassen, ist keine robuste Verteidigung."
    },
    "technical-failure-of-directory-service-g0.18": {
      "title": "Technischer Ausfall des Verzeichnisdienstes (BSI G 0.18)",
      "description": "Technischer Ausfall aufgrund von Hardware- oder Softwareproblemen kann dazu führen, dass Verzeichnisdienste oder Teile davon ausfallen. ",
      "impact": "Der Ausfall eines Verzeichnisdienstes kann Geschäftsprozesse und interne Arbeitsabläufe stören, die für Authentifizierung und Autorisierung darauf angewiesen sind. ",
      "asvs": "Abgeleitet von der BSI IT-Grundschutz Gefährdung G 0.18 (Technischer Ausfall von IT-Komponenten) angewendet auf den Baustein APP.2.1 (Verzeichnisdienste).",
      "action": "Redundanz sicherstellen und eine @Backup:Target/Restore-Strategie implementieren",
      "mitigation": "Implementieren Sie den Verzeichnisdienst in einer redundanten, hochverfügbaren Konfiguration (z. B. geclustert, mit Multi-Master-Replikation). ",
      "check": "Ist das technische Asset, das den Verzeichnisdienst darstellt, im Modell als redundant konfiguriert (d. h. `redundant: true`)? ",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset ausgelöst, das als Verzeichnisdienst identifiziert wird (z. B. Technologie ist `ldap-server`, `identity-store-ldap`, `identity-store-database` oder `identity-provider`) ",
      "riskAssessment": "Die Wahrscheinlichkeit eines technischen Ausfalls in einem nicht-redundanten System über seine Betriebsdauer wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Redundanz durch Mechanismen erreicht wird, die nicht im Modell erfasst sind (z. B. zugrunde liegende Hypervisor- oder Speicherebenen-Redundanz) und das Asset selbst nicht als `redundant` gekennzeichnet ist. In solchen Fällen ist eine manuelle Überprüfung der Architektur erforderlich."
    },
    "anonymous-access-to-directory-service": {
      "title": "Anonymer Zugriff auf den Verzeichnisdienst (BSI-Stil)",
      "description": "Wenn anonymen Benutzern der Zugriff auf einen Verzeichnisdienst gestattet wird, ist dessen Sicherheit erheblich gefährdet. ",
      "impact": "Das Zulassen von anonymem Zugriff erleichtert die Aufklärung, was sensible Informationen über die Infrastruktur und Benutzerkonten offenlegen kann. Es erleichtert auch Denial-of-Service (DoS)-Angriffe, da Angreifer mehr unkontrollierte Zugangspunkte haben. Eine vollständige Kompromittierung könnte das gesamte System, das auf dem Verzeichnisdienst basiert, beeinträchtigen oder zerstören.",
      "asvs": "V2.1.4: Überprüfen Sie, ob anonymes Binden/Zugreifen auf dem Verzeichnisserver deaktiviert ist, es sei denn, dies ist speziell für eine öffentlich zugängliche Ressource erforderlich.",
      "action": "Anonymen Zugriff auf Verzeichnisdienste deaktivieren",
      "mitigation": "Konfigurieren Sie alle Verzeichnisdienste (z. B. LDAP, Active Directory) so, dass anonyme Bindungen und Abfragen standardmäßig abgelehnt werden. Jeder Zugriff sollte eine starke Authentifizierung und Autorisierung erfordern. Ausnahmen für anonymen Zugriff müssen dokumentiert, risikobewertet und auf das absolut notwendige Minimum an Daten beschränkt werden.",
      "check": "Überprüfen Sie die Konfiguration aller Verzeichnisdienste. Ist anonymes Binden deaktiviert? Gibt es eine dokumentierte geschäftliche Begründung und Risikoakzeptanz für Ausnahmen?",
      "detectionLogic": "Diese Regel sucht nach technischen Assets, die als Verzeichnisdienste identifiziert wurden (z. B. Technologie ist LDAP Server, Identity Store) und eingehende Kommunikationsverbindungen mit der Authentifizierung ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn ein anonymer Zugriffspfad entdeckt wird, insbesondere aus einem nicht vertrauenswürdigen Netzwerk wie dem Internet. Die Auswirkung wird durch die Sensibilität der Daten im Verzeichnisdienst und die Kritikalität der Systeme bestimmt, die für Authentifizierung und Autorisierung darauf angewiesen sind. Ein kompromittierter Verzeichnisdienst führt oft zu einem weitreichenden, hochgradig folgenreichen Verstoß.",
      "falsePositives": "Kann auftreten, wenn das Modell fälschlicherweise eine interne, hoch vertrauenswürdige administrative Verbindung als "
    },
    "misconfigured-directory-service-cleartext-auth": {
      "title": "Fehlkonfigurierter Verzeichnisdienst (Klartext-Authentifizierung)",
      "description": "Verzeichnisdienste bieten umfangreiche Funktionalität, was zu Fehlkonfigurationen führen kann, wenn sie nicht sorgfältig verwaltet werden. Eine häufige und kritische Fehlkonfiguration ist die Zulassung unverschlüsselter Kommunikation. Wenn die Standardeinstellungen nicht überprüft und gehärtet werden, können Authentifizierungsinformationen im Klartext oder mit unzureichendem Schutz übertragen werden, sodass sie von einem Angreifer im Netzwerk abgefangen werden können.",
      "impact": "Ein Angreifer kann das Netzwerk abhören, um im Klartext gesendete Anmeldeinformationen (Benutzernamen und Passwörter) zu erfassen. Dies führt zu unbefugtem Zugriff auf den Verzeichnisdienst und potenziell auf alle Systeme und Anwendungen, die für die Authentifizierung darauf angewiesen sind, was zu einer weitreichenden Kompromittierung führt.",
      "asvs": "BSI IT-Grundschutz APP.4.4 Verzeichnisdienste, Anforderung APP.4.4.A8 Sichere Kommunikation mit dem Verzeichnisdienst.",
      "action": "Verschlüsselte Kommunikation für Verzeichnisdienste erzwingen",
      "mitigation": "Jede Kommunikation mit dem Verzeichnisdienst MUSS mit Protokollen wie LDAPS oder STARTTLS verschlüsselt werden. Deaktivieren Sie den unverschlüsselten LDAP-Zugriff (Port 389) vollständig und erlauben Sie nur Verbindungen über den verschlüsselten Port (636). Stellen Sie sicher, dass Clients so konfiguriert sind, dass sie den Server überprüfen",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen, die mit einem ",
      "detectionLogic": "Diese Regel identifiziert jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Kann nur dann als Fehlalarm betrachtet werden, wenn der unverschlüsselte LDAP-Verkehr streng auf ein physisch oder kryptografisch isoliertes Netzwerksegment beschränkt ist (z. B. ein dediziertes VLAN auf einem vertrauenswürdigen Switch oder innerhalb eines Service Mesh mit mTLS), in dem Abhören unmöglich ist. Dies ist eine seltene und risikoreiche Ausnahme."
    },
    "inadequate-physical-protection-for-on-prem-datacenter": {
      "title": "Unzureichender Schutz eines On-Premises-Rechenzentrums vor Umweltbedrohungen (BSI INF.2)",
      "description": "Wenn ein Rechenzentrum oder ein On-Premises-Serverstandort ohne ausreichende Berücksichtigung und Minderung grundlegender physischer und umweltbedingter Bedrohungen konzipiert wird, besteht ein sehr hohes Risiko von Dienstunterbrechungen. ",
      "impact": "Das Versäumnis, sich vor umweltbedingten und physischen Bedrohungen zu schützen, kann zu langanhaltenden Ausfallzeiten aller Systeme am betroffenen Standort führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium, Baustein INF.2: Rechenzentrum sowie Serverraum",
      "action": "Standort-Risikobewertung durchführen und physische & umweltbezogene Kontrollen implementieren",
      "mitigation": "Führen Sie eine gründliche Risikobewertung für den gewählten physischen Standort durch und berücksichtigen Sie alle plausiblen Umweltbedrohungen (z. B. Überschwemmung, Feuer, seismische Aktivität, extreme Wetterbedingungen). ",
      "check": "Wurde eine formelle Standort-Risikobewertung durchgeführt und dokumentiert? Gibt es Schutzmaßnahmen gegen Stromausfall, Feuer und Wasserschäden? ",
      "detectionLogic": "Wird für jede Vertrauensgrenze vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Verfügbarkeitsanforderung jedes technischen Assets bestimmt, das sich innerhalb der On-Premises-Vertrauensgrenze befindet. ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn ein umfassender, dokumentierter und getesteter Business-Continuity- und Disaster-Recovery-Plan, einschließlich aller relevanten physischen und umweltbezogenen Schutzmaßnahmen, für den spezifischen Standort vorhanden ist. Dieses Risiko dient als Erinnerung, diese externen Kontrollen zu überprüfen, die im Bedrohungsmodell selbst nicht dargestellt werden können."
    },
    "inadequate-physical-access-controls": {
      "title": "Unzureichende physische Zugangskontrollen (BSI INF.2.A6)",
      "description": "Wenn physische Zugangskontrollen zu sensiblen Bereichen wie Rechenzentren fehlen oder unzureichend sind, steigt das Risiko eines unbefugten Zugriffs erheblich. ",
      "impact": "Unzureichende physische Zugangskontrollen bedrohen direkt die Vertraulichkeit (z. B. Datendiebstahl), Integrität (z. B. Servermanipulation) und ",
      "asvs": "BSI IT-Grundschutz INF.2 Rechenzentrum, Anforderung INF.2.A6 Zugangskontrolle",
      "action": "Strenge physische Zugangskontrollen implementieren und durchsetzen",
      "mitigation": "Implementieren Sie ein mehrschichtiges physisches Zugangskontrollsystem für alle sensiblen Bereiche (z. B. Rechenzentren, Serverräume). ",
      "check": "Gibt es eine dokumentierte physische Zugangskontrollrichtlinie? Sind alle Eintrittspunkte zu sensiblen Bereichen gesichert? Ist der Zugang auf autorisiertes Personal beschränkt und wird er protokolliert? Gibt es Verfahren für Besucher, Reinigungskräfte und Wartungspersonal?",
      "detectionLogic": "Dieses Risiko wird für jede Vertrauensgrenze ausgelöst, die eine physische On-Premise- oder dedizierte Hosting-Umgebung darstellt ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein physischer Standort, der IT-Assets beherbergt, nicht explizit gesichert ist. Die Auswirkung wird durch die höchste ",
      "falsePositives": "Das Modell spiegelt möglicherweise nicht alle vorhandenen physischen Sicherheitsmaßnahmen vollständig wider. Ein Bereich könnte in der Realität physisch sicher sein, "
    },
    "insufficient-monitoring-of-infrastructure": {
      "title": "Unzureichende Überwachung von IT und Infrastruktur (in Anlehnung an BSI OPS.1.1)",
      "description": "Wenn IT- und Infrastrukturkomponenten unzureichend überwacht und verwaltet werden, können Komponenten ausfallen, ohne dass dies bemerkt wird. ",
      "impact": "Die Nichterkennung von Komponentenausfällen oder Leistungseinbußen wirkt sich direkt auf die Verfügbarkeit der betroffenen Systeme und der abhängigen Geschäftsprozesse aus. ",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.1: Allgemeiner IT-Betrieb, Anforderung OPS.1.1.A7 (Überwachung von IT-Komponenten und -Diensten)",
      "action": "Umfassende Überwachung und Alarmierung implementieren",
      "mitigation": "Implementieren Sie ein robustes Überwachungssystem für alle kritischen IT-Komponenten und Infrastrukturen (z. B. Server, Netzwerkgeräte, Datenbanken, Anwendungen). ",
      "check": "Gibt es eine Überwachungslösung für alle nicht-clientseitigen, im Geltungsbereich befindlichen Assets? Werden wichtige Leistungs- und Gesundheitsindikatoren für diese Assets verfolgt? Sind Alarmschwellen definiert und gibt es einen dokumentierten Incident-Response-Prozess für die Bearbeitung von Alarmen?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche, nicht-clientseitige technische Asset identifiziert, das nicht selbst ein Überwachungssystem ist und keine Kommunikationsverbindung zu einem technischen Asset mit Technologie ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeitsbewertung des nicht überwachten Assets ab. Ein ",
      "falsePositives": "Diese Regel kann einen Fehlalarm erzeugen, wenn die Überwachung über ein Out-of-Band-Management-Netzwerk, ein agentenbasiertes System oder einen Cloud-nativen Plattformdienst (wie AWS CloudWatch, Azure Monitor) erfolgt, der nicht explizit als "
    },
    "inadequate-operating-environment-inf2.a5": {
      "title": "Unzureichende Betriebsumgebung (BSI INF.2.A5)",
      "description": "IT-Komponenten benötigen spezifische Betriebsbedingungen, um zuverlässig zu funktionieren. Sie wandeln auch die von ihnen verbrauchte elektrische Energie in zusätzliche Wärme um. Wenn die Temperatur, die Luftfeuchtigkeit oder der Partikelgehalt in einem IT-Betriebsbereich nicht innerhalb der vom Gerätehersteller angegebenen Grenzen gehalten werden, kann dies zu Fehlfunktionen oder zum vollständigen Ausfall technischer Komponenten führen.",
      "impact": "Das Versäumnis, eine geeignete physische Betriebsumgebung aufrechtzuerhalten, kann zur Verschlechterung oder zum vollständigen Ausfall von Hardwarekomponenten führen. Dies beeinträchtigt direkt die Verfügbarkeit der Systeme und der von ihnen bereitgestellten Dienste, was zu Störungen von Geschäftsprozessen, Datenverlust oder -beschädigung (Integrität) und erheblichen Ausfallzeiten führen kann.",
      "asvs": "BSI IT-Grundschutz INF.2 Serverraum, Anforderung INF.2.A5 Ausreichende Klimatisierung",
      "action": "Ordnungsgemäße Umgebungskontrollen für physische IT-Assets sicherstellen",
      "mitigation": "Die Betriebsumgebung für physische IT-Assets, wie Serverräume oder Rechenzentren, muss mit geeigneten Klimaanlagen (HVAC) ausgestattet sein, um Temperatur und Luftfeuchtigkeit zu regulieren. Implementieren Sie Luftfiltration, um Staub und andere Partikel zu reduzieren. Die Umgebungsbedingungen sollten kontinuierlich überwacht werden, mit automatisierten Alarmen, die das Betriebspersonal benachrichtigen, wenn die Werte vordefinierte Schwellenwerte überschreiten. Eine regelmäßige Wartung der Klimaanlagen und Überwachungssysteme ist unerlässlich.",
      "check": "Sind physische IT-Komponenten in einer Umgebung mit Klimatisierung untergebracht? Werden Temperatur und Luftfeuchtigkeit überwacht? Gibt es Alarmmechanismen für Umweltanomalien? Entsprechen die Umgebungsbedingungen den Herstellerspezifikationen für die eingesetzte Hardware?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das als physische Maschine modelliert ist. Die Wahrscheinlichkeit und Auswirkung sind bei Assets mit hohen Verfügbarkeitsanforderungen oder solchen in on-premise Vertrauensgrenzen erhöht, wo die Umgebungskontrollen möglicherweise weniger robust sind als in einer dedizierten Hosting-Einrichtung.",
      "riskAssessment": "Die Auswirkung leitet sich direkt von der Verfügbarkeitsanforderung des physischen Assets ab. Ein ausfallendes unternehmenskritisches System hat eine viel höhere Auswirkung als ein Archivsystem. Die Wahrscheinlichkeit wird bei unternehmenskritischen Systemen und solchen in on-premise Rechenzentren als höher angesehen, da jede Umweltschwankung eher einen spürbaren und kritischen Vorfall verursacht.",
      "falsePositives": "Das Modell kann die tatsächliche Qualität der physischen Umgebung (z. B. HVAC-Systeme, Überwachung) nicht überprüfen. Dieses Risiko sollte als standardmäßige Sorgfaltsprüfung für die gesamte physische Infrastruktur betrachtet werden, um sicherzustellen, dass die betriebliche Umgebungssicherheit nicht übersehen wird."
    },
    "fire-risk-g0.1": {
      "title": "Brand (BSI G 0.1)",
      "description": "Feuer ist eine seltene, aber hochgradig folgenreiche Bedrohung. Feuer und Rauch können schwere Schäden an IT-Systemen, unterstützender Infrastruktur und Gebäuden verursachen. ",
      "impact": "Ein Brand kann zur Zerstörung oder schweren Beschädigung von IT-Hardware, unterstützender Infrastruktur und der Einrichtung selbst führen. Dies führt zu einem erheblichen Verlust der Verfügbarkeit für alle Systeme und Daten, die am betroffenen Standort gehostet werden. ",
      "asvs": "BSI IT-Grundschutz INF.2.A5 Brandschutz",
      "action": "Umfassende Brandschutzmaßnahmen implementieren",
      "mitigation": "Installieren Sie zertifizierte Brand- und Rauchmeldesysteme, die mit einer Alarmzentrale verbunden sind. Verwenden Sie automatische Feuerlöschanlagen, die für IT-Umgebungen geeignet sind (z. B. Inertgas). ",
      "check": "Sind Brandmelde- und -löschanlagen installiert, werden sie regelmäßig getestet und sind sie zertifiziert? Ist das Gebäude in Brandabschnitte unterteilt? Sind die Mitarbeiter in Notfallverfahren geschult? Wird brennbares Material von kritischen IT-Bereichen ferngehalten?",
      "detectionLogic": "Dieses Risiko gilt für alle technischen Assets, die sich in physischen, on-premise Umgebungen befinden, insbesondere in Rechenzentren. Das Risiko wird für Assets innerhalb von Vertrauensgrenzen vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist im Allgemeinen ",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn ein "
    },
    "water-damage-inf-1-a5": {
      "title": "Wasserschaden im Rechenzentrum (BSI INF.1.A5)",
      "description": "Wasser kann auf verschiedene Weise in ein Rechenzentrum eindringen, z. B. durch undichte Wasserleitungen, Überschwemmungen, Rohrbruch oder defekte Sprinkler- oder Klimaanlagen. Dieser Wassereintritt kann Serverhardware, Speichersysteme und Netzwerkgeräte physisch beschädigen und zu Fehlfunktionen oder zum Totalausfall führen. Er kann auch Kurzschlüsse auslösen, die zu Stromausfällen für einzelne Racks oder ganze Bereiche des Rechenzentrums führen und im schlimmsten Fall einen Brand entfachen können.",
      "impact": "Die primäre Auswirkung von Wasserschäden ist ein schwerwiegender Verlust der Verfügbarkeit für alle betroffenen Systeme und die von ihnen verarbeiteten oder gespeicherten Daten. Es kann auch zu einem Integritätsverlust führen, wenn Speichermedien physisch beschädigt werden. Dies kann den Geschäftsbetrieb zum Erliegen bringen, zu erheblichen finanziellen Verlusten durch Reparaturen und Ausfallzeiten führen und potenziell zu dauerhaftem Datenverlust.",
      "asvs": "BSI IT-Grundschutz Baustein INF.1: Allgemeines Gebäude, Anforderung INF.1.A5 Schutz vor Wasser und Feuchtigkeit.",
      "action": "Physische Schutzmaßnahmen gegen Wasserschäden implementieren",
      "mitigation": "Platzieren Sie Rechenzentren und Serverräume über dem Erdgeschoss und fern von Bereichen mit hohem Überschwemmungsrisiko oder Wasserquellen. Installieren Sie Wassermelder in kritischen Bereichen, insbesondere in Kellern und unter Doppelböden. Stellen Sie sicher, dass eine ordnungsgemäße Entwässerung vorhanden ist. Überprüfen und warten Sie regelmäßig alle Sanitär-, Sprinkler- und Klimaanlagen. Etablieren Sie Notfallverfahren zum Abschalten der Stromversorgung in betroffenen Bereichen, um Kurzschlüsse und Brände zu verhindern. Stellen Sie sicher, dass kritische Geräte nach Möglichkeit in wasserdichten Racks untergebracht sind.",
      "check": "Wird der Standort des Rechenzentrums auf wasserbezogene Risiken geprüft? Sind Wassermelder installiert und werden sie überwacht? Gibt es regelmäßige Wartungspläne für Sanitär- und HVAC-Systeme? Sind Notfall-Stromabschaltverfahren dokumentiert und getestet?",
      "detectionLogic": "Dieses Risiko gilt für alle physischen und virtuellen Assets, die sich in einem on-premises oder einem dedizierten Hosting-Provider-Rechenzentrum befinden. Das Bedrohungsmodell identifiziert diese als technische Assets mit einem Maschinentyp von ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsanforderungen der betroffenen Assets bestimmt. Ein Ausfall eines ",
      "falsePositives": "Das Risiko kann für ein Rechenzentrum gemeldet werden, das über umfangreiche physische Wasserschutzmaßnahmen verfügt (z. B. fortschrittliche Wassererkennungs- und -umleitungssysteme), die im Bedrohungsmodell nicht sichtbar sind. Die Existenz solcher Kontrollen sollte mit den Infrastruktur- und Betriebsteams überprüft werden."
    },
    "insufficient-break-in-protection-inf2-a5": {
      "title": "Unzureichender Einbruchschutz im Rechenzentrum (BSI INF.2.A5)",
      "description": "Auch mit etablierten Zugangskontrollmaßnahmen kann ein Rechenzentrum immer noch anfällig für physisches Eindringen (Einbruch) sein, wenn es nicht ausreichend gehärtet ist. ",
      "impact": "Angreifer mit physischem Zugriff können IT-Komponenten stehlen oder manipulieren, was zu Datendiebstahl (Verlust der Vertraulichkeit), Daten-/Systemmanipulation (Verlust der Integrität), ",
      "asvs": "BSI IT-Grundschutz Baustein INF.2: Rechenzentrum baulich-technische Sicherung, Anforderung INF.2.A5: Schutz vor Einbruch und Diebstahl.",
      "action": "Physische Sicherheitsmaßnahmen verbessern",
      "mitigation": "Implementieren Sie robuste physische Sicherheitskontrollen für den Perimeter des Rechenzentrums. Dazu gehören verstärkte Türen und Fenster, Einbruchmelde- und Alarmanlagen, ",
      "check": "Gibt es zertifizierte physische Sicherheitsmaßnahmen (z. B. Widerstandsklassen für Türen/Fenster)? Gibt es ein überwachtes Einbruchmeldesystem? ",
      "detectionLogic": "Wird ausgelöst, wenn eine Vertrauensgrenze ein physisches Rechenzentrum darstellt (Typ ",
      "riskAssessment": "Die Standardwahrscheinlichkeit ist ",
      "falsePositives": "Wird als Fehlalarm betrachtet, wenn das Rechenzentrum über außergewöhnlich starke, zertifizierte physische Sicherheit verfügt (z. B. Hochsicherheitstresor), die im Modell eindeutig dokumentiert ist. "
    },
    "power-outage-datacenter-inf2-g0.1": {
      "title": "Stromausfall im Rechenzentrum (BSI INF.2 G 0.1)",
      "description": "Wenn der Strom ausfällt, kann der Betrieb eines Rechenzentrums – und damit der Institution – erheblich gestört werden. ",
      "impact": "Ein Stromausfall beeinträchtigt direkt die Verfügbarkeit aller im betroffenen Rechenzentrum gehosteten IT-Systeme und Dienste. ",
      "asvs": "N/A (ASVS konzentriert sich auf anwendungsbezogene Kontrollen, während dies eine umwelt-/infrastrukturbezogene Bedrohung ist). BSI IT-Grundschutz INF.2 ist der relevante Standard.",
      "action": "Redundante Stromversorgung und Notstromsysteme implementieren",
      "mitigation": "Installieren Sie eine unterbrechungsfreie Stromversorgung (USV), um kurzfristige Ausfälle zu überbrücken und ein ordnungsgemäßes Herunterfahren der Systeme zu ermöglichen. ",
      "check": "Gibt es ein dokumentiertes und getestetes Notstromkonzept? Umfasst es sowohl eine USV als auch einen Generator? Sind Wartungs- und Testprotokolle für diese Systeme verfügbar? ",
      "detectionLogic": "Dieses Risiko gilt für alle technischen Assets, die sich innerhalb einer Vertrauensgrenze befinden, die explizit als Rechenzentrum identifiziert ist (z. B. über ein ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Stromausfalls hängt von der Zuverlässigkeit des lokalen Stromnetzes ab und wird als ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm betrachtet werden, wenn das Modell vorhandene Stromredundanzmaßnahmen (z. B. USV und Generatoren sind vorhanden, aber nicht über Tags oder andere Attribute modelliert) nicht genau darstellt. "
    },
    "contamination-in-datacenter": {
      "title": "Verunreinigung im Rechenzentrum (Staub, Schmutz)",
      "description": "Das BSI stellt fest, dass Staub und andere Verunreinigungen in einem Rechenzentrum zum Ausfall technischer Komponenten (z. B. Lüfter) führen können. ",
      "impact": "Der Ausfall physischer Hardwarekomponenten aufgrund von Verunreinigungen kann zu Dienstausfällen, einer Verschlechterung der Systemleistung und im schlimmsten Fall ohne ausreichende Redundanz zu Datenverlust führen. ",
      "asvs": "ASVS V14.1.1 (Physische Sicherheit): Überprüfen Sie, dass die Anwendung",
      "action": "Umweltkontrollen und Reinigungspläne implementieren und aufrechterhalten",
      "mitigation": "Stellen Sie sicher, dass die Umgebung des Rechenzentrums gegen Staub und andere Verunreinigungen kontrolliert wird. Dies umfasst die Implementierung professioneller Luftfiltersysteme (z. B. HEPA-Filter), ",
      "check": "Gibt es eine dokumentierte Richtlinie und ein Verfahren für die Sauberkeit im Rechenzentrum? Ist ein regelmäßiger, professioneller Reinigungs- und Wartungsplan vorhanden und wird er befolgt? ",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Ausfallwahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm gemeldet werden, wenn die als "
    },
    "inadequate-physical-security-for-infrastructure-room": {
      "title": "Unzureichende physische Sicherheit für Infrastrukturraum oder -schrank (BSI INF.5)",
      "description": "Wenn ein Raum oder Schrank für die technische Infrastruktur schlecht geplant ist, können mehrere Probleme auftreten. Wasser kann eindringen oder IT-Komponenten können durch Sonneneinstrahlung überhitzen, wenn der Standort ungeeignet ist. ",
      "impact": "Unzureichender physischer Schutz kann die Verfügbarkeit (z. B. durch Stromausfall, Überhitzung, Wasserschäden), die Integrität (z. B. durch physische Schäden oder Manipulation) ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.5: Raum und Schrank für technische Infrastruktur.",
      "action": "Angemessenen physischen und umweltbezogenen Schutz für Infrastrukturräume und -schränke sicherstellen",
      "mitigation": "Stellen Sie sicher, dass physische Standorte, die IT-Infrastruktur beherbergen (im Modell als on-premise Vertrauensgrenzen dargestellt), angemessen gegen umweltbedingte und physische Bedrohungen geschützt sind. ",
      "check": "Ist die Vertrauensgrenze, die einen physischen Raum oder Schrank für technische Infrastruktur darstellt, mit `@PhysicalProtection:Reviewed-Adequate` getaggt? ",
      "detectionLogic": "Dieses Risiko wird für jede `TrustBoundary` vom Typ `network-on-prem` oder `network-dedicated-hoster` ausgelöst, die das Tag `@PhysicalProtection:Reviewed-Adequate` nicht hat. ",
      "riskAssessment": "Die Wahrscheinlichkeit physischer Bedrohungen (wie unbefugter Zugriff, Umweltschäden) wird als ",
      "falsePositives": "Die Grenze stellt möglicherweise keinen physischen Infrastrukturraum oder -schrank dar, oder die physische Sicherheit ist angemessen, aber noch nicht im Modell mit dem angegebenen Tag dokumentiert."
    },
    "lack-of-physical-access-control-bsi-inf5": {
      "title": "Fehlende physische Zugangskontrolle (BSI INF.5.A3)",
      "description": "Wenn es keine Zugangskontrolle oder keinen Einbruchschutz für Räume mit technischer Infrastruktur gibt, oder wenn diese Maßnahmen zu schwach sind, können sich unbefugte Personen physischen Zugang verschaffen. ",
      "impact": "Ein erfolgreicher physischer Einbruch kann direkt die Vertraulichkeit (durch Diebstahl von datentragenden Geräten), die Integrität (durch Manipulation oder Austausch von Hardware) und ",
      "asvs": "BSI IT-Grundschutz INF.5.A3 (Zutrittsregelung und -kontrolle)",
      "action": "Physische Zugangskontrolle und Einbruchschutz implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle technischen Assets vom Maschinentyp ",
      "check": "Befinden sich alle physischen Assets in sicheren, zugangskontrollierten Umgebungen? Ist der Zugang beschränkt und wird er protokolliert? ",
      "detectionLogic": "Diese Regel wird für jedes im Geltungsbereich befindliche technische Asset mit `machine: physical` ausgelöst, das nicht mit `@PhysicalProtection` getaggt ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn für ein physisches Asset kein physischer Schutz modelliert ist. Die Auswirkung leitet sich von den CIA-Anforderungen des physischen Assets selbst und der von ihm verarbeiteten oder gespeicherten Daten ab. ",
      "falsePositives": "Das Modell ist möglicherweise nicht über alle implementierten physischen Sicherheitskontrollen informiert (z. B. bei einem Cloud-Anbieter"
    }
  }
}
