{
  "meta": {
    "part": 6,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 6 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "net31-admin-tools-spof": {
      "title": "Single Point of Failure bei Administrationswerkzeugen (BSI NET.3.1)",
      "description": "Wenn administrative Werkzeuge oder Fähigkeiten ausfallen und keine redundanten Systeme oder alternativen ",
      "impact": "Ein Mangel an redundanten oder alternativen Administrationspfaden kann zu längeren Ausfällen führen, die Reaktion auf Vorfälle behindern und ",
      "asvs": "BSI NET.3.1: A13, A22, A26 (Managementnetz, Notfallvorsorge, Hochverfügbarkeit)",
      "action": "Redundanz und alternative Administrationspfade implementieren (z. B. Out-of-Band-Management, Notfallkonsolenzugriff); Failover dokumentieren und testen.",
      "mitigation": "Sicherstellen, dass kritische Administrationswerkzeuge auf Hochverfügbarkeit ausgelegt sind, indem sie als ",
      "check": "Das Modell überprüfen, um kritische Assets zu identifizieren. Für jedes Asset verifizieren, dass es von mindestens einem als redundant gekennzeichneten Administrationswerkzeug verwaltet wird. ",
      "detectionLogic": "Die Regel behandelt ein ",
      "riskAssessment": "Die Auswirkung skaliert mit der Verfügbarkeitsanforderung des verwalteten Assets. ",
      "falsePositives": "Das Modell erfasst möglicherweise keine Out-of-Band- oder Notfall-Administrationsverfahren, die als Alternativen dienen. "
    },
    "net-3-1-unprotected-management-channels": {
      "title": "Ungeschützter Management-Kanal für Router/Switch",
      "description": "Management- und Überwachungskanäle für Router, Switches und andere Netzwerk-/Verwaltungskomponenten (z. B. SSH/HTTPS/SNMP), denen eine starke Authentifizierung und Transportverschlüsselung fehlt, können gespooft oder manipuliert werden. Angreifer können gefälschte Warnungen/Befehle einschleusen oder Administratoren dazu verleiten, Änderungen auszuführen, was zu unbefugter Konfiguration, Verkehrsumleitung oder Ausfällen führt.",
      "impact": "Die Kompromittierung der Geräteverwaltung kann die Manipulation von Konfigurationen (Tampering), das Umleiten/Blackholing oder Abfangen von Datenverkehr (Information Disclosure) und Dienstunterbrechungen bis hin zum Ausfall des Backbones (Denial of Service) ermöglichen. Im Endeffekt missbraucht ein Angreifer administrative Privilegien, um die Vertraulichkeit, Integrität und Verfügbarkeit über verbundene Systeme und Netzwerksegmente hinweg zu beeinträchtigen.",
      "asvs": "BSI IT-Grundschutz NET.3.1 (A4 Schutz der Administrationsschnittstellen, A13 Managementnetz, A18 ACLs, A19 Switch-Ports, A21 IAM) und DER.1.A7 (Protokollierung von sicherheitsrelevanten Ereignissen).",
      "action": "Management von Netzwerkgeräten härten: Out-of-Band-Management bevorzugen, Quell-IPs einschränken, mTLS/SSHv2 mit starken Schlüsseln verlangen, Telnet/HTTP/SNMPv1 deaktivieren, ACLs/Timeouts aktivieren und Protokollierung/Alarmierung zentralisieren.",
      "mitigation": "Gegenseitig authentifizierte und verschlüsselte Managementprotokolle (z. B. SSHv2, HTTPS mit Client-Zertifikaten) verwenden. Managementzugriff auf dedizierte Netzwerke und auf der Allowlist stehende Quellen beschränken. Veraltete/ungenutzte Dienste und In-Band-Management nach Möglichkeit deaktivieren. MFA für privilegierte Konsolen erzwingen, administrative Aktionen protokollieren und für Änderungen mit hoher Auswirkung eine Vier-Augen-Genehmigung verlangen.",
      "check": "Alle eingehenden Verbindungen zu Netzwerk-/Verwaltungs-Assets (Router, Switches, Monitoring, Build/CI, Container/IDP, Registries) überprüfen. Sind die Verbindungen verschlüsselt (TLS oder VPN)? Ist die Authentifizierung stark (keine anonymen/einfachen Anmeldeinformationen)? Überschreiten Verbindungen Vertrauensgrenzen oder stammen sie aus dem Internet zugänglichen Quellen? ACLs überprüfen, die den Managementzugriff einschränken.",
      "detectionLogic": "Ein Asset wird als Netzwerk-/Verwaltungsziel behandelt, wenn seine Technologie administrativ ist (Monitoring, BuildPipeline, ContainerPlatform, IdentityProvider, WAF/IDS/IPS, Vault, Service*-Komponenten, LoadBalancer/ReverseProxy) oder wenn es Tags wie ",
      "riskAssessment": "Kanäle ohne Authentifizierung und Verschlüsselung sind hochriskant. Die Auswirkung leitet sich aus den Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen des Geräts und dem Explosionsradius seiner Rolle ab (z. B. Routing-/Identitäts-/Kontrollebene). Eine erfolgreiche Ausnutzung kann eine weitreichende Datenexposition und Ausfälle ermöglichen.",
      "falsePositives": "Kann ein False Positive sein, wenn kompensierende Kontrollen existieren, die im Modell nicht sichtbar sind (z. B. erfolgt die Verwaltung nur über einen gesicherten Jump-Host oder ein VPN mit starker Client-Authentifizierung, oder es gibt strenge Betriebsverfahren, die eine Out-of-Band-Verifizierung erfordern). Fehlende Modelldetails zur Authentifizierung können ebenfalls zu falschen Meldungen führen."
    },
    "ddos-on-network-component-net3.2": {
      "title": "DDoS auf eine Netzwerkeingangskomponente (Firewall/WAF) – BSI NET.3.2",
      "description": "Ein Distributed-Denial-of-Service (DDoS)-Angriff (z. B. TCP-SYN-Flooding, UDP-Paketstürme) kann eine Perimeterskomponente wie eine Firewall, WAF, Reverse Proxy, Gateway, IPS oder einen Load Balancer überlasten. Übermäßiger Verbindungsaufbau und Paketverarbeitung erschöpfen Ressourcen, was zu einer Dienstverschlechterung oder einem Ausfall für die Systeme hinter der Komponente führt.",
      "impact": "Verfügbarkeitsverlust für Dienste und Assets hinter der überlasteten Eingangskomponente; potenzieller Ausfall ganzer Netzwerksegmente; Störung von Geschäftsprozessen mit finanziellen und reputativen Folgen für kritische Systeme.",
      "asvs": "BSI IT-Grundschutz: NET.3.2 (Schutz gegen DoS) – insbesondere NET.3.2.A1 (Planung des Schutzes), A2 (Firewall-Regeln), A19 (Ratenbegrenzungen/SYN/UDP), A23 (Überwachung).",
      "action": "DDoS-Resilienz für internetzugängliche Netzwerkeingangspunkte implementieren und regelmäßig testen.",
      "mitigation": "Dedizierte DDoS-Mitigation verwenden (z. B. Upstream/Anycast-Scrubbing); SYN-Cookies und Verbindungslimits aktivieren; UDP/ICMP-Ratenbegrenzung und Timeouts konfigurieren; skalierbare Architekturen und HA-Paare einsetzen; bei Upstream-Providern filtern; Conntrack/State-Tables optimieren; Playbooks und Überwachung mit schwellenwertbasierten Warnungen pflegen.",
      "check": "Ist eine DDoS-Mitigationslösung (Cloud oder Provider) vor den internetzugänglichen Eingangspunkten vorhanden? Sind SYN/UDP-Ratenbegrenzungen und Timeouts konfiguriert und getestet? Ist eine Überwachung mit Alarmen und Runbooks vorhanden? Wurde Failover und Kapazität unter Last validiert (z. B. durch synthetische Last oder Provider-Test)?",
      "detectionLogic": "Ein Risiko für im Geltungsbereich befindliche TechnicalAssets auslösen, deren Technologie WAF, ReverseProxy, Gateway, IPS oder LoadBalancer ist und die dem Internet zugewandt sind (entweder direkt über das ",
      "riskAssessment": "Die Wahrscheinlichkeit ist für öffentlich zugängliche Eingangskomponenten aufgrund der Verbreitung von volumetrischen und Protokoll-DDoS-Angriffen sehr wahrscheinlich. Die Auswirkung skaliert mit der höchsten Verfügbarkeit der geschützten Dienste: Operativ→Mittel, Wichtig/Kritisch→Hoch, Missionskritisch→Sehr hoch; die eigene Hochverfügbarkeitsbewertung der Komponente kann die Auswirkung erhöhen.",
      "falsePositives": "Möglicherweise ein False Positive, wenn ein robuster, dedizierter DDoS-Mitigations-/Scrubbing-Dienst eines Drittanbieters vor der Komponente bereitgestellt und separat modelliert wird, oder wenn die Kapazität erheblich überprovisioniert und durch regelmäßige Tests validiert ist. Auch möglich, wenn das Asset in der bereitgestellten Topologie tatsächlich nicht aus dem Internet erreichbar ist."
    },
    "unauthorized-firewall-access": {
      "title": "Unbefugter Zugriff auf Firewall oder Gateway",
      "description": "Wenn ein Angreifer unbefugten Zugriff auf eine Netzwerksicherheitskomponente wie eine Firewall, ein Gateway oder einen Load Balancer – oder auf deren Verwaltungsschnittstelle – erlangt, kann er deren Dateien und Konfiguration manipulieren. ",
      "impact": "Ein erfolgreicher Angriff kann zur vollständigen Kompromittierung der geschützten Netzwerksegmente führen. Angreifer könnten Sicherheitskontrollen umgehen, um auf interne Systeme zuzugreifen, sensible Daten zu exfiltrieren oder Denial-of-Service (DoS)-Angriffe durch Blockieren des legitimen Verkehrs zu starten. Dies kompromittiert die Vertraulichkeit, Integrität und Verfügbarkeit aller Assets hinter der Sicherheitskomponente.",
      "asvs": "BSI IT-Grundschutz NET.3.2 Firewall",
      "action": "Administrativen Zugriff auf Netzwerksicherheitskomponenten absichern",
      "mitigation": "Zugriff auf Verwaltungsschnittstellen durch dedizierte, gesicherte Netzwerke (z. B. Management-VLANs) und Jump-Hosts einschränken. Starke Multi-Faktor-Authentifizierung (MFA) für alle administrativen Zugriffe erzwingen. Verschlüsselte Protokolle (z. B. SSH, HTTPS) für die gesamte Management-Kommunikation verwenden. Das Prinzip der geringsten Rechte (Least Privilege) für administrative Rollen anwenden. Konfigurationen, Regelsätze und Zugriffsprotokolle regelmäßig auf unbefugte Änderungen oder verdächtige Aktivitäten überprüfen. Die Komponente aktuell halten.",
      "check": "Wird der administrative Zugriff auf die Komponente protokolliert und überwacht? Ist eine starke MFA für alle administrativen Benutzer erforderlich? Sind die Verwaltungsschnittstellen vom allgemeinen Netzwerkverkehr isoliert? Sind alle Managementverbindungen verschlüsselt?",
      "detectionLogic": "Diese Regel wird für Netzwerksicherheitskomponenten (wie Firewalls, Gateways, WAFs, Reverse Proxies, Load Balancer) ausgelöst, die schwach geschützte oder unverschlüsselte administrative Kommunikationsverbindungen haben. Sie markiert auch Komponenten, bei denen überhaupt keine administrative Verbindung modelliert ist, da dies einen potenziellen blinden Fleck darstellt.",
      "riskAssessment": "Die Auswirkung wird als Hoch oder Sehr Hoch bewertet, da die Kompromittierung einer solchen Komponente alle von ihr geschützten Assets betrifft. Die Wahrscheinlichkeit hängt von der Sicherheit der Verwaltungsschnittstelle ab. Eine nicht authentifizierte oder unverschlüsselte Schnittstelle, die unvertrauenswürdigen Netzwerken ausgesetzt ist, stellt ein sehr wahrscheinliches Risiko dar. Eine Schnittstelle mit nur einfacher Passwortauthentifizierung wird als wahrscheinlich eingestuft. Wenn keine Verwaltungsschnittstelle modelliert ist, wird das Risiko als vorhanden angenommen.",
      "falsePositives": "Das Modell stellt möglicherweise nicht alle Zugriffskontrollmechanismen wie Jump-Hosts oder Out-of-Band-Management vollständig dar, was zu einem False Positive führen könnte. Das Risiko kann akzeptiert werden, wenn kompensierende Kontrollen vorhanden und dokumentiert sind."
    },
    "firewall-bypass-via-protocol-manipulation": {
      "title": "Firewall-Umgehung durch Manipulation von Netzwerkprotokollen (BSI NET.3.2)",
      "description": "Angreifer können grundlegende Mechanismen innerhalb von Netzwerkprotokollen ausnutzen (z. B. Fragmentierungsangriffe) ",
      "impact": "Eine erfolgreiche Umgehung von Firewall-Regeln gewährt einem Angreifer unbefugten Zugriff auf ein geschütztes Netzwerksegment. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.3.2 ",
      "action": "Firewall- und Netzwerksegmentierungsregeln härten",
      "mitigation": "Sicherstellen, dass Firewalls stateful sind und korrekt konfiguriert sind, um Protokollanomalien wie fragmentierte Pakete zu behandeln. ",
      "check": "Sind Firewalls stateful und so konfiguriert, dass sie fragmentierte Pakete vor der Analyse wieder zusammensetzen? Gibt es eine regelmäßige ",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung ausgelöst, die eine netzwerkbasierte Vertrauensgrenze überschreitet. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist bei Verbindungen aus dem Internet erhöht. Die Auswirkung wird berechnet ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn die vorhandene Firewall eine hochentwickelte Next-Generation Firewall (NGFW) ist oder "
    },
    "misconfigured-firewall": {
      "title": "Fehlkonfigurierte Firewall (BSI-basiert)",
      "description": "Eine falsch konfigurierte oder betriebene Firewall kann die Verfügbarkeit von Diensten erheblich beeinträchtigen. Wenn Firewall-Regeln beispielsweise falsch gesetzt sind, kann der Netzwerkzugriff blockiert werden. Darüber hinaus können fehlerhafte Konfigurationen dazu führen, dass IT-Systeme nicht mehr vollständig oder gar nicht mehr geschützt sind. Im schlimmsten Fall werden dadurch interne Dienste für Angreifer zugänglich.",
      "impact": "Eine fehlkonfigurierte Firewall kann entweder zu einem Denial-of-Service für legitime Benutzer (wenn die Regeln zu streng sind) oder zu unbefugtem Zugriff auf interne Systeme (wenn die Regeln zu locker sind) führen. Dies kann die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der geschützten Assets kompromittieren und potenziell zu Datenlecks, Dienstunterbrechungen und unbefugter Systemkontrolle führen.",
      "asvs": "BSI IT-Grundschutz NET.3.2 Firewall",
      "action": "Firewall-Konfiguration überprüfen und härten",
      "mitigation": "Sicherstellen, dass alle Firewall-, WAF- und Reverse-Proxy-Komponenten eine dokumentierte, überprüfte und gehärtete Konfiguration haben. Einen strengen Change-Management-Prozess für Firewall-Regeln implementieren. Den Regelsatz regelmäßig überprüfen, um veraltete oder zu freizügige Regeln zu entfernen. Eine ",
      "check": "Gibt es einen dokumentierten Konfigurationsstandard für Firewalls/WAFs? Gibt es einen formellen Prozess zur Überprüfung von Änderungen an Firewall-Regeln? Werden die Regeln regelmäßig auditiert? Gibt es irgendwelche ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Netzwerksicherheitskontrollpunkt identifiziert wird, wie z. B. eine WAF, ein Reverse Proxy, ein Gateway, IDS oder IPS. Das Risiko ist generisch, da das Modell die tatsächliche Konfiguration nicht überprüfen kann. Der Schweregrad steigt mit der Sensibilität der geschützten Assets.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dies ist ein generisches Risiko, das auf dem Vorhandensein einer firewallähnlichen Komponente basiert. Es kann ein False Positive sein, wenn die Komponente"
    },
    "unregulated-it-administration-ism2.2": {
      "title": "Ungenügende Regelung der Verantwortlichkeiten in der IT-Administration (BSI-basiert)",
      "description": "Die IT-Administration umfasst vielfältige Aufgaben an verschiedenen Komponenten. Sind die Zuständigkeiten und Abläufe nicht klar geregelt oder den Verantwortlichen nicht bekannt, können erhebliche Sicherheitslücken entstehen. Notwendige administrative Tätigkeiten werden unter Umständen vernachlässigt, von unbefugten Personen ohne vollständigen Kontext durchgeführt oder es werden widersprüchliche Maßnahmen von verschiedenen Teams ergriffen. Dies ist besonders kritisch, wenn Rollen wie Anwendungsbetrieb und Systembetrieb nicht klar getrennt sind, obwohl sie miteinander verbunden sind.",
      "impact": "Ein Mangel an klaren administrativen Regelungen kann zu einem Kontrollverlust führen und potenziell alle drei Schutzziele gefährden. Systeme können teilweise oder vollständig ausfallen (Denial of Service). Administratoren mit übermäßigen oder schlecht definierten Berechtigungen könnten über ihren Informationsbedarf hinaus auf vertrauliche Informationen zugreifen (Information Disclosure). Die Gesamtintegrität der Systeme kann bedroht sein, was zu einem allgemeinen Kontrollverlust über die IT-Landschaft führt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.4 (Identitäts- und Berechtigungsmanagement), insbesondere den Anforderungen bezüglich des Prinzips der geringsten Rechte für Administratoren (ORP.4.A5) und der Funktionstrennung (ORP.4.A6).",
      "action": "Klare Rollen, Verantwortlichkeiten und Prozesse für die IT-Administration festlegen und durchsetzen",
      "mitigation": "Alle Verantwortlichkeiten und zugehörigen Prozesse der IT-Administration klar definieren und dokumentieren. Spezifische Rollen für verschiedene administrative Bereiche (z. B. Anwendung, System, Datenbank, Netzwerk) zuweisen. Das Prinzip der geringsten Rechte durchsetzen, um sicherzustellen, dass Administratoren nur die für ihre Aufgaben wesentlichen Rechte haben. Die Verwendung von gemeinsam genutzten Administratorkonten vermeiden. Einen formellen Prozess für die Vergabe und den Entzug administrativer Privilegien implementieren. Sicherstellen, dass alle Administratoren über diese Regelungen informiert und darin geschult sind.",
      "check": "Sind administrative Rollen und Verantwortlichkeiten klar dokumentiert? Gibt es eine Funktionstrennung zwischen verschiedenen administrativen Bereichen? Wird das Prinzip der geringsten Rechte für alle Administratorkonten durchgesetzt? Gibt es mehrere, unterschiedliche administrative Zugriffspfade zu einer einzelnen kritischen Komponente?",
      "detectionLogic": "Dieses Risiko wird durch das Erkennen von technischen Assets identifiziert, insbesondere kritischen Backend-Systemen, die von mehreren unterschiedlichen administrativen Quellen zugänglich sind. Ein ",
      "riskAssessment": "Die Wahrscheinlichkeit steigt mit der Anzahl der administrativen Zugriffspfade auf ein einzelnes Asset. Die Auswirkung wird durch die Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen des Ziel-Assets bestimmt. Eine missionskritische Datenbank, auf die zahlreiche Administratoren zugreifen, stellt eine sehr hohe Auswirkung dar.",
      "falsePositives": "Das Modell kann das Vorhandensein oder die Durchsetzung organisatorischer Richtlinien nicht überprüfen. Mehrere administrative Zugriffspfade können legitim, notwendig und gut dokumentiert sein. Dieses Risiko sollte durch Überprüfung der Organisation validiert werden."
    },
    "vpn-planning-configuration-operation": {
      "title": "Schwächen bei VPN-Planung, -Konfiguration & -Betrieb (BSI NET.3.3)",
      "description": "VPNs schützen sensible Daten über unvertrauenswürdige Netzwerke hinweg mittels Kryptografie und gegenseitiger Authentifizierung. Wenn Planung, Auswahl, Konfiguration oder Betrieb schwach sind, kann das VPN zu einem Einfallstor mit hoher Auswirkung in das institutionelle Netzwerk werden. Typische Ursachen sind fehlende Anforderungsanalysen, unsichere Standardeinstellungen an VPN-Endpunkten, schlecht konfigurierte Fernzugriffs-Clients, ungeprüfte Dienstleister und unzureichende Überwachung oder Zugriffskontrolle. Remote-Benutzer, die sich von nicht verwalteten oder unsicheren Geräten aus verbinden, erhöhen das Risiko zusätzlich.",
      "impact": "Ein fehlerhaftes VPN kann unbefugten Zugriff auf interne Netzwerke ermöglichen und damit die Vertraulichkeit (z. B. Datenexfiltration), Integrität (z. B. Manipulation durch getunnelten Zugriff) und Verfügbarkeit (z. B. Ausfälle durch Fehlrouting oder DoS-Amplifikation) gefährden. Eine kaskadierende Kompromittierung vieler verbundener Systeme ist möglich.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.3.3 VPN; zugehörig: ORP.4, OPS.1.1.2, OPS.1.1.3, OPS.1.2.5, CON.1; verweist auf ISO/IEC 27033-5 und NIST SP 800-77.",
      "action": "VPN-Endpunkte und -Zugriffe planen, härten und kontinuierlich überwachen.",
      "mitigation": "Implementieren: 1) Formaler VPN-Plan mit klaren Verantwortlichkeiten, Benutzergruppen und Rechten (A1). 2) Anbieter mit SLAs bewerten und unter Vertrag nehmen und die Einhaltung überprüfen (A2). 3) Sichere Installation durch qualifiziertes Personal mit Tests vor der Inbetriebnahme (A3). 4) Gehärtete Basiskonfigurationen und regelmäßige Überprüfungen (A4). 5) Veraltete VPN-Konten/-Tunnel umgehend deaktivieren; Zugriff auf Geschäftszeiten beschränken (A5). 6) Anforderungsanalyse, die Prozesse, Zugriffspfade, Benutzer, Authentifizierung und Verantwortlichkeiten abdeckt (A6). 7) Technisches Design für Krypto-Suiten, Endpunkte, erlaubte Protokolle/Dienste und erreichbare Subnetze (A7). 8) VPN-Sicherheitsrichtlinie, Schulungen und Benutzerhandbücher (A8). 9) Zweckmäßige Produktauswahl (A9). 10) Betriebskonzept einschließlich QS, Überwachung, Wartung, Schulung und Autorisierung (A10). 11) Tunnel nur zwischen den vorgesehenen Systemen/Diensten unter Verwendung geeigneter Protokolle zulassen (A11). 12) Zentralisierte Konto- und Zugriffsverwaltung für Fernzugriffs-VPNs (A12). 13) VPN-Komponenten in die Firewall integrieren und die Einrichtung dokumentieren (A13).",
      "check": "Gibt es einen dokumentierten VPN-Plan und ein Betriebskonzept? Werden Provider-SLAs überwacht? Sind die Konfigurationen von Endpunkten/Clients gehärtet und werden sie regelmäßig überprüft? Werden ungenutzte Konten/Tunnel umgehend deaktiviert und ist der Zugriff zeitlich begrenzt? Sind Krypto-Suiten und erreichbare Subnetze explizit definiert? Wird der Fernzugriff zentral verwaltet und in die Firewall integriert? Werden VPN-Protokolle überwacht und korreliert?",
      "detectionLogic": "Diese Regel markiert wahrscheinliche VPN-Endpunkte/Konzentratoren, indem sie sich auf verwaltete Backend-Assets mit signifikanten CIA-Bewertungen konzentriert. Heuristik: (1) Assets, die ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Kann ein False Positive für Nicht-VPN-Backend-Assets sein oder wenn Zero-Trust-Zugang, starke Automatisierung, auditierte Änderungskontrolle und gehärtete Baselines das Risiko menschlicher Fehler wesentlich minimieren. Legen Sie Nachweise (Richtlinien, Automatisierung, Überwachung) vor, um das Risiko herabzustufen."
    },
    "disruption-by-it-administration-t5.158": {
      "title": "Störung durch IT-Administration (BSI T 5.158)",
      "description": "Auch wenn IT-Administrationsaufgaben fehlerfrei durchgeführt werden, können sie unbeabsichtigt die Institution stören.",
      "impact": "Die primäre Auswirkung ist die Störung der Dienstverfügbarkeit, entweder sofort durch die Verletzung von Wartungsfenstern oder verzögert durch unvorhergesehene Nebeneffekte administrativer Änderungen. ",
      "asvs": "Entspricht der BSI IT-Grundschutz-Gefährdung T 5.158 (Fehlerhafte Planung oder Umsetzung von Änderungen). Die Minderung wird durch Kontrollen wie OPS.1.1.A15 (Patch- und Änderungsmanagement) abgedeckt.",
      "action": "Einen strengen Change-Management-Prozess implementieren und durchsetzen",
      "mitigation": "Implementieren und erzwingen Sie einen formellen Change-Management-Prozess für alle IT-Administrationsaktivitäten, wie in der BSI-Kontrolle OPS.1.1.A15 beschrieben. ",
      "check": "Gibt es einen formellen Change-Management-Prozess? Sind Wartungsfenster definiert und werden sie eingehalten? Werden Änderungen in einer separaten Umgebung getestet, bevor sie in der Produktion bereitgestellt werden? Sind Rollback-Verfahren verfügbar und getestet?",
      "detectionLogic": "Dieses Risiko gilt für jedes im Geltungsbereich befindliche, nicht-clientseitige technische Asset, das eine Administration erfordert (z. B. Server, Anwendungen, Datenbanken, Netzwerkkomponenten). ",
      "riskAssessment": "Die Auswirkung des Risikos korreliert direkt mit der Verfügbarkeitsanforderung des administrierten technischen Assets. Eine höhere Verfügbarkeitsanforderung (z. B. ",
      "falsePositives": "Dieses Risiko könnte als False Positive angesehen werden, wenn die Organisation einen außergewöhnlich ausgereiften und rigoros getesteten Change-Management-Prozess hat, der unvorhergesehene Nebeneffekte effektiv eliminiert und sich strikt an störungsfreie Wartungspläne hält. "
    },
    "insufficient-documentation-bsi-ism2.2": {
      "title": "Ungenügende Dokumentation (BSI ISM.2.2)",
      "description": "Dokumentation kann unzureichend sein, wenn Informationen über IT-Komponenten (z. B. Konfiguration oder Zugriffsrechte) nicht erfasst wurden oder unvollständig sind. ",
      "impact": "Ungenügende Dokumentation kann zu Fehlkonfigurationen und fehlerhafter IT-Administration führen, was die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der betroffenen Systeme gefährden kann. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1 (Allgemeiner IT-Betrieb), Anforderung OPS.1.A9 (Dokumentation des Regelbetriebs) gemäß Edition 2023.",
      "action": "Umfassende Systemdokumentation erstellen und pflegen",
      "mitigation": "Einen Prozess zur Erstellung, Pflege und regelmäßigen Überprüfung der Systemdokumentation etablieren und durchsetzen. ",
      "check": "Gibt es einen formellen Prozess für die Systemdokumentation? Ist die Dokumentation für kritische Systeme vollständig, aktuell und wird sie regelmäßig überprüft? ",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das allein aus einem technischen Modell schwer zu überprüfen ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn die Organisation einen robusten und ausgereiften Dokumentationsprozess hat, der konsequent befolgt wird, "
    },
    "net-3-3-vpn-over-privileged-access": {
      "title": "NET.3.3 VPN: Überprivilegierter oder schlecht geregelter Zugriff",
      "description": "VPN-Endpunkte, Gateways und deren administrative Komponenten erhalten oft weitreichenden, dauerhaften Zugriff auf interne Netzwerke. ",
      "impact": "Die Kompromittierung oder der Missbrauch eines VPN-Endpunkts/Gateways oder seiner Admin-Ebene kann eine große Netzwerkreichweite (Ost-West und Nord-Süd) gewähren, ",
      "asvs": "Zugeordnet zu BSI NET.3.3 (A1–A5, A7, A10–A13) mit zugehöriger Governance in ORP.4 und kryptografischen Kontrollen in CON.1.",
      "action": "VPN-Endpunkte härten und das Prinzip der geringsten Rechte mit starker Identität, kurzlebigen Anmeldeinformationen, MFA und rechtzeitigem Off-Boarding durchsetzen.",
      "mitigation": "VPN-Reichweite auf definierte Subnetze und Dienste beschränken; generische ",
      "check": "Sind VPN-Assets explizit modelliert (z. B. ",
      "detectionLogic": "Diese Regel sucht nach technischen Assets, die als VPN-Endpunkte oder privilegierte Admin-Komponenten (z. B. ",
      "riskAssessment": "Die Auswirkung leitet sich aus der höchsten Vertraulichkeit, Integrität und Verfügbarkeit aller erreichbaren Assets ab. ",
      "falsePositives": "Zentrale Gateways oder Überwachungs-Hubs können legitimerweise viele Verbindungen haben, aber durch starke Segmentierung, ACLs pro Tunnel, "
    },
    "insufficiently-secured-admin-access": {
      "title": "Ungenügend gesicherter administrativer Zugriff",
      "description": "Administrativer Zugriff kann sensible Daten und mächtige Funktionen (z. B. Konfigurationsänderungen, Benutzerverwaltung, Betriebsdaten) offenlegen. Wenn diese administrativen Kanäle nicht robust gesichert sind, können unbefugte Akteure privilegierten Zugriff erlangen, was zur Offenlegung von Daten, Manipulation oder Dienstunterbrechung führt und alle CIA-Ziele bedroht.",
      "impact": "Eine erfolgreiche Ausnutzung eines unsicheren administrativen Kanals kann zur vollständigen Kompromittierung des Zielsystems führen, einschließlich Datenlecks, Konfigurationsmanipulation und Dienstausfällen. Er kann auch als Ausgangspunkt für weitere Angriffe innerhalb der Infrastruktur dienen.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.2.A16 (Sichere Administration von IT-Systemen)",
      "action": "Administrative Zugriffskanäle absichern",
      "mitigation": "Administrative Kommunikationsverbindungen müssen stark gesichert sein. Verwenden Sie verschlüsselte Protokolle (z. B. HTTPS, SSH, FTPS, RDP mit TLS), starke Multi-Faktor-Authentifizierung und strenge Autorisierung. Wenden Sie Schutzmaßnahmen auf Netzwerkebene an (VPNs, IP-Filterung), insbesondere beim Überschreiten von Vertrauensgrenzen. Zugangsdaten dürfen nicht im Klartext übertragen werden. Erzwingen Sie das Prinzip der geringsten Rechte für administrative Rollen.",
      "check": "Sind alle administrativen Verbindungen (z. B. `usage: devops` oder mit Admin-Tag versehene Clients) verschlüsselt? Wird eine starke Authentifizierung (2FA, Client-Zertifikate, externalisiert über IdP) erzwungen? Werden VPN/IP-Filter über Vertrauensgrenzen hinweg verwendet, insbesondere bei Internet-Exposition?",
      "detectionLogic": "Analysiert alle Kommunikationsverbindungen: Markiert diejenigen, die für die Administration verwendet werden (entweder `usage: devops` oder Verbindungen von von Menschen bedienten Clients mit dem Tag `@Role:Administrator`). Löst ein Risiko aus, wenn eine der folgenden Bedingungen zutrifft: (1) Protokoll ist unverschlüsselt; (2) Authentifizierung ist `none` oder nur Anmeldeinformationen; (3) die Verbindung überschreitet eine Vertrauensgrenze ohne VPN oder IP-Filterung – insbesondere, wenn eine Seite dem Internet zugewandt ist.",
      "riskAssessment": "Die Wahrscheinlichkeit steigt, wenn administrative Schnittstellen von unvertrauenswürdigen Netzwerken aus erreichbar sind oder eine schwache/keine Authentifizierung verwenden. Die Auswirkung skaliert mit der CIA-Bewertung des Ziel-Assets und der verarbeiteten/gespeicherten Daten. Die Kompromittierung des Admin-Zugriffs auf ein missionskritisches System bedeutet eine sehr hohe Auswirkung aufgrund der privilegierten Kontrolle.",
      "falsePositives": "Kann ein False Positive sein, wenn kompensierende Kontrollen existieren, die aber nicht modelliert sind (z. B. gehärtete Bastion-Hosts oder Firewalls, die eine strenge IP-Filterung erzwingen). Behandeln Sie einfache "
    },
    "insufficient-separation-of-admin-tools": {
      "title": "Ungenügende Trennung von Administrationswerkzeugen",
      "description": "Administrationswerkzeuge gewähren weitreichenden Zugriff auf eine Institution.",
      "impact": "Wenn ein Angreifer über einen weniger sicheren Kontext Zugriff auf ein Administrationswerkzeug erlangt, kann er weitreichende Berechtigungen erlangen. Diese Berechtigungen können für verschiedene Angriffe missbraucht werden, z. B. zur Sabotage der IT-Administration, zur Durchführung unbefugter administrativer Aktionen oder zur weiteren Eskalation von Privilegien im Netzwerk. Dies gefährdet die Vertraulichkeit, Integrität und Verfügbarkeit aller von diesem Werkzeug verwalteten Systeme.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5.A4 (Separate Clients für die Administration)",
      "action": "Dedizierte und gehärtete administrative Clients verwenden",
      "mitigation": "Administrative Aufgaben sollten von dedizierten und gehärteten Systemen (z. B. Privileged Access Workstations - PAWs) ausgeführt werden, die physische oder virtuelle Maschinen sein können. Diese Systeme sollten vom allgemeinen Unternehmensnetzwerk isoliert sein und keinen Zugriff auf das Internet oder E-Mail haben. Die für die Administration verwendeten Werkzeuge (Browser, Terminals) dürfen nicht für nicht-administrative Zwecke verwendet werden. Wenn dedizierte Systeme nicht machbar sind, verwenden Sie separate Benutzerprofile oder Browserprofile für administrative und reguläre Aufgaben, obwohl dies eine schwächere Trennung bietet.",
      "check": "Werden administrative Aufgaben von dedizierten, gehärteten Systemen aus durchgeführt? Sind die Client-Anwendungen (z. B. Browser, SSH-Clients), die für die Administration verwendet werden, strikt von denen getrennt, die für das Tagesgeschäft wie E-Mail und allgemeines Surfen im Internet verwendet werden?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die von Menschen als Clients verwendet werden (z. B. Desktops, DevOps Clients) und ausgehende Kommunikationsverbindungen sowohl für administrative Zwecke (usage: ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein Client administrative und geschäftliche Nutzungskontexte mischt. Die Auswirkung wird durch die höchste Sensibilität (eine Kombination aus Vertraulichkeit, Integrität und Verfügbarkeit) der Assets bestimmt, die über den ",
      "falsePositives": "Ein Modell könnte ein einzelnes Asset anzeigen (z. B. "
    },
    "failure-of-administration-capabilities": {
      "title": "Ausfall von Administrationsfähigkeiten / SPOF bei Ops-Tools (BSI CON.1.A4; unterstützt NET.3.3 VPN-Verfügbarkeit)",
      "description": "Wenn Administrationsfähigkeiten ausfallen und aufgrund mangelnder Planung keine Redundanz oder Alternative vorhanden ist, können zugehörige IT-Administrationsaktivitäten nicht ausgeführt werden, bis der Ausfall behoben ist. Im schlimmsten Fall ist die gesamte IT-Infrastruktur eingeschränkt, nicht verfügbar oder nicht funktionsfähig. Administrationswerkzeuge können auch durch ihre eigene Administration ausfallen, z. B. durch Fehlkonfiguration, einen fehlerhaften Patch oder eine durch eine IT-Administrationsaktivität eingeführte Änderung, was zu einem Single Point of Failure (SPOF) führt. Dies ist besonders relevant für zentrale Zugriffskomponenten wie VPN-Endpunkte/Konzentratoren, die durch NET.3.3 geregelt sind.",
      "impact": "Der Ausfall eines nicht-redundanten Administrationswerkzeugs kann die von ihm verwalteten Systeme unbrauchbar oder unüberschaubar machen, was sich direkt auf deren Verfügbarkeit auswirkt. Dies kann zu weitreichenden Dienstunterbrechungen führen, SLAs verletzen und erheblichen Geschäftsschaden verursachen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Notfallmanagement), insbesondere Anforderung CON.1.A4 (Redundanz von Plattformen); auch im Einklang mit NET.3.3 VPN bezüglich Verfügbarkeit und sicherem Betrieb von VPN-Endpunkten.",
      "action": "Redundanz und getesteten Fallback für kritische Administrations-/Betriebswerkzeuge und -plattformen (einschließlich VPN-Endpunkten) sicherstellen.",
      "mitigation": "Sicherstellen, dass alle technischen Assets, die kritische administrative oder betriebliche Funktionen ausführen, mit Redundanz ausgelegt sind (z. B. Aktiv-Passiv-, Aktiv-Aktiv-Clustering). Wenn ein Werkzeug als Single Point of Failure (SPOF) identifiziert wird, eine redundante Instanz oder ein dokumentiertes, getestetes manuelles Fallback-/Wiederherstellungsverfahren implementieren, das bei Ausfall des primären Werkzeugs ausgeführt werden kann. Change-Management-Prozesse für diese Werkzeuge sollten besonders rigoros sein und gestaffelte Rollouts sowie schnelle Rollbacks beinhalten.",
      "check": "Sind kritische Administrationswerkzeuge (wie Build-Pipelines, Container-Orchestratoren, Identitätsanbieter, VPN-Konzentratoren) redundant konfiguriert? Ist die ",
      "detectionLogic": "Diese Regel scannt alle technischen Assets und markiert nicht-redundante administrative/operative Werkzeuge. Sie prüft Assets, deren `technology` eine der folgenden ist: BuildPipeline, SourcecodeRepository, ArtifactRegistry, CodeInspectionPlatform, Monitoring, IdentityProvider, Vault, HSM, ContainerPlatform, ServiceMesh, Scheduler, LoadBalancer, ReverseProxy, WAF, IDS, IPS, ServiceRegistry. Assets, die als `outOfScope` markiert sind oder `redundant=true` haben, werden ignoriert. Ein Risiko wird nur dann ausgelöst, wenn das Werkzeug mindestens eine ausgehende `communicationLink` mit `usage === DevOps` zu einem bestehenden Ziel-Asset hat – was anzeigt, dass es aktiv andere Komponenten verwaltet und somit einen Single Point of Failure (SPOF) darstellt. Für jedes solche Werkzeug leitet die Regel die Auswirkung aus der höchsten Verfügbarkeitsanforderung der verwalteten Ziele ab.",
      "riskAssessment": "Die Auswirkung skaliert mit der höchsten Verfügbarkeitsanforderung der vom nicht-redundanten Werkzeug verwalteten Assets: Wichtig → Mittel, Kritisch → Hoch, Missionskritisch → Sehr Hoch. Die Wahrscheinlichkeit ist standardmäßig `Likely`, da administrative Werkzeuge sich häufig ändern und Ausfälle aufgrund von Updates oder Fehlkonfigurationen plausibel sind.",
      "falsePositives": "Ein Risiko könnte für ein Werkzeug gemeldet werden, das für die unmittelbare Produktionsverfügbarkeit nicht kritisch ist (z. B. ein reines Entwicklungswerkzeug oder eine Offline-Analyseplattform). Es kann auch ein False Positive sein, wenn ein dokumentiertes und effektives manuelles Fallback-Verfahren existiert, das aber nicht im Modell erfasst ist."
    },
    "misleading-it-administration": {
      "title": "Fehlgeleitete IT-Administration (Fehlgeleitete Administration)",
      "description": "Wenn die IT-Administration in die Irre geführt wird – zum Beispiel durch einen Angreifer, der falsche Informationen einschleust – können Administratoren dazu verleitet werden, falsche oder schädliche Aktionen durchzuführen. ",
      "impact": "Eine erfolgreiche Ausnutzung kann zur Manipulation von Informationen, Hardware oder Software führen und die Verfügbarkeit und Integrität beeinträchtigen. ",
      "asvs": "Basiert auf BSI IT-Grundschutz, OPS.1.1.2 (Abschnitt 2.9 „Fehlgeleitete Administration“) und allgemeinen Social-Engineering-Gefahren gegen Bediener.",
      "action": "Strikte Verifizierungs- und Kommunikationsprotokolle für administrative Aktionen implementieren",
      "mitigation": "Strikte, out-of-band Verifizierungsverfahren für jede kritische administrative Anfrage (z. B. Systemneustarts, Konfigurationsänderungen, Benutzerkontenänderungen) etablieren und durchsetzen. ",
      "check": "Gibt es formale, dokumentierte Prozesse für kritische administrative Aktionen? Enthalten diese Prozesse out-of-band Verifizierungsschritte? Werden Administratoren zu Social-Engineering-Gefahren geschult? Gibt es einen sicheren, dedizierten Kanal für administrative Kommunikation?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das von Personal mit administrativen Rollen verwaltet wird. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher für Assets, die kritisch sind und von mehreren Administratoren verwaltet werden, was die Angriffsfläche für Social Engineering erhöht. ",
      "falsePositives": "Das Risiko könnte als False Positive angesehen werden, wenn die Organisation außergewöhnlich starke, durchgesetzte und auditierte out-of-band Verifizierungsprozesse für alle administrativen Aktionen hat, was solche Social-Engineering-Versuche sehr unwahrscheinlich macht."
    },
    "inadequate-nac-planning-net-2-1": {
      "title": "Ungenügende NAC-Planung oder -Implementierung (BSI NET.2.1)",
      "description": "Wenn nicht alle für die Network Access Control (NAC) relevanten IT-Systeme im IT-Asset-Management erfasst sind, kann eine NAC-Lösung nicht adäquat geplant werden. ",
      "impact": "Mängel in der NAC-Planung und -Implementierung können zu unbefugtem Netzwerkzugriff führen und Angreifern einen Fuß in die Tür interner Netzwerke verschaffen. Dies kann zur Kompromittierung sensibler Daten (Information Disclosure), zur lateralen Bewegung (Elevation of Privilege) oder zur Störung von Diensten (Denial of Service, Verfügbarkeit) führen.",
      "asvs": "BSI IT-Grundschutz: NET.2.1 Network Access Control",
      "action": "NAC-Strategie und -Implementierung überprüfen und verbessern",
      "mitigation": "Sicherstellen, dass ein vollständiges IT-Asset-Inventar existiert und alle Assets innerhalb geeigneter Netzwerk-Vertrauensgrenzen modelliert sind. ",
      "check": "Sind alle mit dem Netzwerk verbundenen Assets registriert und innerhalb einer definierten Netzwerk-Vertrauensgrenze modelliert? Verwenden alle Kommunikationsverbindungen, die Netzwerkgrenzen überschreiten, eine starke, nicht wiederholbare Authentifizierung und explizite Autorisierungsrichtlinien?",
      "detectionLogic": "Dieses Risiko wird auf zwei Arten identifiziert: 1. Wenn eine Kommunikationsverbindung eine Netzwerk-Vertrauensgrenze ohne starke Authentifizierung überschreitet (z. B. ",
      "riskAssessment": "Die Auswirkung wird basierend auf der Sensibilität des Ziel-Assets und der übertragenen Daten bewertet. Die Wahrscheinlichkeit ist hoch für nicht authentifizierte Verbindungen oder nicht verwaltete Assets. Das Risiko eines Datenlecks wird als wahrscheinlich angesehen, wenn sensible Daten über schwach geschützte Verbindungen übertragen werden.",
      "falsePositives": "Das Modell zeigt möglicherweise keinen zentralen NAC oder authentifizierenden Proxy, wodurch direkte Verbindungen als nicht authentifiziert erscheinen. Dieses Risiko sollte anhand der tatsächlichen Netzwerkarchitektur überprüft werden."
    },
    "inadequate-endpoint-integration-and-orchestration-con6": {
      "title": "Ungenügende Endpunkt-Integration und -Orchestrierung (bezogen auf BSI CON.6)",
      "description": "Ein Mangel an oder schlecht implementierte Orchestrierungswerkzeuge, Sicherheitsrichtlinien und standardisierte Prozesse zur Verwaltung von Endpunkten können zu erheblichen Sicherheitslücken führen. Endpunkte können unkoordiniert in das Netzwerk integriert werden, was es schwierig macht, sichere, rollenbasierte Authentifizierungs- und Inbetriebnahmeverfahren durchzusetzen. Dies kann dazu führen, dass Endpunkte in falschen Netzwerksegmenten platziert werden, schwache Authentifizierungsmethoden verwenden oder ihre Kommunikationsfähigkeiten beeinträchtigt werden.",
      "impact": "Wenn Endpunkte nicht korrekt verwaltet und segmentiert werden, kann dies zu einer Vielzahl von Sicherheitsvorfällen führen. Geschützte Geräte könnten in weniger sicheren Netzwerkzonen exponiert werden, was sie anfällig für Angriffe macht. Die Verwendung schwacher Authentifizierung kann Spoofing und unbefugten Zugriff ermöglichen. Diese Fehler können die Vertraulichkeit, Integrität und Verfügbarkeit von Daten gefährden, zu Privilegienerweiterungen führen und Dienstunterbrechungen verursachen.",
      "asvs": "BSI IT-Grundschutz Baustein CON.6: Netz-Zugangskontrolle (Network Access Control)",
      "action": "Standardisiertes Endpunkt-Onboarding und -Management mit ordnungsgemäßer Network Access Control (NAC) implementieren.",
      "mitigation": "Eine umfassende Strategie für das Endpunkt-Management etablieren und durchsetzen. Orchestrierungswerkzeuge nutzen, um die Konfiguration von Endpunkten zu automatisieren und zu standardisieren. Klare Sicherheitsrichtlinien, Anforderungen und Inbetriebnahmeverfahren für alle Gerätetypen definieren. Sicherstellen, dass die Network Access Control (NAC)-Lösung diese Richtlinien durchsetzen kann, einschließlich starker Authentifizierung und korrekter Netzwerksegmentierung für verschiedene Endpunktgruppen. Endpunktkonfigurationen und Netzwerksegmente regelmäßig überprüfen, um die Einhaltung sicherzustellen.",
      "check": "Gibt es ein zentrales Endpunkt-Management- oder Orchestrierungswerkzeug? Gibt es dokumentierte Standards und Onboarding-Prozesse für Endpunkte? Erzwingt die NAC-Lösung eine starke Authentifizierung und Netzwerksegmentierung basierend auf definierten Richtlinien?",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung seiner Symptome auf clientartigen technischen Assets erkannt. Die Regel prüft auf zwei Hauptbedingungen: 1. Client-Assets, die schwache oder keine Authentifizierung auf Kommunikationsverbindungen verwenden, die Vertrauensgrenzen überschreiten. 2. Sensible Client-Assets, die in derselben Netzwerk-Vertrauensgrenze wie weniger sichere Assets (z. B. internetzugängliche Systeme) platziert sind, was auf eine schlechte Segmentierung hindeutet.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn Symptome wie schwache Authentifizierung vorhanden sind, da dies direkt auf ein Versäumnis bei der Richtliniendurchsetzung hinweist. Die Auswirkung wird durch die Sensibilität (CIA-Bewertungen) des fehlkonfigurierten Endpunkts und der von ihm verarbeiteten Daten bestimmt. Ein hochvertraulicher Client in einem schlecht segmentierten Netzwerk oder ohne Authentifizierung für den Zugriff auf kritische Systeme stellt ein sehr hohes Risiko dar.",
      "falsePositives": "Das Modell erfasst möglicherweise nicht vollständig die Besonderheiten der NAC-Implementierung oder anderer kompensierender Kontrollen (z. B. hostbasierte Firewalls). Ein Befund von "
    },
    "weak-network-access-authentication": {
      "title": "Schwache Authentifizierung für den Netzwerkzugriff (basierend auf BSI INF.5.A10)",
      "description": "Wenn sichere Authentifizierungsmethoden (wie EAP mit starken Chiffren) für den Netzwerkzugriff nicht unterstützt oder nicht erzwungen werden, könnten unsichere Protokolle wie EAP-MD5 oder MAC-basierte Authentifizierung verwendet werden. Dies erleichtert Spoofing-, Replay- oder Man-in-the-Middle-Angriffe, die es unbefugten Systemen ermöglichen, Zugang zum Netzwerk zu erhalten.",
      "impact": "Ein Angreifer kann sich als legitimes Gerät ausgeben, um unbefugten Netzwerkzugriff zu erlangen. Wenn das Netzwerk für Geräte, die mit schwachen Methoden authentifiziert werden, nicht ordnungsgemäß segmentiert ist, kann der Angreifer weitreichende Kommunikationsfähigkeiten erlangen und potenziell auf sensible Systeme zugreifen, den Datenverkehr abfangen und die Vertraulichkeit, Integrität und Verfügbarkeit von Daten und Diensten im Zielnetzwerk gefährden.",
      "asvs": "BSI IT-Grundschutz INF.5.A10 (Einsatz sicherer Authentisierungsverfahren)",
      "action": "Starke, verschlüsselte Authentifizierung für den Netzwerkzugriff erzwingen und Netzwerke segmentieren",
      "mitigation": "Verwenden Sie nach Möglichkeit starke, zertifikatsbasierte Authentifizierungsmethoden wie EAP-TLS für den Netzwerkzugriff. Vermeiden Sie schwache oder nicht vorhandene Authentifizierung. Wenn schwache Authentifizierung (wie MAC-basiertes Filtern oder Anmeldeinformationen über unverschlüsselte Protokolle) für bestimmte Legacy-Geräte unvermeidbar ist, müssen diese Geräte in einer streng getrennten Netzwerkzone (VLAN) mit engen Firewall-Regeln platziert werden, die nur die erforderliche Kommunikation zu bestimmten Zielen erlauben.",
      "check": "Sind alle Netzwerkzugangspunkte (@Network:WLAN, LAN-Ports) so konfiguriert, dass sie eine starke Authentifizierung erzwingen? Wird MAC-basierte Authentifizierung verwendet? Wenn ja, befinden sich diese Geräte in einem separaten, eingeschränkten Netzwerksegment? Werden Anmeldeinformationen für den Netzwerkzugriff jemals über unverschlüsselte Protokolle gesendet?",
      "detectionLogic": "Diese Regel erkennt Kommunikationsverbindungen, die Netzwerkgrenzen mit schwachen Authentifizierungsmethoden überschreiten. Schwache Authentifizierung wird identifiziert, wenn die Verbindung keine Authentifizierung verwendet, Anmeldeinformationen über ein unverschlüsseltes Protokoll sendet oder explizit als schwache Methode wie MAC-basierte Authentifizierung gekennzeichnet ist (`@authentication:mac-based`).",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine Authentifizierung verwendet wird, oder wahrscheinlich, wenn schwache Methoden verwendet werden. Die Auswirkung wird durch die Sensibilität der über die Verbindung übertragenen Daten und die Kritikalität der Assets im Zielnetzwerksegment bestimmt. Ein flaches, unsegmentiertes Netzwerk erhöht das potenzielle Ausmaß erheblich.",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn andere kompensierende Kontrollen nicht modelliert sind, wie z. B. ein physisch gesichertes Netzwerk, an das nur vertrauenswürdige Geräte angeschlossen werden können, oder wenn das Zielnetzwerk für die schwache Authentifizierung ein isoliertes Gastnetzwerk ohne Zugriff auf interne Ressourcen ist."
    },
    "misconfiguration-of-nac-components": {
      "title": "Fehlkonfiguration von Network Access Control (NAC)-Komponenten",
      "description": "Aufgrund menschlicher Fehler, unzureichender Prozesse oder unzureichender Personalkapazitäten und daraus resultierender Zeitknappheit, ",
      "impact": "Eine falsche NAC-Konfiguration kann zu zwei primären Fehlermodi führen: ",
      "asvs": "V4.1 Access Control Design",
      "action": "Striktes Konfigurations- und Änderungsmanagement für NAC-Komponenten implementieren",
      "mitigation": "Strikte Änderungsmanagement- und Konfigurationsüberprüfungsprozesse für alle NAC-Komponenten (z. B. Assets, die mit @NACComponent getaggt sind) etablieren und durchsetzen. ",
      "check": "Gibt es einen dokumentierten Änderungskontrollprozess für NAC-Konfigurationen? Werden Konfigurationen regelmäßig auf Korrektheit und Konsistenz überprüft? Ist der Zugriff zur Konfiguration von NAC-Komponenten streng kontrolliert und protokolliert?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als zentraler Bestandteil der Network Access Control-Infrastruktur identifiziert wird (mit `@NACComponent` getaggt). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für manuell verwaltete Systeme oder solche mit kundenspezifisch entwickelten Teilen als höher angesehen. ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn robuste, automatisierte und auditierte Konfigurationsmanagementprozesse vorhanden und im Bedrohungsmodell sichtbar sind."
    },
    "inadequate-change-validation-process": {
      "title": "macOS-Clients: Unzureichende Validierung von Änderungen & Konfigurationen (BSI SYS.2.4 + OPS.1.1.5)",
      "description": "macOS-Client-Konfigurationen (z. B. SIP, Gatekeeper, XProtect, FileVault, Personal Firewall, iCloud, Wi-Fi/Bluetooth/AirDrop/Continuity-Einstellungen) erfordern ",
      "impact": "Schlecht validierte Änderungen können zu Datenexposition (z. B. iCloud-Synchronisierung sensibler Daten), Integritätsproblemen (Ausführung von bösartigem Inhalt über Vorschaufunktionen), ",
      "asvs": "BSI IT-Grundschutz: SYS.2.4 Clients unter macOS (A1, A2, A4–A12) und OPS.1.1.5 Change Management (insb. A5: Test/Abnahme von Änderungen).",
      "action": "macOS-Clients härten und eine gestaffelte Validierung von Änderungen mit Tests/Genehmigung vor dem Rollout erzwingen.",
      "mitigation": "Einen formalen Änderungs-/Konfigurationsmanagement-Workflow für macOS und die zugehörige Infrastruktur definieren: Jede Änderung dokumentieren; Peer-/IS-Review verlangen; in einer ",
      "check": "Gibt es eine dokumentierte macOS-Baseline (SIP, Gatekeeper, XProtect, FileVault, Firewall) und eine Richtlinie für die iCloud-Nutzung? Werden Änderungen nachverfolgt, überprüft, getestet und ",
      "detectionLogic": "Organisatorisches/prozessuales Risiko, das dort auftritt, wo Konfigurationsfehler hohe Auswirkungen hätten. Die Regel markiert im Geltungsbereich befindliche technische Assets, die entweder ",
      "riskAssessment": "Die Wahrscheinlichkeit ist standardmäßig ",
      "falsePositives": "Wenn ein robuster, auditierter Änderungsprozess existiert (z. B. durchgesetzt über MDM-Baselines, Peer-Reviews, dediziertes Staging, vollständiges Rollback und Nachweis von Genehmigungen) "
    },
    "disabled-or-insufficient-network-access-control-net-3-4": {
      "title": "Deaktivierte oder unzureichende Network Access Control (NAC) (BSI NET.3.4)",
      "description": "Wenn die Network Access Control (NAC) an Netzwerkzugangspunkten (z. B. Switches/WLAN) vorübergehend oder dauerhaft deaktiviert ist, ist der Netzwerkzugang unzureichend geschützt. Dies ermöglicht unbefugten Personen oder Geräten den Zugang zum Netzwerk oder verleiht unsicheren IT-Systemen übermäßige Kommunikationsprivilegien. Ebenso können sich Geräte mit Schwachstellen (z. B. veralteter Virenschutz) verbinden, wenn die Endpunkt-Compliance vor der Gewährung des Zugangs nicht überprüft wird.",
      "impact": "Unbefugter Zugriff kann zur Offenlegung, Manipulation oder Löschung von Informationen führen (Verletzung von Vertraulichkeit, Integrität und Verfügbarkeit). Malware kann eingeschleust werden, was zu lateraler Bewegung, Datenlecks und Dienstunterbrechungen führt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.3.4 Network Access Control, der Risiken durch schwache oder fehlende NAC und unzureichende Überprüfungen der Endpunkt-Compliance behandelt.",
      "action": "NAC auf allen Zugriffsebenen durchsetzen, kontinuierlich überwachen und testen",
      "mitigation": "Sicherstellen, dass eine starke NAC auf allen Zugangsports und im WLAN aktiv ist. Zertifikats- oder kontobasierte Authentifizierung (IEEE 802.1X/EAP) verlangen und die Endpunkt-Compliance vor der Gewährung des Zugangs überprüfen. Autorisierung nach dem Least-Privilege-Prinzip verwenden (z. B. VLAN-Zuweisung/Mikro-Segmentierung), auf deaktivierte NAC überwachen und auf Richtlinienverstöße oder nicht konforme Geräte prüfen.",
      "check": "Sind NAC-Richtlinien definiert und auf allen kritischen Segmenten und Ports durchgesetzt? Wird 802.1X mit EAP in Verbindung mit RADIUS verwendet? Sind Compliance-Prüfungen und Alarme für deaktivierte NAC, ungewöhnliche RADIUS-Fehler oder MAC-Auth-Ausnahmen vorhanden?",
      "detectionLogic": "Erkennt Verbindungen, die eine Umgehung von NAC simulieren: ein clientartiges Asset außerhalb einer Netzwerk-Vertrauensgrenze verbindet sich mit einem Ziel innerhalb der Grenze über eine Verbindung ohne Authentifizierung, VPN oder IP-Filterung. Ein solcher Pfad deutet darauf hin, dass ein nicht vertrauenswürdiger Endpunkt sich direkt an interne Segmente ohne NAC-Durchsetzung anschließen könnte.",
      "riskAssessment": "Die Wahrscheinlichkeit steigt, wenn generische Client-Geräte sich ohne Schutz auf Netzwerkebene verbinden können. Die Auswirkung richtet sich nach den CIA-Anforderungen des Ziel-Assets und der verarbeiteten Daten; Kompromittierungen von missionskritischen oder streng vertraulichen Umgebungen haben eine hohe Auswirkung.",
      "falsePositives": "Kompensierende Kontrollen außerhalb des Modells (z. B. dedizierte NAC-Appliances, Port-Security, physische Kontrollen) sind möglicherweise nicht modelliert. Befunde anhand der tatsächlichen NAC-Implementierung, der RADIUS-Richtlinien und der Switch-/WLAN-Konfigurationen validieren."
    },
    "uncontrolled-network-access-on-nac-failure": {
      "title": "Unkontrollierter Netzwerkzugriff bei NAC-Ausfall",
      "description": "Ein Ausfall oder die Nichtverfügbarkeit zentraler Network Access Control (NAC)-Komponenten (z. B. RADIUS-Server) kann zu unbeabsichtigtem Netzwerkzugriffsverhalten führen. Dies kann durch mangelnde Redundanz, Softwarefehler, DoS-Angriffe oder Netzwerkstörungen verursacht werden. Abhängig von der Konfiguration der Netzwerkinfrastruktur (z. B. Switches) kann dies dazu führen, dass Endpunkte entweder jeglichen Netzwerkzugriff verlieren (fail-close) oder uneingeschränkten Zugriff erhalten (fail-open).",
      "impact": "Ein Fail-Open-Szenario umgeht die Netzwerksegmentierung und Zugriffskontrollen und setzt potenziell sensible Systeme und Daten unbefugtem Zugriff aus, was zu schweren Verletzungen der Vertraulichkeit und Integrität führt. Ein Fail-Close-Szenario verursacht einen Denial-of-Service und beeinträchtigt die Verfügbarkeit von Anwendungen und Diensten im betroffenen Netzwerksegment.",
      "asvs": "V13 Network Architecture",
      "action": "Eine resiliente und explizit fehlersichere (fail-closed) NAC-Architektur mit Zustandsüberwachung und Alarmierung implementieren.",
      "mitigation": "Sicherstellen, dass alle kritischen NAC-Komponenten in einem redundanten, hochverfügbaren Cluster implementiert sind. Den Fehlerzustand von Netzwerk-Switches explizit so konfigurieren, dass ",
      "check": "Sind NAC-Komponenten (z. B. RADIUS-Server) als redundant modelliert? Ist der Fehlerzustand (fail-open/fail-close) dokumentiert, konfiguriert und wird er regelmäßig getestet? Ist eine Ende-zu-Ende-Überwachung für NAC und seine Abhängigkeiten mit Alarmierung bei Ausfall vorhanden?",
      "detectionLogic": "Dieses Risiko für technische Assets auslösen, die potenzielle NAC-Komponenten sind (Technologie: ",
      "riskAssessment": "Die Auswirkung leitet sich aus der maximalen Vertraulichkeit, Integrität und Verfügbarkeit von Assets innerhalb der betroffenen Vertrauensgrenze ab. Fail-open bedroht primär Vertraulichkeit und Integrität; fail-close bedroht die Verfügbarkeit. Die Wahrscheinlichkeit ist ",
      "falsePositives": "Ein "
    },
    "inadequate-log-data-protection-ops-1-1-5-g5": {
      "title": "Ungenügender Schutz personenbezogener Protokolldaten (BSI OPS.1.1.5.G 5)",
      "description": "Ein unzureichendes Administrationskonzept, eine mangelhafte Umsetzung, übermäßige Aufbewahrungsfristen für Daten oder eine mangelnde Abstimmung mit dem Betriebsrat und dem Datenschutzbeauftragten können zu einem unzureichenden Schutz personenbezogener Protokolldaten führen. Dies könnte die Erstellung von Benutzerprofilen ermöglichen, wodurch Mitarbeiter über die Zeit verfolgt werden können.",
      "impact": "Die unbefugte Erstellung von Benutzerprofilen aus Protokolldaten stellt eine erhebliche Verletzung der Privatsphäre der Mitarbeiter und der Datenschutzvorschriften (z. B. @DataType:PII) dar. Dies kann zu schweren rechtlichen Strafen, erheblichen Bußgeldern und Reputationsschäden führen. Es untergräbt auch das Vertrauen zwischen der Organisation und ihren Mitarbeitern, was sich potenziell auf die Moral und Produktivität auswirken kann.",
      "asvs": "BSI IT-Grundschutz-Kompendium 2023: OPS.1.1.5 Protokollierung (Logging), Gefährdung G 5 ",
      "action": "Ein datenschutzkonformes Protokollierungskonzept erstellen und durchsetzen",
      "mitigation": "Ein umfassendes Protokollierungskonzept in enger Abstimmung mit dem Datenschutzbeauftragten und gegebenenfalls dem Betriebsrat entwickeln. Dieses Konzept muss die Zwecke der Protokollierung klar definieren, genau festlegen, welche Daten gesammelt werden, angemessene und begründete Aufbewahrungsfristen festlegen und strenge, rollenbasierte Zugriffskontrollen für alle Protokolldaten implementieren. Pseudonymisierungs- oder Anonymisierungstechniken anwenden, wo immer der Zweck der Protokollierung dies zulässt. Der gesamte Protokollierungsprozess, von der Erfassung bis zur Löschung, sollte regelmäßig auf Einhaltung überprüft werden.",
      "check": "Gibt es ein dokumentiertes Protokollierungskonzept, das vom Datenschutzbeauftragten genehmigt wurde? Sind die Aufbewahrungsfristen für Daten definiert, technisch durchgesetzt und begründet? Sind die Zugriffsrechte auf Protokolldaten auf der Grundlage eines strikten Need-to-know-Prinzips beschränkt und werden sie regelmäßig überprüft? Gibt es technische Maßnahmen, um eine unbefugte Analyse von Protokolldaten zu verhindern?",
      "detectionLogic": "Dieses Risiko wird für `datastore`-Assets ausgelöst, die `data_asset`-Elemente speichern, die als `@DataType:Logging` getaggt sind. Das Risiko wird als schwerwiegender angesehen, wenn die Protokolldaten eine `confidentiality`-Stufe von `Restricted` oder höher aufweisen, da dies auf das Vorhandensein sensibler oder persönlicher Informationen hinweist.",
      "riskAssessment": "Die Auswirkung eskaliert mit der Vertraulichkeit der gespeicherten Protokolldaten. `Restricted` personenbezogene Daten implizieren eine mittlere Auswirkung, während `Confidential` oder `Strictly Confidential` Daten (wie detaillierte Benutzeraktivitätsprotokolle) zu einer hohen oder sehr hohen Auswirkung führen. Die Wahrscheinlichkeit wird standardmäßig als `Likely` angesehen, da das Fehlen spezifischer, modellierter Kontrollen für Protokolldaten eine höhere Wahrscheinlichkeit von Missbrauch oder unbefugtem Zugriff impliziert.",
      "falsePositives": "Dies kann ein False Positive sein, wenn ein konformes und umfassendes Protokollierungskonzept vorhanden ist, dessen Kontrollen jedoch nicht explizit modelliert sind. Wenn beispielsweise Protokolldaten von einer spezialisierten SIEM- oder Protokollmanagement-Plattform mit robusten, auditierten Zugriffskontrollen und Aufbewahrungsrichtlinien verwaltet werden, kann dieses Risiko als gemindert betrachtet werden, auch wenn es im Modell nicht sichtbar ist. Das Anwenden eines `log-protection-compliant`-Tags auf den Datastore kann diesen Befund unterdrücken."
    },
    "unencrypted-telecommunication-eavesdropping": {
      "title": "Abhören unverschlüsselter Telekommunikation (bezogen auf BSI NET.4.1 / G 0.35)",
      "description": "Wenn Telefonanrufe oder andere sensible Daten unverschlüsselt über ein Telekommunikationssystem (TK-Anlage) übertragen werden, können Angreifer die Kommunikation abhören oder abfangen. Bedrohungen umfassen das Anzapfen von Telefonleitungen, das Abfangen von VoIP-Streams, das Mithören von Telefonanlagen oder das Erfassen unverschlüsselter Datenpakete. Spezifische Risiken entstehen, wenn Voicemail-Systeme Audiodateien per unverschlüsselter E-Mail weiterleiten, was sie leicht abfangbar macht. Zusätzlich können Systemfunktionen (z. B. Anrufüberwachung, ",
      "impact": "Das Abhören von unverschlüsseltem TK-Verkehr beeinträchtigt die Vertraulichkeit und kann Geschäftsgeheimnisse, personenbezogene Daten oder andere sensible Informationen preisgeben. Die Folgen umfassen finanzielle Verluste, Reputationsschäden, rechtliche Haftung und regulatorische Strafen.",
      "asvs": "BSI IT-Grundschutz: G 0.35 Mithören von Nachrichten; NET.4.1 TK-Anlagen; NET.1.2 VoIP, insbesondere NET.1.2.A5 ",
      "action": "Telekommunikationskanäle verschlüsseln und TK-Systeme absichern",
      "mitigation": "Alle TK-bezogene Kommunikation (Sprache, Fax, Voicemail, Signalisierung) mit modernster Kryptografie verschlüsseln (z. B. TLS, SRTP für VoIP, STARTTLS für E-Mail, HTTPS für Web). Telefonanlagen und VoIP-Gateways härten: ungenutzte Funktionen deaktivieren, starke Authentifizierung erzwingen und den Admin-Zugriff einschränken. Sicherstellen, dass Voicemails sowohl bei der Übertragung als auch im Ruhezustand geschützt sind.",
      "check": "Sind alle TK-Kommunikationsprotokolle (VoIP, E-Mail-Weiterleitung, Signalisierung) verschlüsselt? Sind Telefonanlagen/VoIP-Gateways sicher konfiguriert und gehärtet? Sind Voicemail-Nachrichten während der Übertragung und Speicherung geschützt?",
      "detectionLogic": "Die Regel prüft: ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "False Positives sind selten. Nur akzeptabel, wenn der TK-Verkehr über ein vollständig isoliertes, physisch gesichertes Netzwerk (z. B. Air-Gapped) geführt wird. Die Identifizierung von "
    },
    "eavesdropping-via-microphone": {
      "title": "Abhören über Mikrofon in Endgeräten",
      "description": "Mikrofone in Endgeräten können zum Abhören in Räumen ausgenutzt werden. Dies kann auf zwei Hauptwegen geschehen: ",
      "impact": "Unbefugtes Abhören führt zu einer schweren Verletzung der Vertraulichkeit. Sensible Gespräche, Geschäftsgeheimnisse oder persönliche Daten könnten erfasst werden, ",
      "asvs": "OWASP MASVS-PLATFORM-2: Nur die minimal erforderlichen Berechtigungen anfordern. OWASP IoT Top 10: I5 - Mangel an physischer Härtung.",
      "action": "Endgeräte härten, Berechtigungen verwalten und Fernsteuerungsfunktionen absichern",
      "mitigation": "Starke Authentifizierung für jede Funktion implementieren, die Hardware wie Mikrofone fernaktivieren kann. Für mobile oder Client-Anwendungen, ",
      "check": "Gibt es Funktionen, die eine ferngesteuerte, nicht authentifizierte oder schwach authentifizierte Mikrofonaktivierung ermöglichen? Fordern Anwendungen auf dem Gerät Mikrofonberechtigungen an? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Endbenutzer-Clients klassifiziert sind und plausiblerweise über Mikrofone verfügen könnten. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher für Geräte mit bekannten unsicheren Fernsteuerungsfunktionen oder für Anwendungen, die Mikrofonberechtigungen ohne einen klaren, für den Benutzer ersichtlichen Zweck anfordern. ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn das Gerät physisch kein Mikrofon hat, wenn Fernaktivierungsfunktionen ordnungsgemäß mit starker Authentifizierung gesichert sind, "
    },
    "toll-fraud": {
      "title": "Gebührenbetrug (Toll Fraud)",
      "description": "Gebührenbetrug zielt darauf ab, die Kosten für Telekommunikationsdienste (wie Telefonanrufe oder Datenübertragungen) auf einen Dritten abzuwälzen. ",
      "impact": "Die primäre Auswirkung von Gebührenbetrug ist ein direkter finanzieller Verlust für die Organisation. Es kann auch zu einem Denial-of-Service-Zustand führen, wenn alle verfügbaren Kommunikationsleitungen durch betrügerische Anrufe belegt sind, was den legitimen Geschäftsbetrieb stört.",
      "asvs": "BSI IT-Grundschutz Kompendium: NET.4.1 TK-Anlagen",
      "action": "Sichere Konfiguration und Überwachung von Telefoniesystemen",
      "mitigation": "Alle Telefoniesysteme gegen Missbrauch härten. Den Zugriff auf administrative Funktionen und Fernwartungsports einschränken (z. B. über VPN und starke Multi-Faktor-Authentifizierung). ",
      "check": "Sind die Fernwartungsschnittstellen für Telefoniesysteme gesichert? Sind risikoreiche Funktionen wie DISA und unauthentifizierte Anrufweiterleitung deaktiviert? Gibt es eine Richtlinie für die Anrufsperrung und wird sie durchgesetzt? Werden Anrufprotokolle aktiv auf Anzeichen von Betrug überwacht?",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das als `@Category:Telephony`-System getaggt ist. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist für internet-exponierte Telefoniesysteme, insbesondere solche mit schwacher Authentifizierung, deutlich höher. Die Auswirkung wird durch die Geschäftskritikalität (Integrität und Verfügbarkeit) des Telefoniedienstes bestimmt. Ein erfolgreicher Angriff auf ein missionskritisches System hat aufgrund von finanziellem Verlust und Betriebsunterbrechung eine hohe Auswirkung.",
      "falsePositives": "Dieses Risiko wird aufgrund des Vorhandenseins eines "
    },
    "unauthorized-access-to-phonebook-on-public-phones": {
      "title": "Unbefugter Zugriff auf elektronisches Telefonbuch bei öffentlich zugänglichen Telefonen",
      "description": "Telefone, insbesondere solche, die keinem bestimmten Benutzer zugeordnet und in öffentlich zugänglichen Bereichen (z. B. Parkhäuser, Lobbys oder vor Zugangskontrollsystemen) aufgestellt sind, können ein elektronisches Telefonbuch haben. Wenn dieses Telefonbuch interne Kontaktnummern enthält, könnten diese Nummern von unbefugten Personen, wie z. B. Besuchern, exfiltriert werden.",
      "impact": "Das Durchsickern interner Telefonnummern kann Social-Engineering-Angriffe, gezieltes Phishing (Vishing) oder die Belästigung von Mitarbeitern erleichtern. Es legt interne Organisationsstrukturen und Kontaktinformationen gegenüber Unbefugten offen, was ein wertvoller Vorläufer für ausgefeiltere Angriffe sein kann.",
      "asvs": "Abgeleitet von den Prinzipien des BSI IT-Grundschutzes bezüglich der physischen, umgebungsbedingten und komponentenspezifischen Sicherheit.",
      "action": "Zugriff einschränken und Daten auf öffentlich zugänglichen Geräten bereinigen",
      "mitigation": "Telefone in öffentlichen Bereichen sollten keine internen Kontaktverzeichnisse speichern. Wenn dies unumgänglich ist, sollte der Zugriff auf die Telefonbuchfunktion geschützt sein (z. B. mit einer PIN oder einer anderen Authentifizierung). Der physische Zugang zu solchen Geräten sollte nach Möglichkeit kontrolliert werden. Die auf solchen Geräten gespeicherten Daten regelmäßig überprüfen und bereinigen, um nicht wesentliche sensible Informationen zu entfernen. Idealerweise sollten für solche Standorte Telefone ohne lokale Kontaktspeicherfunktion verwendet werden.",
      "check": "Gibt es technische Assets, die Telefone in öffentlich zugänglichen Bereichen repräsentieren? Speichern diese Geräte ein Datenasset, das ein rein internes Kontaktverzeichnis darstellt? Ist der Zugriff auf dieses Verzeichnis eingeschränkt?",
      "detectionLogic": "Dieses Risiko wird für technische Assets erkannt, die als Telefone identifiziert wurden (über den ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn sich ein ungeschütztes Telefon, das interne Kontakte speichert, in einem öffentlichen Bereich befindet. Die Auswirkung hängt direkt von der Vertraulichkeit der Kontaktdaten ab; das Durchsickern eines eingeschränkten internen Verzeichnisses ist schwerwiegender als das eines öffentlich zugänglichen. Die Auswirkung eskaliert, wenn die Telefonnummern Schlüsselpersonal gehören.",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn die Telefonbuchfunktion deaktiviert oder durch eine starke PIN geschützt ist, das Modell diese spezifische Kontrolle jedoch nicht erfasst. Das Modell könnte auch fälschlicherweise annehmen, dass ein Bereich "
    },
    "misconfiguration-voip": {
      "title": "Fehlkonfiguration von VoIP-Komponenten (BSI SYS.3.2.1)",
      "description": "Ein VoIP-basiertes Telefonsystem kann von Fehlkonfigurationen ähnlich wie eine leitungsvermittelte Telefonlösung betroffen sein. ",
      "impact": "Eine Fehlkonfiguration von VoIP-Komponenten kann zu einem vollständigen Ausfall der Telefoninfrastruktur (Verfügbarkeit) führen, ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1 VoIP-Komponenten",
      "action": "Konfigurationsmanagement und Härtung für VoIP-Systeme implementieren",
      "mitigation": "Einen robusten Konfigurations- und Änderungsmanagementprozess für alle VoIP-Komponenten etablieren. ",
      "check": "Gibt es einen dokumentierten Änderungsmanagementprozess für die VoIP-Infrastruktur? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das über den ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Fehlkonfiguration wird als ",
      "falsePositives": "Das Risiko könnte für ein System gemeldet werden, das über eine sehr ausgereifte, automatisierte und getestete Konfigurationsmanagement-Pipeline verwaltet wird, die im Bedrohungsmodell nicht sichtbar ist. "
    },
    "incorrect-voip-compression-configuration": {
      "title": "Falsche VoIP-Kompressionskonfiguration (BSI-Stil)",
      "description": "Unabhängig davon, ob es sich bei VoIP-Komponenten um dedizierte Hardware-Appliances oder softwarebasierte Systeme handelt, ist ihre Konfiguration für die ordnungsgemäße Funktionalität entscheidend. Dies umfasst Einstellungen für die Übertragung von Medienstrom, insbesondere die verwendete Kompressionsmethode. Eine falsch konfigurierte oder ungeeignete Kompressionsmethode kann zu erheblichen Übertragungsproblemen führen.",
      "impact": "Wenn eine ungeeignete Methode mit übermäßiger Kompression verwendet wird, verschlechtert sich oft die Sprachqualität, was die Integrität der Kommunikation beeinträchtigt. Wird umgekehrt eine Methode mit zu geringer Kompression gewählt, wird der Datenstrom nicht ausreichend reduziert, was das Netzwerk überlasten und zu einem Denial of Service (DoS) führen kann, was die Verfügbarkeit beeinträchtigt.",
      "asvs": "Abgeleitet von den Prinzipien des BSI IT-Grundschutzes. Entspricht nicht direkt einem spezifischen ASVS-Punkt, bezieht sich aber auf allgemeine Prinzipien der sicheren Konfiguration, die in V11.1 (Konfiguration) zu finden sind.",
      "action": "VoIP-Komprimierungseinstellungen überprüfen und validieren",
      "mitigation": "Sicherstellen, dass die für VoIP-Medienströme ausgewählten Kompressions-Codecs und Übertragungsmethoden für das Netzwerk geeignet sind.",
      "check": "Sind die VoIP-Codecs und Komprimierungseinstellungen dokumentiert? Wurde die gewählte Konfiguration unter verschiedenen Netzwerklastbedingungen getestet? Gibt es einen Prozess zur Überprüfung und Genehmigung von Änderungen an der VoIP-Konfiguration?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit als VoIP-System getaggt ist. Das Modell kann die spezifische Konfiguration nicht überprüfen, daher dient es als Erinnerung, manuell zu prüfen, ob die Komprimierungseinstellungen optimiert sind, um eine Netzwerküberlastung (Denial of Service) und schlechte Sprachqualität (Integritätsminderung) zu vermeiden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist eine allgemeine Überprüfung der Best Practices. Ein False Positive tritt auf, wenn das VoIP-System bereits korrekt konfiguriert und optimiert ist, was nur durch eine manuelle Überprüfung der Komponente verifiziert werden kann."
    },
    "unencrypted-telephony-voip": {
      "title": "Unverschlüsselte Telefonie / VoIP (basierend auf BSI CON.3)",
      "description": "Wenn Telefonanrufe, VoIP-Anrufe oder zugehörige Daten (wie Voicemail-to-Email) unverschlüsselt übertragen werden, kann ein Angreifer im selben Netzwerksegment die Kommunikation abfangen, abhören und aufzeichnen. Dies gilt insbesondere für VoIP-Medienströme (z. B. mit RTP) in Datennetzen und für Voicemail-Audiodateien, die über unverschlüsselte E-Mail-Protokolle (wie reines SMTP) gesendet werden.",
      "impact": "Das erfolgreiche Abfangen unverschlüsselter Telefonie- oder VoIP-Kommunikation beeinträchtigt die Vertraulichkeit von Gesprächen und allen darin übertragenen Daten. Angreifer erhalten Zugriff auf potenziell sensible oder vertrauliche Informationen, was zu Datenlecks, Spionage und Material für weitere Social-Engineering-Angriffe führt.",
      "asvs": "BSI IT-Grundschutz CON.3 VoIP",
      "action": "Verschlüsselung für alle Telefonie- und VoIP-bezogenen Kommunikationen erzwingen",
      "mitigation": "Alle Kommunikationsverbindungen, die Sprachdaten oder zugehörige Nachrichten (z. B. Voicemail) übertragen, müssen eine starke, moderne Transportverschlüsselung verwenden. Verwenden Sie verschlüsselte Protokolle wie SMTPS/IMAPS (für Voicemail), HTTPS, WSS oder tunneln Sie den Verkehr durch ein sicheres VPN. Für VoIP-spezifische Protokolle stellen Sie sicher, dass sowohl die Signalisierung (wie SIP) als auch die Medien (wie RTP) verschlüsselt sind, z. B. durch die Verwendung von TLS für die Signalisierung und SRTP für die Medienströme. Für die Voicemail-to-Email-Funktionalität muss die Kommunikationsverbindung vom Telefonsystem zum Mailserver ein verschlüsseltes Protokoll verwenden (z. B. SMTP mit STARTTLS).",
      "check": "Überprüfen Sie die Konfiguration aller Telefonsysteme, VoIP-Gateways, Clients und Mailserver. Verwenden alle relevanten Kommunikationsverbindungen verschlüsselte Protokolle? Überprüfen Sie, dass Protokolle wie reines SMTP, FTP oder unverschlüsseltes BINARY/TEXT nicht zur Übertragung von Sprachdaten oder Voicemails verwendet werden. Bestätigen Sie, dass VoIP-Clients so konfiguriert sind, dass sie verschlüsselte Medien (SRTP) bevorzugen oder erfordern.",
      "detectionLogic": "Dieses Risiko wird erkannt, wenn Kommunikationsverbindungen identifiziert werden, die potenziell Telefonie- oder VoIP-Daten ohne Verschlüsselung übertragen. Die Prüfung sucht speziell nach: \n1. Unverschlüsselten Protokollen (wie SMTP), die Daten an einen Mailserver senden, was ein häufiges Muster für Voicemail-to-Email ist. \n2. Technischen Assets, die explizit als `@Service:VoIP` getaggt sind und über generische unverschlüsselte Protokolle wie BINARY oder TEXT kommunizieren, was unverschlüsselte Medienströme darstellen könnte.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist erheblich erhöht, wenn die unverschlüsselte Kommunikation eine Netzwerk-Vertrauensgrenze überschreitet. Die Auswirkung hängt direkt von der Vertraulichkeit der über die Verbindung übertragenen Datenassets ab. Ein Gespräch über einen ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn die unverschlüsselte Kommunikation vollständig innerhalb eines vollständig vertrauenswürdigen und physisch gesicherten Netzwerksegments stattfindet, wo ein Abfangen praktisch unmöglich ist. Die generische Erkennung für BINARY/TEXT-Protokolle könnte Nicht-VoIP-Verkehr markieren, wenn der `@Service:VoIP`-Tag fälschlicherweise auf ein nicht-telefoniebezogenes Asset angewendet wurde."
    },
    "unauthorized-access-via-public-phone-port": {
      "title": "Unbefugter Netzwerkzugriff über öffentlich zugängliches Telefon (BSI NET.4.2)",
      "description": "Vernetzte Geräte, wie VoIP-Telefone, befinden sich manchmal in Bereichen mit uneingeschränktem physischem Zugang (z. B. Lobbys, Druckerräume, Parkhäuser). ",
      "impact": "Eine erfolgreiche Ausnutzung kann zum Verlust sensibler Unternehmensdaten, zur Kompromittierung des Endgeräts und zum unbefugten Zugriff auf interne Netzwerke führen. Dies kann zu weiteren Angriffen, Datenlecks, Dienstunterbrechungen und einer vollständigen Kompromittierung des Netzwerksegments führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.4.2 (VoIP), speziell Abschnitt 2.4 zum Missbrauch öffentlich zugänglicher Telefonanschlüsse. Entspricht den Anforderungen von OWASP ASVS V14.2 (Netzwerksicherheit) für Netzwerksegmentierung und Zugriffskontrolle.",
      "action": "Netzwerkzugangskontrolle und Netzwerksegmentierung für öffentlich zugängliche Geräte implementieren",
      "mitigation": "Platzieren Sie nach Möglichkeit keine vernetzten Geräte in öffentlich zugänglichen Bereichen. Wenn unvermeidbar, wenden Sie mehrschichtige Sicherheitskontrollen an: ",
      "check": "Gibt es vernetzte Geräte (wie VoIP-Telefone) in öffentlich zugänglichen Bereichen? Ist der von ihnen genutzte Netzwerkport durch NAC (z. B. 802.1X) geschützt? Befindet sich das Gerät in einem isolierten, eingeschränkten Netzwerksegment (VLAN)?",
      "detectionLogic": "Diese Regel wird für technische Assets vom Typ ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird aufgrund des einfachen physischen Zugangs als **Sehr Wahrscheinlich** angesehen. Die Auswirkung wird basierend auf der Sensibilität (CIA-Bewertungen) der internen Assets berechnet, mit denen das Gerät verbunden ist. Wenn der Netzwerkport Zugriff auf ein Netzwerk mit missionskritischen Systemen bietet, ist die Auswirkung sehr hoch.",
      "falsePositives": "Dies kann ein False Positive sein, wenn kompensierende Kontrollen wie eine robuste Network Access Control (NAC)-Lösung vorhanden und korrekt konfiguriert sind, die einem unbefugten Gerät den Netzwerkzugriff verwehren würde. Das Modell sollte aktualisiert werden, um dies widerzuspiegeln (z. B. durch Taggen der Kommunikationsverbindung)."
    },
    "lack-of-consumables-for-@AssetType:Fax-or-@AssetType:Printer": {
      "title": "Mangel an Verbrauchsmaterialien für @AssetType:Fax/@AssetType:Printer-Geräte (BSI G 0.6)",
      "description": "Geräte, die physische Ausgaben produzieren, wie @AssetType:Fax-Geräte oder Drucker, sind für ihren Betrieb auf Verbrauchsmaterialien wie Papier und Toner angewiesen. ",
      "impact": "Ein Mangel an Verbrauchsmaterialien führt zu einem Denial-of-Service für das betroffene Gerät. Dies kann Geschäftsprozesse stören, die auf gedruckte Dokumente oder Faxe angewiesen sind. ",
      "asvs": "Abgeleitet von der BSI IT-Grundschutz-Gefährdung G 0.6 (Ausfall von Verbrauchsmaterialien) angewendet auf die Komponente SYS.3.2.1 (@AssetType:Fax-Geräte). Dies ist ein betriebliches Verfügbarkeitsrisiko.",
      "action": "Überwachungs- und Nachschubverfahren für Verbrauchsmaterialien implementieren",
      "mitigation": "Einen Prozess zur regelmäßigen Überwachung der Füllstände aller notwendigen Verbrauchsmaterialien (Papier, Toner usw.) für abhängige Geräte etablieren. ",
      "check": "Gibt es einen dokumentierten Prozess zur Überwachung und zum Nachschub von Verbrauchsmaterialien? Sind für diese Aufgabe Mitarbeiter zugewiesen? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit mit dem Tag `@consumable-dependent` gekennzeichnet ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn die Organisation ein sehr zuverlässiges, automatisiertes und getestetes Nachschubsystem für Verbrauchsmaterialien hat. "
    },
    "insecure-unreliable-@AssetType:Fax-transmission": {
      "title": "Unsichere oder unzuverlässige @AssetType:Fax-Übertragung",
      "description": "@AssetType:Fax-Übertragungen über herkömmliche Netzwerke (wie das öffentliche Telefonnetz) sind anfällig für verschiedene Ausfälle. ",
      "impact": "Fehler bei der @AssetType:Fax-Übertragung können zu fehlerhaften Geschäftsentscheidungen aufgrund falscher oder fehlender Informationen führen, was zu Betriebsverzögerungen und potenziellen finanziellen Schäden führt. Die Fehllieferung von Faxen kann zu einer Verletzung der Vertraulichkeit führen, was Reputationsschäden, Wettbewerbsnachteile und die Nichteinhaltung von Datenschutzbestimmungen (wie @DataType:PII) zur Folge hat.",
      "asvs": "BSI IT-Grundschutz: SYS.3.2.1 @AssetType:Fax Server (Gefährdungen T 2.50 Fehlerhafte Übertragung von @AssetType:Fax-Dokumenten & T 2.51 Fehlerhaftes Versenden von @AssetType:Fax-Dokumenten)",
      "action": "@AssetType:Fax-Übertragungen sichern, überwachen und überprüfen",
      "mitigation": "Für sensible Daten ersetzen Sie das traditionelle Faxen durch sicherere, überprüfbare elektronische Kommunikationsmethoden. Wenn Faxen unvermeidbar ist, verwenden Sie verschlüsselte @AssetType:Fax-over-IP (FoIP)-Lösungen. Implementieren Sie strenge Verfahren zur Verwaltung von @AssetType:Fax-Server-Adressbüchern und zum Senden hochsensibler Dokumente (z. B. Vier-Augen-Prinzip). Implementieren Sie Überwachung und Alarmierung bei Übertragungsfehlern. Etablieren Sie einen Prozess, bei dem Absender den erfolgreichen und korrekten Empfang kritischer Faxe überprüfen.",
      "check": "Sind @AssetType:Fax-Übertragungen verschlüsselt? Gibt es eine Überwachung und Alarmierung bei fehlgeschlagenen Übertragungen? Gibt es formale Verfahren zur Verwaltung von @AssetType:Fax-Adressbüchern und zur Überprüfung des Empfangs sensibler Dokumente?",
      "detectionLogic": "Identifiziert Kommunikationsverbindungen zu oder von technischen Assets, die als `@AssetType:Fax-related` getaggt sind und unverschlüsselte Protokolle zur Datenübertragung verwenden. Die Risikostufe wird durch die Sensibilität der übertragenen Datenassets bestimmt.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell kann nicht feststellen, ob kompensierende Kontrollen außerhalb des Bandes existieren, wie z. B. ein Absender, der den Empfänger manuell anruft, um den Empfang zu bestätigen. Eine Verbindung könnte auch eine moderne, sichere FoIP-Lösung sein, die fälschlicherweise mit einem generischen oder unverschlüsselten Protokoll modelliert ist."
    },
    "manipulation-of-@AssetType:Fax-address-books": {
      "title": "Manipulation von @AssetType:Fax-Adressbüchern und Verteilerlisten",
      "description": "In @AssetType:Fax-Geräten oder @AssetType:Fax-Servern (oft in Groupware integriert) werden Adressbücher und Verteilerlisten zur Speicherung von Empfängernummern verwendet. ",
      "impact": "Die Manipulation von @AssetType:Fax-Adressbüchern kann zu einer Verletzung der Vertraulichkeit führen, wenn sensible Dokumente an falsche Empfänger gesendet werden. ",
      "asvs": "ASVS V4.0.3 - 4.1 Access Control",
      "action": "Strikte Zugriffskontrolle und Überwachung für Adressbücher implementieren",
      "mitigation": "Änderungsberechtigungen für @AssetType:Fax- und Groupware-Adressbücher nur auf autorisiertes Personal beschränken. ",
      "check": "Sind die Berechtigungen zur Änderung von @AssetType:Fax-/Groupware-Adressbüchern streng kontrolliert? Gibt es einen Audit-Trail für alle Änderungen mit Alarmen bei Massenänderungen? Sind die Benutzer über das Risiko des Fehlversands von Faxen informiert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Mail-/@AssetType:Fax-Server oder als eigenständiges Kommunikationsgerät (wie ein IoT-Gerät, das ein @AssetType:Fax-Gerät darstellt) fungieren ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit der vom Asset verarbeiteten Daten und die höchsten Verfügbarkeitsanforderungen bestimmt. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn robuste, nicht-technische Kontrollen (wie ein obligatorisches Vier-Augen-Prinzip für alle Adressbuchänderungen) vorhanden sind, die nicht modelliert werden können."
    },
    "unprotected-shared-@AssetType:Fax-machine": {
      "title": "Ungeschütztes gemeinsames @AssetType:Fax-Gerät (BSI-basiert)",
      "description": "In vielen Organisationen werden @AssetType:Fax-Geräte aus wirtschaftlichen Gründen von mehreren Benutzern gemeinsam genutzt. ",
      "impact": "Wenn vertrauliche oder streng vertrauliche Informationen über ein physisch ungesichertes @AssetType:Fax-Gerät empfangen werden, ",
      "asvs": "Abgeleitet vom Prinzip des BSI IT-Grundschutz-Katalogs bezüglich der physischen Sicherheit gemeinsam genutzter Bürogeräte (CON.1).",
      "action": "Physische und prozedurale Kontrollen für @AssetType:Fax-Geräte implementieren",
      "mitigation": "@AssetType:Fax-Geräte, die sensible Informationen empfangen, in einem sicheren, zugangskontrollierten Raum aufstellen. ",
      "check": "Befinden sich @AssetType:Fax-Geräte, die sensible Daten verarbeiten, in physisch sicheren Bereichen? Ist der Zugang zu diesen Geräten protokolliert oder eingeschränkt? ",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das als @AssetType:Fax-Gerät (über den `@AssetType:Fax`-Tag) identifiziert wird und Datenassets mit der Einstufung ",
      "riskAssessment": "Die Auswirkung wird basierend auf der höchsten Vertraulichkeit der vom @AssetType:Fax-Gerät empfangenen Daten berechnet. Die Ausnutzungswahrscheinlichkeit wird als ",
      "falsePositives": "Ein False Positive könnte auftreten, wenn das Modell die physische Sicherheit des @AssetType:Fax-Geräts nicht genau darstellt."
    },
    "remnant-data-on-@AssetType:Fax-systems": {
      "title": "Datenrückstände auf @AssetType:Fax-Systemen (BSI SYS.2.5.A10)",
      "description": "Abhängig vom technischen Prozess, den @AssetType:Fax-Systeme zur Speicherung, Verarbeitung oder zum Drucken von Informationen verwenden, können nach dem Senden oder Empfangen von Faxen Datenrückstände auf dem Gerät verbleiben. ",
      "impact": "Wenn Datenrückstände von @AssetType:Fax-Übertragungen nicht ordnungsgemäß bereinigt werden, kann dies zu einer Verletzung der Vertraulichkeit führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.2.5 (@AssetType:Fax- und Multifunktionsgeräte), insbesondere Anforderung SYS.2.5.A10 (Sicheres Löschen von Informationen).",
      "action": "Sichere Datenbereinigungsverfahren implementieren und durchsetzen",
      "mitigation": "Für @AssetType:Fax-Server verschlüsselte Dateisysteme verwenden und sicherstellen, dass temporäre Dateien und abgeschlossene Aufträge mit kryptografisch starken Löschmethoden sicher gelöscht werden. ",
      "check": "Sind @AssetType:Fax-Server so konfiguriert, dass sie temporäre Dateien und Daten aus Swap-/Paging-Dateien sicher löschen? Verfügen physische @AssetType:Fax-Geräte über aktivierte, zertifizierte Datenbereinigungsfunktionen? Gibt es einen formalen, auditierten Prozess für die Außerbetriebnahme von Hardware, die sensible Daten enthält?",
      "detectionLogic": "Dieses Risiko wird für Assets ausgelöst, die als @AssetType:Fax-Server oder physisches @AssetType:Fax-/Multifunktionsgerät fungieren könnten, wie z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn das Asset ein moderner cloud-basierter @AssetType:Fax-Dienst ist, der die Datenbereinigung vertraglich garantiert, oder wenn das spezifische Gerätemodell standardmäßig zertifizierte sichere Löschfunktionen aktiviert hat, was im Bedrohungsmodell nicht erfasst ist."
    },
    "spoofed-or-tampered-@AssetType:Fax": {
      "title": "Gefälschte oder manipulierte @AssetType:Fax-Kommunikation",
      "description": "@AssetType:Fax-Übertragungen sind ein gängiges Medium zum Versenden von Dokumenten, die eine Unterschrift tragen müssen, um gültig zu sein. Genauso wie jedoch ein falscher Absender mit gefälschtem Namen und Briefkopf vorgetäuscht werden kann, kann auch eine @AssetType:Fax-Übertragung manipuliert werden. Beispielsweise können Unterschriften von anderen Dokumenten gescannt und auf das @AssetType:Fax-Dokument kopiert werden. Im Allgemeinen ist es unmöglich zu erkennen, ob eine Unterschrift echt geleistet wurde oder nur eine reproduzierte Grafikdatei ist.",
      "impact": "Schäden entstehen, wenn Empfänger die darin enthaltenen Informationen als authentisch oder sogar rechtlich bindend ansehen. Dies beeinträchtigt die Integrität und Authentizität der übertragenen Daten und kann zu finanziellen Verlusten, unbefugten Handlungen oder Rechtsstreitigkeiten führen.",
      "asvs": "N/A (BSI-abgeleitete Empfehlung). Das Risiko bezieht sich auf die inhärente Schwäche des @AssetType:Fax-Mediums selbst, die nicht direkt von einer einzelnen ASVS-Kontrolle abgedeckt wird. Verwandte Konzepte fallen unter die Überprüfung der Datenauthentizität (ASVS V4.2).",
      "action": "Sicherere Alternativen für rechtlich bindende Dokumente verwenden",
      "mitigation": "Für Dokumente, die eine rechtlich bindende Unterschrift erfordern, ersetzen Sie @AssetType:Fax-Übertragungen durch sicherere Methoden wie qualifizierte elektronische Signaturen (QES) oder sichere Dokumentenportale mit starker Authentifizierung. Wenn @AssetType:Fax verwendet werden muss, implementieren Sie einen sekundären Out-of-Band-Verifizierungsprozess (z. B. einen Anruf beim Absender), um die Authentizität kritischer oder hochwertiger Faxe zu bestätigen, bevor darauf reagiert wird. Definieren Sie in Richtlinien klar, welche Arten von Informationen nicht per @AssetType:Fax gesendet oder akzeptiert werden dürfen.",
      "check": "Gibt es Richtlinien, die die akzeptable Nutzung von @AssetType:Fax für sensible oder rechtlich bindende Dokumente definieren? Steht eine sicherere Alternative für solche Dokumente zur Verfügung und ist diese vorgeschrieben? Wenn Faxe immer noch für kritische Transaktionen verwendet werden, gibt es einen obligatorischen Out-of-Band-Verifizierungsprozess?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das über den `@AssetType:Fax-gateway`-Tag als @AssetType:Fax-System identifiziert wird. Das Risiko gilt für das Asset selbst und alle von ihm verarbeiteten Datenassets, da die Integrität der Kommunikation nicht garantiert werden kann.",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Dies kann als False Positive angesehen werden, wenn das @AssetType:Fax-System ausschließlich für nicht-sensible, nicht-bindende Informationen verwendet wird, bei denen eine Fälschung keine signifikanten Auswirkungen hat, und dies durch eine Richtlinie durchgesetzt wird."
    },
    "insufficient-personnel-capacity-it-operations": {
      "title": "Ungenügende Personalkapazität im IT-Betrieb",
      "description": "Das Personal im IT-Betrieb ist für die Funktionsfähigkeit der gesamten IT-Infrastruktur verantwortlich, ohne die eine Organisation oft nicht arbeiten kann. IT-Systeme sind besonders anfällig, wenn dem IT-Betrieb nicht genügend Kapazitäten zur Verfügung stehen. ",
      "impact": "Das Versäumnis, betriebliche Prozesse aufgrund von Personalmangel oder Wissenssilos ordnungsgemäß auszuführen, kann zu schweren Dienstunterbrechungen (Verfügbarkeit) führen. Es kann auch die Sicherheitslage verschlechtern, da Aufgaben wie Überwachung, Patching und Incident Response vernachlässigt werden, was die Vertraulichkeit und Integrität beeinträchtigt. Dies kann zu Betriebsausfällen, Datenlecks und der Nichteinhaltung von Service Level Agreements führen.",
      "asvs": "BSI IT-Grundschutz: ORP.2 Personal (insb. A5 Vertretungsregelungen) und OPS.1.1 Allgemeiner IT-Betrieb (insb. A5 Ausreichende personelle Ressourcen, A15 Umgang mit Betriebsstörungen und -ausfällen).",
      "action": "Ausreichende Personalkapazität und Know-how-Redundanz sicherstellen",
      "mitigation": "Einen strategischen Personalkapazitätsplan für den IT-Betrieb entwickeln und pflegen. Robuste Vertretungsregelungen für alle kritischen Betriebsrollen implementieren, um Single Points of Failure zu vermeiden. ",
      "check": "Gibt es einen dokumentierten Kapazitätsplan für den IT-Betrieb? Gibt es definierte und getestete Vertretungspläne für Schlüsselpersonal im Betrieb? Gibt es Nachweise für Cross-Training-Programme für das Betriebsteam? Sind kritische Betriebsverfahren gut dokumentiert und zugänglich?",
      "detectionLogic": "Dieses organisatorische Risiko für technische Assets auslösen, die (a) betriebliche Rollen-Tags wie ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsanforderungen des betroffenen Assets bestimmt. Ein für den Geschäftsbetrieb kritisches Asset (",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und wird aus technischen Attributen abgeleitet. Eine Organisation könnte eine ausgezeichnete Personalplanung und Vertretungsregelungen haben, die im Bedrohungsmodell nicht sichtbar sind, was dies zu einem False Positive machen würde. Die Überprüfung erfordert die Prüfung der Organisation."
    },
    "insufficient-it-operations-documentation": {
      "title": "Ungenügende Dokumentation des IT-Betriebs (BSI-basiert)",
      "description": "Wenn IT-Betriebsaktivitäten auf unzureichender, veralteter oder manipulierter Dokumentation beruhen, können sie schwere Störungen verursachen. Dies umfasst falsche Incident Response, Konfigurationsfehler und Verzögerungen bei der Wartung. Ohne ordnungsgemäße Dokumentation kann Betriebswissen verloren gehen und die Fähigkeit zur Verwaltung und Sicherung von IT-Systemen wird gemindert. Ursachen sind mangelnde Koordination mit Dienstleistern, schlecht definierte Dokumentationsprozesse oder das Versäumnis, die Dokumentation aktuell zu halten.",
      "impact": "Direkte Konsequenzen sind Störungen der IT-Funktionalität und falsche oder verzögerte Störungsbehebung, was primär die Verfügbarkeit und Integrität betrifft. Wenn sensible Konfigurationsdetails (wie Anmeldeinformationen oder Architekturschwächen) Teil einer schlecht gesicherten Dokumentation sind, ist auch die Vertraulichkeit gefährdet. Letztendlich kann dies zu Systemausfällen, Datenverlust oder -beschädigung und Sicherheitsverletzungen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Modul OPS.1.1.2 (Administration), insbesondere den Anforderungen A5 (Erstellung von Administrationsdokumentation) und A6 (Pflege von Administrationsdokumentation).",
      "action": "Umfassende und sichere IT-Betriebsdokumentation erstellen und pflegen",
      "mitigation": "Eine Richtlinie für die IT-Betriebsdokumentation erstellen und durchsetzen. Die Dokumentation muss umfassend, aktuell und sicher mit angemessenen Zugriffskontrollen gespeichert sein. Sie sollte Systemadministration, Konfiguration, Verfahren zur Störungsbehebung und Abhängigkeiten abdecken. Klare Vereinbarungen mit externen Dienstleistern über ihre Dokumentationspflichten sicherstellen. Die Dokumentation regelmäßig auf Richtigkeit und Vollständigkeit überprüfen und auditieren.",
      "check": "Gibt es einen dokumentierten Prozess zur Erstellung, Pflege und Speicherung der IT-Betriebsdokumentation? Ist die Dokumentation für kritische Systeme vollständig, korrekt und wird sie regelmäßig überprüft? Sind Zugriffskontrollen für das Dokumentationssystem vorhanden und werden sie durchgesetzt? Basieren die Incident-Response-Playbooks auf dieser Dokumentation?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das für alle technischen Assets gilt, die ein operatives Management erfordern. Das Risiko wird für alle im Geltungsbereich befindlichen, nicht-clientseitigen, serverseitigen Assets ausgelöst. Die Auswirkung wird basierend auf dem Asset bewertet.",
      "riskAssessment": "Die Wahrscheinlichkeit ist oft ",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und kann nicht allein durch ein technisches Modell vollständig verifiziert werden. Die Organisation kann eine ausgezeichnete, aktuelle Dokumentation in einem separaten System haben, das für das Modell nicht sichtbar ist. Die Überprüfung erfordert die Auditierung der tatsächlichen Betriebsdokumentation und -prozesse."
    },
    "inadequate-operational-resources": {
      "title": "Unzureichende Betriebsmittel (BSI OPS.1.1.A10)",
      "description": "Betriebsmittel, die alle IT-Komponenten umfassen, die zur Durchführung von IT-Betriebsaufgaben verwendet werden (z. B. Build-Server, Überwachungssysteme, Container-Plattformen), sind für das effiziente und sichere Funktionieren von IT-Prozessen von entscheidender Bedeutung. ",
      "impact": "Die Nichtverfügbarkeit kritischer Betriebsmittel kann die rechtzeitige Behebung von Fehlern oder die Bereitstellung von Sicherheitsupdates für die verwalteten IT-Komponenten verhindern. ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.A10 Hochverfügbarkeit von Komponenten für den IT-Betrieb",
      "action": "Redundanz und Härtung der Betriebsmittel sicherstellen",
      "mitigation": "Die Betriebsinfrastruktur mit der gleichen Kritikalität wie die von ihr verwalteten Geschäftssysteme behandeln. ",
      "check": "Sind alle technischen Assets mit `usage: devops` oder entwicklungsrelevanten Technologien (Build-Pipelines, Repositories) im Modell als `redundant: true` konfiguriert? ",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die für betriebliche oder Entwicklungszwecke verwendet werden (`usage: devops` oder Technologien wie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jedes nicht-redundante Betriebssystem als hoch angesehen, da Single Points of Failure anfällig für Störungen sind. ",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn die Redundanz durch Mechanismen erreicht wird, die im Modell nicht erfasst sind, wie z. B. Cloud-native Auto-Healing, Auto-Scaling-Gruppen oder ein dokumentierter und getesteter manueller Failover-Plan, der die Verfügbarkeitsanforderungen erfüllt."
    },
    "abuse-of-privileged-rights-by-operations-personnel": {
      "title": "Missbrauch privilegierter Rechte durch Betriebspersonal (OPS.1.1.1)",
      "description": "Privilegierte Rechte des Betriebspersonals (Admins, Dienstleister und ähnliche Rollen) können die gesamte IT-Landschaft beeinflussen. Wenn diese Rechte – absichtlich oder unter Zwang – zur Sabotage, Manipulation oder Spionage missbraucht werden, sind alle zentralen Sicherheitsziele (Vertraulichkeit, Integrität, Verfügbarkeit) für die betriebenen Komponenten und institutionellen Daten gefährdet. Typische Ursachen sind zu weitreichende Berechtigungen, schlechtes Offboarding, fehlende Funktionstrennung oder die Verwendung von gemeinsam genutzten/Notfall-Konten.",
      "impact": "Der Missbrauch von privilegiertem Zugriff kann Datenexfiltration, Integritätsverlust kritischer Konfigurationen und Dienstausfälle über mehrere Systeme hinweg auslösen. Der Explosionsradius erstreckt sich in der Regel über ganze Plattformen und Umgebungen, was zu finanziellen, rechtlichen und Reputationsschäden führt.",
      "asvs": "Angelehnt an BSI IT-Grundschutz OPS.1.1.1 (Allgemeiner IT-Betrieb) – insbesondere A2 (Rollen/Berechtigungen), A12 (klare Betriebsprozesse), A13 (Absicherung Betriebsmittel/Dokumentation), A21 (Einbindung ins Sicherheitsmonitoring) – und ORP.4 (Identitäts- & Zugriffsmanagement).",
      "action": "Prinzip der geringsten Rechte, Funktionstrennung und starkes Privileged Access Management (PAM) durchsetzen",
      "mitigation": "PoLP und rollenbasierten Zugriff mit strikter Trennung zwischen administrativen und nicht-administrativen Aufgaben implementieren. PAM mit Just-in-Time-Erhöhung, MFA, Sitzungsaufzeichnung und Genehmigungsworkflows verwenden. Gemeinsam genutzte/Gruppen-Admin-Konten eliminieren; individuelle, benannte Identitäten verwenden. Schnelles De-Provisioning beim Offboarding und regelmäßige Rezertifizierung von Rechten sicherstellen. Alle privilegierten Operationen protokollieren und kontinuierlich überprüfen.",
      "check": "Sind privilegierte Rollen minimal und getrennt (SoD)? Sind gemeinsam genutzte/Notfall-Konten verboten oder streng geregelt? Werden Admin-Aktionen auditiert und überprüft? Werden Offboarding und regelmäßige Zugriffsrezertifizierungen durchgesetzt? Wird PAM mit MFA und JIT für alle hochwertigen Assets verwendet?",
      "detectionLogic": "Markiert technische Assets, die mit privilegierten Rollen (z. B. `@Role:Administrator`, `@Role:SystemAdministrator`, `@Role:ExternalServiceProvider`, `@Role:ITSecurityOfficer`) oder mit `account-type:shared-privileged-account` getaggt sind. Behandelt mandantenfähige und hochwertige Assets als Assets mit höherer Auswirkung. Stärkere Signale berücksichtigen, wenn Tags wie `break-glass`, `no-PAM` oder `no-audit` zusammen auftreten.",
      "riskAssessment": "Die Wahrscheinlichkeit ist typischerweise hoch, wenn dauerhafter privilegierter Zugriff ohne starkes PAM oder Auditing besteht. Die Auswirkung skaliert mit der Vertraulichkeit und Missionskritikalität des Assets; die Kompromittierung von missionskritischen, mandantenfähigen oder Plattform-Assets führt zu sehr hoher Auswirkung.",
      "falsePositives": "Geringeres Risiko, wo kompensierende Kontrollen existieren – z. B. robustes PAM mit Sitzungsüberwachung, JIT-Erhöhung, MFA, unveränderlichen Audit-Protokollen und häufigen Zugriffsüberprüfungen. Auch weniger relevant für streng OT/isolierte Systeme, wenn sie mit entsprechenden Einschränkungen und Überwachung modelliert werden."
    },
    "inadequate-physical-access-control-inf1": {
      "title": "Ungenügende physische Zugangskontrolle (BSI INF.1)",
      "description": "Wenn ein unzureichender Schutz gegen unbefugten physischen Zugang zu Räumlichkeiten besteht, in denen sich IT-Ausrüstung befindet, kann dies als Ausgangspunkt für jede Art von Angriff oder Missbrauch genutzt werden. ",
      "impact": "Unbefugter physischer Zugang kann zu Hardware-Diebstahl, Manipulation von Systemen, Installation von bösartiger Hardware oder Software und unbefugtem Zugriff auf sensible Daten direkt von der Konsole aus führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein INF.1 (Allgemeines Gebäude), Anforderung INF.1.A1 (Zutrittskontrolle).",
      "action": "Physische Zugangskontrollen implementieren und durchsetzen",
      "mitigation": "Mehrschichtige physische Sicherheitskontrollen für alle Bereiche implementieren, die kritische IT-Assets enthalten. Dazu gehören verschlossene Türen, elektronische Zugangskontrollsysteme mit Protokollierung, Überwachungskameras und Richtlinien für den Besucherzugang. Server-Racks sollten einzeln verschlossen sein. ",
      "check": "Sind Serverräume und Rechenzentren physisch mit Zugangskontrollen gesichert? Ist der Zugang auf autorisiertes Personal beschränkt und wird er protokolliert? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die sich innerhalb physischer Vertrauensgrenzen befinden (z. B. On-Premises Data Center, Dedicated Hoster) und nicht explizit als mit angemessenen physischen Zugangskontrollen versehen gekennzeichnet sind. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als hoch angesehen, wenn keine physischen Sicherheitsmaßnahmen für eine On-Premises- oder dedizierte Hosting-Umgebung modelliert sind. ",
      "falsePositives": "Ein Modell repräsentiert möglicherweise nicht alle vorhandenen physischen Sicherheitskontrollen vollständig. Das Fehlen eines Tags bedeutet nicht definitiv, dass die Kontrolle in der Realität fehlt. "
    },
    "social-engineering-against-it-operations": {
      "title": "Social Engineering gegen den IT-Betrieb (Spoofing)",
      "description": "Wenn interne oder externe Personen dem IT-Betriebspersonal absichtlich falsche Informationen präsentieren, zum Beispiel durch fälschliches Vortäuschen einer autorisierten Person (Spoofing), ",
      "impact": "Ein erfolgreicher Social-Engineering-Angriff auf den IT-Betrieb kann alle primären Schutzziele gefährden. Administratoren könnten dazu verleitet werden, Sicherheitskontrollen zu deaktivieren, ",
      "asvs": "V2.2.1 (MFA), V1.4.2 (Awareness Training)",
      "action": "Starke Authentifizierung und Verifizierung für administrative Aktionen implementieren",
      "mitigation": "Alle administrativen Zugriffe mit Multi-Faktor-Authentifizierung (MFA) schützen. ",
      "check": "Sind alle administrativen Schnittstellen und Aktionen durch MFA geschützt? Gibt es klare, zwingende Verfahren zur Überprüfung sensibler Anfragen von Benutzern oder anderen Administratoren? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die von administrativen Rollen verwaltet werden und Kommunikation von potenziell unzuverlässigen Quellen erhalten (z. B. dem Internet, allgemeinen Endbenutzersystemen) ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn administrative Assets von unzuverlässigen Netzwerken oder Systemen mit nur Ein-Faktor-Authentifizierung (z. B. Benutzername/Passwort) erreichbar sind. ",
      "falsePositives": "Das Modell ist sich möglicherweise nicht bewusst über mildernde Kontrollen außerhalb des Bandes, wie z. B. ein separates, obligatorisches Telefonanruf-Verifizierungsverfahren für alle administrativen Aktionen, was das tatsächliche Risiko senken würde. "
    },
    "disruption-of-it-operations": {
      "title": "Störung des IT-Betriebs (BSI-basiert)",
      "description": "Wenn die Aktivitäten des IT-Betriebs blockiert oder nicht ordnungsgemäß ausgeführt werden, können die Verfügbarkeit und Integrität der gesamten IT-Infrastruktur beeinträchtigt werden. Dies kann durch verschiedene Faktoren verursacht werden, einschließlich unzureichend entworfener oder beschaffter IT-Komponenten, die schwer zu betreiben sind, schlechter Prozessplanung mit unklaren Schnittstellen oder Verantwortlichkeiten und falscher Ausführung von Aufgaben durch das Betriebspersonal aufgrund unzureichenden Know-hows oder unklarer Vereinbarungen mit Dienstleistern.",
      "impact": "Eine Störung im IT-Betrieb kann zu einer erheblichen Verringerung der Verfügbarkeit und Integrität geschäftskritischer Systeme führen. Dies kann Geschäftsprozesse zum Stillstand bringen, zu Dateninkonsistenzen führen und die Bereitstellung von Dienstleistungen für Kunden verhindern, was zu finanziellen und reputativen Schäden führt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.1 (IT-Betrieb) und OPS.1.1.2 (Behandlung von IT-Problemen und Störungen).",
      "action": "Robusten IT-Betrieb etablieren und aufrechterhalten",
      "mitigation": "Sicherstellen, dass IT-Komponenten mit Blick auf die Operabilität beschafft und entworfen werden (z. B. adäquate Überwachung, Konfiguration und Redundanz). Klare Betriebsprozesse, Schnittstellen und Verantwortlichkeiten definieren, insbesondere für die Interaktionen zwischen verschiedenen Teams und mit externen Dienstleistern. Dem Betriebspersonal angemessene Schulungen und Dokumentationen für alle relevanten Betriebsprozesse und Systeme zur Verfügung stellen. Einen robusten Überwachungs- und Incident-Management-Prozess implementieren, um betriebliche Probleme schnell zu erkennen und darauf zu reagieren.",
      "check": "Werden betriebliche Anforderungen (wie Überwachung und Redundanz) bei der Beschaffung und Entwicklung berücksichtigt? Sind Betriebsprozesse und Verantwortlichkeiten klar dokumentiert? Gibt es ein laufendes Schulungsprogramm für das Betriebspersonal? Sind Schnittstellen zu externen Dienstleistern klar definiert und gesichert?",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung gängiger Indikatoren für schlechte betriebliche Bereitschaft und Planung erkannt. Dazu gehören: kritische Betriebs-Assets ohne Redundanz; Assets, die von Betriebspersonal verwaltet werden (was auf eine Abhängigkeit von menschlichen Prozessen hindeutet); unsichere oder undefinierte Kommunikationsverbindungen zwischen betrieblichen Komponenten oder mit externen Dienstleistern.",
      "riskAssessment": "Die Auswirkung wird durch die Kritikalität (Verfügbarkeit und Integrität) der betroffenen Assets bestimmt. Ein Mangel an Redundanz für eine missionskritische Datenbank hat eine sehr hohe Auswirkung. Die Wahrscheinlichkeit wird für konkrete Befunde wie unsichere Schnittstellen oder einen Mangel an Redundanz als höher angesehen, und mittel für organisatorische Risiken wie die Abhängigkeit vom Know-how des Personals.",
      "falsePositives": "Das Modell identifiziert potenzielle Schwächen basierend auf deklarierten Eigenschaften. Ein System könnte im Modell als nicht-redundant gelten, aber Hochverfügbarkeitsmechanismen auf einer niedrigeren, nicht modellierten Ebene haben. Eine unauthentifizierte Verbindung könnte durch netzwerkseitige Kontrollen geschützt sein, die im Modell nicht sichtbar sind."
    },
    "unclear-admin-responsibilities-ism2.2": {
      "title": "OPS.1.1.2: Unklare oder fehlende Regelungen für Verantwortlichkeiten in der IT-Administration",
      "description": "Die IT-Administration umfasst vielfältige Aufgaben an vielen Komponenten. Sind die Verantwortlichkeiten und Prozesse nicht definiert oder den zuständigen Mitarbeitern nicht bekannt, können erhebliche Sicherheitslücken entstehen. ",
      "impact": "Alle drei Schutzsäulen können kompromittiert werden. Die Verfügbarkeit kann reduziert oder eliminiert werden, die Vertraulichkeit kann durch übermäßige Rechte verletzt und die Integrität durch Fehlkonfigurationen geschädigt werden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz (OPS.1.1.2 Ordnungsgemäße IT-Administration). Verwandte Grundlagen umfassen ORP.4.A6 (Funktionstrennung), ORP.4.A13 (Regeln für die Administration) und ORP.4.A14 (Zuweisung von Zugriffsrechten).",
      "action": "Klare Rollen und Verantwortlichkeiten für die IT-Administration definieren, dokumentieren und durchsetzen.",
      "mitigation": "Verantwortlichkeiten und Prozesse für alle Administrationsaufgaben festlegen und dokumentieren. Administrative Privilegien streng nach dem Prinzip der geringsten Rechte vergeben und die Funktionstrennung durchsetzen. ",
      "check": "Sind die Admin-Rollen und -Verantwortlichkeiten dokumentiert und kommuniziert? Gibt es einen formalen Genehmigungsprozess für die Vergabe von Admin-Rechten? Wird die Funktionstrennung durchgesetzt? Werden die Admin-Berechtigungen regelmäßig überprüft?",
      "detectionLogic": "Erkennt im Geltungsbereich befindliche, nicht-clientseitige, nicht-externe technische Assets mit eingehenden Kommunikationsverbindungen von Assets, die mit administrativen Rollen getaggt sind (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird auf ",
      "falsePositives": "Modelle können einen administrativen Zugriff auf ein kritisches System finden, auch wenn die Verfahren gut definiert sind. Eine organisatorische Überprüfung ist zur Bestätigung erforderlich."
    },
    "human-error-in-administration": {
      "title": "Menschliches Versagen in der IT-Administration (BSI OPS.1.1.2 / G 0.14)",
      "description": "Menschliche Fehler können nie vollständig ausgeschlossen werden und können in der IT-Administration weitreichende Folgen haben. ",
      "impact": "Ein administrativer Fehler kann zu Fehlkonfigurationen führen, die die Systemsicherheit gefährden, Dienstunterbrechungen verursachen oder zu Datenlecks führen. ",
      "asvs": "Dies ist ein organisatorisches und operatives Risiko. Verwandte ASVS-Kontrollen umfassen V1 ",
      "action": "Administrative Prozesse und Kontrollen härten: Prinzip der geringsten Rechte durchsetzen, Änderungsmanagement mit Peer-Review, MFA für Admin-Zugriff, umfassende Protokollierung/Alarmierung und dedizierte, gehärtete Admin-Arbeitsplätze.",
      "mitigation": "Um die Wahrscheinlichkeit und die Auswirkungen administrativer Fehler zu reduzieren, eine Kombination aus technischen und prozeduralen Kontrollen implementieren. Dazu gehören: ",
      "check": "Werden administrative Aktionen protokolliert und überprüft? Gibt es einen formellen Änderungsmanagementprozess für kritische Systeme? ",
      "detectionLogic": "Dieses Risiko gilt für jedes technische Asset, das einer administrativen Handlung unterliegt. Es wird ausgelöst, wenn ein Asset administrative Rollen-Tags trägt (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit menschlichen Versagens wird als ",
      "falsePositives": "Ein Modell kann prozedurale Kontrollen nicht sehen. Eine Organisation könnte ein ausgezeichnetes Änderungsmanagement, Peer-Reviews und Automatisierung haben, die die reale Wahrscheinlichkeit eines schädlichen Fehlers erheblich reduzieren. "
    },
    "disruption-by-it-administration-bsi-ops": {
      "title": "Störung durch IT-Administrationsaktivitäten (BSI-bezogen)",
      "description": "Auch wenn IT-Administrationsaufgaben fehlerfrei durchgeführt werden, können sie dennoch die Institution stören.",
      "impact": "Die Störung von IT-Diensten aufgrund administrativer Aktivitäten kann zu einem Verlust der Verfügbarkeit für kritische Geschäftsfunktionen führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.5 (Patch- und Änderungsmanagement), Anforderung A 6 ",
      "action": "Strenge Richtlinien für Änderungsmanagement und Wartungsfenster etablieren und durchsetzen",
      "mitigation": "Wartungsfenster für alle administrativen Aktivitäten an Produktionssystemen definieren und strikt durchsetzen. Einen formellen Änderungsmanagementprozess implementieren, der ",
      "check": "Gibt es einen formellen, durchgesetzten Änderungsmanagementprozess? Gibt es definierte und eingehaltene Wartungsfenster für Produktionssysteme? Werden administrative Änderungen vor der Bereitstellung in einer Nicht-Produktionsumgebung getestet? Sind Rollback-Verfahren dokumentiert und getestet?",
      "detectionLogic": "Dieses Risiko wird für technische Assets mit mindestens ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Systemen mit hoher Komplexität oder vielen gegenseitigen Abhängigkeiten, bei denen unvorhergesehene Nebeneffekte wahrscheinlicher sind, höher. Es",
      "falsePositives": "Eine Organisation könnte einen sehr ausgereiften und streng durchgesetzten Änderungsmanagementprozess haben, der dieses Risiko effektiv mindert, obwohl das Modell einen administrativen Zugriff auf kritische Systeme zeigt. "
    },
    "insufficient-documentation-bsi": {
      "title": "Ungenügende Dokumentation (BSI CON.2 / OPS.1.1.2)",
      "description": "Dokumentation kann unzureichend sein, wenn Informationen über IT-Komponenten (z. B. Konfiguration, Abhängigkeiten oder Zugriffsrechte) nicht erfasst, unvollständig oder nicht auf dem neuesten Stand gehalten werden. ",
      "impact": "Ungenügende Dokumentation kann zu Fehlkonfigurationen oder allgemeinen Fehlern in der IT-Administration führen und die Vertraulichkeit, Integrität und Verfügbarkeit erheblich gefährden. ",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz Bausteinen CON.2 (Konfigurationsmanagement) und OPS.1.1.2 (Ordnungsgemäße IT-Administration), insbesondere Anforderungen wie CON.2.A5 (Dokumentation der Konfiguration) und OPS.1.1.2.A23 (Führen einer Systemakte).",
      "action": "Umfassende Systemdokumentation erstellen und pflegen",
      "mitigation": "Einen robusten Prozess implementieren, um sicherzustellen, dass alle IT-Komponenten, einschließlich ihrer Konfigurationen, Zugriffsrechte, Netzwerkverbindungen und Abhängigkeiten, korrekt dokumentiert sind. ",
      "check": "Gibt es einen etablierten Prozess zur Erstellung und Aktualisierung der Systemdokumentation? Ist dieser Prozess in das Änderungsmanagement integriert? ",
      "detectionLogic": "Dies ist ein prozessbezogenes Risiko, das für jedes technische Asset gilt. Es ist besonders relevant für Assets, die kundenspezifisch entwickelt wurden, da deren Dokumentation oft weniger standardisiert ist als die von kommerziellen Standardprodukten. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn es keinen formellen, durchgesetzten Prozess für das Dokumentationsmanagement gibt. ",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und kann nicht allein durch ein technisches Modell definitiv bestätigt werden. Das Vorhandensein eines `custom_developed_parts`-Flags oder hoher CIA-Bewertungen deutet nur auf eine höhere potenzielle Auswirkung hin. "
    },
    "excessive-administrative-permissions": {
      "title": "Übermäßige administrative Berechtigungen",
      "description": "Übermäßig weitreichende administrative Berechtigungen können zur Sabotage oder zum Ausspähen von Informationen missbraucht werden, was dann als Ausgangspunkt für weitere Angriffe dienen kann. Dies gefährdet alle Informationssicherheitsziele (Vertraulichkeit, Integrität und Verfügbarkeit). Das Risiko erhöht sich, wenn Offboarding-Prozesse unzureichend sind, sodass ehemalige Administratoren privilegierten Zugriff behalten.",
      "impact": "Der Missbrauch übermäßiger Berechtigungen kann zu unbefugter Änderung oder Zerstörung von Daten (Integrität), zur Offenlegung sensibler Informationen (Vertraulichkeit) und zur Störung oder zum vollständigen Verlust von Diensten (Verfügbarkeit) führen. Ein Angreifer mit solchen Privilegien kann Hintertüren erstellen, Audit-Protokolle löschen oder Privilegien innerhalb der Infrastruktur eskalieren, was potenziell zu einer vollständigen Systemkompromittierung führen kann.",
      "asvs": "V4.2 - Überprüfen, dass das Prinzip der geringsten Rechte verwendet wird, um Zugriff und Berechtigungen auf Daten und Funktionalität zu gewähren.",
      "action": "Prinzip der geringsten Rechte (PoLP) und Just-in-Time (JIT)-Zugriff durchsetzen",
      "mitigation": "Administrative Berechtigungen auf das für jede Rolle absolut notwendige Minimum überprüfen und beschränken. Eine feingranulare Zugriffskontrolle implementieren, die auf die Jobfunktionen abgestimmt ist. Eine Privileged Access Management (PAM)-Lösung verwenden, um privilegierte Sitzungen zu verwalten, zu überwachen und zu kontrollieren. Just-in-Time (JIT)-Zugriffsmechanismen einsetzen, die temporäre Berechtigungen für spezifische Aufgaben gewähren. Administrative Konten, deren zugewiesene Berechtigungen und deren Aktivitäten regelmäßig überprüfen. Einen robusten und zeitnahen Offboarding-Prozess sicherstellen, der alle Zugriffe für ausscheidendes Personal widerruft.",
      "check": "Werden administrative Berechtigungen regelmäßig überprüft? Gibt es einen dokumentierten Prozess zur Vergabe und zum Widerruf administrativer Rechte basierend auf dem Prinzip der geringsten Rechte? Werden PAM- oder JIT-Lösungen verwendet? Werden administrative Aufgaben mit dedizierten, auditierten Konten durchgeführt?",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets ausgelöst, die mit administrativen Rollen verbunden sind (z. B. mit `@Role:Administrator`, `@Role:ITSecurityOfficer` getaggt). Das Risiko geht davon aus, dass diese Berechtigungen ohne spezifische Kontrollen wie ein PAM- oder JIT-System standardmäßig zu weitreichend sein könnten und eine erhebliche Bedrohung darstellen.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist höher für Assets, die dem Internet ausgesetzt oder im internen Netzwerk leicht zugänglich sind. Die Auswirkung korreliert mit der CIA-Bewertung des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten. Ein Administrator auf einer missionskritischen, mandantenfähigen Datenbank stellt ein viel höheres Risiko dar als auf einem eigenständigen, nicht-kritischen internen Werkzeug.",
      "falsePositives": "Das Modell kann das Vorhandensein oder die Wirksamkeit externer kompensierender Kontrollen wie einer vollständig implementierten PAM-Lösung, strenger JIT-Zugriffsrichtlinien oder einer strikten Echtzeit-Auditierung nicht überprüfen. Wenn bestätigt wird, dass solche Kontrollen für das identifizierte Asset vorhanden und wirksam sind, kann dieses Risiko als False Positive oder gemindert betrachtet werden."
    },
    "insecure-administrative-access": {
      "title": "Unsicherer administrativer Zugriff",
      "description": "Administrative Zugangspunkte (für Konfiguration, Wartung oder Überwachung) gewähren weitreichende Privilegien über Systeme und Daten. Wenn diese Kanäle nicht ausreichend gesichert sind, können unbefugte Personen über schwache Authentifizierung, unverschlüsselte Protokolle oder die Exposition gegenüber unvertrauenswürdigen Netzwerken Zugriff erlangen.",
      "impact": "Eine erfolgreiche Ausnutzung gefährdet nicht nur die Vertraulichkeit von administrativen Daten und Konfigurationen, sondern kann auch die Manipulation von Systemen (Integrität) oder Dienstunterbrechungen (Verfügbarkeit) ermöglichen. Kompromittierter Admin-Zugriff ist ein häufiger Ausgangspunkt für weitreichendere Angriffe und gefährdet alle Sicherheitsziele.",
      "asvs": "V4 Access Control, z. B. 4.1.2 (Least Privilege für Admin-Schnittstellen) und 4.2.1 (Starke Anmeldeinformationen/MFA für Admin-Konten)",
      "action": "Administrative Zugriffskanäle härten (Verschlüsselung, MFA, Netzwerk-Gating)",
      "mitigation": "Alle administrativen Zugriffe mit starker Multi-Faktor-Authentifizierung (MFA) schützen. Sicherstellen, dass der gesamte Admin-Verkehr verschlüsselte Protokolle verwendet, vorzugsweise über dedizierte sichere Kanäle (VPN, Bastion/Jump-Host), wenn er unvertrauenswürdige Netzwerke durchquert oder von diesen ausgeht. Das Prinzip der geringsten Rechte für Admin-Rollen anwenden und administrative Aktionen umfassend protokollieren und überwachen.",
      "check": "Sind alle Admin-Schnittstellen hinter MFA? Sind sie nur von vertrauenswürdigen Netzwerken aus erreichbar (z. B. über VPN/Bastion) mit IP-Filterung? Sind die Protokolle Ende-zu-Ende verschlüsselt? Werden Admin-Aktionen unveränderlich protokolliert und regelmäßig überprüft?",
      "detectionLogic": "Identifiziert administrative Kommunikationsverbindungen (Usage.DevOps) mit fehlender MFA (authentication != TwoFactor), unverschlüsselten Protokollen oder Internet-Exposition vom Quell-Asset ohne VPN oder IP-Filterung. Ziele außerhalb des Geltungsbereichs werden ignoriert.",
      "riskAssessment": "Die Auswirkung richtet sich nach den Vertraulichkeits-/Integritäts-/Verfügbarkeitsanforderungen des Ziel-Assets. Die Wahrscheinlichkeit ist sehr hoch für internet-exponierten Zugriff ohne kompensierende Kontrollen oder wenn die Authentifizierung ",
      "falsePositives": "Kann bei DevOps-Links ausgelöst werden, die nicht privilegiert sind oder bereits durch nicht modellierte Kontrollen (z. B. Jump-Hosts, PAM) geschützt sind. Validieren Sie den Umgebungskontext, nur für Notfälle vorgesehene Pfade oder temporäre Wartungstunnel."
    },
    "lack-of-redundant-admin-knowledge-orp-4-a5": {
      "title": "Mangel an redundantem Administratorwissen (BSI ORP.4.A5)",
      "description": "Wenn das notwendige Wissen für die IT-Administration nicht redundant unter den Administratoren verfügbar ist, ",
      "impact": "Das Versäumnis, kritische administrative Aufgaben aufgrund von Wissensmonopolen oder fehlenden Stellvertretern durchzuführen, kann die Verfügbarkeit von IT-Systemen erheblich beeinträchtigen.",
      "asvs": "BSI IT-Grundschutz Kompendium: Baustein ORP.4 (Personal), Anforderung ORP.4.A5 (Regelung von Vertretungen).",
      "action": "Redundanz bei administrativem Wissen, Zugriff und Dokumentation sicherstellen",
      "mitigation": "Eine Richtlinie für die Vertretung aller kritischen administrativen Rollen etablieren und durchsetzen. Dies schließt die Benennung und Schulung von Stellvertretern ein. ",
      "check": "Sind für alle kritischen administrativen Rollen formell Stellvertreter benannt? Gibt es eine aktuelle, zugängliche und umfassende Dokumentation für alle administrativen Aufgaben? ",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das mit einer administrativen Rolle verbunden ist (über `role:*`-Tags). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn die Organisation robuste, gut dokumentierte und getestete Vertretungsrichtlinien hat, die im Bedrohungsmodell nicht sichtbar sind. "
    },
    "administrator-staff-shortage": {
      "title": "Personalmangel bei Administratoren (basierend auf BSI-Standardgefährdung)",
      "description": "Wenn ein Mangel an administrativem Personal besteht (z. B. aufgrund unzureichender Personalplanung, Überbuchung, Krankheit oder Pandemien), können notwendige Verwaltungsaufgaben möglicherweise nicht rechtzeitig erledigt werden. ",
      "impact": "Versäumte Aufgaben und administrative Fehler können die Verfügbarkeit verringern, die Angriffsfläche vergrößern (z. B. versäumtes Patchen oder Fehlkonfigurationen) und die Vertraulichkeit, Integrität und Verfügbarkeit gefährden. ",
      "asvs": "Abgeleitet von BSI IT-Grundschutz ORP.2 (Personal), insb. ORP.2.A5 (Besetzung von Rollen), das eine angemessene Personal- und Qualifikationsausstattung fordert.",
      "action": "Angemessene Personalausstattung, Schulung und Werkzeuge für Administratoren sicherstellen",
      "mitigation": "Eine robuste Personal-/Ressourcenplanung für administrative Teams etablieren, einschließlich der Abdeckung von Abwesenheiten und Notfällen. Cross-Training und Verfahrensdokumentation implementieren, um Single Points of Failure zu vermeiden. ",
      "check": "Gibt es einen formalen Kapazitätsplan für den Betrieb/die Administration? Gibt es genügend Administratoren, um Aufgaben ohne chronische Überstunden abzudecken? ",
      "detectionLogic": "Organisatorisches Risiko, das auf der Asset-Ebene auftritt. Ein Befund wird für technische Assets erstellt, die mit administrativer Verantwortung getaggt sind (z. B. @Role:Administrator, @Role:SystemAdministrator, @Role:DevOps, @Role:ExternalServiceProvider). ",
      "riskAssessment": "Die Wahrscheinlichkeit ist standardmäßig ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage von administrativen Rollen-Tags ausgelöst und kann ohne Einblick in die tatsächliche Personalausstattung und Arbeitsbelastung nicht bestätigt werden. "
    },
    "inadequate-securing-of-admin-tools": {
      "title": "Ungenügende Absicherung von Administrationswerkzeugen (basierend auf BSI CON.8.A24)",
      "description": "Administrationswerkzeuge gewähren weitreichenden Zugriff auf eine Institution.",
      "impact": "Wenn ein Angreifer die Kontrolle über ein unzureichend gesichertes Administrationswerkzeug erlangt, kann er weitreichende Privilegien erlangen. Diese Privilegien können missbraucht werden, um die IT-Administration zu sabotieren, unbefugte administrative Aktionen durchzuführen und weitere Angriffe gegen verbundene Systeme zu starten. Dies kompromittiert die Vertraulichkeit, Integrität und Verfügbarkeit aller verwalteten IT-Assets, was zu Datenlecks, Systemausfällen und Kontrollverlust über die Infrastruktur führt.",
      "asvs": "BSI IT-Grundschutz CON.8: Softwareentwicklung und -test; insbesondere A24 Trennung von Administrations-Clients. Das Prinzip stimmt auch mit OPS.1.1.5 Administration über einen Standard-Client überein.",
      "action": "Administrative Umgebungen und Werkzeuge isolieren",
      "mitigation": "Dedizierte, gehärtete Systeme (physisch oder virtuell) ausschließlich für administrative Aufgaben verwenden. Diese ",
      "check": "Werden für alle administrativen Aufgaben dedizierte, isolierte Systeme verwendet? Gibt es eine strikte Trennung zwischen administrativen und nicht-administrativen Benutzerkonten und Sitzungen? Ist der administrative Zugriff auf bestimmte Netzwerkpfade beschränkt und wird er über Bastion-Hosts kontrolliert? Wird MFA für alle privilegierten Zugriffe erzwungen?",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein technisches Asset (wie ein Desktop, ein Client-System oder ein CLI-Tool) sowohl für administrative Zwecke als auch für nicht-administrative, potenziell weniger sichere Aktivitäten verwendet wird. Das Modell erkennt dies, indem es ein Client-Asset findet, das ausgehende Kommunikationsverbindungen mit einem ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein Client-Asset ",
      "falsePositives": "Ein Modell könnte ein "
    },
    "failure-of-administration-tools-ops115": {
      "title": "Ausfall von Administrationsfähigkeiten (BSI-basiert)",
      "description": "Wenn Administrationsfähigkeiten ausfallen und aufgrund mangelnder Planung keine Redundanz oder Alternative vorhanden ist, ",
      "impact": "Ein Ausfall kritischer, nicht-redundanter Administrationswerkzeuge führt zur Unfähigkeit, andere IT-Systeme zu verwalten, zu überwachen oder zu reparieren. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.5 Redundanz (Anforderung A4 - Redundanz für zentrale Infrastrukturdienste) und OPS.1.1.3 Patch- und Änderungsmanagement.",
      "action": "Redundanz und Failover für kritische Administrationswerkzeuge sicherstellen",
      "mitigation": "Alle kritischen Administrationswerkzeuge und -komponenten innerhalb der Infrastruktur identifizieren. ",
      "check": "Sind alle kritischen Administrations- und Infrastrukturkomponenten (z. B. Identitätsanbieter, Container-Plattformen, Überwachungssysteme, CI/CD-Pipelines) redundant ausgelegt? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als administrative oder kritische Infrastrukturkomponenten identifiziert werden, eine Einstufung von ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko könnte für eine Komponente gemeldet werden, die über Out-of-Band- oder manuelle Wiederherstellungsverfahren verfügt, die von der Organisation als akzeptabel angesehen werden, auch wenn sie nicht als "
    },
    "improper-ldap-backend-selection": {
      "title": "Unsachgemäße Auswahl des OpenLDAP-Backends",
      "description": "Wenn OpenLDAP-Backends, -Direktiven und -Parameter falsch gewählt werden, können sie die vom Verzeichnisdienst angebotenen Funktionen negativ beeinflussen. ",
      "impact": "Eine Fehlkonfiguration des LDAP-Backends kann den Dienst erheblich einschränken.",
      "asvs": "N/A. Dies ist ein spezifisches Problem der Technologiekonfiguration. Das Prinzip entspricht OWASP ASVS V14.1 (Konfiguration), ist aber spezifischer als eine einzelne Anforderung.",
      "action": "Sicherstellen, dass ein robustes und skalierbares Backend für OpenLDAP verwendet wird",
      "mitigation": "Für Produktionsumgebungen OpenLDAP so konfigurieren, dass ein robustes, transaktionales Backend wie ",
      "check": "Den OpenLDAP-Server inspizieren.",
      "detectionLogic": "Erkennt automatisch technische Assets vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Anforderungen der Assets bestimmt, die auf diesen LDAP-Server angewiesen sind. Wenn er für missionskritische Authentifizierung verwendet wird, ist die Auswirkung hoch. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive für sehr kleine, nicht-kritische oder temporäre Bereitstellungen sein, bei denen ein einfaches Backend ausreichen könnte und die operativen Risiken akzeptiert werden."
    },
    "bsi-openldap-overlay-planning": {
      "title": "Schlecht geplante OpenLDAP-Overlays (BSI-abgeleitet)",
      "description": "Das BSI stellt fest, dass bei schlecht geplanter Verwendung von OpenLDAP-Overlays unnötige Operationen ausgeführt oder andere Funktionen beeinträchtigt werden können. ",
      "impact": "Diese Schwachstelle kann zu fehlerhaften oder vollständig fehlenden Zugriffsprotokollen führen, was die Nichtabstreitbarkeit untergräbt und Sicherheitsvorfälle wie Datenlecks oder unbefugte Änderungen verbergen kann. ",
      "asvs": "V14.2.1: Sichere Konfiguration",
      "action": "Einen klaren Konfigurations- und Protokollierungsplan für OpenLDAP-Overlays entwickeln und durchsetzen",
      "mitigation": "Die erforderliche Funktionalität für alle OpenLDAP-Overlays definieren und dokumentieren, mit besonderem Augenmerk auf diejenigen, die für die Protokollierung verantwortlich sind (",
      "check": "Gibt es einen dokumentierten Plan für die Verwendung von OpenLDAP-Overlays? Sind Protokollierungs-Overlays wie ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als OpenLDAP-Server identifiziert wird (Technologie: `ldap-server`). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn ein robuster, auditierter Konfigurationsmanagement- und Überprüfungsprozess für den OpenLDAP-Server vorhanden ist, auch wenn dies nicht explizit im Bedrohungsmodell erfasst ist."
    },
    "unsuitable-environment-for-ldap": {
      "title": "Ungeeignete Systemumgebung für OpenLDAP (BSI APP.2.3 / APP.3.2.A6)",
      "description": "OpenLDAP kann fehlerhaft funktionieren, wenn seine Live-Datenbank (z. B. mdb/hdb) auf Netzwerk-/verteilten Dateisystemen wie NFS oder SMB/CIFS liegt. Diese Plattformen unterstützen oft nicht vollständig das für Datenbank-Backends erforderliche POSIX-File-Locking und die atomare Semantik. Fehlende oder unzuverlässige Locks können zu Schreib-Race-Conditions, veralteten Seiten und Datenbankkorruption führen.",
      "impact": "Verlust der Integrität und Verfügbarkeit des Verzeichnisdienstes. Korruption oder inkonsistente Zustände können Authentifizierungs-/Autorisierungsflüsse für abhängige Anwendungen unterbrechen, was zu Ausfällen und möglicherweise zu erzwungenen Wiederherstellungen mit Datenverlust führt.",
      "asvs": "BSI IT-Grundschutz APP.2.3 (Abschnitt 2.1); APP.3.2.A6",
      "action": "Sicherstellen, dass die Live-LDAP-Datenbank geeigneten lokalen oder Block-Level-Speicher verwendet",
      "mitigation": "Die OpenLDAP-Datenbank und den Laufzeitzustand auf Speicher speichern, der lokales POSIX-Locking und korrekte fsync-Semantik garantiert (z. B. ext4, XFS, APFS oder SAN-Blockgeräte). NFS/SMB für den Pfad der Live-Datenbank vermeiden. Wenn Netzwerkfreigaben erforderlich sind, diese nur für Backups/Exporte/Logs verwenden und die Live-DB lokal halten.",
      "check": "Den LDAP-Host inspizieren.",
      "detectionLogic": "Erkennt im Geltungsbereich befindliche technische Assets mit der Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, da die Fehlkonfiguration sich während des normalen Betriebs (gleichzeitige Schreibvorgänge) selbst ausnutzt. Die Auswirkung skaliert mit dem LDAP-Server.",
      "falsePositives": "Kann ein False Positive sein, wenn die NFS/SMB-Freigabe ausschließlich für Backups, Exporte oder Logs und nicht für den Speicherort der Live-Datenbank verwendet wird. Das Modell kann den Verwendungszweck möglicherweise nicht unterscheiden; eine manuelle Überprüfung wird empfohlen."
    },
    "ldap-version-incompatibility": {
      "title": "LDAP-Versionsinkompatibilität (BSI)",
      "description": "Inkompatible Versionen einer oder mehrerer Anwendungen können versuchen, auf die von einem LDAP-Server verwendeten Datenbanken zuzugreifen. ",
      "impact": "Wenn eine inkompatible Client-Anwendung sich mit dem LDAP-Server verbindet, kann dies zu Denial-of-Service (durch wiederholte Verbindungsfehler oder Ressourcenerschöpfung), ",
      "asvs": "V14.2.5: Überprüfen, dass Komponenten von Drittanbietern aus einer vertrauenswürdigen Quelle stammen und eine sichere Konfiguration haben.",
      "action": "Komponentenkompatibilität sicherstellen und überprüfen",
      "mitigation": "Eine Materialliste für alle Anwendungen führen, die sich mit dem LDAP-Server verbinden. Vor der Bereitstellung oder Aktualisierung einer Client-Anwendung, ",
      "check": "Gibt es eine dokumentierte Liste von Client-Anwendungen und deren Versionen, die für den Betrieb mit dem Produktions-LDAP-Server zertifiziert sind? ",
      "detectionLogic": "Identifiziert alle ",
      "riskAssessment": "Die Wahrscheinlichkeit steigt mit der Anzahl und Vielfalt der Client-Anwendungen, die sich mit dem LDAP-Server verbinden. Die Auswirkung steht in direktem Zusammenhang mit der ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn die Organisation ein striktes Versionskontroll- und Kompatibilitätstestregime für alle Clients durchsetzt."
    },
    "inconsistent-ldap-state-mixed-access-bsi-app-2-3": {
      "title": "Inkonsistenter LDAP-Zustand durch gemischten Zugriff (BSI APP.2.3, Abschnitt 2.2)",
      "description": "Auf Daten in einem OpenLDAP-Verzeichnis, einschließlich Verzeichnisobjekten und Konfigurationseinstellungen, kann über verschiedene Methoden zugegriffen werden. ",
      "impact": "Wenn sowohl Online- als auch Offline-Zugriffsmethoden ohne ordnungsgemäße Synchronisation oder Verständnis verwendet werden, kann die resultierende LDAP-Datenbank inkonsistent werden. ",
      "asvs": "Abgeleitet von BSI IT-Grundschutz APP.2.3 (Mischung von Online- und Offline-Zugriff auf die OpenLDAP-Datenbank; siehe Abschnitt 2.2). Dies ist ein spezifisches operatives Risiko, das nicht direkt einer OWASP ASVS-Anforderung zugeordnet werden kann.",
      "action": "Zugriffsmethoden auf die LDAP-Datenbank standardisieren und einschränken",
      "mitigation": "Ein striktes und exklusives Verfahren zur Änderung der LDAP-Datenbank definieren. Bevorzugen Sie die Verwendung von standardmäßigen Online-LDAP-Operationen für alle Änderungen. ",
      "check": "Überprüfen Sie die Betriebshandbücher für den LDAP-Server. Gibt es Verfahren, die sowohl Online-LDAP-Befehle als auch Offline-Dateimanipulation beinhalten? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset vom Technologietyp ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher, wenn mehrere administrative Rollen oder Systeme unterschiedliche Arten von Zugriff haben. Die Auswirkung steht in direktem Zusammenhang mit der **Integrität** und **Verfügbarkeit** ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn die Offline-Zugriffsprotokolle ausschließlich für nicht-konfligierende Zwecke verwendet werden (z. B. Logfile-Versand, Überwachung) und nicht für die Manipulation der Datenbank, "
    },
    "unclear-responsibilities-in-processes-bsi-orp1-a2": {
      "title": "Unklare oder überlappende Verantwortlichkeiten (BSI ORP.1.A2)",
      "description": "Schlecht definierte, überlappende oder unklare Verantwortlichkeiten für sicherheitsrelevante Prozesse können zu erheblichen Verzögerungen und Fehlern führen. ",
      "impact": "In extremen Fällen können schlecht definierte Verantwortlichkeiten das gesamte System oder große Teile davon stören. Betriebsstörungen wirken sich negativ auf die Verfügbarkeit aus. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.1 (Informationssicherheitsorganisation), Anforderung ORP.1.A2 (Festlegung von Rollen und Verantwortlichkeiten).",
      "action": "Rollen und Verantwortlichkeiten klar definieren, dokumentieren und kommunizieren",
      "mitigation": "Klare Verantwortlichkeiten für alle sicherheitsrelevanten Prozesse festlegen und dokumentieren, insbesondere für Patch- und Änderungsmanagement, Incident Response und Zugriffskontrolle. ",
      "check": "Gibt es einen dokumentierten Patch- und Änderungsmanagementprozess? Sind Rollen und Verantwortlichkeiten für das Testen, Genehmigen und Bereitstellen von Änderungen klar definiert und zugewiesen? ",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das auf technische Assets modelliert werden kann, bei denen Prozessfehler eine hohe Auswirkung haben. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird basierend auf dem Typ des Assets ausgelöst, nicht auf direkten Beweisen für einen Prozessfehler. Das Modell kann die Qualität einer Organisation nicht kennen."
    },
    "inadequate-patch-and-change-management-ops-1-1-5": {
      "title": "Ungenügendes Patch- und Änderungsmanagement (BSI OPS.1.1.5)",
      "description": "Wenn das Patch- und Änderungsmanagement innerhalb der Institution eine geringe Akzeptanz hat oder die Kommunikation in einem Projekt",
      "impact": "Schlechte Kommunikation macht den Änderungsprozess ineffizient und erfordert übermäßige Zeit und Ressourcen. Dies schadet der Institution.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.5 (Patch- und Änderungsmanagement), insbesondere den Anforderungen A1 (Planung des Patch- und Änderungsmanagements), A4 (Dokumentation von Änderungen) und A6 (Testen von Patches und Änderungen).",
      "action": "Einen formalisierten und gut kommunizierten Patch- und Änderungsmanagementprozess etablieren",
      "mitigation": "Ein dokumentierter Patch- und Änderungsmanagementprozess muss etabliert und konsequent befolgt werden. Dieser Prozess sollte klare Rollen und Verantwortlichkeiten, Kommunikationskanäle, Testverfahren für alle Änderungen und Rollback-Pläne definieren. Alle Änderungen, einschließlich Patches, sollten in einem zentralen System dokumentiert werden. Notfalländerungsverfahren sollten ebenfalls definiert und getestet werden. Sicherstellen, dass alle beteiligten Mitarbeiter in dem Prozess geschult sind.",
      "check": "Gibt es eine dokumentierte Patch- und Änderungsmanagementrichtlinie? Sind Rollen und Verantwortlichkeiten definiert? Werden alle Änderungen vor der Bereitstellung in Produktionsumgebungen getestet? Gibt es eine dokumentierte Historie aller angewendeten Änderungen?",
      "detectionLogic": "Dieses organisatorische Risiko spiegelt sich oft in technischen Assets wider, die häufige manuelle Eingriffe erfordern oder Teil einer komplexen Lieferpipeline sind. Diese Regel wird bei Assets ausgelöst, die kundenspezifisch entwickelte Teile haben oder mit der Entwicklungs- und Betriebsinfrastruktur zusammenhängen, da diese Hauptkandidaten für Fehler im Änderungsmanagementprozess sind. Das Risiko gilt auch für Assets, die von Schlüsselpersonal im Betrieb verwaltet werden.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei kundenspezifisch entwickelten Assets höher, da ihnen standardisierte, automatisierte Update-Mechanismen fehlen. Die Auswirkung hängt direkt vom Asset ab.",
      "falsePositives": "Das Modell kann die tatsächliche Qualität einer Organisation nicht überprüfen."
    },
    "inadequate-change-management-con-3-g5": {
      "title": "Ungenügendes Änderungsmanagement (BSI CON.3.G5)",
      "description": "Ungeeignete oder unsachgemäß bewertete Änderungen an IT-Systemen können Geschäftsprozesse beeinträchtigen, zu Systemausfällen führen oder das allgemeine Sicherheitsniveau senken. Dies geschieht oft, wenn Tests unzureichend sind oder wenn es an Koordination zwischen IT-, Sicherheits- und Fachabteilungen während des Genehmigungs- und Implementierungsprozesses von Änderungen mangelt.",
      "impact": "Fehlerhafte Änderungen können sich direkt auf die Verfügbarkeit von Diensten auswirken und zu Geschäftsunterbrechungen und Ausfällen führen. Sie können auch neue Schwachstellen einführen und die Vertraulichkeit und Integrität von Daten gefährden. Dies kann zu Datenlecks, finanziellen Verlusten und Reputationsschäden führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.3 (Änderungsmanagement), insbesondere der Gefährdung G5 ",
      "action": "Einen formalen und umfassenden Änderungsmanagementprozess implementieren",
      "mitigation": "Eine dokumentierte Änderungsmanagementrichtlinie etablieren, die für alle Produktionssysteme gilt. Der Prozess muss umfassen: formale Änderungsanträge (CRs), Risiko- und Sicherheitsauswirkungsanalysen für jeden CR, Genehmigungsworkflows, die alle relevanten Stakeholder (Geschäft, IT, Sicherheit) einbeziehen, dediziertes Testen in einer Vorproduktionsumgebung und eine klare Rollback-Strategie. Sicherstellen, dass alle Änderungen nachverfolgt und auditiert werden.",
      "check": "Gibt es einen formalen Änderungsmanagementprozess? Werden alle Änderungen an Produktionsumgebungen protokolliert und genehmigt? Schreibt der Prozess Sicherheitsüberprüfungen und Tests vor? Gibt es Rollback-Pläne für kritische Änderungen?",
      "detectionLogic": "Dieses organisatorische Risiko wird bei technischen Assets identifiziert, die zentral für den Softwareentwicklungs- und Bereitstellungslebenszyklus sind (z. B. Build-Pipelines, Quellcode-Repositories, Container-Plattformen) oder kritische, kundenspezifisch entwickelte Anwendungen sind. Das Risiko ist höher für Assets, die an ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für Assets, die für Entwicklung und Bereitstellung zentral sind, als höher angesehen. Die Auswirkung wird basierend auf den Bewertungen für Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des betroffenen Assets und der von ihm verarbeiteten oder gespeicherten Daten berechnet. Eine unsachgemäße Änderung an einem System mit missionskritischen Daten hat eine viel höhere Auswirkung als eine Änderung an einer weniger kritischen Komponente.",
      "falsePositives": "Dieses Risiko wird basierend auf der technischen Rolle eines Assets ausgelöst. Das Modell kann die tatsächliche Qualität der Organisation nicht überprüfen."
    },
    "inadequate-patch-management-resources": {
      "title": "Unzureichende Ressourcen für das Patch- und Änderungsmanagement (BSI OPS.1.1.3)",
      "description": "Ein effektives Patch- und Änderungsmanagement erfordert angemessene personelle, zeitliche und finanzielle Ressourcen. Wenn diese nicht verfügbar sind, können notwendige Rollen von ungeeignetem Personal besetzt werden, Kommunikationskanäle zwischen IT- und Fachabteilungen nicht etabliert und die erforderliche Infrastruktur für Test- und Bereitstellungsumgebungen nicht bereitgestellt werden. Während solche Mängel im Normalbetrieb manchmal kompensiert werden können, werden sie unter Zeitdruck, wie bei der Bereitstellung von Notfall-Patches, besonders deutlich.",
      "impact": "Ein Mangel an Ressourcen für das Patch-Management führt zu verzögertem oder fehlgeschlagenem Patchen, wodurch Systeme anfällig für Ausnutzung bleiben. Dies kann zur Kompromittierung der Vertraulichkeit, Integrität und Verfügbarkeit der Organisation führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.3 (Patch- und Änderungsmanagement), insbesondere den Anforderungen OPS.1.1.3.A1 (Konzept für Patch- und Änderungsmanagement) und OPS.1.1.3.A15 (Regelmäßige Aktualisierung von IT-Systemen und Software).",
      "action": "Ausreichende Ressourcen für das Patch- und Änderungsmanagement sicherstellen",
      "mitigation": "Ein ausreichendes Budget für Patch- und Änderungsmanagementaktivitäten bereitstellen. Qualifiziertes Personal für definierte Rollen und Verantwortlichkeiten zuweisen und ihnen ausreichend Zeit für Tests und Bereitstellung geben. Klare, dokumentierte Prozesse und Kommunikationskanäle zwischen IT-Betrieb, Entwicklung und Fachabteilungen etablieren. Separate, angemessen ausgestattete Umgebungen für das Testen von Patches vor der Bereitstellung in Produktionssystemen unterhalten. Verwenden Sie ein Tag wie `@patch-process:managed` auf Assets, um anzuzeigen, dass ein formeller Prozess vorhanden ist.",
      "check": "Sind Rollen und Verantwortlichkeiten für das Patch-Management klar definiert und qualifizierten Personen zugewiesen? Gibt es einen dokumentierten Prozess, der die Kommunikation mit den Fachabteilungen einschließt? Werden separate Test-/Staging-Umgebungen zur Patch-Validierung vor der Produktionsbereitstellung verwendet? Gibt es ein dediziertes Budget für diese Aktivitäten?",
      "detectionLogic": "Dieses organisatorische Risiko wird für alle im Geltungsbereich befindlichen, nicht-clientseitigen, nicht-bibliotheksbasierten technischen Assets ausgelöst, die wahrscheinlich regelmäßiges Patchen erfordern. Das Risiko kann pro Asset durch Anwenden eines `@patch-process:managed`-Tags gemindert werden, was anzeigt, dass für dieses Asset ein formeller, gut ausgestatteter Prozess vorhanden ist.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist bei internetzugänglichen Systemen und Systemen, die auf gängigen Drittanbietertechnologien basieren, höher. Die Auswirkung korreliert direkt mit der Geschäftskritikalität (CIA) des Assets und der von ihm verarbeiteten oder gespeicherten Daten. Ein ungepatchtes, internetzugängliches Asset mit hochwertigen Daten stellt ein sehr hohes Risiko dar.",
      "falsePositives": "Dieses Risiko wird aufgrund des Fehlens expliziter Informationen über einen verwalteten Patching-Prozess im Modell ausgelöst. Das Modell kann die tatsächliche Qualität oder Ressourcenausstattung einer Organisation nicht überprüfen."
    },
    "flawed-patch-distribution-sys-1-3-g5": {
      "title": "Fehlerhafte automatisierte Patch-/Änderungsverteilung (BSI OPS.1.1.3 §2.5)",
      "description": "Patches und Änderungen werden oft zentral über softwarebasierte Automatisierung verteilt. ",
      "impact": "Ein fehlerhafter oder bösartiger Patch, der über ein zentrales Verwaltungssystem verteilt wird, kann weitreichende Schwachstellen, Systeminstabilität oder Denial-of-Service auf zahlreichen Assets verursachen. ",
      "asvs": "BSI OPS.1.1.3 Patch- und Änderungsmanagement",
      "action": "Patchverteilung härten, stufenweise durchführen und verifizieren",
      "mitigation": "Einen mehrstufigen Bereitstellungsprozess (z. B. Dev, Test, Prod) etablieren, um Patches und Änderungen vor einem vollständigen Rollout zu prüfen. ",
      "check": "Gibt es ein zentrales Patch-/Änderungsmanagementsystem? Werden Patches und Änderungen vor dem Rollout gründlich in einer Vorproduktionsumgebung getestet? ",
      "detectionLogic": "Erkennt automatisch zentrale DevOps-Assets (Usage = DevOps), die als Software-/Patch-Verteilerknoten fungieren. ",
      "riskAssessment": "Wahrscheinlichkeit: ",
      "falsePositives": "Das Modell kann das Architekturmuster der zentralisierten Verwaltung identifizieren, aber nicht die Reife der betrieblichen Prozesse (Testen, Genehmigungen, gestaffelte Rollouts) bewerten. "
    },
    "inadequate-patch-rollback-capability": {
      "title": "Unzureichende Rollback-Fähigkeit für Patches/Änderungen",
      "description": "Wenn Patches oder Änderungen ohne eine vorgesehene Wiederherstellungsoption verteilt werden, oder wenn die Wiederherstellungsroutinen der verwendeten Software unwirksam oder unzureichend sind, kann fehlerhafte aktualisierte Software nicht rechtzeitig korrigiert werden. Dies kann zum Ausfall wichtiger IT-Systeme und zu hohen Folgeschäden führen.",
      "impact": "Ein fehlgeschlagenes Update ohne einen geeigneten Rollback-Plan kann zu längeren Ausfällen, Datenkorruption oder -verlust führen. Die Verfügbarkeit und Integrität der Daten und der betroffenen IT-Systeme sind besonders gefährdet, was kritische Geschäftsprozesse stören kann.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5 Patch- und Änderungsmanagement, insbesondere Anforderung A6 (Rückfalloption für Patches).",
      "action": "Rollback-Pläne für Patches und Änderungen implementieren und testen",
      "mitigation": "Einen formalen Änderungsmanagementprozess etablieren, der einen getesteten Rollback- oder Wiederherstellungsplan für jeden signifikanten Patch oder jede Änderung erfordert. Dies kann System-Snapshots, Datenbank-Backups, Anwendungsversionierung oder Blue-Green/Canary-Deployment-Strategien umfassen. Das Wiederherstellungsverfahren muss dokumentiert sein, und seine Wirksamkeit sollte regelmäßig überprüft werden, insbesondere bei kritischen Systemen. Sicherstellen, dass das Personal darin geschult ist, die Rollback-Verfahren auszuführen.",
      "check": "Gibt es einen dokumentierten Änderungsmanagementprozess, der einen Rollback-Plan für Änderungen erfordert? Werden diese Rollback-Pläne getestet, bevor die eigentliche Änderung in der Produktion bereitgestellt wird? Kann das Betriebsteam einen erfolgreichen Rollback von einer kürzlichen Bereitstellung in einer Test- oder Staging-Umgebung demonstrieren?",
      "detectionLogic": "Dies ist ein prozessbezogenes Risiko. Die Regel wird bei technischen Assets ausgelöst, bei denen die Auswirkung eines fehlgeschlagenen Updates am schwerwiegendsten wäre. Sie identifiziert Assets mit hohen Integritäts- oder Verfügbarkeitsanforderungen, kundenspezifisch entwickelte Komponenten, die sich häufig ändern, und wichtige DevOps-Systeme. Das Risiko ist bei nicht-redundanten Assets erhöht, bei denen ein einzelner Fehler zu einem vollständigen Ausfall führt.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeits- und Integritätsbewertung des betroffenen technischen Assets ab. Die Wahrscheinlichkeit wird bei nicht-redundanten Systemen als höher angesehen, da keine sofortige Failover-Fähigkeit zur Minderung der Auswirkungen eines fehlgeschlagenen Patches vorhanden ist. Für alle anderen kritischen Systeme wird die Wahrscheinlichkeit als ",
      "falsePositives": "Dieses Risiko wird aufgrund der Kritikalität des Assets ausgelöst, wobei eine potenzielle Schwäche in den betrieblichen Prozessen angenommen wird. Eine Organisation kann ein ausgezeichnetes und rigoros getestetes Änderungsmanagement- und Rollback-Verfahren haben, das vom Modell nicht überprüft werden kann. Dieses Risiko sollte durch Überprüfung der tatsächlichen betrieblichen Prozesse bestätigt werden."
    },
    "flawed-patch-and-change-management": {
      "title": "Fehlerhaftes Patch- und Änderungsmanagement (BSI CON.1)",
      "description": "Wenn Änderungen falsch priorisiert werden, könnten kritische Sicherheitspatches zu spät installiert werden, wodurch bekannte Schwachstellen offen für die Ausnutzung bleiben. ",
      "impact": "Dies kann dazu führen, dass Systeme anfällig für bekannte Exploits bleiben, was die Wahrscheinlichkeit einer Kompromittierung erheblich erhöht. Die Integrität, Verfügbarkeit und Vertraulichkeit des Systems und der von ihm verarbeiteten Daten sind gefährdet. Ungepatchte Systeme sind ein primärer Angriffsvektor, der zu Datenlecks, Dienstunterbrechungen und unbefugtem Zugriff führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Patch- und Änderungsmanagement).",
      "action": "Einen robusten Patch- und Änderungsmanagementprozess etablieren und einhalten",
      "mitigation": "Einen klaren, risikobasierten Prozess zur Identifizierung, Priorisierung, Prüfung und Bereitstellung von Patches und Systemänderungen definieren und durchsetzen. ",
      "check": "Gibt es eine dokumentierte Patch- und Änderungsmanagementrichtlinie? Werden Patches konsequent nach Schweregrad der Schwachstelle und Kritikalität des Assets priorisiert? Werden Änderungen in einer Vorproduktionsumgebung getestet? Gibt es einen Verifizierungsprozess, um eine erfolgreiche Bereitstellung und Funktionalität zu bestätigen?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die regelmäßiges Patchen erfordern (z. B. Server, Anwendungen, Datenbanken), ausgenommen Serverless-Komponenten und die DevOps-/Management-Tools selbst. ",
      "riskAssessment": "Die Auswirkung wird durch die Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des technischen Assets und der von ihm verarbeiteten Daten bestimmt. ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn für das Asset ein robuster, effektiver und gut dokumentierter Patch-Management-Prozess existiert, auch wenn dieser nicht vollständig durch einen "
    },
    "compromised-patch-management-system": {
      "title": "Kompromittierung des Patch- und Änderungsmanagementsystems",
      "description": "Patch- und Änderungsmanagementsysteme arbeiten oft von einer zentralen Position aus, um Software und Updates zu verteilen. ",
      "impact": "Ein erfolgreicher Angriff kann zu einer weitreichenden Kompromittierung vieler Systeme führen und die Integrität, Vertraulichkeit und Verfügbarkeit des gesamten Ökosystems erheblich beeinträchtigen. ",
      "asvs": "V14.2 Software and Component Integrity Requirements",
      "action": "Infrastruktur der Software-Lieferkette härten",
      "mitigation": "Strenge Zugriffskontrolle und Netzwerksegmentierung für alle Komponenten der Software-Lieferkette (Quellcode-Repositories, Build-Pipelines, Artefakt-Registries) implementieren. ",
      "check": "Sind Patch- und Artefaktmanagementsysteme von allgemeinen Unternehmensnetzwerken isoliert? Ist der gesamte administrative Zugriff mit starker Authentifizierung gesichert? ",
      "detectionLogic": "Diese Regel identifiziert zentrale Komponenten der Software-Lieferpipeline (z. B. Build Pipeline, Artifact Registry, Source Code Repository), die Software an mehrere andere Assets verteilen. ",
      "riskAssessment": "Die Auswirkung wird basierend auf der Anzahl und Sensibilität der nachgelagerten Systeme berechnet, die Software von dieser zentralen Komponente erhalten. ",
      "falsePositives": "Diese Regel kann jedes zentrale Build-System als riskant einstufen. "
    },
    "malware-infection-via-unpatched-client-software": {
      "title": "OPS.1.1.4 – Malware-Infektion durch ungepatchte Client-Software",
      "description": "Wenn IT-Systeme, insbesondere clientseitige Anwendungen wie Browser oder mobile Apps, nicht ausreichend vor Malware geschützt sind, können Angreifer Software-Schwachstellen ausnutzen, um bösartigen Code auszuführen. Dies geschieht oft, wenn Sicherheitspatches nicht zeitnah angewendet werden oder Schutzmechanismen falsch konfiguriert sind. Ein häufiger Angriffsvektor ist ein ",
      "impact": "Eine erfolgreiche Ausnutzung kann zur Systeminfektion führen, wodurch ein Angreifer weitreichende Kontrolle über das kompromittierte Asset und einen potenziellen Stützpunkt in der Institution erhält.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.4 (Schutz vor Schadprogrammen); zugehörig: SYS.1.2.2, APP.3.2 (Web-Browser) und Patch-Management in Client-OS-Modulen (z. B. SYS.1.3).",
      "action": "Einen robusten Patch- und Schwachstellenmanagementprozess für alle Client-Systeme etablieren und durchsetzen.",
      "mitigation": "Client-Systeme (Desktops, Laptops, mobile Geräte) und deren Anwendungen (Browser, Plugins) mit Sicherheitspatches auf dem neuesten Stand halten. Zentral verwalteten, modernen Endpunktschutz/EDR mit häufigen Signatur- und Engine-Updates verwenden. Browser-Einstellungen härten, um aktive Inhalte einzuschränken, veraltete Plugins zu deaktivieren und sichere Standardeinstellungen zu erzwingen. Nicht unterstützte Software und Hardware rechtzeitig außer Betrieb nehmen.",
      "check": "Gibt es eine dokumentierte Patch-Management-Richtlinie für Client-Software? Werden Clients regelmäßig auf Schwachstellen gescannt? Ist der Endpunktschutz zentral bereitgestellt und wird er aktualisiert? Sind die Browser-Konfigurationen gehärtet und werden sie über das Management (z. B. MDM/GPO) durchgesetzt?",
      "detectionLogic": "Wird für jedes technische Asset ausgelöst, das als Client klassifiziert ist (über isTechnologyClient) und mit dem Internet verbunden ist. Typische Technologien umfassen Browser, mobile Apps, Desktops/Thin Clients. Die Regel bevorzugt die Internet-Exposition als primären Indikator für Drive-by- und clientseitige Exploit-Risiken.",
      "riskAssessment": "Die Wahrscheinlichkeit ist für internetzugängliche Clients aufgrund der stetigen Entdeckung von clientseitigen Schwachstellen sehr hoch. Die Auswirkung skaliert mit der höchsten CIA-Bewertung des Assets und der Sensibilität der verarbeiteten/gespeicherten Daten. Clients, die für administrative Aufgaben oder die Verarbeitung sensibler Daten verwendet werden, implizieren eine höhere Auswirkung.",
      "falsePositives": "Kann in streng verwalteten Umgebungen mit schnellem, erzwungenem Patchen, fortschrittlichem EDR, Anwendungskontrolle und strenger Egress-Filterung ein False Positive sein. Solche mildernden Kontrollen können nicht vollständig aus dem Modell allein abgeleitet werden und erfordern eine Überprüfung."
    },
    "ransomware-encryption": {
      "title": "Risiko der Verschlüsselung durch Ransomware & Malware (BSI OPS.1.1.4 / CON.8)",
      "description": "Malware – einschließlich Ransomware – kann ohne Benutzerbewusstsein ausgeführt werden und Informationen auf Clients, Servern, mobilen Geräten, IoT und sogar industriellen Systemen verschlüsseln oder zerstören. ",
      "impact": "Ohne effektiven Malware-Schutz und widerstandsfähige Backups kann die Verfügbarkeit von Informationen stark eingeschränkt werden, Daten können dauerhaft verloren gehen und der Betrieb gestört werden – was zu finanziellen Verlusten, rechtlicher Haftung und Reputationsschäden führt.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.4 (Schutz vor Schadprogrammen) & CON.8",
      "action": "Mehrschichtige Anti-Malware-Kontrollen und eine gehärtete, regelmäßig getestete @Backup:Target- & Wiederherstellungsstrategie etablieren.",
      "mitigation": "Unternehmensweiten, zentral verwalteten Anti-Malware-Schutz auf Endgeräten und Servern einsetzen (inkl. Verhaltensanalyse und hostbasiertem Intrusion Prevention). ",
      "check": "Sind unternehmensweite Anti-Malware-Lösungen auf allen relevanten Systemen (inkl. Gateways) implementiert, aktualisiert und überwacht? Sind Backups isoliert/unveränderlich und wird die Wiederherstellung Ende-zu-Ende getestet? Werden das Prinzip der geringsten Rechte, Patchen, Anwendungskontrolle und Netzwerksegmentierung durchgesetzt? Werden die Verfahren für Malware-Vorfälle geübt?",
      "detectionLogic": "Anwendbar auf im Geltungsbereich befindliche Assets, die typische Infektionsvektoren (Clients) sind oder wertvolle/operative Daten speichern (Datenspeicher, Dateiserver, Datenbanken). ",
      "riskAssessment": "Die Verbreitung von Ransomware macht die Wahrscheinlichkeit mindestens wahrscheinlich; sie wird sehr wahrscheinlich für internetzugängliche Assets oder Gateways. ",
      "falsePositives": "Wird basierend auf der Rolle des Assets und der Kritikalität der Daten ausgelöst. Das Modell kann das Vorhandensein oder die Wirksamkeit externer Kontrollen (z. B. EDR, E-Mail-Sandboxing) oder die Qualität von @Backup:Target-Verfahren nicht überprüfen. "
    },
    "inadequate-or-missing-logging-der.1.a5": {
      "title": "Ungenügende oder fehlende Protokollierung (BSI DER.1.A5)",
      "description": "Wenn IT-Systeme innerhalb eines Informationssystems keine notwendigen Protokolldaten für sicherheitsrelevante Ereignisse bereitstellen, ",
      "impact": "Ein Mangel an angemessener Protokollierung schafft einen erheblichen blinden Fleck in der Sicherheitslage, der es Angreifern ermöglicht, über längere Zeiträume unentdeckt zu bleiben. ",
      "asvs": "BSI IT-Grundschutz DER.1.A5 (Protokollierung von sicherheitsrelevanten Ereignissen); OWASP ASVS V7.1 (Log Generation)",
      "action": "Umfassende und überwachte Protokollierung sicherstellen",
      "mitigation": "Sicherstellen, dass alle kritischen Systeme so konfiguriert sind, dass sie detaillierte Protokolle für sicherheitsrelevante Ereignisse erstellen (z. B. Anmeldeversuche, administrative Aktionen, Datenzugriffe, Fehler). ",
      "check": "Sind alle kritischen Assets so konfiguriert, dass sie sicherheitsrelevante Ereignisse protokollieren? Werden die Protokolle an ein zentrales, sicheres Repository gesendet? ",
      "detectionLogic": "Dieses Risiko wird für kritische, im Geltungsbereich befindliche ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei kundenspezifisch entwickelten Teilen als höher angesehen, da die Protokollierung oft ein nachträglicher Gedanke ist. ",
      "falsePositives": "Das Modell repräsentiert möglicherweise kein separates, out-of-band Überwachungsnetzwerk. Ein Asset könnte von einem System überwacht werden, das nicht im Bedrohungsmodell enthalten ist. "
    },
    "insufficient-logging-infrastructure-ops1.1.5": {
      "title": "Ungenügende Protokollierungsinfrastruktur (BSI OPS.1.1.5)",
      "description": "Aufgrund komplexer Informationsnetzwerke und vielfältiger Angriffsszenarien steigen die Anforderungen an die Protokollierung, was die Speicherung und Verarbeitung großer Mengen von Protokolldaten erforderlich macht. ",
      "impact": "Eine unterdimensionierte Protokollierungsinfrastruktur kann zu verlorenen oder unvollständigen Protokolldaten führen. Dies verhindert die Erkennung von Sicherheitsvorfällen, ",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.1.5 (Protokollierung), Anforderung OPS.1.1.5.A5 (Ausreichende Dimensionierung der Protokollierungsinfrastruktur).",
      "action": "Ausreichende Kapazität für die Protokollierungsinfrastruktur sicherstellen",
      "mitigation": "Die Protokollierungsinfrastruktur muss mit ausreichender Kapazität ausgelegt sein, um sowohl die normale Betriebslast als auch Spitzenlasten während Sicherheitsvorfällen zu bewältigen. ",
      "check": "Ist die Protokollierungsinfrastruktur (Speicher, CPU, Netzwerk) so dimensioniert, dass sie Spitzenprotokollvolumina bewältigen kann, insbesondere während eines simulierten Sicherheitsvorfalls? ",
      "detectionLogic": "Dieses Risiko wird für zentrale Überwachungs- und Protokollierungssysteme (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass dieses Risiko eintritt, ist hoch, wenn ein zentrales Protokollierungs-/Überwachungssystem eine große Anzahl von Quellen hat und keine explizite Kapazitätsplanung durchgeführt wurde. ",
      "falsePositives": "Das Modell kann die tatsächliche Hardware- oder Cloud-Ressourcenzuweisung nicht kennen. Ein "
    },
    "testing-with-production-data-bsi-con-6": {
      "title": "Testen mit Produktionsdaten (BSI CON.6)",
      "description": "Wenn Software mit Produktionsdaten getestet wird, können erhebliche Sicherheitsprobleme auftreten. ",
      "impact": "Diese Praxis kann schwere Verletzungen der Vertraulichkeit, Integrität und Verfügbarkeit verursachen. Unbefugter Zugriff auf sensible Daten kann zu Datenschutzverletzungen, finanziellen Verlusten und Reputationsschäden führen. ",
      "asvs": "V14.3.1: Überprüfen, dass Test- und Produktionsumgebungen streng getrennt sind.",
      "action": "Test-/Entwicklungs- und Produktionsumgebungen trennen; anonymisierte oder synthetische Daten für Tests verwenden",
      "mitigation": "Test-, Entwicklungs- und Produktionsumgebungen strikt trennen. Eine Richtlinie etablieren, die die Verwendung von echten Produktionsdaten für Tests verbietet. ",
      "check": "Sind Test- und Produktionsumgebungen logisch und physisch getrennt? Gibt es eine Richtlinie, die die Verwendung von Produktionsdaten für Tests verbietet? ",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von Datenflüssen von Produktionsdatenspeichern zu Entwicklungs- oder Testsystemen erkannt. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn im Modell ein direkter Datenfluss von einem Produktionsdatenspeicher zu einer Testumgebung existiert. ",
      "falsePositives": "Ein Datenfluss könnte fälschlicherweise mit "
    },
    "insufficient-software-testing-con1": {
      "title": "Ungenügende Softwaretests und Freigabeverfahren (BSI OPS.1.1.6)",
      "description": "Wenn neue Software nicht oder nur unzureichend getestet und ohne ordnungsgemäße Installationsverfahren freigegeben wird, können kritische Fehler unentdeckt bleiben. ",
      "impact": "Unentdeckte Software- oder Installationsfehler können zu unerwartetem Systemverhalten, Abstürzen, Datenbeschädigung oder Datenverlust führen, insbesondere wenn Updates bereitgestellt werden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.6 (Software-Tests und Freigaben), z. B. A2/A4/A15.",
      "action": "Einen formalen Softwaretest- und Freigabemanagementprozess etablieren und durchsetzen",
      "mitigation": "Einen formalen, mehrstufigen Testprozess für alle neuen und aktualisierten kundenspezifisch entwickelten Software vor der Bereitstellung implementieren. Dies sollte Unit-, Integrations- und Benutzerakzeptanztests (UAT) umfassen. ",
      "check": "Gibt es eine dokumentierte Softwaretest- und Freigaberichtlinie? Werden Testergebnisse (einschließlich Sicherheitstests) vor der Freigabe überprüft und genehmigt? Werden Installations- und Rollback-Anleitungen für alle Software bereitgestellt? Wird ein Änderungsmanagementprozess für alle Produktionsbereitstellungen strikt befolgt?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Organisation einen sehr ausgereiften und rigoros durchgesetzten SDLC- und Testprozess hat, der im Bedrohungsmodell nicht sichtbar ist. "
    },
    "inadequate-release-process": {
      "title": "OPS.1.1.6 – Unzureichender Softwaretest-/Freigabe- & Genehmigungsprozess",
      "description": "Softwareänderungen können ohne strukturierte Tests, explizite Freigabe oder Integritätsprüfungen der Artefakte in die Produktion gelangen. Fehlende Genehmigungen oder schwache Kontrollmechanismen können die Bereitstellung von nicht verifiziertem Code ermöglichen.",
      "impact": "Nicht genehmigte oder unzureichend getestete Releases können unbeabsichtigte oder bösartige Funktionen einführen, benötigte Features entfernen, die Kompatibilität beeinträchtigen oder Sicherheitskontrollen schwächen – was die Integrität und Verfügbarkeit direkt bedroht und potenziell Daten preisgibt.",
      "asvs": "OWASP ASVS: V1.1 (SDLC) • V14.2 (Supply Chain) • ISO/IEC 29119 (Testing)",
      "action": "Auditierbare Freigabe-Gates mit expliziten Genehmigungen und Integritätsüberprüfung von Artefakten etablieren und durchsetzen.",
      "mitigation": "Einen dokumentierten, wiederholbaren Freigabe-Workflow definieren: obligatorische Freigaben (Produkt/QS/Sicherheit), Funktionstrennung, CI/CD-Gates (Policy-as-Code), Signierung/Prüfsummen von Artefakten, Kontrollen für die Umgebungsbeförderung und begrenzte Bereitstellungsrechte. Nachweise für jede Bereitstellung aufbewahren.",
      "check": "Gibt es ein schriftliches Test- & Freigabeverfahren? Werden die letzten Bereitstellungen durch nachprüfbare Genehmigungen und Integritätsaufzeichnungen der Artefakte gestützt? Verhindern Pipelines, dass nicht genehmigte oder unsignierte Artefakte in die Produktion befördert werden?",
      "detectionLogic": "Wird für im Geltungsbereich befindliche technische Assets mit customDevelopedParts=true ausgelöst, die ausführbaren Code oder Datenspeicher repräsentieren (Prozesse/Datenspeicher). Heuristik (konzeptionell): höhere Priorität, wenn das Asset geschäftskritisch ist, sensible Daten verarbeitet oder speichert oder keine modellierten Referenzen zu Genehmigungs-Gates aufweist. Das Fehlen modellierter Freigabekontrollen wird als Warnung behandelt, die eine Überprüfung erfordert.",
      "riskAssessment": "Die Auswirkung skaliert mit den CIA-Anforderungen des Assets: Wichtig⇒Mittel, Kritisch⇒Hoch, Missionskritisch/Streng Vertraulich⇒Sehr Hoch. Die Wahrscheinlichkeit wird für kundenspezifische Software aufgrund der üblichen organisatorischen Abweichung bei der Durchsetzung von Genehmigungen auf „Wahrscheinlich“ gesetzt.",
      "falsePositives": "Organisatorische Freigabeprozesse können außerhalb des Modells existieren (z. B. out-of-band CAB/ITIL). Vor der Behebung validieren. Wenn starke Pipeline-Richtlinien und Artefakt-Signierung bereits durchgesetzt werden, kann dies mit Nachweis als akzeptiert markiert werden."
    },
    "incomplete-test-documentation-bsi-con-1-a12": {
      "title": "Unvollständige Testdokumentation (BSI CON.1.A12 / OPS.1.1.6)",
      "description": "Wenn die Dokumentation von Softwaretests unvollständig ist, kann nachträglich nicht mehr festgestellt werden, was und mit welchen Ergebnissen getestet wurde. ",
      "impact": "Fehler oder fehlende Funktionen, die vor einer Freigabe nicht ordnungsgemäß dokumentiert und behoben werden, können die Integrität der verarbeiteten Daten direkt beeinträchtigen (unbeabsichtigte Änderung/Löschung). ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.6 Software-Tests und Freigaben; CON.1.A12 Dokumentation zu Tests und Freigaben",
      "action": "Umfassende, überprüfbare Testdokumentation und Freigabekriterien einführen und durchsetzen.",
      "mitigation": "Sicherstellen, dass alle Testaktivitäten (Testplan, -fälle, -daten, -umgebung, Ausführungsprotokolle, -ergebnisse, -fehler und Genehmigungen) vollständig, nachvollziehbar und versioniert sind. ",
      "check": "Gibt es eine durchgesetzte Richtlinie für Testdokumentation und Freigabekriterien? Werden Testergebnisse und Abweichungen vor der Genehmigung überprüft? Wird ein Bug-Tracker verwendet und werden Regressionstests und Umgebungstrennung praktiziert?",
      "detectionLogic": "Wird für jedes technische Asset mit customDevelopedParts=true ausgelöst, das im Geltungsbereich liegt. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird auf ",
      "falsePositives": "Kann ein False Positive sein, wenn ein ausgereifter und durchgesetzter Prozess existiert: schriftliche Richtlinien, Testpläne, Regressionstests, getrennte Testumgebungen, formale Genehmigungen und ein obligatorischer Fehlermanagement-Workflow. "
    },
    "unclear-software-release-criteria": {
      "title": "Unklare Kriterien für die Softwarefreigabe (BSI-abgeleitet)",
      "description": "Wenn die Freigabekriterien für Software nicht klar definiert und kommuniziert werden, kann Software vorzeitig mit unentdeckten Fehlern freigegeben werden, oder umgekehrt können Freigaben unnötig verzögert werden. ",
      "impact": "Die vorzeitige Freigabe von Software kann Versionen mit unentdeckten Fehlern einführen, die potenziell den Produktionsbetrieb stören und die Integrität und Verfügbarkeit des Systems beeinträchtigen. ",
      "asvs": "ASVS V1.1 (Secure Software Development Lifecycle Requirements)",
      "action": "Klare Freigabekriterien definieren, dokumentieren und durchsetzen",
      "mitigation": "Formale Freigabekriterien festlegen und dokumentieren, die funktionale Korrektheit, Sicherheitsüberprüfungen (z. B. SAST/DAST-Ergebnisse, Abhängigkeitsscans), Leistungstests und Betriebsbereitschaft abdecken. ",
      "check": "Gibt es eine formale, dokumentierte Richtlinie für Softwarefreigabekriterien? Erzwingen Build-Pipelines Überprüfungen im Zusammenhang mit diesen Kriterien? Gibt es einen formalen Genehmigungs- oder Abnahmeprozess für Produktionsfreigaben?",
      "detectionLogic": "Dieses organisatorische Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als `custom_developed_parts` gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn für das Asset ein robuster, gut dokumentierter Freigabeprozess vorhanden ist, dieser aber im Modell nicht mit dem Tag `release-criteria:documented` gekennzeichnet wurde."
    },
    "compromise-of-system-management-solution": {
      "title": "Kompromittierung der Systemmanagement-Lösung",
      "description": "Aufgrund ihrer zentralen Position und der notwendigen Zugriffsrechte auf alle verwalteten Systeme sind Systemmanagement-Lösungen ein Hauptziel für Angriffe. ",
      "impact": "Eine erfolgreiche Kompromittierung kann zur vollständigen Übernahme aller verwalteten Systeme führen. Angreifer könnten Ransomware installieren, sensible Daten aus der gesamten verwalteten Flotte exfiltrieren oder weitreichende Dienstausfälle verursachen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.1.5 (Patch- und Änderungsmanagement), insbesondere Anforderung OPS.1.1.5.A13 (Zeitnahe Anwendung sicherheitsrelevanter Patches und Updates).",
      "action": "Systemmanagement-Lösungen härten und zeitnahes Patchen sicherstellen",
      "mitigation": "Einen robusten Patch- und Schwachstellenmanagementprozess für die Systemmanagement-Lösung selbst implementieren. ",
      "check": "Gibt es einen dokumentierten und effektiven Patch-Management-Prozess für die Systemmanagement-Lösung? Ist die Lösung selbst gehärtet? Ist der Zugriff auf ihre Verwaltungsschnittstellen nur auf autorisiertes Personal und Systeme beschränkt?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit als `@SystemManagementSolution` getaggt ist. Das Tool identifiziert dann alle von dieser Lösung verwalteten Systeme (über ausgehende Kommunikationsverbindungen), um den potenziellen Explosionsradius zu bewerten und die Auswirkung zu berechnen.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als höher angesehen, wenn die Management-Lösung dem Internet ausgesetzt ist oder aus kundenspezifisch entwickelten Teilen besteht, da diese Faktoren die Angriffsfläche vergrößern. ",
      "falsePositives": "Dieses Risiko kann auch für gut gewartete und gehärtete Systeme gemeldet werden, da das Modell den aktuellen Patch-Stand oder die Wirksamkeit operativer Sicherheitskontrollen nicht überprüfen kann. Es sollte als ständiges Risiko betrachtet werden, das durch robuste operative Prozesse akzeptiert oder gemindert werden muss."
    },
    "faulty-automation-from-scripts-bsi": {
      "title": "Kompromittierung durch fehlerhafte Systemmanagement-Automatisierung (BSI-konform)",
      "description": "Alle Schutzziele (Vertraulichkeit, Integrität, Verfügbarkeit) der verwalteten Systeme können durch fehlerhafte Automatisierung gefährdet werden. ",
      "impact": "Ein einziger Fehler in der Automatisierung (z. B. ein fehlerhafter Konfigurations-Push oder eine unsichere Aufgabe) kann sich schnell über viele Systeme ausbreiten, einschließlich hochkritischer, und zu Ausfällen, Manipulationen oder Datenlecks führen.",
      "asvs": "ASVS V1, V2, V3, V11.3.1 (Sicherheit des Bereitstellungsprozesses)",
      "action": "Automatisierung, die Systeme verwaltet, härten und validieren",
      "mitigation": "SDLC-Kontrollen auf Automatisierung und IaC anwenden: Code-Reviews, statische Prüfungen, Tests und gestaffelte Rollouts mit automatischem Rollback. ",
      "check": "Werden Automatisierungsskripte/-pipelines überprüft und getestet? Haben Automatisierungskonten nur die notwendigen Berechtigungen? ",
      "detectionLogic": "Wird für technische Assets ausgelöst, die eine Systemmanagement-Automatisierung darstellen (Build-/Deploy-Pipelines, Scheduler, Orchestrierung, Repos mit Webhooks) ",
      "riskAssessment": "Die Wahrscheinlichkeit steigt, wenn kundenspezifisch entwickelte Automatisierung vorhanden ist oder häufig geändert wird. Die Auswirkung leitet sich von den CIA-Bewertungen des Ziels ab—",
      "falsePositives": "Kann ein False Positive sein, wenn Verbindungen ausschließlich schreibgeschützt/zur Überwachung dienen, Workflows formal verifiziert sind oder Änderungen nicht auf Ziele angewendet werden können (z. B. air-gapped, unveränderlich)."
    },
    "insecure-system-management-communication": {
      "title": "Unsichere Kommunikation im Systemmanagement (BSI CON.6)",
      "description": "Zufällige Störungen oder gezielte Angriffe auf die Systemmanagement-Kommunikation können die Integrität und Verfügbarkeit der verwalteten IT-Systeme verletzen. Wenn die Systemmanagement-Kommunikation abgehört wird, können Daten, die zu und von den Systemen übertragen werden, aufgezeichnet und eingesehen werden. Wenn die Kommunikation manipuliert wird, können aktive Systeme von Unbefugten kontrolliert werden.",
      "impact": "Wenn ein Angreifer diese Kommunikation abhören oder manipulieren kann, kann er sensible Konfigurationsdaten, Anmeldeinformationen oder Betriebsdaten abfangen (Verletzung der Vertraulichkeit). Er könnte auch bösartige Befehle einschleusen, um Systemkonfigurationen zu ändern, Malware zu verbreiten oder Dienste zu stören (Verletzung von Integrität und Verfügbarkeit), wodurch er effektiv unbefugte Kontrolle über das Zielsystem erlangt (Elevation of Privilege).",
      "asvs": "V6.1.1: Überprüfen, dass alle Kommunikationen zwischen Komponenten mit TLS mit einer starken Konfiguration verschlüsselt sind.",
      "action": "Kommunikationsverbindungen im Systemmanagement absichern",
      "mitigation": "Alle für das Systemmanagement verwendeten Kommunikationsverbindungen (`usage: devops`) müssen starke, verschlüsselte Protokolle verwenden (z. B. HTTPS, SSH, WSS, FTPS). Sicherstellen, dass starke Authentifizierungsmethoden verwendet werden und die Authentifizierung niemals auf `none` gesetzt ist. Für hochsensible Verbindungen, die Vertrauensgrenzen überschreiten, die Verwendung eines VPN (`vpn: true`) erzwingen und eine strenge IP-Filterung implementieren.",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen mit `usage: devops`. Überprüfen Sie, ob ihr `protocol` eine verschlüsselte Variante ist und dass die `authentication` nicht `none` ist. Prüfen Sie, ob diese Verbindungen Vertrauensgrenzen ohne zusätzlichen Schutz wie ein VPN überschreiten.",
      "detectionLogic": "Diese Regel wird für jede `CommunicationLink` ausgelöst, bei der `usage` `devops` ist und die Verbindung entweder unverschlüsselt ist (geprüft über `isProtocolEncrypted`) oder keine Authentifizierung verwendet (`authentication: none`). Das Risiko wird ignoriert, wenn die Verbindung als durch ein VPN geschützt markiert ist (`vpn: true`).",
      "riskAssessment": "Die Wahrscheinlichkeit basiert auf dem Kontext. Eine unverschlüsselte Managementverbindung in einem vertrauenswürdigen internen Netzwerk könnte ",
      "falsePositives": "Eine Verbindung könnte fälschlicherweise als `devops` getaggt sein. Die Kommunikation könnte durch ein externes VPN getunnelt sein, aber nicht mit dem `vpn: true`-Flag modelliert sein. Einige ältere Überwachungsprotokolle könnten absichtlich unverschlüsselt, aber stark durch eine Firewall geschützt sein; dies könnte eine gültige Ausnahme sein, wenn sie dokumentiert ist."
    },
    "insufficient-time-synchronization-bsi-ops114-a4": {
      "title": "Ungenügende Zeitsynchronisation (BSI OPS.1.1.7.A3)",
      "description": "Fehler bei der Zeitsynchronisation können Probleme und Ereignisse verschleiern, was die Erkennung von Sicherheitsvorfällen und Datenexfiltration erschwert. ",
      "impact": "Dies kann die Reaktion auf Vorfälle erheblich behindern, unbefugte Aktivitäten verbergen und die Authentifizierung oder andere zeitkritische Protokolle stören. ",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.1.7 (Systemmanagement), Anforderung A3 (Zeitsynchronisation für das Systemmanagement)",
      "action": "Zentralisierte Zeitsynchronisation sicherstellen und durchsetzen",
      "mitigation": "Alle serverseitigen technischen Assets, insbesondere solche, die an der Protokollierung, Überwachung, Authentifizierung und Transaktionsverarbeitung beteiligt sind, müssen so konfiguriert sein, dass sie eine zentrale, zuverlässige Zeitquelle verwenden (z. B. über NTP). ",
      "check": "Sind alle serverseitigen Systeme und relevanten Geräte (wie IoT) so konfiguriert, dass sie einen zentralen NTP-Server verwenden? Wird der Zustand des NTP-Dienstes überwacht? Zeigen Protokolle von verschiedenen Systemen synchronisierte Zeitstempel?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche, serverseitige technische Asset ausgelöst (d. h. kein typischer Client wie ein Browser oder eine mobile App), das nicht explizit als zeitsynchronisiert über ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird aufgrund des Fehlens eines spezifischen Tags im Modell generiert. Es kann ein False Positive sein, wenn das Asset tatsächlich zeitsynchronisiert ist, aber im Modell noch nicht entsprechend getaggt wurde. Eine Überprüfung mit dem Betriebsteam ist erforderlich."
    },
    "incompatible-system-management-solution": {
      "title": "Inkompatible Systemmanagement-Lösung (bezogen auf BSI G 0.23)",
      "description": "Eine teilweise kompatible Systemmanagement-Lösung kann Fehlfunktionen in den verwalteten IT-Systemen verursachen und deren Verfügbarkeit einschränken. ",
      "impact": "Die primäre Auswirkung liegt auf der **Verfügbarkeit** der verwalteten Systeme, was potenziell zu Instabilität, unerwartetem Verhalten oder Abstürzen führen kann. ",
      "asvs": "Basiert auf BSI IT-Grundschutz Katalog, Gefährdung G 0.23 ",
      "action": "Kompatibilität von Systemmanagement-Tools überprüfen und testen",
      "mitigation": "Sicherstellen, dass jede Systemmanagement-Lösung vollständig mit den von ihr verwalteten Zielsystemen kompatibel ist. Dies sollte vor der Erstbereitstellung überprüft und nach Updates entweder des Management-Tools oder des verwalteten Systems erneut validiert werden. ",
      "check": "Gibt es eine dokumentierte Kompatibilitätsmatrix für die Management-Tools und die von ihnen verwalteten Systeme? Gibt es einen Test- und Validierungsprozess, um die Kompatibilität nach Updates zu überprüfen?",
      "detectionLogic": "Wird bei Kommunikationsverbindungen ausgelöst, die von Assets ausgehen, die als Systemmanagement-Tools identifiziert wurden (z. B. Monitoring, Scheduler, Container Platform, IDS/IPS), zu anderen technischen Assets. Das Risiko hebt das Potenzial für Inkompatibilität zwischen dem Tool und dem Ziel hervor, was eine manuelle Überprüfung erfordert.",
      "riskAssessment": "Die Auswirkung leitet sich von der **Verfügbarkeits**-Bewertung des verwalteten Ziel-Assets ab. Ein `mission-critical`-Ziel führt zu einem ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn das Management-Tool explizit für das Zielsystem entwickelt und zertifiziert ist (z. B. ein herstellerspezifisches Tool)."
    },
    "connection-interruption-system-management": {
      "title": "Verbindungsunterbrechung der Systemmanagement-Lösung (BSI SYS.1.6.A1)",
      "description": "Verbindungsunterbrechungen können die Verfügbarkeit einer Systemmanagement-Lösung einschränken. ",
      "impact": "Wenn eine Verbindung unterbrochen oder gestört wird, können kostspielige, sicherheitsrelevante und zeitkritische Aufgaben nicht termingerecht ausgeführt werden. ",
      "asvs": "ASVS V9.1: Denial of Service Defenses",
      "action": "Netzwerk- und Systemresilienz für Managementverbindungen sicherstellen",
      "mitigation": "Redundante Netzwerkpfade für kritische administrative Verbindungen implementieren. Hochverfügbarkeitskonfigurationen für die Systemmanagement-Lösung selbst sicherstellen und die Verbindungsgesundheit überwachen. ",
      "check": "Werden Kommunikationsverbindungen zu Systemmanagement-Tools auf Verfügbarkeit überwacht? Ist die Systemmanagement-Lösung in einer hochverfügbaren Konfiguration bereitgestellt? ",
      "detectionLogic": "Dieses Risiko wird für ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Unterbrechung ist bei Verbindungen höher, die unzuverlässige Netzwerke (wie das Internet) ohne robuste Protokolle oder VPNs durchqueren. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn Netzwerkredundanz vorhanden ist, aber nicht explizit modelliert wurde (z. B. über BGP, mehrere NICs oder SD-WAN). "
    },
    "connection-loss-to-managed-systems": {
      "title": "Verbindungsverlust zu verwalteten Systemen",
      "description": "Verbindungsunterbrechungen zu Systemen, die verwaltet werden (z. B. für Administration, Überwachung oder Bereitstellungen), können die Verfügbarkeit und Integrität von Diensten innerhalb des Informationsnetzwerks beeinträchtigen. Das Ausmaß eines solchen Verbindungsverlusts bestimmt, ob Dienste beeinträchtigt werden und welcher Schaden entstehen kann. Die resultierenden Fehlermuster können schwer zu analysieren sein, und die daraus resultierenden Fehler können schwer zu beheben sein.",
      "impact": "Ein Verlust einer Managementverbindung kann zu einer Dienstverschlechterung oder zu vollständigen Ausfällen (Denial of Service) führen. Es kann auch zu Dateninkonsistenzen oder -beschädigungen kommen, wenn laufende Prozesse abrupt unterbrochen werden (Verlust der Integrität). Darüber hinaus können die resultierenden Fehler schwer zu diagnostizieren sein, was die Ausfallzeit verlängert und den betrieblichen Aufwand erhöht.",
      "asvs": "Abgeleitet von allgemeinen BSI-Gefährdungsbewertungen. Eng verwandt mit den Prinzipien des BSI IT-Grundschutz Bausteins CON.3 (Redundanz).",
      "action": "Redundante Verbindungen und Failover-Mechanismen implementieren",
      "mitigation": "Sicherstellen, dass kritische Management- und Betriebsverbindungen redundant sind. Hochverfügbare Netzwerkkonfigurationen verwenden. Automatisierte Zustandsprüfungen für Verbindungen mit Failover-Funktionen implementieren. Robuste Überwachung und Alarmierung sollten vorhanden sein, um Verbindungsfehler schnell zu erkennen und darauf zu reagieren. Die Zielsysteme selbst sollten nach Möglichkeit ebenfalls redundant sein.",
      "check": "Sind Verbindungen für Management und Betrieb zu kritischen Systemen auf hohe Verfügbarkeit ausgelegt? Alarmieren Überwachungssysteme bei Verbindungsfehlern? Ist das Zielsystem selbst redundant, um die Auswirkungen eines Ausfalls der Steuerungsebene zu mindern?",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen mit `devops`-Nutzung ausgelöst, die zu wichtigen oder kritischen technischen Assets führen, insbesondere wenn das Ziel-Asset nicht als redundant gekennzeichnet ist. Der Schweregrad steigt basierend auf dem Ziel.",
      "riskAssessment": "Die Auswirkung wird durch die höchsten Verfügbarkeits- und Integritätsanforderungen des Ziel-Assets und der von ihm verarbeiteten Daten bestimmt. Ein Mangel an Redundanz im Zielsystem erhöht die Auswirkung erheblich. Die Wahrscheinlichkeit eines Vorfalls wird bei nicht-redundanten Zielen als höher angesehen, da ein einziger Verbindungsfehler direkt zu einem Verlust der Managementfähigkeit führt.",
      "falsePositives": "Das Modell erfasst möglicherweise keine zugrunde liegende Redundanz auf Netzwerkebene (z. B. redundante Switches, Link-Aggregation). Das Risiko kann akzeptabel sein, wenn bestätigt wird, dass eine solche Resilienz auf Infrastrukturebene vorhanden ist."
    },
    "uncoordinated-network-and-system-management": {
      "title": "Unkoordinierte Netzwerk- und Systemverwaltung",
      "description": "Unkoordinierte Aktionen in der Netzwerkverwaltung können sich negativ auf die Systemverwaltung auswirken. ",
      "impact": "Wenn Änderungen an Netzwerk- und Systemkonfigurationen nicht koordiniert werden, kann dies zu Dienstunterbrechungen (Denial of Service) oder Datenbeschädigung (Integritätsverlust) führen. ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5 Patch- und Änderungsmanagement",
      "action": "Koordiniertes Änderungsmanagement etablieren und durchsetzen",
      "mitigation": "Einen einheitlichen Änderungsmanagementprozess implementieren, der sowohl die Netzwerk- als auch die Systeminfrastruktur abdeckt. ",
      "check": "Gibt es einen integrierten Änderungsmanagementprozess für Netzwerk und Systeme? Werden Netzwerkänderungen auf ihre Auswirkungen auf Anwendungs- und Datenflüsse bewertet? ",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen identifiziert, die Netzwerk-Vertrauensgrenzen durchqueren. ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Vorfalls ist höher, wenn die Kommunikation administrative oder Netzwerkgrenzen überschreitet. ",
      "falsePositives": "Dieses Risiko kann in Organisationen mit außergewöhnlich ausgereiften und integrierten Änderungsmanagementprozessen ein False Positive sein, auch bei komplexen Netzwerkarchitekturen. "
    }
  }
}
