{
  "meta": {
    "part": 1,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "ÜBERSETZUNGSANWEISUNGEN:",
      "1. Übersetzen Sie alle Textwerte vom Englischen ins Deutsche",
      "2. Behalten Sie die gesamte JSON-Struktur und alle Schlüssel unverändert bei",
      "3. Behalten Sie alle HTML-Tags, Fachbegriffe und BSI-Referenzen bei",
      "4. Behalten Sie die Risiko-IDs (Schlüssel) exakt bei",
      "5. Dies ist Teil 1 von 8 - übersetzen Sie nur diese Datei"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "inadequate-network-performance-for-virtual-clients": {
      "title": "Risiken bei Netzwerkkapazität und Latenz für virtualisierte Clients und kritische Verbindungen (BSI SYS.2.5)",
      "description": "Fehlende oder unzureichende Planung der Netzwerkkapazität und Latenz für Verbindungen zu und von virtuellen Clients (oder anderen kritischen Komponenten) kann die Funktionalität und Geschäftsabläufe beeinträchtigen. Im Kontext des BSI sind Terminal-/Remote-Desktop-ähnliche Workloads besonders empfindlich gegenüber Latenz und Jitter; unterdimensionierte Verbindungen zu Benutzern oder Backend-Diensten (Dateidienste, Datenbanken, Verzeichnisdienste und Konferenzsysteme) verursachen Einfrieren, Timeouts und Dienstunterbrechungen.",
      "impact": "Eingeschränkter oder instabiler Zugriff auf Dienste, träge Benutzeroberfläche, erhöhte Fehlerraten und Timeouts – was letztendlich die Verfügbarkeit beeinträchtigt. Für Endbenutzer äußert sich dies in langsamen, nicht reagierenden oder unbrauchbaren Anwendungen; bei Backend-Systemen kann dies zu festgefahrenen Threads, Warteschlangenstau und Teilausfällen führen.",
      "asvs": "Basiert auf BSI IT-Grundschutz SYS.2.5 Client-Virtualisierung und SYS.1.6 Virtualisierung; bezieht sich auf die Gefährdung „T 4.29: Unzureichende Netzanbindung von virtuellen Maschinen“. Die fiktive Anforderungs-ID ",
      "action": "Bandbreite/Latenz/QoS für alle kritischen Verbindungen dokumentieren, bereitstellen und überprüfen.",
      "mitigation": "Identifizieren und dokumentieren Sie Bandbreiten-, Latenz-, Jitter- und Paketverlust-SLOs für Endbenutzer- und Backend-Pfade. Stellen Sie ausreichende Kapazität und QoS (einschließlich DSCP/klassenbasiertem Queuing, wo anwendbar) bereit. Vermeiden Sie Überbuchung. Testen Sie vor der Inbetriebnahme mit synthetischer Last und realen Benutzerwegen. Überwachen Sie kontinuierlich (APM/NPM) und alarmieren Sie bei SLO-Verletzungen. Für durch diese Regel markierte Verbindungen, legen Sie explizit Nachweise vor, dass das Netzwerk die erwartete Spitzennachfrage erfüllt.",
      "check": "Haben kritische Verbindungen definierte Bandbreiten-/Latenz-/Jitter-SLOs und Bemessungsberechnungen? Ist QoS konfiguriert und End-to-End validiert (einschließlich WAN/Cloud-Edges)? Sind Performance-Dashboards/Alerts vorhanden und werden sie überprüft, mit Handlungsanweisungen (Runbooks) für Leistungsabfälle?",
      "detectionLogic": "Wird für jede nicht-lokale Kommunikationsverbindung ausgelöst, die entweder (1) explizit mit @Latency:Critical getaggt ist oder (2) mindestens ein Daten-Asset mit Mission-Critical-Verfügbarkeit transportiert. Lokale, nicht-netzwerkbasierte Interaktionen (In-Process-Aufrufe oder lokaler Dateizugriff) sind ausgeschlossen. Die Auswirkung leitet sich aus der höchsten Verfügbarkeit der Verbindung oder des Ziels ab; wenn eine Client-Technologie beteiligt ist, wird die Auswirkung aufgrund der benutzerseitigen Effekte minimal erhöht.",
      "riskAssessment": "Wahrscheinlichkeit: Standardmäßig 'Wahrscheinlich' für latenzempfindliche oder geschäftskritische (mission-critical) Abläufe, da Leistungseinbußen ohne explizite Kapazitätsplanung häufig sind. Auswirkung: abgeleitet aus der maximalen Verfügbarkeit des Ziel-Assets und der Verbindung; Mission-Critical-Abläufe werden als 'Hohe' Auswirkung eingestuft. Eine Beteiligung auf der Benutzerseite (Client) hebt die Untergrenze auf mindestens 'Mittel' an.",
      "falsePositives": "Akzeptabel, wenn Sie auf aktuelle Kapazitätspläne, QoS-Konfigurationen, Last-/Latenztestergebnisse und Live-Überwachung verweisen können, die Reserven unter Spitzen- und Ausfallszenarien nachweisen. In solchen Fällen dokumentieren Sie die Nachweise und erwägen Sie, die Instanz als mitigiert zu kennzeichnen."
    },
    "insufficient-virtual-client-resources": {
      "title": "Unzureichende Ressourcen für virtuelle Clients (BSI SYS.2.5 – Gefährdung 2.2, Anforderung A10)",
      "description": "Virtuelle Desktop-/Client-Workloads (VDI) erfordern ausreichend CPU, RAM, Speicher-IOPS, GPU und Netzwerkdurchsatz. Wenn ein virtueller Client unterdimensioniert ist oder um gemeinsam genutzte Ressourcen konkurriert, verlangsamen sich benutzerseitige Anwendungen oder starten nicht, was sich direkt auf den Geschäftsbetrieb auswirkt.",
      "impact": "Ein Leistungseinbruch bei virtuellen Clients beeinträchtigt die Verfügbarkeit von Benutzer-Workflows: längere Anmeldezeiten, eingefrorene Anwendungen, fehlerhaftes Rendering und Timeouts bei nachgelagerten Diensten. Bei hochverfügbaren Rollen kann dies kritische Prozesse und die Produktivität ganzer Teams zum Erliegen bringen.",
      "asvs": "BSI-Zuordnung: SYS.2.5 Client-Virtualisierung – 2.2 Ressourcenknappheit; SYS.2.5.A10 Bedarfsgerechte Zuweisung von Ressourcen.",
      "action": "Ressourcen für virtuelle Clients (VDI) richtig dimensionieren und garantieren.",
      "mitigation": "Definieren Sie persona-basierte Ressourcenprofile; reservieren Sie minimale CPU/RAM/IOPS; ermöglichen Sie eine dynamische Anpassung der Größe mit überwachten Obergrenzen; weisen Sie GPUs nur bei Bedarf zu/virtualisieren Sie sie; erstellen Sie Baselines und Warnmeldungen für CPU-, RAM-, IOPS-, GPU- und Netzwerksättigung; verwenden Sie Ressourcenpools, Reservierungen, Limits und Anteile; verhindern Sie verschachtelte Virtualisierung; halten Sie Vorlagen aktuell und gehärtet.",
      "check": "Sind die Baselines für CPU/RAM/IOPS/GPU/Netzwerk pro Rolle dokumentiert? Sind Reservierungen/Limits/Anteile auf der Virtualisierungsplattform konfiguriert? Ist eine Überwachung mit Schwellenwerten und Warnmeldungen für VDI-Sitzungen und Hosts aktiv? Sind die Benutzer über die gleichzeitige starke Nutzung aufgeklärt?",
      "detectionLogic": "Löst einen Befund für jedes im Geltungsbereich befindliche technische Asset aus, bei dem machine === Virtual UND technology ∈ {ClientSystem, Desktop} gilt. Schließt Assets außerhalb des Geltungsbereichs aus. Die Auswirkung wird durch die Verfügbarkeitsanforderung des Assets skaliert. Bestimmt für VDI/virtuelle Desktop-/Client-Systeme, die unter Ressourcenkonflikten oder Unterdimensionierung leiden könnten.",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich – Ressourcenkonflikte und falsche Dimensionierung sind in virtuellen Desktop-Umgebungen häufig. Auswirkung: abgeleitet aus der Verfügbarkeit des Assets (MissionCritical → Hoch; Critical/Important → Mittel; sonst Niedrig).",
      "falsePositives": "Geringes Risiko, wenn strikte Reservierungen und dedizierte Ressourcenpools eine Mindestleistung garantieren (z. B. vCPU-/Speicherreservierungen, dedizierte GPUs, nachgewiesene Reserven) und eine kontinuierliche Leistungsüberwachung keine Sättigung unter Spitzenlast zeigt."
    },
    "resource-exhaustion-on-virtualization-platform": {
      "title": "Ressourcenerschöpfung auf der Virtualisierungsplattform (BSI CON.5)",
      "description": "Virtualisierungs-Hosts konsolidieren viele Clients auf gemeinsam genutzten CPU, RAM, Speicher und I/O. Ohne sorgfältige Kapazitätsplanung und Limits können konkurrierende Tenants um Ressourcen kämpfen, was zu unvorhersehbaren Verlangsamungen oder Ausfällen von virtuellen Clients führt, insbesondere bei dynamischer Zuweisung oder stoßweisen Workloads.",
      "impact": "Erschöpfte Host-Ressourcen beeinträchtigen oder stoppen alle VMs auf diesem Host/Cluster. Dies führt zu einer Verlangsamung des Dienstes oder zu einem Denial-of-Service für abhängige Anwendungen, was hauptsächlich die Verfügbarkeit und indirekt die Integrität beeinträchtigt (z. B. Timeouts, fehlgeschlagene Schreibvorgänge).",
      "asvs": "ASVS V13.2.1: Überprüfen Sie, ob die Anwendung widerstandsfähig gegen Ressourcenerschöpfungsangriffe ist.",
      "action": "Führen Sie Host-Kapazitätsplanung, pro-VM-Quoten/Reservierungen und proaktive Überwachung/Alarmierung ein.",
      "mitigation": "Dimensionieren Sie Hosts für Spitzenlasten mit Reserven; konfigurieren Sie pro-VM CPU-/Speicherreservierungen und harte Limits; kontrollieren Sie Noisy-Neighbor-Effekte (Anteile/Limits); überwachen Sie kontinuierlich die Host- und VM-Auslastung mit Warnmeldungen; testen Sie Failover und Live-Migration; isolieren oder dedizieren Sie Hosts für kritische Tenants; bevorzugen Sie HA-Cluster für Ausfallsicherheit.",
      "check": "Sind CPU-/Speicherreservierungen/-limits pro VM festgelegt? Wird die Cluster-/Host-Auslastung mit Warnmeldungen und SLOs überwacht? Sind HA-/Live-Migrationsfunktionen aktiviert und getestet? Sind kritische Workloads von allgemeinen Tenants isoliert? Gibt es einen dokumentierten Kapazitätsplan mit regelmäßigen Überprüfungen und Stresstests?",
      "detectionLogic": "Wird für jede Shared Runtime ausgelöst, die mehr als ein technisches Asset im Geltungsbereich ausführt (Assets außerhalb des Geltungsbereichs werden ignoriert). Die Wahrscheinlichkeit skaliert mit der Anzahl der Tenants: ≤3 ⇒ Unwahrscheinlich, 4–7 ⇒ Wahrscheinlich, >7 ⇒ Sehr wahrscheinlich. Die Auswirkung ist die maximale Verfügbarkeitsanforderung unter den Tenants: Important ⇒ Mittel, Critical ⇒ Hoch, Mission-Critical ⇒ Sehr hoch. Der kritischste Tenant wird als am relevantesten hervorgehoben. Single-Tenant Shared Runtimes lösen dieses Risiko nicht aus.",
      "riskAssessment": "Mehr Tenants auf einem Host erhöhen die Wahrscheinlichkeit von Konkurrenz; wenige Tenants machen es unwahrscheinlich, viele Tenants machen es sehr wahrscheinlich. Die Auswirkung spiegelt den höchsten Verfügbarkeitsbedarf unter den Co-Tenants wider, sodass das Vorhandensein einer geschäftskritischen VM die Auswirkung auf sehr hoch anhebt, auch wenn andere weniger kritisch sind.",
      "falsePositives": "Kann ein False Positive sein, wenn harte Reservierungen/Limits die Kapazität garantieren, Hosts einem einzigen kritischen Tenant gewidmet sind oder ein HA-/Autoscaling-Cluster ausreichende Reserven unterhält, die durch Stresstests und SLOs validiert sind. Solche Zusicherungen erfordern in der Regel operative Nachweise, die über das Modell hinausgehen."
    },
    "improper-virtual-network-segmentation-on-shared-host": {
      "title": "Unsachgemäße virtuelle Netzwerksegmentierung auf einem gemeinsam genutzten Host (BSI SYS.2.5 §2.4)",
      "description": "Virtuelle Clients mit unterschiedlichen Schutzbedürfnissen werden auf demselben Virtualisierungs-Host betrieben. Wenn virtuelle Netzwerkkomponenten (vSwitches/Portgruppen/VLANs/Uplinks) falsch konfiguriert sind, kann der Client-Verkehr unbeabsichtigte Segmente durchlaufen, was die beabsichtigte Netzwerktrennung untergräbt.",
      "impact": "Fehler in der virtuellen Netzwerksegmentierung können sensible Servernetzwerke für Client-Segmente freilegen und so unbefugten Zugriff, Datenoffenlegung, Manipulation und laterale Bewegungen ermöglichen. Das Zusammenlegen eines internet-zugänglichen Clients mit hochsicheren internen Netzwerken erhöht die Angriffsfläche der Institution erheblich.",
      "asvs": "In Anlehnung an BSI IT-Grundschutz: SYS.2.5 Client-Virtualisierung (insb. Abschnitt 2.4: Netztrennung), SYS.2.1 Allgemeiner Client, SYS.1.5 Virtualisierung und NET.1.1 Netzarchitektur & Design.",
      "action": "Strikte Netzwerksegmentierung auf der Virtualisierungsebene durchsetzen, überprüfen und kontinuierlich überwachen.",
      "mitigation": "Konfigurieren Sie vSwitches/Port-Gruppen/VLAN-Tags, um die modellierten Grenzen durchzusetzen. Bei gemischten Vertrauenszonen auf einem Host verwenden Sie separate virtuelle Switches oder eine starke, verifizierte Isolation (z. B. Mikrosegmentierung). Überprüfen Sie regelmäßig das Hypervisor-Netzwerk gegen die Zielarchitektur. Wenden Sie im Modell ",
      "check": "Laufen technische Assets aus verschiedenen Netzwerk-Vertrauensgrenzen auf derselben Shared Runtime? Wenn ja, gibt es eine robuste, auditierte Trennung auf der Hypervisor-Ebene (korrekte vSwitch/VLAN-Platzierung, kein unbeabsichtigtes Bridging/Uplinks) und – falls zutreffend – eine dokumentierte Härtung (",
      "detectionLogic": "Für jede Shared Runtime ohne das Tag ",
      "riskAssessment": "Die Auswirkung skaliert mit der Sensibilität und Kritikalität der gemischten Assets; das Mischen von internet-zugänglichen Clients mit vertraulichen oder kritischen Backends führt zu einer sehr hohen Auswirkung. Die Wahrscheinlichkeit ist ",
      "falsePositives": "Möglich, wenn eine Out-of-Band-Mikrosegmentierung oder dedizierte Hosts pro Zone (SYS.2.5.A4) existieren, aber nicht modelliert sind. Markieren Sie dies als mitigiert oder akzeptiert mit Begründung, oder fügen Sie das "
    },
    "loss-of-virtual-client-sys3.3": {
      "title": "Verlust eines virtuellen Clients durch Fehlkonfiguration oder Löschung (BSI SYS.2.5)",
      "description": "In Client-Virtualisierungsumgebungen werden die Images virtueller Clients zentral gespeichert und verwaltet. ",
      "impact": "Wenn ein virtueller Client verloren geht oder beschädigt wird, wirkt sich dies direkt auf die Integrität der gespeicherten Daten (da sie gelöscht werden könnten) und die Verfügbarkeit des Clients und seiner Verarbeitungsfunktionen aus. ",
      "asvs": "Basiert auf dem BSI IT-Grundschutz-Modul SYS.2.5 Client-Virtualisierung, das Bedrohungen wie fehlerhafte Planung/Konfiguration und Bedienungsfehler adressiert.",
      "action": "Implementieren Sie Redundanz und @Backup:Target/Restore-Verfahren für virtuelle Clients",
      "mitigation": "Stellen Sie sicher, dass die Images virtueller Clients regelmäßig gesichert werden und dass ein dokumentierter und getesteter Wiederherstellungsprozess vorhanden ist. ",
      "check": "Werden die Images virtueller Clients und ihre Daten regelmäßig gesichert? Gibt es ein dokumentiertes und getestetes Wiederherstellungsverfahren? ",
      "detectionLogic": "Löst bei jedem technischen Asset aus, das ein nicht-redundantes virtuelles Client-System ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit von Bedienungsfehlern oder Fehlkonfigurationen wird allgemein als ",
      "falsePositives": "Das Risiko könnte überschätzt werden, wenn robuste, außerhalb des Modells liegende kompensierende Kontrollen existieren, wie z. B. ein separates, hochwirksames @Backup:Target- und Wiederherstellungssystem, das die Wiederherstellung von Clients unkompliziert macht. "
    },
    "unavailability-of-virtual-clients-bsi-con-3": {
      "title": "Nichtverfügbarkeit von virtuellen Clients (BSI CON.3)",
      "description": "Virtuelle Clients werden – im Gegensatz zu physischen Maschinen – oft zentral vom IT-Betrieb verwaltet, der die Virtualisierungsinfrastruktur administriert. ",
      "impact": "Die Nichtverfügbarkeit eines virtuellen Clients hindert Benutzer daran, ihre Aufgaben auszuführen, was zu Störungen von Geschäftsprozessen und Produktivitätsverlusten führen kann. ",
      "asvs": "BSI IT-Grundschutz CON.3: Virtualisierung (bezogen auf die Gefährdung G 0.14 Ausfall von IT-Komponenten)",
      "action": "Implementieren Sie Hochverfügbarkeits- und Wiederherstellungsverfahren für die Virtualisierungsinfrastruktur",
      "mitigation": "Nutzen Sie Hochverfügbarkeitsfunktionen (HA) der Virtualisierungsplattform, wie Failover-Clustering und Live-Migration, um Ausfallzeiten zu minimieren. ",
      "check": "Ist die Virtualisierungsplattform als Hochverfügbarkeits-Cluster konfiguriert? Gibt es automatisierte Warnmeldungen, wenn ein virtueller Client nicht mehr reagiert? Gibt es dokumentierte und getestete Verfahren zum Neustart von Clients nach Wartungsarbeiten oder einem Host-Ausfall? Ist die ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als virtuelle Maschine (`machine: virtual`) konfiguriert ist und auf einer Shared Runtime läuft, die den Virtualisierungs-Host darstellt. Das Risiko hebt die inhärente Verfügbarkeitsabhängigkeit von der zugrunde liegenden Shared Runtime hervor.",
      "riskAssessment": "Die Wahrscheinlichkeit, dass dieses Risiko eintritt, hängt von der Stabilität, Redundanz und den Wartungsverfahren der Virtualisierungsplattform ab. Die Auswirkung wird durch die Verfügbarkeitsanforderung (Kritikalität) des virtuellen Clients und der von ihm verarbeiteten Daten bestimmt. Ein geschäftskritischer virtueller Client hat eine sehr hohe Auswirkung, wenn er nicht verfügbar ist.",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn die Virtualisierungsplattform bereits mit robusten Hochverfügbarkeits- und automatisierten Wiederherstellungsmechanismen konfiguriert ist, die im Bedrohungsmodell nicht vollständig dargestellt sind. "
    },
    "compromise-of-virtual-client-from-outdated-template": {
      "title": "Kompromittierung virtueller Clients durch veraltete Vorlagen (BSI SYS.2.5 – Gefährdung 2.7, Anforderung A9)",
      "description": "Virtuelle Clients werden typischerweise aus Vorlagen (virtuelles Hardwareprofil und Basis-Image) bereitgestellt. Wenn diese Vorlagen nicht regelmäßig aktualisiert werden, können neu erstellte Clients mit Software ausgeliefert werden, die bereits bekannte Schwachstellen enthält (siehe SYS.2.5 §2.7). Sobald solche Clients von anderen IT-Systemen erreichbar sind, wird eine automatisierte Ausnutzung möglich und kann zur Kompromittierung des Clients führen.",
      "impact": "Eine erfolgreiche Ausnutzung kann die vollständige Kontrolle über den virtuellen Client ermöglichen, was den Diebstahl von Anmeldeinformationen, laterale Bewegungen und die Exfiltration von Daten erlaubt. Dies bedroht die Vertraulichkeit, Integrität und Verfügbarkeit des Clients und kann sich auf benachbarte Systeme und die vom Client verarbeiteten oder gespeicherten Daten ausweiten.",
      "asvs": "Zugeordnet zu BSI IT-Grundschutz SYS.2.5 (A9 Vorlagen aktuell halten; A16/A17 erweiterte Protokollierung und Überwachung) und SYS.1.5 Virtualisierung, wo anwendbar.",
      "action": "Etablieren Sie einen Lebenszyklus für Vorlagen und eine Patch-Governance für virtuelle Clients",
      "mitigation": "Führen Sie einen formalen Lebenszyklus für Vorlagen virtueller Clients ein: Versionieren, Patchen, Testen und planmäßiges Ausmustern. Automatisieren Sie das Neuerstellen von Images und Sicherheitsupdates; mustern Sie veraltete Vorlagen aus. Wenn Sie absichtlich veraltete/verletzliche Clients einsetzen (z. B. für Kompatibilitätstests), beschränken Sie diese auf isolierte Segmente mit strengen Zugriffskontrollen und kontinuierlicher Überwachung. Verwenden Sie das Tag ",
      "check": "Werden Vorlagen zentral verwaltet, versioniert und regelmäßig neu erstellt? Wann war das letzte Update? Gibt es Nachweise für automatisches Patchen und das Entfernen von End-of-Life (EOL)-Vorlagen? Ist bei Test-/Legacy-Clients eine Isolierung durchgesetzt und dokumentiert? Ist die ",
      "detectionLogic": "Markiert jedes technische Asset, das (1) auf einer virtuellen Maschine läuft (Maschinentyp ",
      "riskAssessment": "Die Wahrscheinlichkeit ist standardmäßig ",
      "falsePositives": "Dies kann ein False Positive sein, wenn automatisierte Neuerstellungen/Patching von Vorlagen existieren, aber nicht über "
    },
    "resource-overbooking-in-vdi": {
      "title": "Ressourcen-Überbuchung in VDI",
      "description": "Eine Virtual Desktop Infrastructure (VDI) wird häufig zur Optimierung von Ressourcen verwendet. Wenn jedoch viele virtuelle Clients auf einzelnen Virtualisierungs-Hosts konsolidiert werden oder die Anzahl der Benutzer unterschätzt wird, können die verfügbaren Ressourcen überbucht werden. Dies kann zu schwerwiegenden Ressourcenkonflikten zwischen virtuellen Clients und unvorhersehbaren Leistungseinbußen führen.",
      "impact": "Die Überbuchung von Ressourcen kann zur vorübergehenden Nichtverfügbarkeit von virtuellen Clients (Denial of Service) führen. Leistungseinbußen sind für Benutzer oft nicht transparent, was zu Datenverlust oder unbeabsichtigter Datenänderung führen kann und somit die Integrität und Verfügbarkeit beeinträchtigt.",
      "asvs": "Abgestimmt auf den BSI IT-Grundschutz für Virtualisierung und Client-Management, insbesondere SYS.2.6 Virtual Desktop Infrastructure und APP.1.1 Office Products.",
      "action": "Implementieren Sie VDI-Kapazitätsplanung und Leistungsüberwachung",
      "mitigation": "Etablieren Sie einen robusten Prozess zur Kapazitätsplanung und -verwaltung für die VDI-Umgebung. Überwachen Sie kontinuierlich die Ressourcennutzung (CPU, Speicher, I/O, Netzwerk) auf den Virtualisierungs-Hosts. Verwenden Sie Lastverteilung und definieren Sie klare Schwellenwerte für die Anzahl der Clients pro Host. Legen Sie Ressourcenlimits und -reservierungen für kritische virtuelle Clients fest, um deren Leistung zu garantieren. Vermeiden Sie die Konsolidierung zu vieler ressourcenintensiver Clients auf einem einzigen physischen Host.",
      "check": "Gibt es einen etablierten Kapazitätsmanagementprozess für die VDI? Wird die Ressourcennutzung aktiv anhand definierter Schwellenwerte überwacht? Sind Leistungs- und Verfügbarkeits-SLAs für virtuelle Clients definiert und werden diese erfüllt?",
      "detectionLogic": "Dieses Risiko wird angezeigt, wenn eine Shared Runtime, die einen VDI-Host darstellt, eine große Anzahl von virtuellen Clients ausführt (z. B. Assets mit ",
      "riskAssessment": "Die Wahrscheinlichkeit steigt mit der Anzahl der virtuellen Clients pro Host. Die Auswirkung wird durch die höchsten Verfügbarkeits- und Integritätsanforderungen der virtuellen Clients und der von ihnen verarbeiteten Daten bestimmt. Wenn Clients für geschäftskritische Aufgaben verwendet werden, ist die Auswirkung hoch, da Leistungseinbußen Geschäftsprozesse zum Erliegen bringen können.",
      "falsePositives": "Eine hohe Anzahl von Clients auf einem einzelnen Host stellt möglicherweise kein Risiko dar, wenn die zugrunde liegende Hardware außergewöhnlich leistungsstark ist und von effektiven Ressourcen-Schedulern verwaltet wird. Diese Regel ist eine Heuristik und sollte anhand der tatsächlichen Hardwarespezifikationen und Überwachungsdaten der VDI-Umgebung validiert werden."
    },
    "faulty-vdi-profile-assignment": {
      "title": "Fehlerhafte Zuweisung von VDI-Profilen (BSI SYS.2.6)",
      "description": "In einer Virtual Desktop Infrastructure (VDI) werden virtuelle Clients und ihre Ressourcen den Benutzern zentral über Profile zugewiesen. ",
      "impact": "Eine fehlerhafte Zuweisung von VDI-Profilen kann direkt zu einer Privilegienerweiterung führen, bei der Benutzer Zugriff auf Daten und Systeme erhalten, die über ihre Berechtigungen hinausgehen. ",
      "asvs": "BSI IT-Grundschutz SYS.2.6 Virtual Desktop Infrastructure, insbesondere die Anforderungen SYS.2.6.A4 (Netzsegmentierung von VDI-Komponenten) und SYS.2.6.A5 (Standardisierter Zugriff auf virtuelle Clients).",
      "action": "Implementieren und erzwingen Sie VDI-Profile nach dem Prinzip der geringsten Rechte",
      "mitigation": "Entwerfen und implementieren Sie VDI-Profile nach dem Prinzip der geringsten Rechte, um sicherzustellen, dass Benutzer nur auf die für ihre Rollen erforderlichen Ressourcen zugreifen können. ",
      "check": "Sind die VDI-Profile streng nach dem Prinzip der geringsten Rechte konfiguriert? Gibt es separate, gehärtete Profile für Benutzer mit unterschiedlichen Sicherheitsanforderungen? ",
      "detectionLogic": "Diese Regel identifiziert VDI-Management-Server (gekennzeichnet mit `@System:VDI`). ",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertung des Backend-Systems bestimmt, auf das der virtuelle Client zugreifen kann. ",
      "falsePositives": "Eine erkannte Verbindung von einem virtuellen Client zu einem Backend-System kann für einen bestimmten Power-User oder eine administrative Rolle legitim sein. "
    },
    "bypassed-network-segmentation-vdi": {
      "title": "VDI: Umgehung der Netzwerksegmentierung (BSI SYS.2.6)",
      "description": "VDI-Implementierungen betreiben oft viele virtuelle Clients für verschiedene Benutzergruppen, idealerweise durch Netzwerksegmentierung isoliert. Wenn eine einzelne VDI-Managementkomponente Clients über Sicherheitszonen hinweg zuweist oder steuert, kann eine Fehlkonfiguration diese Trennung untergraben und unbeabsichtigte zonenübergreifende Kommunikation ermöglichen.",
      "impact": "Eine erfolgreiche Umgehung der Segmentierung ermöglicht laterale Bewegungen von Netzwerken mit geringerem zu höherem Vertrauen, potenzielle Privilegienerweiterung und die Kompromittierung sensibler Systeme oder Daten, die vom kritischsten, von der VDI-Komponente verwalteten Client gesteuert werden.",
      "asvs": "BSI IT-Grundschutz SYS.2.6 / CON.5.A13 – Sichere Netzkonfiguration für virtualisierte IT-Systeme",
      "action": "VDI-Management härten und unabhängige Netzwerksegmentierung durchsetzen",
      "mitigation": "Härten und konfigurieren Sie die VDI-Management-Ebene sicher. Erzwingen Sie striktes RBAC für Client-zu-Benutzer/Gruppen-Zuweisungen. Implementieren Sie eine Deny-by-Default-Segmentierung im Netzwerk (Firewalls, VLANs, Cloud Security Groups/Mikrosegmentierung), sodass die VDI sie nicht außer Kraft setzen kann. Überprüfen Sie regelmäßig Gruppenzuordnungen, Vorlagen und Netzwerkregeln; wenden Sie Änderungskontrolle und Peer-Review für die Zuweisungslogik an.",
      "check": "Steuert ein einzelner VDI-Manager Clients in mehreren Netzwerkzonen? Sind DevOps-/Management-Verbindungen erlaubt, Zonen zu durchqueren? Sind die Segmentierungskontrollen unabhängig von der VDI-Logik und verifiziert (z. B. Policy-as-Code, Firewall-Baselines, Mikrosegmentierung)? Werden Zuweisungen und Vorlagen überprüft und auf Abweichungen überwacht?",
      "detectionLogic": "Markiert jedes technische Asset mit dem Tag @System:VDI, das DevOps-/Management-Kommunikationsverbindungen zu ≥2 virtuellen Clients hat, die sich (über übergeordnete Vertrauensgrenzen) auf ≥2 verschiedene netzwerkartige Vertrauensgrenzen auflösen. Gruppieren Sie Clients nach ihrer aufgelösten Netzwerkgrenze; wenn mehr als eine eindeutige Grenze existiert, fügen Sie dem VDI-Manager ein Risiko hinzu und verweisen Sie auf alle verwalteten Clients.",
      "riskAssessment": "Die Wahrscheinlichkeit wird auf 'Wahrscheinlich' gesetzt, da eine einzelne Steuerungsebene, die sich über Zonen erstreckt, eine häufige Quelle für Fehlkonfigurationen ist. Die Auswirkung leitet sich aus dem maximalen Vertraulichkeits-/Integritäts-/Verfügbarkeitslevel des VDI-Managers und aller verwalteten Clients ab: höhere Level führen zu mittleren/hohen/sehr hohen Auswirkungen. Die Wahrscheinlichkeit einer Datenpanne wird auf 'Möglich' gesetzt, wenn die Auswirkung 'Mittel' übersteigt.",
      "falsePositives": "Eine starke, unabhängig durchgesetzte Segmentierung (z. B. Mikrosegmentierung mit Deny-by-Default und verifizierten Richtlinien) kann zonenübergreifenden Verkehr verhindern, auch wenn eine VDI-Komponente mehrere Zonen verwaltet. Kompensierende Kontrollen (separate Admin-Ebenen, dedizierte Infrastruktur, unveränderliche Zuweisungen mit Genehmigungen) können das Risiko reduzieren; überprüfen Sie deren Wirksamkeit, bevor Sie diesen Befund unterdrücken."
    },
    "@System:VDI-corruption-or-reset": {
      "title": "Datenverlust auf einem VDI-Client durch Beschädigung oder Zurücksetzen der Vorlage",
      "description": "Eine wesentliche Stärke der Virtual Desktop Infrastructure (VDI) ist die einfache Verwaltung vieler virtueller Clients durch wenige zentrale Vorlagen. ",
      "impact": "Dieses Szenario wirkt sich direkt auf die Integrität und Verfügbarkeit von Benutzerdaten und Systemkonfigurationen aus. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Modul SYS.2.6 (Virtual Desktop Infrastructure/Virtualisation). Dies ist ein architektonisches und operatives Risiko, das spezifisch für Virtualisierungsumgebungen ist und sich nicht direkt auf OWASP ASVS abbilden lässt, welches sich auf die Sicherheit auf Anwendungsebene konzentriert.",
      "action": "Implementieren Sie Datenpersistenz- und Backup-Strategien für die VDI-Umgebung.",
      "mitigation": "Stellen Sie sicher, dass Benutzerdaten nicht ausschließlich auf nicht-persistenten oder flüchtigen virtuellen Desktops gespeichert werden. ",
      "check": "Werden VDI-Clients in der Architektur verwendet? Wenn ja, werden Benutzerdaten ausschließlich auf diesen Clients gespeichert? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das mit ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein False Positive kann auftreten, wenn das Modell angibt, dass Daten auf dem VDI-Client gespeichert werden, aber ein nicht modellierter externer Persistenzmechanismus (wie eine Profilverwaltungslösung, die Ordner auf eine Netzwerkfreigabe umleitet) verwendet wird. "
    },
    "@System:VDI-failure-con-5": {
      "title": "VDI-Komponente als Single Point of Failure (BSI SYS.2.6 / CON.5)",
      "description": "Eine Virtual Desktop Infrastructure (VDI) besteht aus voneinander abhängigen Kernkomponenten (Zugriff, Steuerung, Verwaltung). Wenn eine dieser Komponenten keine hohe Verfügbarkeit aufweist und ausfällt – aufgrund von Hardware-/Softwarefehlern oder Fehlkonfigurationen – ist die gesamte VDI-Verfügbarkeit gefährdet. Selbst ein Verlust der Verwaltungsebene kann die Bereitstellung, das Zurücksetzen oder Kapazitätsanpassungen stoppen und die Wiederherstellung erheblich verlangsamen.",
      "impact": "Ungeplante Ausfallzeiten einer VDI-Kernkomponente blockieren den Zugriff der Benutzer auf ihre Desktops oder hindern Administratoren daran, den Dienst wiederherzustellen, was die Produktivität und Geschäftskontinuität beeinträchtigt. Der Schweregrad skaliert mit der Verfügbarkeitsanforderung des betroffenen Dienstes.",
      "asvs": "BSI SYS.2.6.A15 Hochverfügbare Bereitstellung der VDI-Komponenten; BSI IT-Grundschutz CON.5.A5 Hochverfügbarkeit der Virtualisierungslösung",
      "action": "Entwerfen Sie VDI-Kernkomponenten für hohe Verfügbarkeit und beseitigen Sie Single Points of Failure.",
      "mitigation": "Modellieren Sie kritische VDI-Komponenten (Zugriff/Steuerung/Verwaltung) als redundant (z. B. Failover-Cluster, Load Balancer, Aktiv/Aktiv-Paare). Setzen Sie in Threagile `redundant: true` für diese technischen Assets. Implementieren Sie Health-Checks, Konfigurationsmanagement, regelmäßige Failover-Tests und berücksichtigen Sie Redundanz auf Standort- und Netzwerkebene.",
      "check": "Sind alle technischen Assets, die VDI-Komponenten darstellen (gekennzeichnet mit `@System:VDI`), mit `redundant: true` modelliert? Ist eine Überwachung zur Erkennung von Komponentenausfällen und Cluster-Degradation vorhanden?",
      "detectionLogic": "Markiert jedes im Geltungsbereich befindliche technische Asset mit dem Tag `@System:VDI`, bei dem `redundant !== true` ist. Assets außerhalb des Geltungsbereichs werden ignoriert. Solche Assets werden als potenzielle Single Points of Failure behandelt.",
      "riskAssessment": "Die Wahrscheinlichkeit ist 'Wahrscheinlich', wenn eine kritische Komponente keine Redundanz aufweist. Die Auswirkung leitet sich aus der Verfügbarkeitsanforderung des Assets ab (MissionCritical → Sehr Hoch, Critical → Hoch, Important → Mittel).",
      "falsePositives": "Hohe Verfügbarkeit kann vorhanden sein, aber nicht modelliert sein (z. B. Aktiv/Aktiv hinter einem Load Balancer, verwaltete Cloud-HA oder externe Standort-Failover). Überprüfen Sie die reale Architektur und aktualisieren Sie das Modell gegebenenfalls mit `redundant: true`."
    },
    "kompromittierung-vdi-managementkomponente": {
      "title": "Kompromittierung der VDI-Managementkomponente (BSI SYS.2.6 / APP.3.2)",
      "description": "Eine VDI-Managementkomponente verwaltet virtuelle Desktops/Clients und die Richtlinien, die ihnen Benutzer zuweisen. Wenn sie kompromittiert wird (z. B. durch Schwachstellen, Fehlkonfigurationen oder Diebstahl von Anmeldeinformationen), kann ein Angreifer in die meisten oder alle verbundenen virtuellen Clients und die zugehörige Infrastruktur eindringen und so die Vertraulichkeit, Integrität und Verfügbarkeit im großen Stil beeinträchtigen. Da der Manager und seine Agenten die Bereitstellung und die Kontrollen während der Sitzung orchestrieren, ist er sowohl ein hochwertiges Ziel als auch ein Single Point of Failure.",
      "impact": "Die Kompromittierung des zentralen Managers ermöglicht die massenhafte Übernahme von Konten und Sitzungen, die Remote-Code-Ausführung auf Clients, die massenhafte Exfiltration oder Zerstörung von Daten sowie weit verbreitete Denial-of-Service-Angriffe, was die Geschäftsprozesse stört, die von der VDI-Plattform abhängen.",
      "asvs": "BSI IT-Grundschutz: SYS.2.6 Virtual Desktop Infrastructure (z. B. A11 Monitoring, A15 Hochverfügbarkeit, A16 SIEM); sowie APP.3.2 Virtualisierung und SYS.2.5 Client-Virtualisierung.",
      "action": "Härten und isolieren Sie die VDI-Management-Ebene; erzwingen Sie eine starke Authentifizierung und das Prinzip der geringsten Rechte; überwachen Sie aggressiv.",
      "mitigation": "Isolieren Sie Management-Schnittstellen in dedizierten Admin-/VPN-Netzwerken; fordern Sie MFA für alle Administratoren (einschließlich Notfall-Break-Glass-Konten) und verwenden Sie RBAC/das Prinzip der geringsten Rechte; patchen Sie Betriebssystem, Manager- und Agenten-Software zeitnah; deaktivieren oder beschränken Sie riskante Agenten-Funktionen; aktivieren Sie Manipulationsschutz und Code-Signierung für Vorlagen/Agenten; protokollieren Sie alle Admin-Aktionen zentral (SIEM) mit Alarmierung; bewahren Sie offline/unveränderliche Backups und getestete Wiederherstellungsverfahren für die Manager-Konfiguration und Golden Images auf; vermeiden Sie die direkte Exposition des Managers gegenüber dem Internet; setzen Sie redundante Manager-Knoten ein, falls unterstützt.",
      "check": "• Sind Management-Schnittstellen nur von einem dedizierten Admin-Netzwerk/VPN und niemals direkt aus dem Internet erreichbar?\n• Wird MFA für alle Admin-Konten (einschließlich Notfall-Konten) erzwungen und sind die Rollen nach dem Prinzip der geringsten Rechte konfiguriert?\n• Sind die Manager-Software, das Betriebssystem und die VDI-Agenten vollständig gepatcht und gehärtet?\n• Werden administrative Aktionen zentral protokolliert und überwacht (SIEM) mit Alarmierung?\n• Sind Vorlagen/Golden Images signiert, aktualisiert und geschützt; werden Zurücksetzungen/Provisionierungen kontrolliert?\n• Ist die Managementkomponente redundant implementiert und wird sie regelmäßig in Tests gesichert/wiederhergestellt?",
      "detectionLogic": "Markiert eine wahrscheinliche VDI-Management-Ebene, wenn ein zentrales technisches Asset im Geltungsbereich mit Technologie in {ApplicationServer, WebServer, Gateway, Management} ausgehende Kommunikationsverbindungen zu mehr als Quantity.Few verschiedenen Client-Endpunkten hat, deren Technologie {Desktop, ClientSystem} ist. Je mehr Desktop-/Client-Verbindungen, desto stärker das Signal. Die Wahrscheinlichkeit wird weiter erhöht, wenn das Asset internet-zugänglich ist oder kundenspezifisch entwickelte Teile hat (einzelne Instanz, keine redundanten Peers). Schließt Assets außerhalb des Geltungsbereichs aus. Heuristiken spiegeln wider: count = manager.communicationLinks → unique targets filtered by client tech; threshold = getQuantityFactor(Quantity.Few).",
      "riskAssessment": "Die Auswirkung skaliert mit der Anzahl der verwalteten Clients (Many ⇒ Hoch, VeryMany ⇒ Sehr Hoch) und wird auf Hoch/Sehr Hoch angehoben, wenn ein Client vertrauliche/streng vertrauliche Daten verarbeitet. Die Wahrscheinlichkeit beginnt bei 'Unwahrscheinlich', wird 'Wahrscheinlich', wenn der Manager kundenspezifisch entwickelte Teile hat, und 'Sehr Wahrscheinlich', wenn er über das Internet erreichbar ist. Die Wahrscheinlichkeit einer Datenpanne steigt von 'Unwahrscheinlich' → 'Möglich' (Eingeschränkt) → 'Wahrscheinlich' (Vertraulich+).",
      "falsePositives": "Andere zentrale Systeme mit vielen Desktop-Verbindungen (z. B. Softwareverteilung/-patching, Endpoint-Management/MDM, Überwachung, Fernwartung, Verzeichnisdienste) können dem Muster entsprechen. Bestätigen Sie die Rolle durch Name/Beschreibung/Tags, Netzwerkplatzierung (Admin-Netzwerk) und das Vorhandensein von VDI-Agenten/-Vorlagen vor der Triage. Wenn das Rauschen hoch ist, kennzeichnen Sie echte VDI-Manager entsprechend und unterdrücken Sie Nicht-VDI-Manager über Metadaten im Modell."
    },
    "vdi-outdated-template": {
      "title": "Veraltete VDI-Vorlage ermöglicht bekannte Schwachstellen (BSI SYS.2.6 §2.7, A9)",
      "description": "In einer Virtual Desktop Infrastructure (VDI) werden virtuelle Clients aus Master-Images (Vorlagen) bereitgestellt. ",
      "impact": "Ein kompromittierter Desktop, der aus einer veralteten Vorlage bereitgestellt wird, kann einen ersten Zugriff ermöglichen, laterale Bewegungen erleichtern und zu unbefugtem Datenzugriff oder Dienstunterbrechungen führen. ",
      "asvs": "BSI IT-Grundschutz: SYS.2.6 Virtual Desktop Infrastructure – Abschnitt 2.7 (Verwendung von Vorlagen mit Softwareschwachstellen) und Anforderung A9 (Patch- und Änderungsmanagement).",
      "action": "Unterstellen Sie alle VDI-Master-Vorlagen einem formalen Patch-Management mit regelmäßigen, dokumentierten Recompose-Zyklen.",
      "mitigation": "Pflegen Sie ein gehärtetes, versioniertes Golden Image; scannen Sie es routinemäßig auf Schwachstellen; wenden Sie Hersteller- und Betriebssystem-Patches an; ",
      "check": "Gibt es einen Zeitplan und Nachweise für das Neuerstellen und Patchen von VDI-Golden-Images? ",
      "detectionLogic": "Markiert technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist sehr wahrscheinlich, da sich in veralteten Images bekannte, weithin ausnutzbare Probleme ansammeln. ",
      "falsePositives": "Staging- oder isolierte Laborvorlagen, auf die andere Systeme nicht zugreifen können, können markiert werden, wenn ihnen das Mitigations-Tag fehlt. "
    },
    "mobile-client-in-untrusted-environment": {
      "title": "Mobile Clients in nicht vertrauenswürdigen Netzwerken (angelehnt an BSI SYS.3.1 Laptops)",
      "description": "Laptops und andere mobile Clients werden in verschiedenen, oft nicht vertrauenswürdigen Umgebungen eingesetzt. ",
      "impact": "Die Verbindung eines mobilen Clients mit einem nicht vertrauenswürdigen Netzwerk ohne angemessene Schutzmaßnahmen kann zur Kompromittierung des Geräts führen. ",
      "asvs": "BSI IT-Grundschutz SYS.3.1 (Laptops); OWASP MASVS-NETWORK; OWASP ASVS V9 (Kommunikation); CIS Safeguards 12 & 13.",
      "action": "Erfordern Sie einen sicheren Tunnel (VPN oder ZTNA) und härten Sie Endpunkte für den mobilen Einsatz",
      "mitigation": "Leiten Sie den gesamten Datenverkehr von mobilen Clients in externen Netzwerken über einen obligatorischen, systemseitig erzwungenen VPN- oder ZTNA-Tunnel. ",
      "check": "Ist ein systemseitig erzwungenes VPN/ZTNA außerhalb des Firmengeländes erforderlich? Gibt es eine technische Kontrolle, die eine Umgehung verhindert (kein Split-Tunneling für sensible Anwendungen)? ",
      "detectionLogic": "Markiert jede Kommunikationsverbindung, bei der: (1) die Quelle eine als internet-zugänglich (`internet: true`) markierte Client-Technologie ist, ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Clients in öffentlichen Netzwerken sehr hoch. Die Auswirkung skaliert mit der Sensibilität der auf dem Client gespeicherten und über die Verbindung gesendeten Daten. ",
      "falsePositives": "Kann ein False Positive sein, wenn ein Always-On-VPN/ZTNA auf Systemebene außerhalb des Modells erzwungen wird; wenn ein sicheres Gateway an anderer Stelle modelliert ist; "
    },
    "laptop-theft-or-loss-con1": {
      "title": "Diebstahl oder Verlust von Laptops (BSI CON.1)",
      "description": "Mitarbeiter nutzen ihre Laptops häufig außerhalb der Institution",
      "impact": "Wenn ein unverschlüsselter Laptop mit sensiblen Daten verloren geht oder gestohlen wird, kann dies zu einer schwerwiegenden Datenpanne (Vertraulichkeit), einem dauerhaften Datenverlust bei fehlendem Backup (Verfügbarkeit) sowie zu erheblichen finanziellen und reputativen Schäden führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein CON.1: Laptops. Dieses Risiko entspricht direkt den Gefährdungen CON.1.G1 (Diebstahl eines Laptops) und CON.1.G2 (Verlust eines Laptops). Die primäre Mitigationsmaßnahme wird durch die Anforderung CON.1.A5 (Festplattenverschlüsselung bei Laptops) abgedeckt.",
      "action": "Vollständige Festplattenverschlüsselung auf Laptops erzwingen",
      "mitigation": "Auf allen Laptops, die sensible Daten speichern oder verarbeiten könnten, muss die vollständige Festplattenverschlüsselung (FDE) aktiviert sein (z. B. BitLocker für Windows, FileVault für macOS). Dies sollte durch technische Richtlinien (z. B. MDM, GPO) erzwungen werden. ",
      "check": "Ist bei allen Laptops, insbesondere bei denen von mobilen Mitarbeitern, bestätigt, dass die vollständige Festplattenverschlüsselung aktiviert und durch Richtlinien erzwungen wird? Gibt es regelmäßige Backups wichtiger Daten, die auf diesen Laptops gespeichert sind?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Client-System identifiziert wird (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit von Diebstahl oder Verlust eines mobilen Geräts wie eines Laptops ist von Natur aus hoch. Die Ausnutzung dieses Umstands (d.h. der Zugriff auf die Daten) ist trivial, wenn die Festplatte unverschlüsselt ist. Daher wird die Wahrscheinlichkeit als ",
      "falsePositives": "Dieses Risiko könnte als False Positive für ein Asset betrachtet werden, das zwar als "
    },
    "uncontrolled-shared-device-handover": {
      "title": "Unkontrollierte Übergabe von gemeinsam genutzten Laptops (BSI SYS.3.1, Abschnitt 2.3)",
      "description": "Das Teilen von Laptops als Pool-Geräte ohne einen formalen Prozess birgt ein ständiges Risiko von Datenresten und benutzerübergreifender Kontamination. ",
      "impact": "Potenzielle Vertraulichkeitsverletzungen (Offenlegung der Daten eines anderen Benutzers), Integritätsverletzungen (Malware/Manipulation) und Auswirkungen auf die Verfügbarkeit (Gerät in Quarantäne oder neu abgebildet). ",
      "asvs": "BSI IT-Grundschutz: SYS.3.1.A7 Geregelte Übergabe und Rücknahme; SYS.3.1.A13 Verschlüsselung von Laptops; CON.3.A13 Wiedervergabe und Rückgabe mobiler Geräte",
      "action": "Definieren und erzwingen Sie einen Prozess zur Ein- und Ausgabe sowie zur Bereinigung von Pool-Laptops",
      "mitigation": "Erzwingen Sie ein MDM-gesteuertes Löschen oder Neu-Imaging von einem Golden Image zwischen den Benutzern; fordern Sie eine vollständige Festplattenverschlüsselung mit Pre-Boot-Authentifizierung; ",
      "check": "Gibt es eine dokumentierte Richtlinie für Pool-Geräte? Erzwingt eine MDM-Richtlinie das Löschen/Neu-Imaging zwischen den Benutzern? Sind die Verwahrungsprotokolle vollständig und prüfbar? ",
      "detectionLogic": "Markiert im Geltungsbereich befindliche Client-Assets, die explizit mit ",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich für jedes als gemeinsam genutzt gekennzeichnete Asset. Auswirkungsstufen: Mittel, wenn Vertraulichkeit ≥ Eingeschränkt oder Integrität ≥ Wichtig; ",
      "falsePositives": "Möglich, wenn ein robuster, durchgesetzter Lösch-/Neu-Imaging-Prozess (über MDM), ephemere Profile und Verwahrungsprotokollierung existieren, aber nicht modelliert sind. "
    },
    "unsupported-mobile-os": {
      "title": "Risiko durch veraltete oder nicht unterstützte mobile Betriebssysteme",
      "description": "Mobile Betriebssysteme erhalten häufige Updates, aber die Gerätehersteller (OEMs) müssen diese zuerst integrieren und verteilen, was oft zu Verzögerungen führt. ",
      "impact": "Die Ausnutzung einer ungepatchten Schwachstelle in einem mobilen Betriebssystem kann zu einer vollständigen Kompromittierung des Geräts führen. ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1 Allgemeine Smartphones und Tablets, Anforderung A5 (Updates von Betriebssystem und Apps) und SYS.3.2.2 Mobile Device Management (MDM).",
      "action": "Erzwingen Sie das Management von mobilen Betriebssystemversionen und Patch-Leveln",
      "mitigation": "Implementieren Sie eine Mobile Device Management (MDM)-Lösung, um Sicherheitsrichtlinien auf allen mobilen Geräten durchzusetzen, die auf Unternehmensdaten oder -systeme zugreifen. ",
      "check": "Ist eine Mobile Device Management (MDM)-Lösung im Einsatz? Erzwingt sie Mindestrichtlinien für Betriebssysteme und Patch-Level? ",
      "detectionLogic": "Löst bei jedem technischen Asset des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei nicht verwalteten mobilen Flotten sehr hoch, da Benutzer Updates oft verzögern oder ignorieren und ältere Geräte in Gebrauch bleiben. ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn ein effektives MDM oder eine ähnliche kompensierende Kontrolle für das OS-Patchmanagement vorhanden ist, aber im Modell nicht durch die Anwendung des "
    },
    "privilege-escalation-on-mobile-os-sys3.1.a5": {
      "title": "Privilegienerweiterung auf mobilen Geräten durch Betriebssystem-Schwachstellen (Jailbreaking/Rooting)",
      "description": "In Smartphone- und Tablet-Betriebssystemen werden häufig Schwachstellen entdeckt, die es Angreifern ermöglichen, etablierte Sicherheitskontrollen zu umgehen. Dies ermöglicht unbefugten Zugriff auf Systemprozesse und geschützte Speicherbereiche. Angreifer können diese Schwächen ausnutzen, oft unter Verwendung von Techniken, die dem vom Benutzer initiierten ",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einer Anwendung, unbeabsichtigte Privilegien zu erlangen (Elevation of Privilege), was ihr die Ausführung unbefugter Aktionen ermöglicht. Dies könnte den Zugriff auf sensible Daten des Betriebssystems oder anderer Apps, die Installation von Malware oder die Manipulation des Geräts umfassen. Dies kompromittiert die Vertraulichkeit und Integrität von Daten auf dem Gerät und kann zu einer vollständigen Übernahme des Assets führen.",
      "asvs": "BSI IT-Grundschutz SYS.3.1.A5 (Umgehung von Sicherheitsmechanismen durch Jailbreaking oder Rooting)",
      "action": "Implementieren Sie Jailbreak/Root-Erkennung und verwenden Sie Mobile Device Management",
      "mitigation": "Für mobile Anwendungen, die sensible Daten verarbeiten, implementieren Sie robuste Jailbreak/Root-Erkennungsmechanismen, um zu verhindern, dass die App auf einem kompromittierten Gerät läuft oder um sie in einem Modus mit eingeschränkter Funktionalität zu betreiben. Halten Sie mobile Betriebssysteme und alle Anwendungen mit den neuesten Sicherheitspatches auf dem neuesten Stand. Setzen Sie Mobile Device Management (MDM)-Lösungen ein, um Sicherheitsrichtlinien durchzusetzen, wie z.B. das Verbot von gerooteten/jailbroken Geräten für den Zugriff auf Unternehmensressourcen. Das Risiko kann durch das Taggen des Mobile-App-Assets mit `@root-detection:implemented` als mitigiert markiert werden.",
      "check": "Implementiert die mobile Anwendung eine Root/Jailbreak-Erkennung? Werden mobile Geräte von einer MDM-Lösung verwaltet, die Richtlinien gegen kompromittierte Geräte durchsetzt? Gibt es einen Prozess, um sicherzustellen, dass Updates für mobiles Betriebssystem und Apps zeitnah angewendet werden?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets der Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte als False Positive betrachtet werden, wenn die Anwendung nur nicht-sensible, öffentliche Daten verarbeitet oder wenn sie außergewöhnlich starke, hochmoderne Anti-Tampering- und Root/Jailbreak-Erkennungskontrollen hat, die nicht durch das einfache Mitigations-Tag erfasst werden."
    },
    "@Maintenance:Unmaintained-preinstalled-or-third-party-software": {
      "title": "@Maintenance:Unmaintained Vorinstallierte oder Drittanbieter-Software",
      "description": "Vorinstallierte oder Drittanbieter-Anwendungen können Schwachstellen enthalten, die über lokale oder Netzwerkangriffe ausgenutzt werden können. ",
      "impact": "Wenn Schwachstellen in solchen Komponenten ausgenutzt werden, kann dies zu einer vollständigen Kompromittierung des technischen Assets führen, was zu unbefugtem Zugriff auf oder Änderung von Daten (Vertraulichkeit, Integrität), Denial of Service (Verfügbarkeit) oder der Nutzung des Assets als Dreh- und Angelpunkt für weitere Angriffe innerhalb der Architektur führen kann.",
      "asvs": "OWASP ASVS V14: Software Component Verification Requirements",
      "action": "Lebenszyklus von Drittanbieter-Komponenten verwalten",
      "mitigation": "Führen Sie ein vollständiges Inventar aller Drittanbieter- und vorinstallierten Softwarekomponenten (ein ",
      "check": "Gibt es ein vollständiges Inventar aller Drittanbieter-Softwarekomponenten? Werden SCA-Tools zum Scannen auf Schwachstellen verwendet? Gibt es einen definierten Prozess für den Umgang mit anfälligen oder @Maintenance:Unmaintained Komponenten?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die explizit als `@Maintenance:Unmaintained` gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist **Sehr wahrscheinlich**, wenn ein Asset explizit als @Maintenance:Unmaintained gekennzeichnet ist. Sie ist **Wahrscheinlich** für andere nicht-kundenspezifische Komponenten, deren Wartungsstatus unbekannt ist. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn ein Asset nicht getaggt ist, aber aufgrund seines Technologietyps markiert wird, jedoch ein robuster Prozess für Schwachstellen- und Patch-Management für all seine Drittanbieter-Komponenten nachweislich vorhanden ist."
    },
    "unauthorized-manipulation-of-mobile-devices": {
      "title": "Unbefugte Manipulation von mobilen Geräten (Smartphones & Tablets)",
      "description": "Angreifer können sich Zugang zu Smartphones oder Tablets verschaffen und diese durch Ändern von Konfigurationen, Starten unbefugter Dienste, ",
      "impact": "Manipulation kann die Integrität und Vertraulichkeit von Daten auf dem Gerät und während der Übertragung beeinträchtigen; Diebstahl von Anmeldeinformationen oder Sitzungen ermöglichen; ",
      "asvs": "OWASP MASVS v2: MASVS-STORAGE, MASVS-NETWORK, MASVS-PLATFORM",
      "action": "Mobile Endgeräte und Apps härten: MDM durchsetzen, starken Sperrbildschirm verwenden, Berechtigungen minimieren, Kommunikation verschlüsseln, Sideloading und Debugging deaktivieren, ",
      "mitigation": "Verwenden Sie ein MDM, um Richtlinien durchzusetzen (Bildschirmsperre, biometrische Richtlinien, Verschlüsselung, VPN, App-Allowlists/Denylists). ",
      "check": "Ist die MDM-Registrierung obligatorisch und konform? Sind Betriebssystem- und App-Updates automatisiert und zeitnah? Sind Entwickleroptionen und Sideloading deaktiviert? ",
      "detectionLogic": "Löst für jedes im Geltungsbereich befindliche TechnicalAsset mit Technologie ",
      "riskAssessment": "Internet-zugängliche mobile Apps, die sensible Daten verarbeiten (z. B. PII/Gesundheit/Standort), haben einen höheren Schweregrad. ",
      "falsePositives": "Kann für streng gesperrte, zweckgebundene Geräte (z. B. Kiosk-Geräte), die in isolierten Umgebungen betrieben werden, weniger relevant sein "
    },
    "malware-on-mobile-devices": {
      "title": "Mobile Malware auf Smartphones & Tablets",
      "description": "Mobile Geräte sind attraktive Ziele für Malware. Obwohl die Infektionsraten insgesamt niedriger sein mögen als bei Desktop-Systemen, schaffen die Allgegenwart von Apps, die ständige Konnektivität (Mobilfunk, WLAN, Bluetooth, NFC) und die benutzergesteuerten Installationsmuster eine bedeutende Angriffsfläche. Das Beziehen von Apps aus nicht vertrauenswürdigen Quellen, verzögerte Betriebssystem-/App-Updates oder die Verwendung von gerooteten/jailbroken Geräten erhöht das Risiko erheblich.",
      "impact": "Eine Kompromittierung kann zum Verlust der Vertraulichkeit, Integrität und Verfügbarkeit von Daten auf dem Gerät, zum Diebstahl von Anmeldeinformationen, zur Übernahme von Sitzungen, zu unbefugten Transaktionen und zur lateralen Bewegung in Backend-Dienste führen. Angreifer können Benutzer imitieren und sensible Unternehmensinformationen exfiltrieren.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5 – Schutz vor Schadprogrammen",
      "action": "MDM/MAM implementieren und durchsetzen; App-Quellen auf offizielle Stores beschränken; zeitnahes Betriebssystem-/App-Patching sicherstellen; App-Überprüfung für sensible Anwendungsfälle verwenden.",
      "mitigation": "Verwenden Sie MDM/MAM, um durchzusetzen: Nur-Store-App-Installation, zeitnahe Betriebssystem-/App-Updates, Geräteverschlüsselung, Bildschirmsperr-Richtlinien und Deaktivierung ungenutzter Funkverbindungen/Schnittstellen; überwachen Sie App-Berechtigungen (Kamera, Mikrofon, Standort, Gesundheitsdaten) gemäß der Datenschutzrichtlinie; implementieren Sie starke Authentifizierung/Zero Trust auf Backends, um die Auswirkungen kompromittierter Clients zu begrenzen; ziehen Sie App-Attestierung und Laufzeitschutz für Hochrisiko-Apps in Betracht.",
      "check": "Ist MDM/MAM vorhanden und wird es durchgesetzt? Sind App-Installationen von außerhalb des Stores blockiert? Werden Betriebssystem-/App-Updates vorgeschrieben und sind sie überprüfbar? Sind sensible Berechtigungen durch Richtlinien eingeschränkt? Erfordern Backend-Systeme eine starke, geräteunabhängige Authentifizierung und das Prinzip der geringsten Rechte, um einem kompromittierten mobilen Client standzuhalten?",
      "detectionLogic": "Markiert automatisch jedes im Geltungsbereich befindliche technische Asset mit Technologie ",
      "riskAssessment": "Die grundlegende Wahrscheinlichkeit ist auf ",
      "falsePositives": "Das Risiko kann reduziert sein, wenn ein ausgereiftes, durchgesetztes MDM/MAM implementiert ist (Nur-Store-Installationen, schnelles Patchen, Verschlüsselung, strenge Berechtigungskontrollen), Geräte nicht gerootet/jailbroken sind, sensible Apps Attestierung und Laufzeitschutz verwenden und Backends die Authentifizierung/Autorisierung strikt durchsetzen, um kompromittierte Clients einzudämmen."
    },
    "web-based-attacks-on-mobile-clients": {
      "title": "Webbasierte Angriffe auf mobile Clients",
      "description": "Mobile Browser sowie viele andere Apps können Webseiten und Webinhalte anzeigen. ",
      "impact": "Ein erfolgreicher Angriff kann zur Installation von Malware (Verletzung der Integrität), ",
      "asvs": "OWASP MASVS v8.1 (MSTG-CODE-1): Die App ist anfällig für WebView-bezogene Probleme.",
      "action": "Sichere Handhabung von clientseitigem Web-Content",
      "mitigation": "Stellen Sie sicher, dass Komponenten, die Webinhalte rendern (z. B. WebViews), auf dem neuesten Stand gehalten und sicher konfiguriert werden, ",
      "check": "Werden mobile Anwendungen und Browser auf dem neuesten Stand gehalten? Werden sichere Konfigurationen für WebViews erzwungen? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als internet-zugängliche mobile Clients identifiziert werden ",
      "riskAssessment": "Die Wahrscheinlichkeit ist für jeden mobilen Client, der im allgemeinen Internet surft, hoch. ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn die Anwendung nur vollständig statische, vertrauenswürdige, "
    },
    "unauthorized-access-to-mobile-health-location-data": {
      "title": "Mobil: Offenlegung von Gesundheits-, Fitness- und Standortdaten (BSI SYS.3.2.1 §2.6)",
      "description": "Smartphones und Tablets sammeln oft hochsensible Gesundheits-, Fitness- und Standortdaten. ",
      "impact": "Die Ausnutzung kann besondere Kategorien personenbezogener Daten offenlegen, was zu schweren Datenschutzverletzungen, Identitätsdiebstahlrisiken, potenziellen physischen Sicherheitsproblemen sowie zu erheblichen regulatorischen und reputativen Schäden für die Organisation führt.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein SYS.3.2.1 §2.6 ",
      "action": "Verschlüsselung im Ruhezustand und reine TLS-Kommunikation für mobile Apps erzwingen; Geräte über MDM verwalten und App-Berechtigungen härten.",
      "mitigation": "Verschlüsseln Sie sensible Daten im Ruhezustand mit starken, an den Benutzer oder das Gerät gebundenen Schlüsseln (z. B. OS Keychain/Keystore, dateibasierte Verschlüsselung). ",
      "check": "Überprüfen Sie, ob mobile Apps keine sensiblen Daten unverschlüsselt speichern und ob alle Kommunikationsverbindungen TLS verwenden (z. B. HTTPS). ",
      "detectionLogic": "Erkennt im Geltungsbereich befindliche technische Assets der Technologie ",
      "riskAssessment": "Die Auswirkung ist ",
      "falsePositives": "Möglich, wenn eine Verschlüsselung auf Betriebssystemebene aktiv, aber nicht modelliert ist, oder wenn kompensierende Kontrollen (z. B. ein obligatorisches, immer aktives Unternehmens-VPN mit strengen Split-Tunneling-Beschränkungen) vorgeschrieben sind. "
    },
    "lock-screen-information-disclosure-on-mobile-devices": {
      "title": "Informationspreisgabe über den Sperrbildschirm bei Smartphones und Tablets",
      "description": "Die meisten mobilen Betriebssysteme können Benachrichtigungen von Widgets und Push-Nachrichten auf dem Sperrbildschirm anzeigen. Dies kann vertrauliche Informationen an unbefugte Personen preisgeben, die diese ausnutzen können. Sprachassistenten können den Zugriff auf Telefonfunktionen und Kontaktdaten auch bei gesperrtem Gerät ermöglichen und so potenziell vertrauliche Informationen offenlegen. Darüber hinaus sind Schnittstellen wie WLAN oder Bluetooth oft bei gesperrtem Gerät konfigurierbar. Ein Angreifer mit physischem Zugriff könnte beispielsweise Bluetooth aktivieren und so einen zusätzlichen Angriffsvektor schaffen.",
      "impact": "Unbefugte Personen mit physischem Zugriff auf das Gerät können vertrauliche Informationen (z. B. Nachrichtenvorschauen, Kalendereinträge, Einmal-Authentifizierungscodes) einsehen, ohne es zu entsperren. Dies kann zu Datenschutzverletzungen, Datenlecks und Folgeangriffen aufgrund der preisgegebenen Informationen führen. Das Aktivieren von Schnittstellen wie Bluetooth kann das Gerät auch zusätzlichen Fernangriffen aussetzen.",
      "asvs": "OWASP MASTG: MSTG-PLATFORM-9 (Entfernen sensibler Daten aus Ansichten, wenn die App in den Hintergrund wechselt)",
      "action": "Implementieren Sie eine sichere Handhabung von Benachrichtigungen und eine Benutzeranleitung",
      "mitigation": "Anwendungen sollten Benachrichtigungen standardmäßig sicher handhaben. Verwenden Sie Plattform-APIs, um Benachrichtigungen, die sensible Daten enthalten, als privat zu kennzeichnen, damit ihr Inhalt nicht auf dem Sperrbildschirm angezeigt wird (z. B. Android `Notification.VISIBILITY_PRIVATE`). Vermeiden Sie es, sensible Details in den Titeln von Benachrichtigungen zu platzieren, die möglicherweise dennoch sichtbar sind. Geben Sie den Benutzern zusätzlich klare Anweisungen zur Konfiguration der Benachrichtigungseinstellungen auf dem Sperrbildschirm für maximale Privatsphäre. Erfordern Sie bei jeder Integration von Sprachassistenten eine Benutzerauthentifizierung für sensible Aktionen oder den Abruf von Daten.",
      "check": "Sind Benachrichtigungen, die sensible Daten enthalten könnten, so konfiguriert, dass ihr Inhalt auf dem Sperrbildschirm verborgen wird? Macht die Anwendung",
      "detectionLogic": "Dieses Risiko gilt für alle im Geltungsbereich befindlichen technischen Assets mit Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Anwendung niemals Benachrichtigungen sendet oder wenn alle Benachrichtigungen generisch sind und keine sensiblen oder benutzerspezifischen Inhalte enthalten. Das Risiko kann auch auf Betriebssystemebene gemindert werden, aber die Anwendung sollte dennoch sichere Standardeinstellungen implementieren."
    },
    "private-use-of-company-mobile-devices": {
      "title": "Private Nutzung von firmeneigenen mobilen Geräten (BSI CON.3)",
      "description": "Wenn Mitarbeiter firmeneigene Smartphones und Tablets für private Zwecke nutzen, können mehrere Risiken für die Informationssicherheit entstehen. ",
      "impact": "Die private Nutzung von Firmengeräten ohne angemessene Kontrollen kann zu Datenpannen, Malware-Infektionen und Compliance-Verstößen führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein CON.3 ",
      "action": "Implementieren Sie Kontrollen für die private Nutzung von firmeneigenen mobilen Geräten",
      "mitigation": "Die wirksamste Minderung ist die Implementierung einer Mobile Device Management (MDM)-Lösung. ",
      "check": "Gibt es eine Richtlinie für die private Nutzung von firmeneigenen mobilen Geräten? Ist eine Mobile Device Management (MDM)- oder Mobile Application Management (MAM)-Lösung im Einsatz? ",
      "detectionLogic": "Diese Regel löst bei technischen Assets des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist sehr hoch, wenn die private Nutzung ohne zentrale Verwaltung oder Sicherheitskontrollen erlaubt ist. Das Vorhandensein einer MDM-Lösung reduziert die Wahrscheinlichkeit, eliminiert sie aber nicht vollständig. ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht den vollen Umfang der von einem MDM durchgesetzten Sicherheitsrichtlinien. Ein Risiko könnte auch dann gemeldet werden, wenn spezifische kompensierende Kontrollen (wie eine sehr restriktive App-Whitelist) existieren, aber nicht mit einem Tag modelliert wurden."
    },
    "insecure-private-device-usage-con3": {
      "title": "BYOD: Unsichere Nutzung privater mobiler Geräte (BSI CON.3)",
      "description": "Wenn private mobile Geräte für geschäftliche Zwecke genutzt werden (BYOD), haben Organisationen eine geringere Kontrolle über die Härtung und den Lebenszyklus der Plattform, was die Wahrscheinlichkeit von Richtlinienverstößen, unsicheren Konfigurationen und Datenlecks erhöht. Reparaturen, Wiederverkauf oder Verlust solcher Geräte können Unternehmensdaten unbefugten Parteien aussetzen. Lizenzprobleme, versehentliches Löschen von Unternehmensdaten über MDM und unklare Offboarding-Verfahren verstärken das Risiko zusätzlich.",
      "impact": "Kompromittierung der Vertraulichkeit und Integrität von Unternehmensdaten (z. B. @DataType:PII), Nichteinhaltung von Vorschriften, rechtliche Risiken (Lizenzierung, Datenschutz), Betriebsunterbrechungen und Reputationsschäden. Verlust, Diebstahl oder unsachgemäße Außerbetriebnahme von Geräten können zu irreversibler Datenexposition oder -verlust führen.",
      "asvs": "Referenz: BSI IT-Grundschutz Baustein CON.3 (Konzept für mobile Geräte), insb. CON.3.A5 (Regelungen für die Nutzung privater mobiler Geräte/BYOD).",
      "action": "Definieren, implementieren und erzwingen Sie eine umfassende BYOD-Richtlinie mit technischer Durchsetzung (z. B. MDM/EMM).",
      "mitigation": "Veröffentlichen Sie eine formale BYOD-Richtlinie, die Mindestsicherheitsstandards für Geräte vorschreibt (Betriebssystemversion/Support-Zeitraum, Bildschirmsperre, vollständige Festplattenverschlüsselung, Anti-Malware, wo machbar), die Datenhoheit und Benutzerverantwortlichkeiten klärt und App-Quellen einschränkt. Erzwingen Sie dies über MDM/EMM mit Geräte-Compliance-Prüfungen, Containerisierung/Arbeitsprofilen, Fernlöschung und zertifikatbasiertem Netzwerkzugriff. Etablieren Sie ein strenges Onboarding/Offboarding, um sicherzustellen, dass Unternehmensdaten bei Rollenwechseln oder beim Ausscheiden entfernt werden.",
      "check": "Gibt es eine dokumentierte BYOD-Richtlinie mit Mindest-Baselines für Geräte? Sind private Geräte im MDM/EMM registriert und wird ihre Konformität (Verschlüsselung, Sperre, Betriebssystem-Patchlevel) gemessen? Werden Datentrennung und genehmigte App-Quellen erzwungen? Sind Offboarding- und Fernlösch-Verfahren getestet?",
      "detectionLogic": "Wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das (1) eine Client-Technologie ist (z. B. mobile App, Browser, Desktop) und (2) das Tag ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für privat genutzte Geräte in geschäftlichen Kontexten aufgrund häufiger Richtlinienlücken und schwächerer Kontrolle auf 'Wahrscheinlich' gesetzt. Die Auswirkung skaliert mit der Sensibilität der Daten: Die Verarbeitung von eingeschränkten/vertraulichen oder geschäftskritischen Informationen erhöht die Auswirkung. Die Wahrscheinlichkeit einer Datenpanne wächst mit denselben Faktoren.",
      "falsePositives": "Kann reduziert oder unzutreffend sein, wenn ein robustes, durchgesetztes BYOD-Programm mit Geräte-Compliance-Prüfungen, Containerisierung und kontinuierlicher Überwachung existiert, das nachweislich die organisatorischen Anforderungen erfüllt – auch wenn das Modell ein privates Gerät enthält."
    },
    "mdm-synchronization-gap": {
      "title": "MDM-Synchronisationslücke (BSI SYS.3.2.2)",
      "description": "Mobile Geräte müssen sich regelmäßig beim MDM melden, um Richtlinien zu erhalten, diese durchzusetzen und Fernaktionen (z. B. Fernlöschung) zu ermöglichen. ",
      "impact": "Fehlende Synchronisation macht Geräte nicht konform und anfällig. Die Unfähigkeit, eine Fernlöschung auf einem verlorenen oder gestohlenen Gerät auszulösen, kann zu schwerwiegender Datenexposition führen, die Vertraulichkeit und Integrität beeinträchtigt und potenziell finanzielle, rechtliche und reputative Schäden verursacht.",
      "asvs": "BSI IT-Grundschutz SYS.3.2.2 Mobile Device Management (MDM), insbesondere Gefährdung 2.1 ",
      "action": "Regelmäßige MDM-Synchronisation modellieren und überwachen",
      "mitigation": "Konfigurieren Sie alle verwalteten Geräte so, dass sie sich in einem definierten Rhythmus (z. B. mindestens täglich) mit dem MDM-Server synchronisieren. Überwachen Sie den Check-in-Status zentral und alarmieren Sie, wenn Geräte diesen Schwellenwert überschreiten. Definieren Sie Verfahren für lange offline befindliche Geräte (vorübergehende Zugangssperre, Benutzerbenachrichtigung, Eskalation). Modellieren Sie explizit die Kommunikationsverbindung zwischen mobilen Clients und dem MDM-Server.",
      "check": "Hat jedes modellierte mobile Gerät eine Kommunikationsverbindung zu mindestens einem Asset mit dem Tag ",
      "detectionLogic": "Für jeden im Geltungsbereich befindlichen mobilen Client (Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn im Modell ein MDM-Link fehlt, da keine Synchronisation stattfinden kann. Die Auswirkung skaliert mit der maximalen Vertraulichkeit und Integrität der Daten auf dem Gerät – Geräte, die ",
      "falsePositives": "Möglich, wenn der MDM-Server oder seine Konnektivität nicht modelliert ist (z. B. von einem externen Dienst verwaltet) oder wenn die Synchronisation implizit ist. Stellen Sie sicher, dass alle mobilen Endpunkte und der MDM-Server modelliert und explizit verknüpft sind."
    },
    "misconfiguration-of-@System:MDM": {
      "title": "Fehlkonfiguration des Mobile Device Management (MDM)",
      "description": "MDM-Plattformen orchestrieren Richtlinien, Apps, Zertifikate und den Gerätezustand über Flotten von Smartphones und Tablets hinweg. Ihre Regelsätze sind umfangreich und voneinander abhängig; selbst kleine Fehler können sich auf Tausende von Geräten auswirken. Dieses Risiko erfasst Fehlkonfigurationen, die den Schutz verwalteter Endpunkte und des MDM selbst schwächen.",
      "impact": "Eine einzige fehlerhafte Richtlinie kann sich sofort auf viele Geräte ausbreiten und unbefugten Zugriff ermöglichen, wesentliche Kontrollen (z. B. Bildschirmsperre, Verschlüsselung) deaktivieren, die Compliance verletzen oder die Fernlöschung verhindern. Zu den Folgen gehören Datenexfiltration, Malware-Verbreitung, Dienstausfälle sowie regulatorische Strafen mit finanziellen und reputativen Schäden.",
      "asvs": "V14.2.1 Sichere Konfiguration; V1.14 Konfigurationsmanagement",
      "action": "Härten Sie das MDM, erstellen Sie eine Baseline für seine Konfiguration und erzwingen Sie eine Änderungskontrolle mit Peer-Review und automatischer Abweichungserkennung.",
      "mitigation": "Definieren Sie eine an den Hersteller angelehnte Härtungs-Baseline und wenden Sie das Prinzip der geringsten Rechte an. Sichern Sie alle Regeländerungen durch ein formales Änderungsmanagement mit Vier-Augen-Prinzip ab. Überwachen Sie kontinuierlich auf Abweichungen und nicht unterstützte Betriebssystemversionen; automatisieren Sie Prüfungen, wo möglich. Stellen Sie sicher, dass Administratoren geschult sind und separate, MFA-geschützte Konten verwenden.",
      "check": "Gibt es eine dokumentierte, genehmigte Härtungs-Baseline für das MDM? Werden Richtlinienänderungen per Peer-Review überprüft und nachverfolgt? Werden Konfigurationen automatisch auf Abweichungen und nicht unterstützte Betriebssystemversionen überprüft? Sind die Admin-Rollen nach dem Prinzip der geringsten Rechte konfiguriert und mit MFA geschützt?",
      "detectionLogic": "Löst bei jedem im Geltungsbereich befindlichen technischen Asset aus, das mit ",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich, angesichts der Komplexität und Änderungshäufigkeit von MDM-Implementierungen. Die Auswirkung skaliert mit den sensibelsten Daten und der Kritikalität der verwalteten Geräte; Umgebungen, die streng vertrauliche Daten oder geschäftskritische Dienste verwalten, führen zu hohen bis sehr hohen Auswirkungen, insbesondere bei vielen Endpunkten.",
      "falsePositives": "Geringeres Risiko, wenn der MDM-Umfang minimal ist (wenige Geräte, nicht sensible Daten) und es starke Beweise für ein ausgereiftes Konfigurationsmanagement, automatisierte Konformitätsprüfungen, kontinuierliche Überwachung und schnelle Abweichungserkennung gibt. Sandbox- oder schreibgeschützte Pilotprojekte können die Relevanz ebenfalls reduzieren."
    },
    "incorrect-mdm-role-assignment-sys-3-2-2": {
      "title": "Fehlerhafte Rollenzuweisung im MDM (BSI SYS.3.2.2)",
      "description": "Das Berechtigungsmanagement eines Mobile Device Management (MDM)-Systems steuert, welche Benutzer Einstellungen auf mobilen Geräten ändern können und wer auf welche Daten zugreifen darf (siehe BSI SYS.3.2.2, Abschnitt 2.3). ",
      "impact": "Fehlerhaft zugewiesene Rollen in einem MDM können zu unbefugtem Zugriff auf sensible Daten, zur Änderung kritischer Gerätekonfigurationen, zur Installation von bösartiger oder nicht genehmigter Software, zu Datenlecks und zu Verstößen gegen gesetzliche oder regulatorische Datenschutzanforderungen führen. Die Auswirkung skaliert mit der Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der verwalteten Geräte und der von ihnen verarbeiteten Daten.",
      "asvs": "Basiert auf dem BSI IT-Grundschutz-Modul SYS.3.2.2 Mobile Device Management (MDM) (insbesondere Abschnitt 2.3 und Anforderung A20) und bezieht sich auf ORP.4 Identity and Access Management.",
      "action": "Implementieren und erzwingen Sie ein rollenbasiertes Zugriffskontrollmodell (RBAC) für das MDM nach dem Prinzip der geringsten Rechte, mit Änderungsgenehmigungen und regelmäßigen Überprüfungen.",
      "mitigation": "Entwerfen und implementieren Sie ein detailliertes RBAC-Modell für das MDM, das auf dem Prinzip der geringsten Rechte basiert. ",
      "check": "Gibt es ein dokumentiertes, genehmigtes RBAC-Konzept für das MDM? Werden Benutzer-zu-Rollen-Zuweisungen und Admin-Privilegien mindestens vierteljährlich überprüft (A20)? ",
      "detectionLogic": "Wird für jedes technische Asset ausgelöst, das mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Kann auch dann gemeldet werden, wenn robuste IAM-Prozesse existieren (z. B. starke Funktionstrennung, Änderungsgenehmigungen, regelmäßige Rezertifizierung und automatisierte Compliance). "
    },
    "unauthorized-location-tracking-mdm-sys321": {
      "title": "Unbefugte Standortverfolgung und Missbrauch über MDM (BSI SYS.3.2.2)",
      "description": "Die meisten Mobile Device Management (MDM)-Produkte können ein Gerät",
      "impact": "Wenn sensible Standortdaten und Bewegungsprofile durchsickern oder missbraucht werden, kann dies zu schwerwiegenden Datenschutzverletzungen führen, die persönliche Sicherheit von Einzelpersonen gefährden und erhebliche rechtliche und finanzielle Strafen für die Organisation aufgrund der Nichteinhaltung von Datenschutzgesetzen zur Folge haben. Illegale Überwachung kann auch das Vertrauen der Mitarbeiter schädigen und zu Rechtsstreitigkeiten führen.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein SYS.3.2.2 Mobile Device Management (MDM)",
      "action": "Implementieren Sie strenge Kontrollen, Richtlinien und Transparenz für Ortungsdienste",
      "mitigation": "Deaktivieren Sie die Standortverfolgungsfunktionen im MDM-System standardmäßig. Aktivieren Sie sie nur, wenn ein zwingender, dokumentierter und rechtmäßiger Geschäftszweck vorliegt. ",
      "check": "Ist die Standortverfolgung im MDM-System aktiviert? Wenn ja, gibt es einen dokumentierten, legitimen Geschäftszweck? Werden die Benutzer explizit informiert und haben sie ihre Zustimmung gegeben? Gibt es strenge Zugriffskontrollen und eine formelle Richtlinie, die die Verwendung dieser Daten regelt?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Mobile Device Management (MDM)-System über das ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn die Standortverfolgungsfunktionen technisch deaktiviert sind und nicht wieder aktiviert werden können, oder wenn das System ausschließlich zur Verfolgung von nicht-persönlichen Gütern (z. B. Logistikfahrzeugen) verwendet wird, bei denen die Datenschutzbestimmungen für Einzelpersonen nicht gelten."
    },
    "unauthorized-apple-id-access": {
      "title": "Unbefugter Zugriff auf eine unzureichend gesicherte Apple ID (BSI SYS.3.2.3)",
      "description": "Eine Apple ID ist das zentrale Konto für Apple-Dienste (iMessage, FaceTime, iCloud, App Store, „Wo ist?“, etc.). Wenn Angreifer Zugang zu einer schwach geschützten Apple ID erlangen, die für Unternehmenszwecke genutzt wird, können sie Dienste stören, iOS-Geräte orten oder fernlöschen und auf iCloud-Daten und -Backups zugreifen – was potenziell das Klonen von Gerätedaten auf ein anderes Gerät einschließt.",
      "impact": "Eine Kompromittierung kann die Vertraulichkeit verletzen (iCloud-Daten, Nachrichten, Standort), die Integrität untergraben (Fernlöschung oder Gerätesteuerung) und die Verfügbarkeit beeinträchtigen (Dienstunterbrechung). Zu den Folgen gehören Datenexposition, betriebliche Auswirkungen, finanzielle Verluste und Reputationsschäden.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz und Best Practices; stimmt mit OWASP ASVS (Authentication Verification Requirements) überein.",
      "action": "Sichern Sie Apple IDs mit starker Authentifizierung und Verwaltungskontrollen",
      "mitigation": "Schützen Sie jede für geschäftliche Zwecke genutzte Apple ID mit einem starken, einzigartigen Passwort und obligatorischer Zwei-Faktor-Authentifizierung (2FA). Bevorzugen Sie verwaltete Apple IDs über den Apple Business Manager für organisatorische Kontrolle. Kennzeichnen Sie das relevante Asset mit ",
      "check": "Benötigt das Asset eine Apple ID? Ist 2FA für diese Apple ID nachweislich aktiviert (idealerweise eine verwaltete Apple ID)? Sind die Passwörter gemäß der Richtlinie einzigartig und stark?",
      "detectionLogic": "Markiert jedes im Geltungsbereich befindliche technische Asset mit dem Tag ",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich ohne 2FA; Unwahrscheinlich mit 2FA. Auswirkung: Standardmäßig Mittel; Hoch, wenn das Asset ≥ vertrauliche Daten verarbeitet oder ≥ kritische Integrität/Verfügbarkeit hat; Sehr Hoch, wenn streng vertrauliche Daten oder geschäftskritische Integrität/Verfügbarkeit vorliegen. Wahrscheinlichkeit einer Datenpanne: Unwahrscheinlich mit 2FA; Wahrscheinlich, wenn Auswirkung ≥ Hoch ohne 2FA; sonst Möglich.",
      "falsePositives": "Kann überbewertet sein, wenn die Apple ID auf nicht-kritische, isolierte Zwecke beschränkt ist (z. B. nur VPP-App-Zuweisung) ohne Zugriff auf sensible Daten oder Geräteverwaltungsfunktionen."
    },
    "elevated-privileges-of-preinstalled-ios-apps": {
      "title": "Erhöhte Berechtigungen vorinstallierter iOS-Apps",
      "description": "Apple liefert iOS mit vorinstallierten Apps (z. B. Mail, Safari) aus, die oft mit höheren Berechtigungen laufen als Apps, die aus dem App Store heruntergeladen werden. Dies erhöht das Gerät",
      "impact": "Wenn eine Schwachstelle in einer dieser vorinstallierten, hoch privilegierten Apps ausgenutzt wird, könnte ein Angreifer erhöhten Zugriff auf Geräteressourcen, Daten oder Funktionen erlangen. Dies könnte Sicherheitskontrollen umgehen, unbefugten Datenzugriff ermöglichen oder zu einer vollständigen Kompromittierung des Geräts führen.",
      "asvs": "Nicht anwendbar. Dies ist ein plattformspezifisches Risiko, das dem iOS-Ökosystem innewohnt. Verwandte Konzepte werden im OWASP Mobile Security Testing Guide (MSTG) behandelt, insbesondere in Bezug auf Plattforminteraktion und Berechtigungsmodelle (MSTG-PLATFORM-1, MSTG-PLATFORM-2).",
      "action": "Gerätekonfigurationen härten und die Nutzung vorinstallierter Apps für sensible Aufgaben einschränken.",
      "mitigation": "Da diese Berechtigungen fest integriert sind, ist eine direkte Minderung begrenzt. Das Risiko kann jedoch reduziert werden durch: 1. Regelmäßiges Aktualisieren von iOS und allen Apps, um bekannte Schwachstellen zu patchen. 2. Verwendung einer Mobile Device Management (MDM)-Lösung, um Sicherheitsrichtlinien durchzusetzen und die App-Funktionalität einzuschränken. 3. Für hochsensible Operationen sollten dedizierte, gehärtete Drittanbieter-Apps mit einem kleineren, besser überprüfbaren Funktionsumfang anstelle von Standard-Apps wie Mail oder Safari in Betracht gezogen werden. 4. Benutzer über die Risiken des Öffnens verdächtiger Links oder Anhänge in diesen Anwendungen aufklären.",
      "check": "Laufen die Geräte unter iOS? Werden standardmäßig vorinstallierte Apps wie Safari und Mail zur Verarbeitung oder zum Zugriff auf sensible Daten verwendet? Ist eine MDM-Lösung zur Verwaltung und Einschränkung dieser Anwendungen vorhanden? Werden Geräte und Apps konsistent auf dem neuesten Stand gehalten?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das ein iOS-basiertes Client-Gerät darstellt. Es prüft auf Assets mit clientseitigen Technologien (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist im Allgemeinen ",
      "falsePositives": "Dieses Risiko kann als False Positive oder "
    },
    "dependency-on-apple-infrastructure": {
      "title": "Abhängigkeit von Apple Cloud-Diensten für iOS/iPadOS-Funktionen (BSI SYS.3.2.3 §2.3)",
      "description": "Ein breites Spektrum an iOS/iPadOS-Funktionen leitet Daten über von Apple betriebene Infrastruktur: iCloud-Schlüsselbund und -Backups, iMessage, FaceTime, Siri, Continuity/Handoff, Spotlight-Vorschläge, Dokumentenkollaboration und der Apple Push Notification Service (APNs). Selbst wenn nur für Benachrichtigungen genutzt, können Metadaten und Nutzdaten die Apple-Infrastruktur durchlaufen. Dies führt zu einer inhärenten Abhängigkeit und Exposition außerhalb der direkten Kontrolle der Organisation.",
      "impact": "Kompromittierung, rechtmäßiger Zugriff, Fehlkonfiguration oder Ausfall der Apple-Infrastruktur können sensible Daten, die durch diese Funktionen synchronisiert oder transportiert werden, offenlegen oder verändern. Dies bedroht primär die Vertraulichkeit und Integrität und kann auch die Verfügbarkeit beeinträchtigen, wenn Dienste unterbrochen werden.",
      "asvs": "BSI SYS.3.2.3.A14 (Verwendung der iCloud-Infrastruktur), SYS.3.2.3.A15 (Continuity-Funktionen); APP.4.5 (Smartphones/Tablets unter iOS/iPadOS).",
      "action": "Definieren und erzwingen Sie eine Richtlinie für Apple-Cloud-Funktionen über MDM; minimieren oder deaktivieren Sie nicht wesentliche iCloud/Continuity/Siri-Nutzung; halten Sie Push-Nutzdaten nicht-sensitiv; bevorzugen Sie E2EE-Apps für vertrauliche Kommunikation.",
      "mitigation": "Verwenden Sie MDM, um: (1) iCloud-Backups, iCloud Drive, iCloud-Schlüsselbund, Continuity/Handoff, Siri, Spotlight-Vorschläge zu deaktivieren oder einzuschränken; (2) anonyme/verwaltete Apple IDs über den Apple Business Manager zu erfordern; (3) 2FA für jede erlaubte Nutzung von Apple IDs zu erzwingen; (4) sicherzustellen, dass Push-Benachrichtigungen keine sensiblen Inhalte enthalten (serverseitige Schwärzung); (5) Ende-zu-Ende-verschlüsselte Kommunikationskanäle für sensible Austausche vorzuschreiben; (6) zu dokumentieren, wann und warum eine Apple-Cloud-Funktion erlaubt ist.",
      "check": "Ist MDM im Einsatz und erzwingt es Einschränkungen für iCloud, Siri, Continuity, Spotlight und den Inhalt von APNs-Nutzdaten? Werden der Apple Business Manager und verwaltete Apple IDs verwendet? Ist 2FA erforderlich, wo Apple IDs erlaubt sind? Gibt es eine dokumentierte Richtlinie, die Apple-Cloud-Funktionen explizit nach Datenklassifizierung genehmigt oder verbietet?",
      "detectionLogic": "Markiert jedes im Geltungsbereich befindliche Client-Technologie-Asset mit dem Tag ",
      "riskAssessment": "Geräte, die Daten mit höheren Vertraulichkeits- oder Integritätsanforderungen verarbeiten, eskalieren die Auswirkung von Niedrig → Mittel → Hoch → Sehr Hoch. Die Wahrscheinlichkeit wird auf ",
      "falsePositives": "Geringes Risiko, wenn eine effektive MDM-Baseline iCloud/Continuity/Siri nachweislich deaktiviert und Benachrichtigungs-Nutzdaten bereinigt werden, oder wenn das Gerät nur öffentliche, nicht-sensible Daten verarbeitet (z. B. Kiosk-/Demo-Geräte)."
    },
    "unlocked-bootloader-on-android-device": {
      "title": "Entsperrter Bootloader auf einem Android-Gerät (gemäß BSI-Leitfaden)",
      "description": "Der Startvorgang moderner mobiler Geräte (wie Android) ist durch eine Vertrauenskette gesichert, die typischerweise von einem Hersteller",
      "impact": "Ein entsperrter Bootloader kompromittiert die grundlegende Integrität des Geräts. Dies kann zur Installation von Malware mit Root-Rechten, einer vollständigen Umgehung von Sicherheitskontrollen auf Anwendungsebene und unbefugtem Zugriff auf sensible Daten führen, die auf dem Gerät gespeichert oder von ihm verarbeitet werden (z. B. Anmeldeinformationen, persönliche Informationen, Unternehmensdaten). Das kompromittierte Gerät könnte auch als Dreh- und Angelpunkt für Angriffe auf andere Systeme genutzt werden. Die Vertraulichkeit, Integrität und Verfügbarkeit aller Assets auf dem Gerät sind einem hohen Risiko ausgesetzt.",
      "asvs": "OWASP MASVS V8.1: Die App läuft nicht auf einem gerooteten oder jailbroken Gerät.",
      "action": "Geräteintegrität erzwingen und Laufzeit-Manipulationserkennung implementieren",
      "mitigation": "Stellen Sie bei unternehmensverwalteten Geräten sicher, dass sie mit einem gesperrten Bootloader über eine Mobile Device Management (MDM)-Lösung bereitgestellt werden (siehe BSI CON.8). Implementieren Sie für Anwendungen, die sensible Daten verarbeiten, robuste Laufzeitprüfungen, um kompromittierte Umgebungen zu erkennen. Dies beinhaltet die Verwendung plattformspezifischer APIs wie Android",
      "check": "Müssen Geräte gemäß Richtlinie einen gesperrten Bootloader haben? Beinhaltet die Anwendung Laufzeitprüfungen, um eine kompromittierte Betriebssystemumgebung zu erkennen und angemessen zu reagieren? Werden diese Erkennungsereignisse zur Sicherheitsüberwachung protokolliert?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist sehr hoch, da die primäre Sicherheitsbarriere (Verified Boot) entfernt wurde. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten. Ein entsperrter Bootloader auf einem Gerät, das ",
      "falsePositives": "Dieses Risiko ist im Allgemeinen kein False Positive, wenn das Asset korrekt getaggt ist. Eine Geschäftsentscheidung könnte getroffen werden, dieses Risiko zu akzeptieren (z. B. für Entwicklungs- oder Testgeräte), aber die Schwachstelle und ihre potenziellen Folgen bleiben bestehen und müssen formell anerkannt und akzeptiert werden."
    },
    "malware-on-android-devices": {
      "title": "Malware auf Android-Geräten (Sideloading und nicht vertrauenswürdige Stores)",
      "description": "Die Popularität und Offenheit von Android machen es zu einem Hauptziel für mobile Malware. Neben dem offiziellen Google Play Store können Benutzer auch Apps aus alternativen Stores, direkten APK-Downloads oder Unternehmensverteilungskanälen installieren. Angreifer verpacken häufig legitime Apps mit bösartigem Code neu und verleiten Benutzer dazu, sie aus nicht vertrauenswürdigen Quellen zu installieren. Dieses Risiko modelliert die Exposition von Unternehmensgeräten und -apps, die auf Android laufen.",
      "impact": "Kompromittierte Android-Geräte können Anmeldeinformationen und Tokens preisgeben; Daten im Ruhezustand und in Gebrauch exfiltrieren; die App-Logik manipulieren; in Backend-APIs eindringen; oder Geräteschutzmechanismen deaktivieren. Solche Verletzungen können die Vertraulichkeit (Datendiebstahl/Spyware), Integrität (Transaktions- oder Konfigurationsmanipulation) und Verfügbarkeit (z. B. Ransomware oder DoS gegen MDM/EMM-Richtlinien) aller Daten beeinträchtigen, auf die das Gerät oder die App zugreifen kann.",
      "asvs": "OWASP MASVS v2.0 – V8: Resilience",
      "action": "MDM/EMM mit strengen App-Kontrollen einführen und durchsetzen; „unbekannte Quellen“ blockieren; verwaltete Google Play-Allowlists bevorzugen; Benutzer schulen; und mobile Anti-Malware/Play Protect fordern.",
      "mitigation": "Erzwingen Sie die Geräteverwaltung (MDM/EMM) mit: 1) Installation beschränkt auf verwaltetes Google Play (nur Whitelist), 2) „unbekannte Quellen“ deaktiviert, 3) Entwicklermodus und USB-Debugging deaktiviert, 4) automatische Betriebssystem- und App-Updates, 5) Play Integrity/SafetyNet-Attestierung für Unternehmens-Apps, 6) Root-Erkennung und Manipulationsschutz in benutzerdefinierten Apps, 7) Minimierung und Überwachung von Laufzeitberechtigungen, 8) Netzwerk-Ausgangskontrollen und TLS-Pinning für sensible APIs.",
      "check": "Sind Android-Geräte in MDM/EMM mit ausschließlich auf der Whitelist stehenden Apps registriert? Ist die Installation aus „unbekannten Quellen“ deaktiviert und der Entwicklermodus ausgeschaltet? Werden Play Protect und Betriebssystem-/App-Updates erzwungen? Implementieren benutzerdefinierte Apps Root-Erkennung, Manipulationsschutz und Play Integrity-Prüfungen?",
      "detectionLogic": "Ausgelöst für jedes im Geltungsbereich befindliche technische Asset, das eine Client-Technologie ist (z. B. MobileApp, ClientSystem) UND explizit mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist auf ",
      "falsePositives": "Kann ein False Positive sein, wenn MDM/EMM verwaltete Google Play-Allowlists vollständig durchsetzt, unbekannte Quellen und den Entwicklermodus blockiert und das Gerät in einem gesperrten Kiosk-/Nur-Arbeitsprofil-Modus mit erzwungener Play Integrity und ohne sensible Tokens läuft."
    },
    "outdated-mobile-os": {
      "title": "Verwendung veralteter mobiler Betriebssystemkomponenten (BSI SYS.3.2.1)",
      "description": "Einige Hersteller liefern Smartphones und Tablets mit veralteten Versionen ihres Betriebssystems (wie Android) aus oder stellen keine regelmäßigen oder gar keine Updates zur Verfügung. ",
      "impact": "Die Ausnutzung bekannter Schwachstellen kann zu einer vollständigen Kompromittierung des Geräts führen, was zum Diebstahl sensibler Daten (Verletzung der Vertraulichkeit), zur Manipulation von Gerätefunktionen oder Daten (Verletzung der Integrität) und zur Unbrauchbarkeit des Geräts (Verletzung der Verfügbarkeit) führen kann. Dies kann alle auf dem Gerät verarbeiteten oder gespeicherten Datenbestände gefährden.",
      "asvs": "BSI IT-Grundschutz: SYS.3.2.1.A5 Regelmäßige Updates von mobilen Geräten",
      "action": "Implementieren Sie eine Richtlinie für Mobile Device Management (MDM) und Patch-Management",
      "mitigation": "Stellen Sie sicher, dass alle mobilen Geräte, die für den Zugriff auf Unternehmensdaten verwendet werden, von einer MDM-Lösung verwaltet werden. Die MDM-Richtlinie sollte Mindestanforderungen an die Betriebssystemversion durchsetzen und Sicherheitspatches automatisch anwenden. Geräte, die nicht aktualisiert werden können oder die Konformität verlieren, sollten vom Zugriff auf Unternehmensressourcen ausgeschlossen werden. Beschaffen Sie Geräte von Herstellern mit einer nachgewiesenen Erfolgsbilanz bei der Bereitstellung zeitnaher und langfristiger Sicherheitsupdates.",
      "check": "Ist eine MDM-Lösung im Einsatz? Erzwingt das MDM Richtlinien für die Betriebssystemversion und den Patch-Level? Gibt es Protokolle, um zu überprüfen, dass die Geräte regelmäßig aktualisiert werden? Gibt es eine Liste genehmigter Geräte von seriösen Herstellern?",
      "detectionLogic": "Das Risiko wird für jedes technische Asset ausgelöst, das als mobiler Client identifiziert wird (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Das Risiko könnte als False Positive betrachtet werden, wenn eine robuste MDM-Lösung vorhanden ist, die die identifizierten Gerätetypen effektiv verwaltet und patcht, auch wenn dies nicht explizit modelliert ist. Dem Modell fehlt der Einblick in die Organisation"
    },
    "compromise-of-central-identity-provider": {
      "title": "Kompromittierung des zentralen Identitätsanbieters (z. B. Google ID)",
      "description": "Viele Dienste verwenden einen zentralen Identitätsanbieter, wie eine Google ID, zur Benutzerauthentifizierung. Dies schafft einen Single Point of Failure. Wenn ein Angreifer die Kontrolle über diese zentrale Identität erlangt, kann er auf alle verbundenen Dienste unter der gestohlenen Identität zugreifen.",
      "impact": "Eine kompromittierte zentrale Identität kann zu unbefugtem Zugriff auf eine breite Palette von Diensten führen, einschließlich Cloud-Speicher, Geräteverwaltung, Kommunikationsplattformen und Drittanbieter-Anwendungen. Angreifer könnten gespeicherte Daten (Dateien, Lesezeichen, Passwörter) abrufen oder stehlen, den Benutzer imitieren oder sogar mit dem Konto verknüpfte Geräte fernorten und löschen.",
      "asvs": "V2 Authentifizierungsüberprüfungsanforderungen",
      "action": "Starke Authentifizierung für zentrale Identitäten erzwingen",
      "mitigation": "Stellen Sie sicher, dass die gesamte Kommunikation mit zentralen Identitätsanbietern eine starke, mehrstufige Authentifizierung (MFA/2FA) erfordert. Modellieren Sie diese Anforderung explizit auf der Kommunikationsverbindung. Schulen Sie Benutzer über Phishing und den Diebstahl von Anmeldeinformationen. Überprüfen und widerrufen Sie regelmäßig den Zugriff für ungenutzte oder verdächtige Drittanbieter-Anwendungen, die mit der zentralen Identität verbunden sind.",
      "check": "Ist die Kommunikation mit dem zentralen Identitätsanbieter durch mehrstufige Authentifizierung geschützt? Sind die Assets, die den Identitätsanbieter verwenden, so konfiguriert, dass dies erzwungen wird? Gibt es Überwachungs- und Warnmechanismen für verdächtige Anmeldeaktivitäten?",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die mit einem externen ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Kompromittierung ist hoch, wenn schwache Authentifizierungsmethoden (wie nur Passwörter) verwendet werden. Die Auswirkung wird durch die Sensibilität des technischen Assets, das die Identität verwendet, und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Der Zugriff auf ein Asset, das ",
      "falsePositives": "Das Modell könnte bereits widerspiegeln, dass der Identitätsanbieter MFA auf seiner Seite erzwingt, auch wenn der Link im Modell nicht explizit als "
    },
    "preinstalled-apps-on-android-devices": {
      "title": "Nicht entfernbare vorinstallierte Apps auf Android-Geräten (Bloatware)",
      "description": "Hersteller von Android-Geräten liefern Geräte oft mit vorinstallierten, nicht entfernbaren Anwendungen und Integrationen mit Drittanbieter-Diensten (z. B. soziale Medien oder Hersteller-Dienstprogramme). ",
      "impact": "Die erhöhte Angriffsfläche durch Bloatware erhöht das Risiko von Malware-Infektionen oder unbefugtem Zugriff auf vertrauliche Informationen. ",
      "asvs": "Abgeleitet von BSI SYS.3.2.1 Mobile Device Management (MDM) und OWASP MASVS-PLATFORM-1: ",
      "action": "Vorinstallierte Anwendungen einschränken, kontrollieren oder entfernen",
      "mitigation": "Verwenden Sie eine Mobile Device Management (MDM)-Lösung, um unnötige vorinstallierte Anwendungen auf allen Unternehmensgeräten zu deaktivieren oder einzuschränken. ",
      "check": "Gibt es ein Inventar der vorinstallierten Anwendungen auf unternehmenseigenen Android-Geräten? Ist ein Mobile Device Management (MDM)-System zur Kontrolle dieser Anwendungen vorhanden? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das ein Client-Gerät darstellt (z. B. Technologien wie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn das Gerät nachweislich eine saubere, AOSP-basierte Custom ROM ohne Bloatware von Drittanbietern ausführt oder wenn eine effektive und auditierte MDM-Konfiguration vorhanden ist, die alle nicht wesentlichen vorinstallierten Anwendungen erfolgreich deaktiviert."
    },
    "unsuitable-mobile-asset-procurement-sys321-g04": {
      "title": "Ungeeignete Beschaffung von Mobiltelefonen (BSI SYS.3.3: Unzureichende Planung)",
      "description": "Wenn relevante Eigenschaften von Mobiltelefonen bei der Planung und Beschaffung nicht richtig bewertet werden, können wesentliche Funktionen nicht verfügbar sein. Dies kann auftreten, wenn das Gerät oder sein Betriebssystem erforderliche Standards (z. B. Kommunikationsprotokolle, Sicherheitsmerkmale) nicht unterstützt oder für die vorgesehene Betriebsumgebung (z. B. bestimmte Länder oder bestimmte Unternehmensnetzwerke) ungeeignet ist.",
      "impact": "Die primäre Auswirkung ist ein Verlust der Verfügbarkeit, da das Asset für seinen beabsichtigten Zweck teilweise oder vollständig unbrauchbar sein kann, was Geschäftsprozesse stört. Darüber hinaus können unvorhergesehene Einschränkungen bei den Sicherheitsmerkmalen zu Vertraulichkeits- oder Integritätsrisiken führen, wenn das Asset trotz seiner Mängel verwendet wird.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein SYS.3.3 (Mobiltelefon), Abschnitt 2.1 ",
      "action": "Etablieren Sie detaillierte Beschaffungs- und Onboarding-Anforderungen für Mobiltelefone.",
      "mitigation": "Definieren und dokumentieren Sie klare technische und sicherheitstechnische Anforderungen für jedes Mobiltelefon vor der Beschaffung. Dazu gehören erforderliche Kommunikationsstandards, unterstützte Sicherheitsfunktionen (z. B. Verschlüsselung, SIM-Sperre) und betriebliche Einschränkungen. Führen Sie eine Proof-of-Concept- oder Pilotphase durch, um zu validieren, dass das gewählte Gerät alle Anforderungen in der Zielumgebung erfüllt. Führen Sie eine genehmigte Liste von Gerätemodellen und Firmware-Versionen.",
      "check": "Gibt es dokumentierte Anforderungen für Mobiltelefone? Gibt es einen formalen Bewertungsprozess, bevor ein neuer Typ von Mobiltelefon eingeführt wird? Ist das Gerät",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das einen mobilen Client darstellt (z. B. Technologietypen ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn in der Organisation ein gründlicher und dokumentierter Bewertungs- und Beschaffungsprozess für mobile Assets existiert, auch wenn dieser Prozess nicht im Bedrohungsmodell erfasst ist."
    },
    "lost-or-stolen-mobile-device": {
      "title": "Verlorenes oder gestohlenes mobiles Gerät (BSI)",
      "description": "Mobile Geräte sind im Allgemeinen klein und werden ständig transportiert, was sie leicht zu verlieren, zu vergessen oder zu stehlen macht. ",
      "impact": "Wenn ein mobiles Gerät verloren geht oder gestohlen wird, kann dies zu einer direkten Verletzung der Vertraulichkeit und Integrität aller darauf gespeicherten Daten und zu einem Verlust der Dienstverfügbarkeit für den Benutzer führen. ",
      "asvs": "OWASP MASVS V2.0.0: V8.1 - Benutzer müssen einen gerätespezifischen Passcode festlegen.",
      "action": "Implementieren Sie starke Gerätesicherheit und Fernverwaltung",
      "mitigation": "Erzwingen Sie eine starke Authentifizierung auf Geräteebene (Passcode oder biometrische Authentifizierung). ",
      "check": "Gibt es eine Richtlinie, die starke Passcodes auf mobilen Geräten vorschreibt? Sind alle Geräte standardmäßig verschlüsselt? ",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das als mobiler Anwendungskunde identifiziert wird, ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass ein mobiles Gerät während seines Lebenszyklus verloren geht oder gestohlen wird, ist sehr hoch. ",
      "falsePositives": "Dieses Risiko könnte als False Positive betrachtet werden, wenn das Asset-Modell einen Backend-Dienst für eine mobile App darstellt und nicht die Client-Anwendung, die auf dem physischen Gerät läuft. Das Risiko gilt nur für Assets auf einem tragbaren physischen Gerät."
    },
    "careless-mobile-usage": {
      "title": "Informationspreisgabe durch unachtsamen Umgang mit Mobilgeräten",
      "description": "Unachtsamer oder fahrlässiger Umgang mit mobilen Geräten durch Mitarbeiter kann Dritten den Zugriff auf sensible Informationen ermöglichen. ",
      "impact": "Wenn sensible Informationen aufgrund unachtsamen Umgangs mit mobilen Geräten kompromittiert werden, kann dies zu einer Verletzung der Vertraulichkeit führen. ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1.A6 (Unbefugtes Mithören bei Mobiltelefonen)",
      "action": "Implementieren Sie Schulungen zur Sensibilisierung der Benutzer und fördern Sie sichere Nutzungsgewohnheiten für mobile Geräte",
      "mitigation": "Etablieren Sie eine Sicherheitsrichtlinie für die Nutzung mobiler Geräte, die Mitarbeiter über sichere Praktiken berät. ",
      "check": "Werden Benutzer über die Risiken der Nutzung mobiler Geräte in der Öffentlichkeit geschult? Gibt es Richtlinien bezüglich der Diskussion sensibler Informationen am Mobiltelefon? Sind Sichtschutzfolien verfügbar und werden sie für Firmengeräte verwendet?",
      "detectionLogic": "Dieses Risiko ist für alle von Menschen bedienten mobilen Clients (z. B. mobile Apps, tragbare IoT-Geräte) relevant, die Daten mit einem beliebigen Vertraulichkeitsgrad verarbeiten oder übertragen. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der Häufigkeit der Nutzung mobiler Geräte im öffentlichen Raum als hoch angesehen. ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn das mobile Gerät ausschließlich in einer physisch sicheren und kontrollierten Umgebung betrieben wird (z. B. ein Handscanner, der nur in einem sicheren Lager ohne externe Besucher verwendet wird)."
    },
    "unauthorized-private-use-of-mobile-devices": {
      "title": "Unbefugte private Nutzung von firmeneigenen Mobilgeräten",
      "description": "Firmeneigene Mobilgeräte können ohne Genehmigung für private Zwecke genutzt werden. ",
      "impact": "Wenn firmeneigene Mobilgeräte für private Zwecke genutzt werden, kann dies zu einer Verletzung der Vertraulichkeit interner Daten führen. ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.2 Mobile Device Management (MDM), insbesondere mit Verweis auf die Anforderung SYS.3.2.2.A4 ",
      "action": "Implementieren und erzwingen Sie eine Richtlinie für Mobile Device Management (MDM)",
      "mitigation": "Erzwingen Sie eine klare Richtlinie bezüglich der privaten Nutzung von Firmengeräten. ",
      "check": "Gibt es eine dokumentierte Richtlinie für die Nutzung von Mobilgeräten? Ist eine Mobile Device Management (MDM)-Lösung vorhanden und so konfiguriert, dass Geschäfts- und Privatdaten getrennt werden? ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die von Menschen bediente Clients sind (insbesondere mobile Apps oder Geräte), die nicht explizit als durch eine MDM-Lösung verwaltet gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit der privaten Nutzung wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn eine effektive MDM-Lösung vorhanden ist, aber das entsprechende technische Asset im Modell nicht mit `@System:MDM` getaggt wurde."
    },
    "mobile-phone-unavailability": {
      "title": "Nichtverfügbarkeit von Mobiltelefonen (BSI-basiert)",
      "description": "Die Nichtverfügbarkeit eines Mobiltelefons kann verschiedene Ursachen haben. Benutzer haben möglicherweise vergessen, das Gerät aufzuladen",
      "impact": "In all diesen Fällen ist der Benutzer nicht erreichbar und kann wiederum andere nicht über das Mobiltelefon erreichen. Dies führt zu einem Denial-of-Service für alle Geschäftsprozesse und Datenbestände, die von der Verfügbarkeit des mobilen Geräts abhängen.",
      "asvs": "Dieses Risiko steht im Einklang mit dem allgemeinen IT-Sicherheitsprinzip der Gewährleistung der Verfügbarkeit. Es ist nicht an eine spezifische ASVS-Anforderung gebunden, sondern spiegelt eine grundlegende operative Bedrohung wider.",
      "action": "Verfügbarkeit mobiler Geräte sicherstellen",
      "mitigation": "Um diese Risiken zu mindern, sollten Benutzer in der richtigen Gerätepflege, einschließlich regelmäßigem Aufladen, geschult werden. Organisationen sollten die Bereitstellung von @Backup:Target-Stromquellen (z. B. Powerbanks) für kritische Rollen in Betracht ziehen. Die Verwendung von Schutzhüllen kann das Risiko physischer Schäden verringern. Es müssen klare, effiziente Verfahren zum Zurücksetzen vergessener PINs oder Passwörter vorhanden sein, um den Zugriff ohne längere Ausfallzeiten wiederzuerlangen. Für geschäftskritische Szenarien sollte die Bereitstellung redundanter @Backup:Target-Geräte erwogen werden.",
      "check": "Erhalten Benutzer Anleitungen und Schulungen zur Wartung mobiler Geräte? Stehen für kritische Benutzer @Backup:Target-Stromversorgungsoptionen oder redundante Geräte zur Verfügung? Gibt es einen effizienten, dokumentierten Prozess für den Umgang mit gesperrten Geräten oder vergessenen Anmeldeinformationen?",
      "detectionLogic": "Dieses Risiko gilt für alle im Geltungsbereich befindlichen technischen Assets mit dem Technologietyp ",
      "riskAssessment": "Die Wahrscheinlichkeit wird im Allgemeinen als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn das Modell ein unkritisches Gerät darstellt oder wenn robuste, nicht modellierte Redundanzmaßnahmen (wie ein zweites Firmenhandy pro Mitarbeiter) vorhanden sind."
    },
    "eavesdropping-and-location-tracking-of-mobile-communication": {
      "title": "Mithören und Standortverfolgung der mobilen Kommunikation",
      "description": "Mobile Kommunikationssignale können von Angreifern mit ausreichenden Ressourcen abgefangen und aufgezeichnet werden. ",
      "impact": "Wenn die mobile Kommunikation nicht ordnungsgemäß gesichert ist, können die Vertraulichkeit und Integrität der übertragenen Daten kompromittiert werden. ",
      "asvs": "BSI IT-Grundschutz: SYS.3.2.2.A11 (Schutz der Kommunikation bei Smartphones), NET.3.2.A4 (WLAN-Verschlüsselung).",
      "action": "Starke Verschlüsselung für alle mobilen Kommunikationen erzwingen",
      "mitigation": "Alle von mobilen Geräten übertragenen Daten müssen mit starken, aktuellen Verschlüsselungsprotokollen (z. B. HTTPS, WSS oder einem VPN-Tunnel) geschützt werden. ",
      "check": "Verwenden alle Kommunikationsverbindungen, die von mobilen Clients ausgehen, verschlüsselte Protokolle? Wird ein VPN für den mobilen Zugriff erzwungen? Werden sensible Anmeldeinformationen oder Daten übertragen?",
      "detectionLogic": "Diese Regel wird für alle Kommunikationsverbindungen ausgelöst, die von technischen Assets ausgehen, die als mobile Clients identifiziert werden (z. B. Technologien ",
      "riskAssessment": "Die Wahrscheinlichkeit des Abfangens ist bei unverschlüsseltem drahtlosem Verkehr hoch. Die Auswirkung hängt von den Vertraulichkeits- und Integritätsanforderungen der übertragenen Daten ab. ",
      "falsePositives": "Das Risiko kann für die Kommunikation innerhalb eines physisch gesicherten, privaten drahtlosen Netzwerks (z. B. ein dediziertes WLAN vor Ort für Lager-Scanner) gemeldet werden, bei dem das Risiko des Mithörens als gering eingestuft wird. "
    },
    "covert-eavesdropping-via-mobile-device": {
      "title": "Verdecktes Mithören über mobile Geräte",
      "description": "Mobile Geräte wie Smartphones können unbemerkt Gespräche aufzeichnen oder übertragen. Während sensibler Besprechungen oder in sicheren Bereichen kann ein kompromittiertes oder böswillig genutztes mobiles Gerät eine Verbindung zu einem unbefugten Dritten herstellen und so den Raum effektiv verwanzen. Funktionen wie die Freisprecheinrichtung können Audio aus der gesamten Umgebung erfassen, und es ist oft schwer visuell zu erkennen, ob ein Gerät aktiv aufzeichnet oder sendet.",
      "impact": "Wenn vertrauliche Gespräche (z. B. über Geschäftsstrategie, Geschäftsgeheimnisse, persönliche Daten oder Systemarchitektur) mitgehört werden, führt dies zu einer schwerwiegenden Verletzung der Vertraulichkeit. Dies kann zu erheblichen finanziellen Verlusten, Reputationsschäden, dem Verlust von Wettbewerbsvorteilen und potenziellen rechtlichen oder regulatorischen Strafen führen.",
      "asvs": "Abgeleitet aus den Prinzipien des BSI IT-Grundschutzes, insbesondere im Zusammenhang mit CON.3 (Physische und Umgebungssicherheit). Diese Bedrohung hebt Risiken hervor, die die Lücke zwischen Cyber- und physischer Sicherheit schließen.",
      "action": "Etablieren und Durchsetzen einer ",
      "mitigation": "Für Besprechungen oder Arbeitsbereiche, in denen hochsensible Informationen besprochen werden, setzen Sie eine strikte Richtlinie durch, die persönliche oder nicht vertrauenswürdige mobile Geräte verbietet. Erwägen Sie die Bereitstellung sicherer Schließfächer zur Aufbewahrung von Geräten. Alternativ können technische Gegenmaßnahmen wie HF-Jammer oder -Detektoren (sofern gesetzlich zulässig) eingesetzt oder Diskussionen in speziell gesicherten Räumen (SCIFs) abgehalten werden. Schärfen Sie das Bewusstsein aller Mitarbeiter für diese spezifische Bedrohung.",
      "check": "Gibt es eine Richtlinie bezüglich mobiler Geräte in sensiblen Besprechungsbereichen? Sind die Mitarbeiter über diese Richtlinie und die Risiken des Mithörens informiert? Gibt es physische Kontrollen, um die Richtlinie durchzusetzen?",
      "detectionLogic": "Dieses Risiko wird durch das Vorhandensein von technischen Assets wie mobilen Apps oder IoT-Geräten innerhalb einer Vertrauensgrenze ausgelöst, die auch andere Assets enthält, die vertrauliche Daten verarbeiten oder speichern. Der Modell-Proxy für ein ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell repräsentiert möglicherweise nicht genau die physischen Standorte. Ein "
    },
    "outdated-mobile-devices-bsi": {
      "title": "Verwendung veralteter mobiler Geräte (BSI)",
      "description": "Die Verwendung veralteter Mobiltelefone (n@SystemType:OT moderne Smartphones) stellt ein erhebliches Risiko dar. Diese Geräte laufen oft auf nicht unterstützten Betriebssystemen, was bedeutet, dass Sicherheitslücken nicht mehr gepatcht werden. ",
      "impact": "Die Ausnutzung ungepatchter Schwachstellen kann zur Kompromittierung aller auf dem Gerät gespeicherten oder von ihm übertragenen Daten führen, was dessen Vertraulichkeit und Integrität beeinträchtigt. ",
      "asvs": "V14.2.5: Überprüfen Sie, ob alle Komponenten gepatcht und auf dem neuesten Stand sind.",
      "action": "Nicht unterstützte mobile Geräte ausmustern",
      "mitigation": "Etablieren und erzwingen Sie eine Richtlinie, die die Verwendung nicht unterstützter mobiler Geräte für geschäftliche Zwecke verbietet. Führen Sie ein Inventar aller mobilen Geräte und ihrer Betriebssystemversionen, um die Support-Lebenszyklen zu verfolgen. ",
      "check": "Gibt es ein Inventar aller in der Organisation verwendeten mobilen Geräte? Werden alle Geräte und ihre Betriebssysteme aktiv vom Hersteller mit Sicherheitsupdates unterstützt? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit als veraltetes mobiles Gerät mit dem ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird für ein Gerät mit bekannten, ungepatchten Schwachstellen, das mit einem beliebigen Netzwerk verbunden ist, als sehr hoch angesehen. ",
      "falsePositives": "Ein False Positive kann auftreten, wenn das gekennzeichnete Gerät in einer vollständig isolierten, offline-Umgebung verwendet wird, in der Software-Schwachstellen nicht remote ausgenutzt werden können und sein Potenzial für Hardwarefehler ein akzeptiertes Betriebsrisiko darstellt. "
    },
    "unattended-printouts-at-@AssetType:Printer": {
      "title": "Unbeaufsichtigte Ausdrucke am @AssetType:Printer – Sichere Ausgabe (BSI CON.3.A21)",
      "description": "Gedruckte Dokumente, Faxe und Übertragungsberichte werden häufig unbeaufsichtigt in den Ausgabefächern von zentralen, Abteilungs- oder Home-Office-Druckern und Multifunktionsgeräten zurückgelassen. ",
      "impact": "Unbeaufsichtigte sensible Ausdrucke können die Vertraulichkeit verletzen und persönliche oder Geschäftsgeheimnisse preisgeben. ",
      "asvs": "BSI IT-Grundschutz CON.3.A21 Sichere Ausgabe auf Druckern.",
      "action": "Sicheres/Pull-Printing durchsetzen, prompte Abholung und kontrollierte Aktenvernichtung oder Entsorgung.",
      "mitigation": "Führen Sie Pull-Printing ein, das eine Benutzerauthentifizierung am @AssetType:Printer erfordert. ",
      "check": "Wird Pull-Printing mit Benutzerauthentifizierung durchgesetzt? Befinden sich die Drucker in kontrollierten Bereichen? ",
      "detectionLogic": "Auslöser für jedes technische Asset, das mit ",
      "riskAssessment": "Die Auswirkung leitet sich von der sensibelsten Eigenschaft der an den @AssetType:Printer gesendeten Daten ab. ",
      "falsePositives": "Kann einen @AssetType:Printer in einem streng kontrollierten Raum für eine Einzelperson mit erzwungenem Pull-Printing und überwachter Entsorgung kennzeichnen. "
    },
    "data-leakage-from-print-@AssetType:Fax-jobs": {
      "title": "Vertraulicher Datenabfluss aus Druck- und @AssetType:Fax-Aufträgen und -Ausgaben (basierend auf BSI-Gefährdung G 0.15)",
      "description": "Drucker, @AssetType:Fax-Geräte und Multifunktionsgeräte (MFDs) verarbeiten oft sensible Informationen und Metadaten, was mehrere Wege für Datenlecks schafft. ",
      "impact": "Die Offenlegung von Druck- und @AssetType:Fax-Metadaten und Tracking-Informationen kann zu schweren Verletzungen der Vertraulichkeit und des Datenschutzes führen. Sie ermöglicht Unbefugten Einblicke in sensible Geschäftsabläufe, persönliche Daten und interne Dokumente. Dies kann bei der Verarbeitung von @DataType:PII zu einer Nichteinhaltung von Datenschutzbestimmungen, Reputationsschäden und der Kompromittierung von Geschäftsgeheimnissen führen.",
      "asvs": "BSI IT-Grundschutz, Gefährdung G 0.15 ",
      "action": "Sichere Druck-/Faxrichtlinien und Gerätehärtung implementieren",
      "mitigation": "Setzen Sie eine sichere Drucklösung ein, die eine Benutzerauthentifizierung am Gerät erfordert, bevor ein Auftrag freigegeben wird (Pull-Printing). Konfigurieren Sie Drucker und Druckserver so, dass sie die Metadaten von Druckaufträgen in Warteschlangen anonymisieren oder unterdrücken. Härten Sie Geräte, indem Sie unnötige Dienste deaktivieren, die administrative Weboberfläche sichern und den Zugriff auf Bedienfelder und Protokolle beschränken. Bewerten Sie Geräte auf Tracking-Funktionen wie ",
      "check": "Ist Pull-Printing für sensible Daten implementiert? Sind Druckwarteschlangen auf Servern und Geräten so konfiguriert, dass sensible Metadaten verborgen werden? Sind die Weboberflächen und Bedienfelder der Geräte gesichert? Sind @AssetType:Fax-Protokolle vor unbefugtem Zugriff geschützt? Wurde die Verwendung von Tracking-Wasserzeichen durch Drucker bewertet?",
      "detectionLogic": "Diese Regel löst bei technischen Assets aus, die als `@AssetType:Printer` oder `@AssetType:Fax` gekennzeichnet sind. Sie identifiziert Risiken durch (1) das Senden sensibler Daten an diese Geräte, was auf Metadatenlecks hinweist, (2) das inhärente Risiko der physischen Dokumentenverfolgung (",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeit der vom Gerät verarbeiteten Daten bestimmt. Die Wahrscheinlichkeit von Metadatenlecks wird bei Standarddruckaufträgen als hoch angesehen, da viele Geräte standardmäßig unsicher sind. Die Wahrscheinlichkeit, ",
      "falsePositives": "Das Risiko könnte durch organisatorische Richtlinien oder spezifische Gerätekonfigurationen gemindert werden, die im Modell nicht erfasst sind. Beispielsweise könnte ein Gerät physisch in einem verschlossenen Raum gesichert sein, oder eine sichere Pull-Printing-Lösung könnte vorhanden sein, die nicht explizit modelliert ist. Die Überprüfung erfordert die Prüfung der tatsächlichen Geräte- und Druckserverkonfigurationen."
    },
    "unprotected-data-on-mfd-storage": {
      "title": "Ungeschützte Daten auf @AssetType:Printer/MFD-Speicher",
      "description": "Drucker, Kopierer und Multifunktionsgeräte (MFDs) sind oft mit nichtflüchtigem Speicher ausgestattet ",
      "impact": "Unbefugter Zugriff auf sensible Daten, die auf dem Gerät gespeichert sind, führt zu einer Verletzung der Vertraulichkeit. ",
      "asvs": "BSI IT-Grundschutz SYS.4.1 Drucker, Kopierer und Multifunktionsgeräte",
      "action": "MFD-Konfiguration härten und sichere Außerbetriebnahme implementieren",
      "mitigation": "Aktivieren Sie die integrierte Speicherverschlüsselung auf dem MFD. Konfigurieren Sie das Gerät so, dass es sicheres Datenüberschreiben/-löschen für gelöschte Aufträge verwendet. ",
      "check": "Ist die Speicherverschlüsselung auf allen MFDs aktiviert? Sind sichere Löschmethoden konfiguriert und aktiv? ",
      "detectionLogic": "Löst bei technischen Assets aus, die als Multifunktionsgeräte (MFDs) über das ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeits- und Integritätsbewertung der Datenassets bestimmt ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn das identifizierte Asset trotz des Tags keinen persistenten Speicher hat oder wenn kompensierende Kontrollen "
    },
    "unencrypted-printing-scanning-data": {
      "title": "Unverschlüsselte Übertragung von Druck-, Scan- und Verwaltungsdaten",
      "description": "Druck- und Scandaten werden oft unverschlüsselt über das Netzwerk übertragen. Dies ermöglicht das Abfangen und Lesen gesendeter Dokumente. ",
      "impact": "Das Abfangen unverschlüsselter Druck- oder Scandaten führt zu einer Verletzung der Vertraulichkeit. Wenn auch administrative Schnittstellen unverschlüsselt sind, ",
      "asvs": "Abgeleitet aus den Prinzipien des BSI IT-Grundschutzes. Entspricht den OWASP Proactive Controls C8 (Protect Data Everywhere) und ASVS V4.1 (Communication Security Requirements).",
      "action": "Verschlüsselte Kommunikationskanäle erzwingen",
      "mitigation": "Verwenden Sie verschlüsselte Protokolle für den gesamten Druck-, Scan- und Verwaltungsdatenverkehr (z. B. IPPS anstelle von LPR/IPP, HTTPS anstelle von HTTP, SSH anstelle von Telnet). ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen zu und von Assets, die Druck-, Scan- oder Dokumentenmanagement durchführen. Überprüfen Sie, ob alle für die Datenübertragung und Verwaltung verwendeten Protokolle verschlüsselt sind. ",
      "detectionLogic": "Dieses Risiko wird durch das Auffinden von Kommunikationsverbindungen identifiziert, die unverschlüsselte Protokolle verwenden und auf technische Assets abzielen, die wahrscheinlich Druck-, ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird bei Verkehr, der Vertrauensgrenzen überschreitet, als höher angesehen. Die Auswirkung wird durch die Vertraulichkeit der übertragenen Datenassets bestimmt. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn die unverschlüsselte Kommunikation ausschließlich innerhalb eines physisch gesicherten, isolierten Netzwerksegments (z. B. einem dedizierten Drucker-VLAN) stattfindet, wo das Abfangen von Netzwerkdaten nicht als glaubwürdige Bedrohung angesehen wird. Solche Szenarien sollten explizit dokumentiert und akzeptiert werden."
    },
    "insecure-multifunction-device-handling-sys-3-2-1": {
      "title": "Unsicherer Umgang mit Druckern, Kopierern und Multifunktionsgeräten (BSI SYS.4.1)",
      "description": "Viele Multifunktionsgeräte (MFDs) können digitalisierte Dokumente per E-Mail und Fax versenden. Ohne spezifische Sicherheitsmaßnahmen, ",
      "impact": "Fehlkonfigurierte MFDs können zu schwerwiegenden Datenpannen (Verlust der Vertraulichkeit), zu Spoofing-Angriffen, die das Vertrauen schädigen und Betrug erleichtern (Verlust der Integrität), ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1: Drucker, Kopierer und Multifunktionsgeräte",
      "action": "Sichere Konfigurations- und Nutzungsrichtlinien für Multifunktionsgeräte",
      "mitigation": "Implementieren Sie ein strenges Konfigurationsmanagement für alle MFDs. Deaktivieren Sie unnötige Funktionen wie das Drucken aus dem Internet per E-Mail. ",
      "check": "Werden MFD-Konfigurationen gehärtet und regelmäßig überprüft? Ist das Drucken aus dem Internet deaktiviert? Sind E-Mail-/Fax-Ziele eingeschränkt? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Multifunktionsgerät identifiziert wird. Dies kann durch die Zuweisung des ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Gerät könnte korrekt als MFD identifiziert werden, aber bereits gemäß der Richtlinie gehärtet und gesichert sein. "
    },
    "uncontrolled-mfd-storage-interfaces-con3": {
      "title": "Unkontrollierte Nutzung von MFD-Speicherschnittstellen (BSI CON.3)",
      "description": "Multifunktionsgeräte (MFDs) haben oft physische Schnittstellen wie USB- oder SD-Kartensteckplätze. ",
      "impact": "Die unkontrollierte Nutzung von MFD-Schnittstellen kann zu schweren Verletzungen der Vertraulichkeit (Diebstahl sensibler Dokumente) und der Integrität (Einschleusung von Malware) führen. ",
      "asvs": "BSI IT-Grundschutz CON.3 Peripheriegeräte. Adressiert Bedrohungen wie G 0.22 (Missbrauch von Geräten), G 0.29 (Mithören) und G 0.40 (Einschleusung von Malware).",
      "action": "Physische und logische Kontrollen für MFD-/Peripherieschnittstellen implementieren",
      "mitigation": "Deaktivieren Sie physisch oder logisch alle ungenutzten Ports (USB, SD-Kartensteckplätze) an MFDs und ähnlichen Peripheriegeräten. ",
      "check": "Sind ungenutzte physische Ports an MFDs deaktiviert? Ist eine Benutzerauthentifizierung zur Nutzung von Speicherschnittstellen erforderlich? Befinden sich MFDs in einem dedizierten, eingeschränkten Netzwerksegment? Wird die Firmware regelmäßig aktualisiert?",
      "detectionLogic": "Identifiziert vernetzte IoT-Geräte, die in einem Modell oft Multifunktionsgeräte (MFDs) darstellen. Das Risiko besteht darin, dass ihre physischen Schnittstellen (wie USB/SD-Ports) zur Exfiltration von Daten (z. B. Scannen vertraulicher Dokumente auf ein USB-Laufwerk) oder zur Einschleusung von Malware in das verbundene Netzwerk verwendet werden können.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn das Gerät sich in einem physisch zugänglichen Bereich befindet und mit dem Netzwerk verbunden ist. Die Auswirkung wird durch die höchste Vertraulichkeit und Integrität der Daten bestimmt, die vom MFD selbst oder von IT-Systemen, mit denen es direkt verbunden ist, verarbeitet werden, da das MFD als unkontrollierte Brücke zum Netzwerk fungieren kann.",
      "falsePositives": "Die Regel kann jedes vernetzte IoT-Gerät markieren. Das tatsächliche Risiko hängt von der physischen Sicherheit und der Gerätekonfiguration ab, die möglicherweise nicht vollständig im Modell erfasst sind. Eine Überprüfung der physischen und logischen Kontrollen am Gerät ist erforderlich."
    },
    "uncontrolled-internet-access-for-peripherals": {
      "title": "Unkontrollierter Internetzugang für Peripherie- oder weniger sichere Geräte in einem gemeinsam genutzten Netzwerksegment",
      "description": "Peripheriegeräte (wie Drucker, Kopierer, IoT-Geräte) oder andere weniger sichere Systeme werden oft im selben Netzwerksegment wie kritischere Assets wie Clients und Server platziert. ",
      "impact": "Ein kompromittiertes Gerät mit Internetzugang kann als Einfallstor für Angriffe genutzt werden. Angreifer könnten es verwenden, um sensible Daten von anderen Systemen im selben Netzwerksegment zu exfiltrieren, was die Vertraulichkeit verletzt. ",
      "asvs": "Abgeleitet von BSI IT-Grundschutz Kompendium Bedrohungen im Zusammenhang mit Netzwerkdesign und Firewalls, wie in den Bausteinen NET.1.1 (Netzwerkarchitektur und -design) und NET.3.2 (Firewall). Das beschriebene Szenario ist ein klassisches Beispiel für unzureichende Netzwerksegmentierung.",
      "action": "Strikte Netzwerksegmentierung und Egress-Filterung implementieren",
      "mitigation": "Platzieren Sie alle Peripheriegeräte (Drucker, IoT-Geräte usw.) und andere nicht-kritische Systeme in einem separaten, isolierten Netzwerksegment (z. B. einem dedizierten VLAN). ",
      "check": "Befinden sich Peripheriegeräte wie Drucker und IoT-Geräte in einem anderen Netzwerksegment als Standard-Clients und -Server? ",
      "detectionLogic": "Diese Regel identifiziert periphere oder weniger sichere technische Assets (wie IoT-Geräte, Clients), die Internetzugang haben und sich in derselben Netzwerk-Vertrauensgrenze wie andere Assets befinden, die sensible Daten verarbeiten oder speichern. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein typischerweise unsicheres Gerät Internetzugang innerhalb eines gemischten Vertrauensnetzwerks hat. ",
      "falsePositives": "Das Modell erfasst möglicherweise keine Mikrosegmentierung oder hostbasierte Firewall-Regeln, die dieses Risiko in der Realität mindern könnten, auch wenn die Assets in derselben Netzwerkgrenze erscheinen. "
    },
    "insecure-@AssetType:Printer-credential-management": {
      "title": "Unsicheres Anmeldungs-Management für vernetzte Drucker/MFDs (BSI INF.4)",
      "description": "Vernetzte Drucker, Kopierer und Multifunktionsgeräte (MFDs) werden oft ohne Passwort oder mit einem Standardpasswort für ihre Verwaltungsschnittstellen (z. B. einen integrierten Webserver) geliefert. ",
      "impact": "Unbefugter Zugriff auf einen @AssetType:Printer",
      "asvs": "BSI IT-Grundschutz INF.4.A5 (Absicherung der Administrationsoberfläche)",
      "action": "Starke und einzigartige Anmeldeinformationen für alle Geräte erzwingen",
      "mitigation": "Stellen Sie sicher, dass jeder vernetzte @AssetType:Printer und MFD ein starkes, einzigartiges Administratorpasswort hat. Ändern Sie Standardpasswörter sofort nach der Bereitstellung. ",
      "check": "Gibt es Kommunikationsverbindungen für den administrativen Zugriff auf @AssetType:Printer/MFD-Assets, bei denen die Authentifizierung auf ",
      "detectionLogic": "Diese Regel prüft technische Assets, die als Drucker gekennzeichnet sind. Anschließend werden alle eingehenden Kommunikationsverbindungen überprüft. ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit der vom @AssetType:Printer verarbeiteten oder gespeicherten Daten bestimmt. Ein Mangel an Authentifizierung stellt ein ",
      "falsePositives": "Das Modell unterscheidet möglicherweise nicht zwischen einem Druckauftrags-Übermittlungsprotokoll (das möglicherweise keine Authentifizierung erfordert) und einem Verwaltungsprotokoll. Das Risiko sollte validiert werden, um sicherzustellen, dass der nicht authentifizierte Link tatsächlich für administrative Zwecke bestimmt ist."
    },
    "neglected-security-in-embedded-development": {
      "title": "Vernachlässigte Sicherheit in der Entwicklung von Embedded Systems",
      "description": "Aus Kostengründen spielt die Informationssicherheit bei der Entwicklung von Embedded Systems oft eine geringere Rolle als beispielsweise Leistung oder Zuverlässigkeit. ",
      "impact": "Wenn Sicherheitsanforderungen während der Entwicklung vernachlässigt werden, können die resultierenden Schwachstellen in Embedded Systems von Angreifern ausgenutzt werden, um die Gerätefunktionalität zu manipulieren, ",
      "asvs": "V1: Architektur-, Design- und Bedrohungsmodellierungsanforderungen",
      "action": "Sicherheit in den Entwicklungslebenszyklus für Embedded Systems integrieren",
      "mitigation": "Ein sicherer Entwicklungslebenszyklus (SDL) muss für alle kundenspezifisch entwickelten eingebetteten Komponenten implementiert und durchgesetzt werden. Dies beinhaltet die Durchführung von Bedrohungsmodellierungen in der frühen Designphase, ",
      "check": "Gibt es einen formalen, durchgesetzten sicheren Entwicklungslebenszyklus für eingebettete Komponenten? Werden Bedrohungsmodelle erstellt und gepflegt? Sind Sicherheitstests, einschließlich Penetrationstests, Teil des Release-Zyklus?",
      "detectionLogic": "Diese Regel prüft auf kundenspezifisch entwickelte technische Assets, die eingebettete Systeme darstellen (z. B. eingebettete Geräte, Bibliotheken), die Teil des Modells sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit von Schwachstellen wird für kundenspezifisch entwickelte eingebettete Komponenten aufgrund von Marktdruck (Time-to-Market, Kosten), der oft Sicherheitsbedenken überwiegt, als hoch angesehen. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn ein robuster sicherer Entwicklungslebenszyklus für die Komponente befolgt wird, aber das entsprechende Tag `Mitigation:SecureSDLC:Embedded` nicht auf das Asset im Modell angewendet wurde."
    },
    "unprotected-embedded-system-interfaces": {
      "title": "Ungeschützte Schnittstellen an Embedded Systems (BSI SYS.4.3)",
      "description": "Die Schnittstellen von Embedded Systems sind potenzielle Angriffsvektoren. Dies gilt für Schnittstellen auf allen Schichten des OSI-Modells und über alle Übertragungsmedien hinweg. ",
      "impact": "Eine erfolgreiche Ausnutzung ungeschützter Schnittstellen kann zu unbefugtem Eindringen in das System, zur Manipulation sicherheitskritischer Prozesse, zum Diebstahl sensibler Daten und zu Systemausfällen (Denial-of-Service) führen. ",
      "asvs": "BSI IT-Grundschutz, SYS.4.3: Eingebettete Systeme",
      "action": "Zugriff auf Schnittstellen von Embedded Systems sichern und kontrollieren",
      "mitigation": "Implementieren Sie robuste physische Sicherheitsmaßnahmen für das Gerät (z. B. verschlossene Gehäuse, manipulationssichere Siegel), um unbefugten physischen Zugriff zu verhindern. ",
      "check": "Sind Embedded Systems physisch gegen Manipulation gesichert? Sind alle Netzwerkschnittstellen und APIs mit starker Authentifizierung geschützt? Sind alle Kommunikationskanäle verschlüsselt? ",
      "detectionLogic": "Diese Regel löst bei allen technischen Assets des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist deutlich erhöht, wenn das Gerät für potenzielle Angreifer physisch zugänglich ist oder nicht vertrauenswürdigen Netzwerken (wie dem Internet) ausgesetzt ist. ",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn robuste physische Sicherheitsmaßnahmen oder kompensierende Netzwerkkontrollen (wie eine separate Firewall) vorhanden sind, aber nicht explizit modelliert wurden."
    },
    "physical-access-to-embedded-systems": {
      "title": "Physischer Zugriff auf Embedded Systems (OT-Geräte)",
      "description": "Wenn Embedded Systems (wie OT-Geräte) physisch zugänglich sind, können Angreifer deren elektronische Komponenten (z. B. IC-Pins, Ports) zerstören, beschädigen oder darauf zugreifen. ",
      "impact": "Erfolgreiche physische Angriffe können zu einer vollständigen Kompromittierung der Vertraulichkeit, Integrität und Verfügbarkeit von Informationen führen, die auf dem Embedded System gespeichert und verarbeitet werden. ",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1.A5: Schutz vor unbefugtem physischem Zugriff",
      "action": "Physische Schutzmaßnahmen für Embedded Systems implementieren",
      "mitigation": "Sichern Sie Embedded Systems physisch entsprechend ihrer Einsatzumgebung. Verwenden Sie manipulationssichere oder manipulationserkennbare Gehäuse. ",
      "check": "Befindet sich das Gerät in einer physisch sicheren Umgebung? Hat es ein manipulationssicheres/erkennbares Gehäuse? Sind ungenutzte physische Debug-Ports in der Produktions-Firmware deaktiviert? Sind Daten im Ruhezustand verschlüsselt? Verwendet das Gerät einen sicheren Startvorgang?",
      "detectionLogic": "Diese Regel löst bei technischen Assets des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Gerät könnte sich an einem physisch sicheren Ort befinden (z. B. einem verschlossenen Schrank in einem öffentlichen Bereich), der nicht als spezifische Vertrauensgrenze modelliert ist. Das Risiko muss auf der Grundlage des tatsächlichen physischen Einsatzkontexts bewertet werden, der möglicherweise nicht vollständig im Modell erfasst ist."
    },
    "environmental-failure-of-embedded-systems": {
      "title": "Umwelteinflüsse, die zu Ausfällen in Embedded Systems führen",
      "description": "Umweltfaktoren wie elektromagnetische Störungen, Temperaturschwankungen, instabile Stromversorgung, Staub, Sand oder Schmutz können zum Ausfall von Embedded Systems (wie IoT-Geräten) führen. ",
      "impact": "Ein Ausfall eines Embedded Systems beeinträchtigt hauptsächlich seine Verfügbarkeit. Wenn das Gerät physische Prozesse steuert oder überwacht oder Daten für andere kritische Systeme bereitstellt, ",
      "asvs": "Dieses Risiko bezieht sich auf den physischen und umgebungsbedingten Schutz, der in Standards wie IEC 60529 (IP-Code) behandelt wird und ein grundlegender Aspekt der physischen Sicherheit in Frameworks wie ISO 27001 (Anhang A.11) oder dem BSI IT-Grundschutz (INF-Module) ist. Es fällt außerhalb des Geltungsbereichs des OWASP Application Security Verification Standard (ASVS), der sich auf Software konzentriert.",
      "action": "Physischen und umgebungsbedingten Schutz für Embedded Systems implementieren",
      "mitigation": "Stellen Sie sicher, dass Embedded Systems, insbesondere IoT-Geräte, für ihre Einsatzumgebung geeignet sind. Verwenden Sie Hardware mit einer angemessenen IP-Schutzart zum Schutz gegen Staub und Feuchtigkeit. ",
      "check": "Werden Embedded Systems und IoT-Geräte in Umgebungen eingesetzt, für die sie zertifiziert sind (z. B. Temperaturbereich, IP-Schutzart)? ",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets des Typs ",
      "riskAssessment": "Die Ausfallwahrscheinlichkeit wird in rauen oder unkontrollierten Umgebungen als höher angesehen. Die Auswirkung wird durch die Verfügbarkeitsanforderung (Kritikalität) des Geräts selbst und, was noch wichtiger ist, aller anderen Assets bestimmt, die mit ihm kommunizieren und von seiner Funktion abhängen. Das Fehlen von Redundanz erhöht die Auswirkung eines einzelnen Geräteausfalls erheblich.",
      "falsePositives": "Dieses Risiko könnte für ein IoT-Gerät, das in einer physisch sicheren, klimatisierten Umgebung (z. B. einem Serverraum) eingesetzt wird, zu hoch bewertet sein. In solchen Fällen sollte das Asset mit `@environment:controlled` getaggt werden, um dieses Risiko zu unterdrücken."
    },
    "manipulated-firmware-update-on-embedded-systems": {
      "title": "Manipuliertes Firmware-Update auf Embedded Systems",
      "description": "Viele Embedded Systems speichern ihre Software auf persistentem Speicher (wie Flash oder EEPROMs) und bieten einen Mechanismus zum Aktualisieren dieser Firmware, entweder über eine physische Datenschnittstelle oder eine Netzwerkverbindung. Angreifer können diesen Mechanismus missbrauchen, um manipulierte Software-Updates zu installieren und dadurch das System zu verändern",
      "impact": "Wenn ein Angreifer erfolgreich bösartige Firmware installiert, kann er die volle Kontrolle über das Embedded System erlangen. Dies kann zu einem schweren Verlust der Integrität (Manipulation des Systemverhaltens und der Daten) und der Verfügbarkeit (Störung oder Deaktivierung von Systemfunktionen) führen. Dies könnte Geschäftsprozesse kompromittieren, weitere Angriffe erleichtern und physische oder betriebliche Schäden verursachen.",
      "asvs": "V14.2.5: Überprüfen Sie die Integrität von Anwendungskomponenten, einschließlich Frameworks, Bibliotheken und Abhängigkeiten, während der Entwicklung und vor der Bereitstellung oder Verwendung.",
      "action": "Implementieren Sie einen sicheren Firmware-Update-Mechanismus",
      "mitigation": "Der Firmware-/Software-Update-Prozess muss gesichert werden. Alle Firmware-Updates sollten digital signiert sein, und das Embedded System muss diese Signatur vor der Anwendung des Updates überprüfen. Der Zugriff auf die Update-Schnittstelle (sowohl physisch als auch netzwerkbasiert) sollte streng kontrolliert und authentifiziert werden. Die Verwendung eines sicheren Startvorgangs hilft, eine Hardware-Vertrauensbasis zu schaffen, die sicherstellt, dass nur vertrauenswürdiger Code ab der initialen Startsequenz ausgeführt wird.",
      "check": "Ist die gesamte Firmware/Software für das Embedded System kryptographisch signiert? Überprüft das Gerät die Signatur vor der Installation? Ist der Zugriff auf den Update-Mechanismus (z. B. Netzwerk-Port, JTAG/serielle Schnittstelle) authentifiziert und zugriffsgesteuert? Ist ein sicherer Startmechanismus vorhanden?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Embedded Systems (z. B. IoT-Geräte) darstellen und eine aktualisierbare Firmware haben könnten. Das Risiko wird gemindert, wenn das Asset mit `@Mitigation:firmware-update-secured` getaggt ist. Die Wahrscheinlichkeit wird für Geräte als höher angesehen, die dem Internet ausgesetzt sind oder netzwerkbasierte Kommunikationsverbindungen haben, da diese Fernangriffsvektoren darstellen.",
      "riskAssessment": "Die Auswirkung der Ausnutzung wird durch die Integritäts- und Verfügbarkeitsanforderungen des Embedded Systems bestimmt. Ein System, das kritische physische Prozesse steuert, hat eine sehr hohe Auswirkung. Die Wahrscheinlichkeit ist bei fernzugänglichen Systemen (über Netzwerk) höher als bei solchen, die für Updates physischen Zugriff erfordern. Ohne signierte Firmware ist ein erfolgreicher Angriff deutlich wahrscheinlicher.",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn das Embedded System überhaupt keinen Feld-Update-Mechanismus hat oder wenn der Update-Mechanismus bereits durch Maßnahmen gesichert ist, die im Modell nicht erfasst sind (z. B. eine physisch separate, luftdicht abgeschottete Update-Umgebung)."
    },
    "insecure-embedded-systems": {
      "title": "Unsichere Kommunikation in Embedded Systems (basierend auf BSI SYS.4.3)",
      "description": "Embedded Systems sind oft in ihren Ressourcen (Strom, Kosten, Größe) eingeschränkt, was zu unzureichenden Sicherheitsmerkmalen wie starker Kryptographie führen kann. Wenn diese Geräte über Standardprotokolle vernetzt werden, werden sie anfällig für Angriffe. Dieses Risiko deckt den Missbrauch unsicherer Kommunikationsschnittstellen (z. B. unverschlüsselte Protokolle, fehlende Authentifizierung) ab, um Daten oder Software zu manipulieren, Verbindungen zu kapern oder in das System einzudringen.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu Daten- und Softwaremanipulation, dem Spoofing von Nachrichten und unbefugtem Systemzugriff führen. Dies kompromittiert die Vertraulichkeit, Integrität und Verfügbarkeit des Embedded Systems und der von ihm verarbeiteten Daten und ermöglicht potenziell Angriffe auf die vernetzte Infrastruktur in größerem Maßstab.",
      "asvs": "Basierend auf dem BSI IT-Grundschutz Baustein SYS.4.3 (Eingebettete Systeme)",
      "action": "Alle Kommunikationsschnittstellen sichern",
      "mitigation": "Verwenden Sie verschlüsselte Kommunikationsprotokolle (z. B. HTTPS, WSS, MQTTS, FTPS) für alle Netzwerkverbindungen. Erzwingen Sie starke, nicht standardmäßige Authentifizierungsmechanismen für alle Verbindungen. Wo möglich, verwenden Sie Netzwerksegmentierung, IP-Filterung oder VPNs, um den Kommunikationskanal zu schützen. Deaktivieren Sie ungenutzte physische Ports (wie USB) und härten Sie die verwendeten.",
      "check": "Verwenden alle Kommunikationsverbindungen von Embedded-Geräten verschlüsselte Protokolle? Wird die Authentifizierung bei allen Verbindungen erzwungen? Sind sensible Datenbestände bei der Übertragung geschützt? Sind physische Ports gesichert?",
      "detectionLogic": "Sucht nach technischen Assets, die Embedded-Geräte darstellen. Es prüft dann alle ausgehenden Kommunikationsverbindungen von diesen Geräten. Ein Risiko wird gemeldet, wenn eine Kommunikationsverbindung ein unverschlüsseltes Protokoll verwendet oder keine Authentifizierung hat, insbesondere bei der Übertragung sensibler Daten oder der Verbindung über Vertrauensgrenzen zum Internet.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn sowohl Verschlüsselung als auch Authentifizierung bei einer Netzwerkverbindung fehlen. Die Auswirkung wird durch die Sensibilität (CIA) der übertragenen Daten und die Kritikalität der Quell- und Ziel-Assets bestimmt. Auswirkung und Wahrscheinlichkeit steigen, wenn die Verbindung eine Vertrauensgrenze überschreitet, insbesondere in Richtung Internet.",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn die unverschlüsselte Kommunikation ausschließlich in einem physisch gesicherten und isolierten Netzwerksegment stattfindet, in dem ein Abfangen nicht als glaubwürdige Bedrohung angesehen wird."
    },
    "counterfeit-hardware-components": {
      "title": "Gefälschte oder manipulierte Hardwarekomponenten (BSI G 0.46)",
      "description": "Gefälschte oder manipulierte Komponenten können während der Produktion oder Wartung in Embedded Systems oder anderer physischer Hardware installiert werden. Dies kann unbeabsichtigt aufgrund der Verbreitung von Fälschungen geschehen oder absichtlich durch einen Angreifer. ",
      "impact": "Die Verwendung von gefälschter oder manipulierter Hardware kompromittiert das System",
      "asvs": "BSI IT-Grundschutz Gefährdung G 0.46 Sabotage von Hardware, Software oder Daten. Siehe auch: NIST SP 800-161 (Supply Chain Risk Management for Federal Information Systems and Organizations).",
      "action": "Prozesse zur Überprüfung von Hardware und Lieferkette implementieren",
      "mitigation": "Beziehen Sie alle Hardwarekomponenten von vertrauenswürdigen, geprüften Lieferanten. Implementieren Sie einen Wareneingangsprozess zur Überprüfung der Echtheit von Komponenten (z. B. Überprüfung auf physische Anzeichen von Manipulation, Einsatz von Hardware-Scannern). ",
      "check": "Gibt es einen formalen Prozess zur Überprüfung von Hardwarelieferanten? Werden Komponenten bei Erhalt physisch und/oder elektronisch überprüft? Wird der Zugriff auf Hardwarekomponenten während der Lagerung, Montage und Wartung kontrolliert? Werden manipulationssichere Siegel verwendet?",
      "detectionLogic": "Dieses Risiko wird für physische Assets ausgelöst, insbesondere für Betriebstechnologie (OT)-Geräte, die häufige Ziele für Angriffe auf Komponentenebene sind. Das Risiko wird für Assets, die explizit als sensibel für Lieferkettenprobleme gekennzeichnet sind, als höher eingestuft.",
      "riskAssessment": "Die Wahrscheinlichkeit erhöht sich für Assets, die physisch zugänglich sind oder Teil einer komplexen, weniger kontrollierten Lieferkette sind (zum Beispiel viele OT-Geräte). Die Auswirkung steht in direktem Zusammenhang mit den Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des Assets selbst und der von ihm verarbeiteten oder gespeicherten Daten. Die Kompromittierung eines geschäftskritischen Assets kann eine sehr hohe Auswirkung haben.",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn die Organisation über starke, bewährte Kontrollen der Lieferkette und der physischen Sicherheit verfügt, die im Modell nicht erfasst sind. Die Überprüfung erfordert eine Prüfung der Beschaffungs- und Hardwarehandhabungsverfahren."
    },
    "unprotected-smb-communication": {
      "title": "Ungeschützte SMB-Kommunikation (BSI APP.3.4.A15 – SMB-Verkehr verschlüsseln)",
      "description": "Unverschlüsselte oder schwach geschützte Samba/SMB-Kommunikation kann abgehört werden, was das Abfangen von Anmeldeinformationen und sensiblen Dateien ermöglicht. ",
      "impact": "Klartext-SMB-Verkehr kann Anmeldeinformationen und vertrauliche Daten preisgeben (Vertraulichkeit) und laterale Bewegungen ermöglichen. ",
      "asvs": "OWASP ASVS 4.0 – V9: Kommunikationssicherheit (z. B. überprüfen, ob vertrauliche Daten während der Übertragung verschlüsselt sind).",
      "action": "SMB3-Verschlüsselung erzwingen und SMBv1 deaktivieren",
      "mitigation": "Erfordern Sie SMB 3.0+ mit durchgängig aktivierter Verschlüsselung (bevorzugen Sie AES-GCM, wo verfügbar). ",
      "check": "Suchen Sie alle Kommunikationsverbindungen, die mit dem Protokoll ",
      "detectionLogic": "Löst bei jeder Kommunikationsverbindung aus, die das unverschlüsselte ",
      "riskAssessment": "Die Wahrscheinlichkeit erhöht sich auf ",
      "falsePositives": "Der Verkehr kann sich in einem physisch isolierten Netzwerksegment befinden, oder die Verschlüsselung kann auf einer niedrigeren Schicht (z. B. IPsec/VPN) bereitgestellt werden, die nicht auf der Verbindung modelliert ist. "
    },
    "insecure-samba-default-configuration": {
      "title": "Unsichere Standardkonfiguration des Samba-Servers",
      "description": "Um einen schnellen Start zu ermöglichen, generieren Samba-Server-Installationen oft eine Standard-",
      "impact": "Wenn aufgrund einer nicht überprüften Standardkonfiguration unerwünschte Dateifreigaben aktiv sind, können auf dem Server gespeicherte sensible Daten offengelegt werden, was die Vertraulichkeit verletzt. ",
      "asvs": "V14.2.1: Konfiguration",
      "action": "Samba-Server-Konfiguration härten",
      "mitigation": "Verwenden Sie niemals die Standard-",
      "check": "Ist der Samba-Server",
      "detectionLogic": "Dieses Risiko wird für jeden ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Modell kann einen Dateiserver, der SMB verwendet, korrekt identifizieren, aber seine Live-Konfiguration nicht überprüfen. "
    },
    "outdated-admin-tools": {
      "title": "Verwendung veralteter Administrationswerkzeuge (BSI-basiert)",
      "description": "Unbefugte Personen können sich durch die Verwendung von Anwendungen oder IT-Systemen Zugang zu vertraulichen Informationen verschaffen, diese manipulieren oder Störungen verursachen. ",
      "impact": "Eine erfolgreiche Ausnutzung kann zu unbefugter administrativer Kontrolle über das verwaltete System (z. B. einen Dateiserver) führen, was eine Privilegienerweiterung zur Folge hat. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Software- und Systemlebenszyklus), insbesondere Anforderung CON.1.A15 (Patch- und Änderungsmanagement), die den Umgang mit Komponenten und deren Lebenszyklus abdeckt.",
      "action": "Veraltete Komponenten ausmustern und ersetzen",
      "mitigation": "Führen Sie regelmäßig eine Bestandsaufnahme aller administrativen Werkzeuge und Softwarekomponenten durch. Identifizieren Sie alle Werkzeuge, die vom Hersteller nicht mehr unterstützt oder aktualisiert werden (End-of-Life). ",
      "check": "Gibt es ein Inventar der administrativen Software? Werden Komponenten auf ihren Support-Lebenszyklusstatus überprüft? Gibt es bekannte veraltete Werkzeuge wie Samba",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit als `outdated-admin-tool` oder als ein spezifisches, bekanntermaßen anfälliges Werkzeug wie `samba-swat-tool` gekennzeichnet ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung für ein öffentlich bekanntes, veraltetes Werkzeug wird als SEHR WAHRSCHEINLICH angesehen. ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn das Werkzeug, obwohl es als veraltet gekennzeichnet ist, stark durch eine Firewall geschützt, nur von einem sicheren Verwaltungsnetzwerk aus zugänglich ist und andere kompensierende Kontrollen vorhanden sind. "
    },
    "samba-misconfiguration-due-to-insufficient-knowledge": {
      "title": "Samba-Fehlkonfiguration aufgrund unzureichender Kenntnisse des Administrators",
      "description": "Wenn Administratoren mit den umfangreichen Komponenten, Funktionen, Optionen und Konfigurationseinstellungen von Samba nicht ausreichend vertraut sind, ",
      "impact": "Eine Fehlkonfiguration eines Dateiservers wie Samba kann die Vertraulichkeit, Integrität und Verfügbarkeit der von ihm gespeicherten und bereitgestellten Daten direkt gefährden. ",
      "asvs": "BSI IT-Grundschutz SYS.1.2.2 Linux- und Unix-Server; ORP.1 Informationssicherheitsorganisation",
      "action": "Sicherstellen, dass Samba-Administratoren eine spezielle Schulung erhalten",
      "mitigation": "Administratoren, die für Samba-Server verantwortlich sind, müssen angemessen in dessen Konfiguration, Sicherheitsfunktionen und potenziellen Fallstricken geschult werden. ",
      "check": "Sind Samba-Administratoren formell geschult oder können sie gleichwertige Fachkenntnisse nachweisen? Werden Konfigurationsänderungen überprüft und protokolliert? Werden Samba-Konfigurationen regelmäßig anhand einer sicheren Baseline auditiert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Dateiserver identifiziert werden, entweder durch ihren Technologietyp (`file-server`) oder weil sie das Ziel von SMB/CIFS-Kommunikationsprotokollen sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko basiert auf der allgemeinen Komplexität der Technologie und bewertet nicht das spezifische Qualifikationsniveau der Organisation"
    },
    "data-loss-on-incompatible-filesystems-bsi": {
      "title": "Datenverlust oder -beschädigung durch inkompatible Dateisystemsemantik",
      "description": "Wenn Dateien zwischen verschiedenen Betriebssystemen (z. B. Windows und Unix/Linux) über Dienste wie Samba geteilt werden, können Unterschiede in den Dateisystemfähigkeiten zu Datenverlust oder -beschädigung führen. ",
      "impact": "Wenn geschäftsrelevante Informationen zerstört oder verändert werden, können Geschäftsprozesse und Aufgaben verzögert werden oder ganz scheitern. ",
      "asvs": "Abgeleitet aus den Prinzipien des BSI IT-Grundschutzes, insbesondere in Bezug auf die Systeminteroperabilität, wie sie in Modulen wie SYS.1.3 (Windows Server) und SYS.2.1 (Linux- und Unix-Server) zu sehen ist. Es gibt keine einzelne direkte Kontrolle, aber das Risiko ergibt sich aus ihrer Interaktion.",
      "action": "Dateisystemkompatibilität und Erhaltung der Datenintegrität sicherstellen",
      "mitigation": "Stellen Sie bei der Nutzung von Dateifreigabediensten über verschiedene Plattformen hinweg sicher, dass der Dienst so konfiguriert ist, dass Dateimetadaten und Berechtigungen so weit wie möglich erhalten bleiben (z. B. mit Samba",
      "check": "Wird ein Dateiserver verwendet, um Dateien zwischen Clients verschiedener Betriebssysteme (z. B. Windows und Linux) auszutauschen? Sind Anwendungen, die die Freigabe nutzen, von plattformspezifischen Dateiattributen (wie ADS oder erweiterten POSIX-ACLs) abhängig? Wie ist der Dateifreigabedienst (z. B. Samba) konfiguriert, um mit Metadaten- und Berechtigungsin-Kompatibilitäten umzugehen?",
      "detectionLogic": "Löst bei technischen Assets mit ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn der Dateiserver ausschließlich von Clients derselben Betriebssystemfamilie genutzt wird, der Server explizit für den Umgang mit Metadaten-Inkompatibilitäten konfiguriert ist (z. B. über Samba VFS-Module) oder die gespeicherten Daten und zugehörigen Anwendungen keine plattformspezifischen Dateisystemfunktionen verwenden."
    },
    "samba-tdb-inconsistency": {
      "title": "Samba TDB-Inkonsistenz auf einem unzuverlässigen Dateisystem",
      "description": "Samba speichert kritische Betriebsdaten – wie Benutzerzuordnungen, Freigabedefinitionen und Sitzungsinformationen – in Trivial Database (TDB)-Dateien. Wenn das zugrunde liegende Betriebssystem oder Dateisystem diese Datenbankdateien nicht mit ausreichender Leistung und Konsistenz handhabt (z. B. wenn sie auf Netzwerkfreigaben wie NFS/SMB ohne ordnungsgemäße Sperrgarantien platziert werden), können die TDBs beschädigt werden. Dies kann zu Instabilität oder einem vollständigen Ausfall der Samba-Dienste führen.",
      "impact": "Beschädigung von Samba",
      "asvs": "N/A - Dies ist ein spezifisches Infrastruktur- und Konfigurationsrisiko, das nicht direkt vom OWASP ASVS abgedeckt wird.",
      "action": "Sicherstellen, dass Samba-TDBs auf einem zuverlässigen, lokalen Dateisystem gespeichert werden",
      "mitigation": "Speichern Sie Samba",
      "check": "Überprüfen Sie die Samba-Konfiguration (smb.conf), um den Speicherort der Datenbankverzeichnisse zu identifizieren (z. B. ",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein technisches Asset, das ein ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Das Modell könnte die Speichertopologie falsch darstellen. Der identifizierte Netzwerkspeicher könnte ausschließlich für Benutzerdatenfreigaben verwendet werden, während sich die TDBs korrekt auf einer lokalen Festplatte befinden. Dieses Risiko erfordert eine manuelle Überprüfung des Samba-Servers"
    },
    "insecure-iot-components-sys-4-4": {
      "title": "Unsichere IoT-Komponenten (BSI SYS.4.4)",
      "description": "Bei der Entwicklung von IoT-Geräten werden Aspekte der Informationssicherheit oft nicht berücksichtigt oder erhalten eine niedrige Priorität. Dies hat wiederholt dazu geführt, dass IoT-Geräte missbraucht wurden, um Informationen über Benutzer oder deren Umgebung zu sammeln. Das BSI liefert Beispiele wie gekaperte Überwachungskameras und Babyfone aufgrund fehlender Authentifizierung oder Hintertüren in Raumsensoren, die eine unbefugte Datenexfiltration ermöglichen.",
      "impact": "Ein erfolgreicher Angriff kann zur Übernahme des IoT-Geräts führen",
      "asvs": "BSI IT-Grundschutz SYS.4.4 Allgemeines IoT-Gerät",
      "action": "Implementieren Sie ein sicheres IoT-Lebenszyklusmanagement",
      "mitigation": "Beschaffen Sie IoT-Geräte von seriösen Herstellern mit einer Erfolgsbilanz bei Sicherheitsupdates. Ändern Sie alle Standardanmeldeinformationen sofort nach der Bereitstellung. Segmentieren Sie das Netzwerk, um IoT-Geräte von kritischen Systemen zu isolieren (z. B. durch ein dediziertes VLAN oder eine Vertrauensgrenze). Deaktivieren Sie alle unnötigen Dienste und Ports. Implementieren Sie einen Prozess zur Überwachung und Anwendung von Firmware-Updates. Überwachen Sie den Netzwerkverkehr von IoT-Geräten auf verdächtige ausgehende Verbindungen.",
      "check": "Werden die Standardanmeldeinformationen auf allen IoT-Geräten geändert? Befinden sich IoT-Geräte in einem separaten, isolierten Netzwerksegment? Gibt es einen Prozess, um die Firmware auf dem neuesten Stand zu halten? Sind unnötige Funktionen und Dienste deaktiviert? Wird der Netzwerkverkehr von diesen Geräten überwacht?",
      "detectionLogic": "Löst bei allen im Geltungsbereich befindlichen technischen Assets des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Kann als False Positive betrachtet werden, wenn das spezifische Gerät einer gründlichen Sicherheitsbewertung unterzogen wurde, vollständig gehärtet ist und gemäß Best Practices verwaltet wird. Dies wäre typischerweise außerhalb des Modells dokumentiert und validiert."
    },
    "uncontrolled-i@SystemType:OT-internet-exposure": {
      "title": "Unkontrollierte Internet-Exposition von LAN-integrierten I@SystemType:OT-Geräten",
      "description": "I@SystemType:OT-Geräte, die in lokale Netzwerke (LANs) integriert sind, versuchen oft, selbstständig eine Verbindung zum Internet herzustellen. Sie können Protokolle wie UPnP (Universal Plug and Play) verwenden, um Router automatisch für die Portweiterleitung zu konfigurieren. Dadurch werden die I@SystemType:OT-Geräte, die möglicherweise ungepatchte Schwachstellen aufweisen, von außerhalb des vertrauenswürdigen LANs sichtbar und zugänglich. Ein Angreifer kann ein solches Gerät ausnutzen, um es zu kompromittieren, in ein Botnetz zu integrieren oder als Piv@SystemType:OT-Punkt zu verwenden, um Malware in das interne Netzwerk einzuschleusen, was zu weiteren bösartigen Aktivitäten führt.",
      "impact": "Wenn ein extern exponiertes I@SystemType:OT-Gerät kompromittiert wird, kann es als Einfallstor in ein ansonsten geschütztes internes Netzwerk dienen. Dies könnte zu einer weit verbreiteten Malware-Infektion, Datenpannen sensibler interner Systeme und der Störung kritischer Geschäftsprozesse führen. Das kompromittierte Gerät selbst kann für bösartige Zwecke wie die Teilnahme an DDoS-Angriffen als Teil eines Botnetzes verwendet werden.",
      "asvs": "OWASP I@SystemType:OT Top 10: I5 - Mangelnde Netzwerkhärtung",
      "action": "I@SystemType:OT-Geräte segmentieren und Egress-Filterung implementieren",
      "mitigation": "Deaktivieren Sie UPnP auf allen Netzwerkinfrastrukturgeräten innerhalb des LAN. Segmentieren Sie I@SystemType:OT-Geräte in eine separate, isolierte Netzwerkzone (VLAN/Subnetz) mit strengen Firewall-Regeln. Implementieren Sie eine standardmäßige ablehnende Egress-Filterungsrichtlinie für das I@SystemType:OT-Netzwerksegment und erlauben Sie Verbindungen nur zu spezifischen, erforderlichen externen Endpunkten. Jeglicher Verkehr vom I@SystemType:OT-Segment zum internen Unternehmensnetzwerk sollte standardmäßig blockiert und nur im Einzelfall bei absoluter Notwendigkeit erlaubt werden, typischerweise über einen Proxy oder ein Gateway.",
      "check": "Werden I@SystemType:OT-Geräte im selben Netzwerksegment wie kritische interne Assets eingesetzt? Ist UPnP auf allen Routern und Firewalls deaktiviert? Gibt es strenge Egress-Firewall-Regeln für Netzwerksegmente mit I@SystemType:OT-Geräten? Wird der Verkehr zwischen dem I@SystemType:OT-Segment und internen Unternehmensnetzwerken überwacht und eingeschränkt?",
      "detectionLogic": "Diese Regel prüft auf technische Assets des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird aufgrund der oft schlechten Sicherheitslage von I@SystemType:OT-Geräten und standardmäßig aktivierten Funktionen wie UPnP als hoch angesehen. Die Auswirkung wird durch die Sensibilität anderer Assets bestimmt, die sich im selben Netzwerksegment wie das I@SystemType:OT-Gerät befinden. Wenn das I@SystemType:OT-Gerät ein Netzwerk mit Assets teilt, die hochvertrauliche oder kritische Daten verarbeiten oder speichern, könnte eine Kompromittierung eine sehr hohe Auswirkung haben.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die modellierte Verbindung zum Internet beabsichtigt und durch eine dedizierte, ordnungsgemäß konfigurierte Firewall mit strengen Egress-Regeln gesichert ist, die n@SystemType:OT explizit modelliert ist. Das Modell zeigt möglicherweise nur eine logische Verbindung an, ohne die vorhandenen Netzwerkkontrollen zu erfassen."
    },
    "careless-handling-of-removable-media": {
      "title": "Unachtsamer Umgang mit Wechselmedien",
      "description": "In vielen Organisationen existieren organisatorische Vorschriften und technische Sicherheitsverfahren für Wechselmedien, ",
      "impact": "Wenn Wechselmedien mit sensiblen oder kritischen Daten verloren gehen, kann dies zu einer erheblichen Verletzung der Vertraulichkeit führen, insbesondere wenn die Daten unverschlüsselt sind. ",
      "asvs": "BSI IT-Grundschutz CON.3 Wechselmedien",
      "action": "Sichere Handhabungs- und Verschlüsselungsrichtlinien für Wechselmedien durchsetzen",
      "mitigation": "Eine umfassende Richtlinie für die Verwendung von Wechselmedien muss erstellt und durchgesetzt werden. Alle Wechselmedien, die zur Speicherung sensibler Unternehmensdaten verwendet werden, müssen verschlüsselt sein (z. B. durch vollständige Datenträgerverschlüsselung). ",
      "check": "Gibt es eine Richtlinie für die sichere Verwendung von Wechselmedien? Ist eine starke Verschlüsselung für alle Wechselmedien mit sensiblen Daten obligatorisch? Sind die Benutzer über die Risiken informiert und in sicheren Handhabungsverfahren geschult?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Wechselmedium identifiziert wird (über das ",
      "riskAssessment": "Die Wahrscheinlichkeit eines unachtsamen Umgangs mit physischen Medien ist von Natur aus hoch. Die Auswirkung hängt direkt von der Sensibilität (CIA-Bewertung) der auf dem Medium gespeicherten Daten und davon ab, ob eine effektive Verschlüsselung verwendet wird. ",
      "falsePositives": "Das Modell erfasst möglicherweise n@SystemType:OT spezifische kompensierende Kontrollen, wie eine streng durchgesetzte Unternehmensrichtlinie, die nur vom Unternehmen ausgegebene, vorverschlüsselte USB-Laufwerke zulässt. "
    },
    "insecure-handling-of-removable-media": {
      "title": "Unsicherer Umgang mit Wechselmedien (BSI CON.3)",
      "description": "Wenn die Vorschriften für den korrekten Umgang mit Wechselmedien (z. B. USB-Sticks, externe Festplatten) nicht ausreichend bekannt sind oder befolgt werden, können sie nicht eingehalten werden. ",
      "impact": "Ein durch bösartige Wechselmedien kompromittiertes System kann zu einem Verlust der Vertraulichkeit, Integrität und Verfügbarkeit für das System und die von ihm verarbeiteten Daten führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.3 (Wechseldatenträger).",
      "action": "Eine strenge Richtlinie für die Nutzung von Wechselmedien etablieren und durchsetzen",
      "mitigation": "Definieren und erzwingen Sie eine klare Richtlinie für die Verwendung von Wechselmedien. Diese Richtlinie sollte Maßnahmen wie das Deaktivieren von Autorun-Funktionen, das Scannen aller Medien auf Malware vor der Verwendung, die Beschränkung der Verwendung von Wechselmedien auf autorisiertes Personal und Geräte sowie die Verschlüsselung sensibler Daten, die darauf gespeichert sind, umfassen. ",
      "check": "Gibt es eine formale Richtlinie für Wechselmedien? Werden die Benutzer in dieser Richtlinie geschult? Sind technische Kontrollen zur Durchsetzung der Richtlinie vorhanden (z. B. Port-Sperrung, obligatorisches Scannen)? Sind physische Ports an Servern in Rechenzentren gesichert?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset generiert, das als physische Maschine (`machine: physical`) ausgewiesen ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als `Wahrscheinlich` angesehen, da sie vom Benutzerverhalten abhängt, das ohne starke technische und organisatorische Kontrollen unvorhersehbar sein kann. ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn alle physischen Ports am Asset nachweislich durch technische Kontrollen (z. B. GPO, MDM) deaktiviert oder physisch gesichert und unzugänglich sind. "
    },
    "data-loss-on-removable-media": {
      "title": "Datenverlust auf unverschlüsselten Wechsel- oder tragbaren Medien (BSI SYS.4.5)",
      "description": "Das Risiko eines Datenverlusts durch Diebstahl oder physischen Verlust ist bei Wechselmedien (wie USB-Laufwerken, externen Festplatten, optischen Medien oder Speicherkarten) deutlich höher als bei stationären IT-Systemen. Wenn solche Medien verloren gehen oder gestohlen werden und der Speicher nicht verschlüsselt ist, können die Informationen unwiederbringlich verloren gehen (Auswirkung auf die Verfügbarkeit) und unbefugten Dritten zugänglich gemacht werden (Auswirkung auf die Vertraulichkeit).",
      "impact": "Dies kann zu einer schwerwiegenden Verletzung der Vertraulichkeit führen, wenn sensible Daten offengelegt werden, und zu einem Verlust der Verfügbarkeit, wenn die Daten nicht an anderer Stelle gesichert sind. Dies kann zu finanziellen Verlusten, Reputationsschäden und der Nichteinhaltung von Datenschutzbestimmungen wie @DataType:PII führen.",
      "asvs": "BSI IT-Grundschutz SYS.4.5 Wechseldatenträger, insbesondere SYS.4.5.A10 (Datenträgerverschlüsselung) und SYS.4.5.A12 (Schutz vor Schadsoftware).",
      "action": "Vollständige Festplatten- und Wechselmedienverschlüsselung erzwingen",
      "mitigation": "Alle im Ruhezustand auf Wechselmedien (USB-Laufwerke, externe Festplatten, Speicherkarten, optische Medien) gespeicherten Daten müssen mit starken, branchenüblichen Algorithmen verschlüsselt werden (z. B. über BitLocker, FileVault, LUKS). Implementieren Sie Richtlinien, die die Verschlüsselung für alle solchen Medien erzwingen. Führen Sie außerdem regelmäßige Backups kritischer Daten durch, um Verfügbarkeitsrisiken durch Geräteverlust zu mindern.",
      "check": "Sind alle technischen Assets, die tragbare Systeme oder Wechselmedien darstellen, mit einem anderen Verschlüsselungsstil als `none` konfiguriert? Gibt es eine Richtlinie, die die Verschlüsselung von Daten im Ruhezustand auf diesen Arten von Assets erzwingt?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das von Natur aus tragbar ist (z. B. `technology: client-system` oder `desktop`) oder Wechselmedien darstellt (z. B. `type: datastore` mit `technology: local-file-system` oder `block-storage`). Das Risiko wird ausgelöst, wenn das Asset Daten speichert (`data_assets_stored` ist nicht leer), aber seine `encryption`-Eigenschaft auf `none` gesetzt ist.",
      "riskAssessment": "Die Wahrscheinlichkeit eines physischen Verlusts oder Diebstahls von Wechselmedien wird als ",
      "falsePositives": "Das Risiko kann als False Positive betrachtet werden, wenn das Asset, obwohl es entfernbar oder tragbar ist, ausschließlich in einer hochsicheren physischen Umgebung verwendet wird (z. B. Medien, die niemals ein sicheres Rechenzentrum verlassen) und dies streng durchgesetzt wird. Solche Ausnahmen müssen dokumentiert und begründet werden."
    },
    "physical-damage-to-removable-media": {
      "title": "Physische Beschädigung von Wechselmedien (BSI SYS.4.5)",
      "description": "Wechselmedien wie USB-Sticks oder externe Festplatten sind aufgrund ihrer Größe, Tragbarkeit und physischen Beschaffenheit anfällig für Beschädigungen, Fehler oder Ausfälle. ",
      "impact": "Ein Ausfall oder eine Beschädigung von Wechselmedien wirkt sich direkt auf die Verfügbarkeit und Integrität der darauf gespeicherten Daten aus. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.4.5 (Wechseldatenträger), insbesondere dem Szenario ",
      "action": "Implementieren Sie sichere Handhabungs-, Verschlüsselungs- und @Backup:Target-Richtlinien für Wechselmedien",
      "mitigation": "Um das Risiko von Datenverlusten durch physische Schäden zu mindern, erzwingen Sie obligatorische Backups für alle kritischen oder wichtigen Informationen, die auf Wechselmedien gespeichert sind. ",
      "check": "Gibt es eine Richtlinie zur Nutzung von Wechselmedien? Wird die Datenverschlüsselung für Wechselmedien mit sensiblen Informationen erzwungen? ",
      "detectionLogic": "Diese Regel löst bei jedem ",
      "riskAssessment": "Die Wahrscheinlichkeit eines physischen Ausfalls oder einer Beschädigung wird als ",
      "falsePositives": "Das Risiko könnte als teilweise gemindert betrachtet werden, wenn nachweislich starke physische Kontrollen, eine obligatorische Verschlüsselung und robuste @Backup:Target-Verfahren vorhanden sind. "
    },
    "removable-media-risk-con5": {
      "title": "Risiken bei der Verwendung von Wechselmedien (BSI SYS.4.5)",
      "description": "Wechselmedien werden in sehr unterschiedlichen Umgebungen eingesetzt und sind daher vielen Bedrohungen ausgesetzt. ",
      "impact": "Wenn Wechselmedien nicht sicher gehandhabt werden, kann dies zum Verlust der Vertraulichkeit, Integrität und Verfügbarkeit der darauf gespeicherten Daten und der Systeme, mit denen sie verbunden sind, führen. ",
      "asvs": "BSI IT-Grundschutz SYS.4.5: Wechseldatenträger",
      "action": "Implementieren Sie sichere Handhabungsverfahren für Wechselmedien",
      "mitigation": "Eine umfassende Richtlinie für die Verwendung von Wechselmedien muss erstellt und durchgesetzt werden. ",
      "check": "Gibt es eine dokumentierte und durchgesetzte Richtlinie für die Verwendung von Wechselmedien? Sind technische Kontrollen wie obligatorische Verschlüsselung und Antiviren-Scans vorhanden? ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als Clients oder andere physisch zugängliche Gerätetypen (z. B. Desktops, Laptops, IoT-Geräte) klassifiziert sind. ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen der vom betroffenen technischen Asset verarbeiteten oder gespeicherten Daten bestimmt. ",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn eine Organisation effektive technische Kontrollen implementiert hat, die im Modell nicht sichtbar sind, wie z. B. die Deaktivierung aller relevanten physischen Ports über Hardware-Einstellungen oder zentrale Verwaltungsrichtlinien (MDM/GPO)."
    },
    "malware-via-removable-media-sys-4-5": {
      "title": "Verbreitung von Malware über Wechselmedien (BSI SYS.4.5)",
      "description": "Wechselmedien (z. B. USB-Sticks, externe Festplatten) werden oft zum Austausch von Daten zwischen verschiedenen Geräten und Arbeitsstationen verwendet. ",
      "impact": "Wenn Malware über Wechselmedien eingeschleust wird, kann dies zur Kompromittierung der Vertraulichkeit (Datendiebstahl), Integrität (Datenmanipulation), ",
      "asvs": "BSI IT-Grundschutz Baustein SYS.4.5 Wechseldatenträger, z.B. Anforderungen SYS.4.5.A12 Schutz vor Schadsoftware und SYS.4.5.A4 Richtlinie zum sicheren Umgang mit Wechseldatenträgern.",
      "action": "Strikte Kontrollen für die Nutzung von Wechselmedien implementieren",
      "mitigation": "Deaktivieren Sie Autorun/Autoplay-Funktionen für alle Medien über Endpoint-Management-Richtlinien. Implementieren Sie eine Endpoint-Protection-Lösung (Antivirus/Antimalware) ",
      "check": "Sind Endpoint-Protection-Systeme so konfiguriert, dass sie Wechselmedien scannen? Sind Autorun-Funktionen über Gruppenrichtlinien oder ähnliche Mechanismen deaktiviert? ",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset generiert, das als Client-System identifiziert wird (z. B. `desktop`, `client-system`, `mobile-app`, `devops-client`) ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn sich das Asset in einer hochkontrollierten physischen Umgebung befindet, in die keine externen Medien eingebracht werden können, "
    },
    "dns-failure-bsi-app-3-6": {
      "title": "Ausfall eines DNS-Servers (BSI APP.3.6)",
      "description": "Fällt ein DNS-Server aus, kann dies den gesamten IT-Betrieb stören. Da Clients und andere Server der Institution dann keine internen oder externen Hostnamen mehr in Adressen auflösen können, können keine Datenverbindungen aufgebaut werden. Dieses Risiko identifiziert DNS-Server, die nicht für Hochverfügbarkeit konfiguriert sind und somit einen Single Point of Failure (SPOF) darstellen.",
      "impact": "Ein Ausfall eines zentralen DNS-Servers führt zu weitreichenden Dienstausfällen. Externe IT-Systeme, wie die von mobilen Mitarbeitern, Kunden und Geschäftspartnern, können die Institution nicht erreichen",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium 2023, Baustein APP.3.6: DNS-Server, speziell Anforderung APP.3.6.A2 ",
      "action": "Implementieren Sie eine redundante und widerstandsfähige DNS-Infrastruktur",
      "mitigation": "Stellen Sie die hohe Verfügbarkeit von DNS-Diensten durch die Implementierung redundanter DNS-Server sicher (z. B. ein Primär/Sekundär-Setup). Das `redundant: true`-Flag sollte am technischen Asset im Modell gesetzt werden, um dies widerzuspiegeln. Verwenden Sie für kritische Operationen mehrere, geografisch verteilte DNS-Server. Implementieren Sie eine aktive Überwachung, um DNS-Server-Ausfälle schnell zu erkennen und Failover-Mechanismen auszulösen. Stellen Sie sicher, dass die DNS-Server-Konfigurationen regelmäßig gesichert werden.",
      "check": "Ist das technische Asset mit ",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das mit `@Service:DNSServer` gekennzeichnet ist und im Modell nicht als `redundant: true` markiert ist. Das Fehlen des `redundant`-Flags bei einer kritischen Infrastrukturkomponente wie einem DNS-Server weist auf einen Single Point of Failure (SPOF) hin.",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jeden nicht-redundanten DNS-Server als **Wahrscheinlich** angesehen, da er einen Single Point of Failure darstellt. Die Auswirkung leitet sich direkt aus der Verfügbarkeitsbewertung des DNS-Server-Assets selbst ab. Ein `Mission-Critical` DNS-Server führt zu `Sehr-Hoher` Auswirkung, `Critical` zu `Hoher` Auswirkung usw. Der Gesamtschweregrad des Risikos ist eine Funktion dieser Wahrscheinlichkeit und Auswirkung.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn der DNS-Dienst"
    },
    "insufficient-dns-capacity": {
      "title": "Unzureichende Kapazität des DNS-Servers (DoS-Risiko)",
      "description": "Das BSI stellt fest: ",
      "impact": "Ein erfolgreicher Denial-of-Service-Angriff oder eine Kapazitätsüberlastung eines zentralen DNS-Servers kann abhängige Dienste und Anwendungen unbrauchbar machen und den Geschäftsbetrieb erheblich beeinträchtigen. Dies bedroht direkt die Verfügbarkeit aller IT-Infrastrukturkomponenten, die für die Namensauflösung auf ihn angewiesen sind.",
      "asvs": "Abgeleitet aus einer allgemeinen BSI-Gefährdungsbeschreibung zur DNS-Verfügbarkeit. Dies steht im Einklang mit den Prinzipien der Hochverfügbarkeitsarchitektur.",
      "action": "Redundanz und Kapazitätsplanung des DNS-Servers sicherstellen",
      "mitigation": "Betreiben Sie DNS-Server in einer redundanten, hochverfügbaren Konfiguration (z. B. einem Cluster). Verwenden Sie Lastverteilung, um Anfragen zu verteilen. Implementieren Sie für internet-zugängliche DNS-Server robuste DoS-Schutzmaßnahmen (z. B. über eine WAF, einen spezialisierten Anbieter oder Cloud-Service-Funktionen). Überwachen Sie regelmäßig die Serverlast und die Netzwerkkapazität und skalieren Sie die Ressourcen proaktiv. Das Asset im Modell sollte als `redundant: true` markiert werden, um diese Maßnahmen widerzuspiegeln.",
      "check": "Ist das technische Asset für Hochverfügbarkeit konfiguriert (z. B. geclustert, redundante Instanzen)? Wird es auf Leistung und Last überwacht? Sind DoS-Schutzmechanismen vorhanden, insbesondere wenn es",
      "detectionLogic": "Diese Regel löst bei technischen Assets aus, die mit `@Service:DNSServer` gekennzeichnet sind. Das Risiko wird generiert, wenn das Asset nicht als redundant markiert ist (`redundant: false`). Der Schweregrad wird erhöht, wenn das Asset internet-zugänglich ist und/oder eine große Anzahl von Clients bedient, da diese Faktoren seine Exposition und die potenzielle Auswirkung eines Ausfalls erhöhen.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Ausfalls wird durch fehlende Redundanz erheblich erhöht. Die Internet-Exposition macht das Asset zu einem wahrscheinlicheren Ziel für externe Angriffe. Die Auswirkung leitet sich aus der Verfügbarkeitsanforderung des DNS-Servers selbst ab, da er eine kritische Infrastrukturkomponente für viele andere Assets ist.",
      "falsePositives": "Diese Regel kann ein False Positive generieren, wenn ein Asset als eine einzelne Komponente modelliert ist, aber in Wirklichkeit ein verwalteter, hochverfügbarer DNS-Dienst ist (z. B. von einem Cloud-Anbieter), bei dem Redundanz implizit ist. In solchen Fällen sollte das Asset im Modell als `redundant: true` markiert werden, um dieses Risiko zu unterdrücken."
    },
    "inadequate-dns-planning-bsi-net2.2": {
      "title": "Unzureichende oder fehlende Planung des DNS-Einsatzes (BSI NET.2.2)",
      "description": "Planungsfehler haben oft besonders schwerwiegende Auswirkungen, da sie leicht weitreichende Sicherheitsschwachstellen schaffen können. ",
      "impact": "Wenn Firewall-Regeln, die den DNS-Verkehr kontrollieren, zu freizügig sind, können sie Angriffe wie DNS-Tunneling zur Datenexfiltration (Verlust der Vertraulichkeit) oder DNS-Spoofing (Verlust der Integrität) ermöglichen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.2.2 (@Service:DNSServer), speziell bezogen auf die Gefährdung NET.2.2.A2 (Ungeplante oder unsachgemäße Anbindung eines DNS-Servers an das Internet).",
      "action": "Entwickeln und implementieren Sie ein umfassendes DNS-Sicherheitskonzept und Firewall-Regelwerk",
      "mitigation": "Ein dokumentiertes DNS-Konzept sollte erstellt und gepflegt werden. Firewall-Regeln für den DNS-Verkehr müssen streng definiert werden ",
      "check": "Gibt es ein dokumentiertes DNS-Konzept? Basieren die Firewall-Regeln für den DNS-Verkehr auf einem ",
      "detectionLogic": "Dieses Risiko wird für jede netzwerkebene Vertrauensgrenze (wie lokale Netzwerke, Cloud-Anbieter oder Sicherheitsgruppen) ausgelöst, über die Verkehr fließt und die nicht explizit mit dem ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn ein robustes DNS-Sicherheitskonzept vorhanden ist, aber die entsprechende Vertrauensgrenze im Modell nicht getaggt wurde. "
    },
    "incorrect-dns-information": {
      "title": "Falsche DNS-Informationen",
      "description": "Auch wenn der Einsatz von DNS sorgfältig geplant und alle sicherheitsrelevanten Punkte berücksichtigt wurden, ist dies nicht ausreichend, wenn semantisch und syntaktisch falsche Domäneninformationen erstellt werden. ",
      "impact": "Falsche oder böswillig geänderte DNS-Informationen können zu schwerwiegenden Dienstunterbrechungen (Verfügbarkeit) führen, da Anwendungen möglicherweise keine Verbindung zu erforderlichen Backends, Datenbanken oder externen Diensten herstellen können. ",
      "asvs": "BSI IT-Grundschutz NET.1.1 @Service:DNSServer, speziell Anforderung NET.1.1.A5 ",
      "action": "Implementieren und erzwingen Sie Überprüfungen der DNS-Datenintegrität und -konsistenz",
      "mitigation": "Stellen Sie sicher, dass der Zugriff auf die DNS-Server-Konfiguration und Zonendateien streng kontrolliert wird. Implementieren Sie ein Vier-Augen-Prinzip für Änderungen an kritischen DNS-Einträgen. ",
      "check": "Gibt es Prozesse zur Überprüfung der Korrektheit von DNS-Einträgen vor und nach ihrer Bereitstellung? Ist der Zugriff zur Verwaltung von DNS-Einträgen auf autorisiertes Personal beschränkt? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das explizit über das ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Fehlkonfiguration wird als ",
      "falsePositives": "Diese Regel könnte ein False Positive generieren, wenn das getaggte Asset lediglich ein Caching- oder Forwarding-DNS-Resolver ist und nicht autoritativ für Zonen. Das Risiko gilt hauptsächlich für autoritative DNS-Server, bei denen falsche Daten entstehen können."
    },
    "misconfigured-@Service:DNSServer": {
      "title": "Fehlkonfigurierter DNS-Server (BSI APP.3.6)",
      "description": "Sicherheitskritische Standardeinstellungen, benutzerdefinierte sicherheitskritische Einstellungen oder falsche Konfigurationen können zu Fehlfunktionen eines DNS-Servers führen. Dies umfasst Probleme wie den Betrieb als offener Resolver oder die Zulassung uneingeschränkter Zonentransfers.",
      "impact": "Eine offene Resolver-Konfiguration kann den Server erheblich beeinträchtigen",
      "asvs": "BSI IT-Grundschutz APP.3.6 DNS-Server, z. B. A4 (Sichere Grundkonfiguration eines DNS-Servers: Rekursion und Zonentransfers einschränken) und A18 (Erhöhter Schutz von Zonentransfers).",
      "action": "DNS-Server-Konfiguration sichern",
      "mitigation": "Konfigurieren Sie den DNS-Server so, dass er rekursive Anfragen nur von vertrauenswürdigen internen Netzwerken akzeptiert (offene Rekursion deaktivieren). Beschränken Sie DNS-Zonentransfers (z. B. AXFR/IXFR-Anfragen) strikt auf die IP-Adressen autorisierter sekundärer DNS-Server. Stellen Sie sicher, dass die DNS-Server-Software auf dem neuesten Stand gehalten und gegen bekannte Schwachstellen gepatcht wird.",
      "check": "Ist die Rekursion für externe Anfragen deaktiviert? Sind Zonentransfers auf spezifische, autorisierte IP-Adressen beschränkt? Wird die DNS-Server-Software regelmäßig gepatcht?",
      "detectionLogic": "Diese Regel identifiziert als DNS-Server getaggte Assets. Sie prüft dann auf zwei verschiedene Fehlkonfigurationsrisiken: 1. Wenn der DNS-Server Kommunikation von einem Asset erhält, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit für beide Risiken wird als hoch angesehen, wenn die jeweilige Exposition besteht, da es sich um häufige und bekannte Angriffsvektoren handelt. Die Auswirkung des ",
      "falsePositives": "Eine Verbindung aus dem Internet könnte für einen nur-autoritativen Server bestimmt sein, was weniger riskant ist als ein rekursiver; das Modell kann Anfragetypen nicht unterscheiden. Eine Verbindung aus einem anderen Netzwerk könnte für einen legitimen, autorisierten sekundären Server bestimmt sein, der sich zufällig in einer anderen Netzwerk-Vertrauensgrenze befindet. Eine manuelle Überprüfung des Servers"
    },
    "dns-cache-poisoning-app4.4": {
      "title": "DNS-Cache-Poisoning (BSI APP.3.6)",
      "description": "Ein DNS-Cache-Poisoning-Angriff zielt darauf ab, dass das angegriffene IT-System falsche Zuordnungen von IP-Adressen und Namen speichert. ",
      "impact": "Erfolgreiche DNS-Cache-Poisoning-Angriffe werden oft mit dem Ziel durchgeführt, Anfragen an bösartige Server umzuleiten (z. B. für Phishing oder Malware-Verbreitung). ",
      "asvs": "V14.2 Überprüfungsanforderungen für die Kommunikationssicherheit",
      "action": "Implementieren Sie sichere DNS-Auflösungsmechanismen",
      "mitigation": "Verwenden Sie vertrauenswürdige, sicherheitsbewusste DNS-Resolver, die DNSSEC unterstützen. Aktivieren Sie für Clients und Anwendungen, die ausgehende Aufrufe tätigen, die DNSSEC-Validierung, um die Authentizität und Integrität von DNS-Antworten zu gewährleisten. ",
      "check": "Sind alle Clients und Server so konfiguriert, dass sie einen vertrauenswürdigen, unternehmenseigenen DNS-Resolver verwenden? Wird die DNSSEC-Validierung für externe Abfragen erzwungen? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset gemeldet, das mit einem Asset im Internet aus einer vertrauenswürdigen Netzwerkgrenze heraus kommuniziert. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei Client-Technologien (Browser, mobile Apps, IoT-Geräte), die möglicherweise in weniger vertrauenswürdigen Netzwerken betrieben werden, als höher angesehen. ",
      "falsePositives": "Dieses Risiko wird aufgrund der modellierten Netzwerktopologie ausgelöst. Es kann ein False Positive sein, wenn die Zieldomäne unkritisch ist oder die Client-Anwendung andere eingebaute Schutzmechanismen gegen Umleitung hat (z. B. Zertifikats-Pinning, das hier nicht modelliert wird). "
    },
    "dns-hijacking": {
      "title": "DNS-Hijacking",
      "description": "DNS-Hijacking ist eine Man-in-the-Middle (MITM)-Angriffsmethode, die verwendet wird, um die Kommunikation durch Kompromittierung des Domain Name System (DNS)-Auflösungsprozesses abzufangen und umzuleiten. Ein Angreifer kann die Kommunikation zwischen einem Client",
      "impact": "Erfolgreiches DNS-Hijacking kann zu Phishing-Angriffen, Diebstahl von Anmeldeinformationen und Malware-Verbreitung führen, indem Benutzer auf betrügerische Websites umgeleitet werden. Es untergräbt grundlegend das Vertrauen in Domain-Namen und kompromittiert die Integrität der Kommunikation. Dies kann zu erheblichen finanziellen Verlusten, Reputationsschäden und der Kompromittierung sensibler Daten führen (Verletzung von Vertraulichkeit und Integrität).",
      "asvs": "BSI IT-Grundschutz: SYS.1.2.2 DNS-Server. OWASP: ASVS V4.0.3 - 9.1.1 (Überprüfen Sie, ob alle Verbindungen zu externen Systemen authentifiziert und während der Übertragung verschlüsselt sind).",
      "action": "Verschlüsselte Kommunikationsprotokolle und sicheres DNS erzwingen",
      "mitigation": "Alle Kommunikationen, insbesondere über Vertrauensgrenzen zu externen oder internet-zugänglichen Assets, müssen verschlüsselte Protokolle verwenden (z. B. HTTPS, LDAPS, FTPS). Dies verhindert MITM-Angriffe, einschließlich derer, die durch DNS-Hijacking erleichtert werden. Verwenden Sie zusätzlich sichere DNS-Protokolle wie DNS-over-HTTPS (DoH) oder DNS-over-TLS (D@SystemType:OT), um die DNS-Anfragen selbst zu verschlüsseln. Die Implementierung der DNSSEC-Validierung am Resolver stellt die Authentizität und Integrität der DNS-Antworten sicher. Wenn unverschlüsselte Protokolle unvermeidbar sind, stellen Sie sicher, dass sie durch ein obligatorisches, vertrauenswürdiges VPN geschützt sind, das mit dem ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen, die Vertrauensgrenzen zu externen oder internet-zugänglichen Assets überschreiten. Überprüfen Sie, ob sie ausschließlich stark verschlüsselte Protokolle verwenden. Überprüfen Sie die Client- und Server-Konfigurationen auf die Verwendung von sicherem DNS (DoH/D@SystemType:OT) und DNSSEC-Validierung.",
      "detectionLogic": "Dieses Risiko wird für jede unverschlüsselte Kommunikationsverbindung von einem im Geltungsbereich befindlichen Asset zu einem externen, internet-zugänglichen Asset ausgelöst. Solche Verbindungen sind für die Auflösung auf DNS angewiesen, und ohne Transport Layer Encryption sind sie anfällig für MITM-Angriffe, die über DNS-Hijacking eingeleitet werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn das Kommunikationsprotokoll, obwohl technisch unverschlüsselt, durch andere kompensierende Kontrollen wie ein obligatorisches, vertrauenswürdiges VPN geschützt ist, das den gesamten Verkehr zwischen den beiden Endpunkten verschlüsselt. Dies muss explizit modelliert werden (z. B. durch Verwendung der `vpn: true`-Eigenschaft auf der Kommunikationsverbindung)."
    },
    "dos-on-@Service:DNSServer": {
      "title": "Denial-of-Service-Angriff auf einen DNS-Server",
      "description": "Bei einem Denial-of-Service (DoS)-Angriff auf einen DNS-Server wird eine große Anzahl von Anfragen, typischerweise von einem Botnetz, an den Server gesendet. ",
      "impact": "Ein erfolgreicher DoS-Angriff auf einen DNS-Server führt zu einem Verlust der Verfügbarkeit für alle Systeme und Anwendungen, die von ihm abhängen. ",
      "asvs": "OWASP ASVS V4.0.3: 11.1.1 (Überprüfen Sie, ob die Anwendung in der Lage ist, Anfragen zu bearbeiten und bei einem Denial-of-Service-Angriff ordnungsgemäß auszufallen.)",
      "action": "Implementieren Sie volumetrischen DoS-Schutz und stellen Sie DNS-Redundanz sicher",
      "mitigation": "Schützen Sie DNS-Server mit einem spezialisierten DoS-Mitigationsdienst (z. B. von einem CDN oder Cloud-Anbieter). ",
      "check": "Ist der DNS-Server durch einen professionellen Anti-DoS-Dienst geschützt? Gibt es redundante, geografisch getrennte DNS-Server? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als DNS-Server identifiziert wird (über das ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Angriffs ist für jeden öffentlich zugänglichen DNS-Server hoch. Die Auswirkung ist direkt proportional zur Verfügbarkeitsanforderung ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn der DNS-Dienst von einem großen Cloud-Anbieter (z. B. AWS Route 53, Google Cloud DNS) bereitgestellt wird "
    }
  }
}
