{
  "meta": {
    "part": 2,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 2 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "insecure-sap-erp-configuration-bsi-app2.1": {
      "title": "Unsichere SAP-ERP-Konfiguration (BSI APP.2.1)",
      "description": "Wenn ein SAP-ERP-System ohne Einhaltung der empfohlenen Sicherheitsleitfäden von SAP eingerichtet wird, kann dies zu schwerwiegenden Sicherheitslücken führen.",
      "impact": "Die Nichtbefolgung der SAP-Härtungsleitfäden kann die Vertraulichkeit, Integrität und Verfügbarkeit des gesamten ERP-Systems gefährden.",
      "asvs": "BSI IT-Grundschutz APP.2.1 SAP-ERP-System",
      "action": "SAP-Sicherheitshärtungsleitfäden anwenden",
      "mitigation": "Das SAP-ERP-System muss gemäß den offiziellen SAP-Sicherheitsempfehlungen und Best Practices konfiguriert und gehärtet werden.",
      "check": "Wurde das SAP-ERP-System gemäß den SAP-Empfehlungen konfiguriert?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets des ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird standardmäßig als hoch eingestuft, da SAP-Systeme komplex sind und Fehlkonfigurationen häufig vorkommen. Der Schaden wird aus dem ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn bestätigt wird, dass das System vollständig gemäß den SAP-Richtlinien gehärtet ist, diese Information jedoch n@SystemType:OT im Bedrohungsmodell erfasst ist."
    },
    "missing-sap-patches-or-security-notes": {
      "title": "Fehlende SAP-Patches oder Sicherheitshinweise",
      "description": "SAP-ERP-Systeme sind komplex und verarbeiten typischerweise sensible Daten. SAP veröffentlicht regelmäßig Patches und Sicherheitshinweise, um Softwarefehler und bekannte Schwachstellen zu beheben.",
      "impact": "Das Versäumnis, SAP-Patches zeitnah einzuspielen, kann zur Ausnutzung bekannter Schwachstellen führen. Dies kann die Vertraulichkeit sensibler Daten, die Integrität geschäftskritischer Prozesse und die Verfügbarkeit des gesamten ERP-Systems gefährden, was potenziell zu erheblichen finanziellen und Reputationsschäden führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein SYS.1.1 (Allgemeiner Server), Anforderung SYS.1.1.A20 (Zeitnahes Einspielen von Sicherheitsupdates).",
      "action": "Einen zeitnahen Patch-Management-Prozess für SAP-Systeme implementieren und durchsetzen",
      "mitigation": "Etablieren Sie einen formellen Patch-Management-Prozess für alle SAP-Systeme. Dieser Prozess sollte die regelmäßige Überwachung auf neue SAP-Sicherheitshinweise und -Patches, die Bewertung ihrer Relevanz und Kritikalität, das Testen in einer Nicht-Produktivumgebung und die Bereitstellung in Produktivsystemen innerhalb eines definierten Zeitrahmens umfassen. Automatisieren Sie die Überwachung und Bereitstellung, wo immer möglich, und führen Sie einen Audit-Trail aller eingespielten Patches.",
      "check": "Gibt es eine dokumentierte Patch-Management-Richtlinie für SAP-Systeme? Werden SAP-Sicherheitshinweise aktiv überwacht? Gibt es einen definierten Prozess für das Testen und Einspielen von Patches innerhalb eines festgelegten Zeitrahmens? Werden die Patch-Stände regelmäßig überprüft?",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset ausgelöst, das als SAP-ERP-System identifiziert wird (Technologie: ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn ein robuster, auditierter und zeitnaher Patch-Management-Prozess für SAP-Systeme nachweislich vorhanden ist. Dies kann nicht allein aus dem Modell bestimmt werden und erfordert eine Überprüfung der betrieblichen Sicherheitsverfahren und -aufzeichnungen."
    },
    "inadequate-sap-authorization-concept": {
      "title": "Unzureichendes SAP-Berechtigungskonzept (BSI APP.4.2)",
      "description": "SAP-Berechtigungskonzepte sind technisch und fachlich komplex. Aufgrund dieser Komplexität sind sie oft schlecht geplant oder umgesetzt. Ohne ein durchdachtes Konzept werden Konten häufig übermäßige Berechtigungen zugewiesen (was gegen das Prinzip der geringsten Rechte verstößt), die zur absichtlichen Manipulation oder versehentlichen Beschädigung des SAP-ERP-Systems verwendet werden könnten, wodurch dessen Integrität, Vertraulichkeit und Verfügbarkeit gefährdet werden.",
      "impact": "Diese Probleme können zu unbefugtem Zugriff, Datenmanipulation, Betrug und der Offenlegung sensibler Geschäftsdaten führen. In S/4HANA-Systemen können falsch ausgerichtete Berechtigungen zwischen den Komponenten ABAP, HANA und NetWeaver Gateway zu widersprüchlichen und unsicheren Zugriffszuständen führen. Eine schlechte Dokumentation verhindert effektive Wartung und Zugriffsüberprüfungen, wodurch ehemalige Mitarbeiter oder solche in neuen Rollen unnötige Privilegien behalten können.",
      "asvs": "BSI IT-Grundschutz APP.4.2 SAP-ERP-System",
      "action": "Ein rollenbasiertes SAP-Berechtigungskonzept entwerfen, implementieren und dokumentieren",
      "mitigation": "Entwickeln und erzwingen Sie ein detailliertes, rollenbasiertes Berechtigungskonzept, das auf dem Prinzip der geringsten Rechte basiert. Stellen Sie bei S/4HANA sicher, dass die Berechtigungen über ABAP, HANA und NetWeaver Gateway hinweg synchronisiert sind. Dokumentieren Sie das Konzept und alle zugewiesenen Privilegien gründlich. Führen Sie regelmäßige, periodische Zugriffsüberprüfungen (Benutzerzugriffs-Rezertifizierung) durch, um sicherzustellen, dass die Berechtigungen mit den aktuellen Jobrollen übereinstimmen und um veraltete Zugriffe für Mitarbeiter, die das Unternehmen verlassen oder die Rolle wechseln, zu entfernen. Verwenden Sie spezialisierte Werkzeuge zur Analyse und Verwaltung von SAP-Berechtigungen, um übermäßige Privilegien zu identifizieren und zu beheben. Markieren Sie das Asset mit dem Tag `@Mitigation:sap-authorization-concept-reviewed`, sobald dies überprüft wurde.",
      "check": "Gibt es ein dokumentiertes, rollenbasiertes SAP-Berechtigungskonzept? Werden Berechtigungen regelmäßig überprüft? Gibt es einen Prozess, um Mitarbeiter, die das Unternehmen verlassen oder die Rolle wechseln, zeitnah zu behandeln? Sind die Berechtigungen über verschiedene S/4HANA-Komponenten hinweg synchronisiert und konsistent?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset vom Technologietyp ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird aufgrund der inhärenten Komplexität von SAP-Systemen standardmäßig als hoch angesehen. Der Schaden leitet sich aus der CIA-Bewertung des ERP-Systems selbst ab. Ein ERP-System, das ",
      "falsePositives": "Das Risiko ist eine generische Best-Practice-Prüfung für SAP-Systeme. Es kann ein Fehlalarm sein, wenn bereits ein robustes, gut dokumentiertes und regelmäßig überprüftes Berechtigungskonzept existiert. Dies muss durch eine manuelle Überprüfung bestätigt werden."
    },
    "lack-of-erp-documentation-and-contingency-plan": {
      "title": "Fehlende SAP/ERP-Systemdokumentation und/oder Notfallplan",
      "description": "Wenn die Dokumentation für ein SAP/ERP-System nicht vorhanden ist oder nicht gepflegt wird, ist es unmöglich nachzuvollziehen, wie das System konfiguriert und aufgebaut wurde.",
      "impact": "Das Versäumnis, das System zu dokumentieren und Notfallpläne vorzubereiten, kann das System schwerwiegend beeinträchtigen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein APP.4.2 (SAP-ERP-System), insbesondere Abschnitt 2.4 (Fehlende SAP-Dokumentation und Notfallpläne) und Anforderung APP.4.2.A28 (Erstellung eines Notfallplans).",
      "action": "Systemdokumentation und Notfallpläne erstellen und pflegen",
      "mitigation": "Erstellen Sie eine umfassende technische und betriebliche Dokumentation für das SAP/ERP-System, die alle Konfigurationen, Anpassungen und Abhängigkeiten abdeckt. Halten Sie diese Dokumentation bei allen Änderungen auf dem neuesten Stand.",
      "check": "Gibt es eine aktuelle, umfassende Dokumentation für das SAP/ERP-System? Existiert ein detaillierter, getesteter Notfallplan für das System? Sind die zuständigen Mitarbeiter über den Plan informiert und geschult?",
      "detectionLogic": "Löst bei im Geltungsbereich befindlichen technischen Assets mit dem ",
      "riskAssessment": "Die Auswirkung ist direkt an die Verfügbarkeitsbewertung des ERP-Systems gekoppelt. Für ein ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die erforderliche Dokumentation und die Pläne in der Realität existieren, aber im Bedrohungsmodell nicht entsprechend gekennzeichnet wurden. Der Zweck dieses Risikos ist es, eine Überprüfung anzustoßen."
    },
    "insufficient-hardware-resources-for-database": {
      "title": "Unzureichende Hardwareressourcen für Datenbanksystem (BSI-basiert)",
      "description": "Wenn die Hardware eines Datenbanksystems n@SystemType:OT über ausreichende Systemressourcen (CPU, Speicher, Speicher-I/O) verfügt,",
      "impact": "Ein Mangel an ausreichenden Hardwareressourcen für eine Datenbank bedroht direkt deren Integrität und Verfügbarkeit.",
      "asvs": "BSI IT-Grundschutz: OPS.1.1.5 Kapazitätsmanagement (insbesondere A1 Planung, A2 Überwachung)",
      "action": "Kapazitätsmanagement implementieren und überwachen",
      "mitigation": "Stellen Sie sicher, dass das Datenbanksystem mit angemessenen Hardwareressourcen (CPU, Speicher, I/O, Speicherplatz) ausgestattet ist, um Spitzenlasten zu bewältigen, basierend auf einem Kapazitätsplan (BSI OPS.1.1.5.A1).",
      "check": "Gibt es einen Kapazitätsplan für die Datenbank? Werden Leistung und Ressourcennutzung überwacht?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets des ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsanforderungen des Datenbank-Assets und der darin gespeicherten Daten bestimmt.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Datenbank bereits gut ausgestattet und überwacht wird, was n@SystemType:OT allein aus dem Modell bestimmt werden kann."
    },
    "default-database-accounts": {
      "title": "Standardkonten auf Datenbankmanagementsystemen (BSI APP.4.4.A6)",
      "description": "Bei der Erstinstallation oder im Auslieferungszustand verfügt ein Datenbankmanagementsystem (DBMS) oft über Standardkonten (für Benutzer und Administratoren), die entweder ungesichert oder nur durch öffentlich bekannte Passwörter geschützt sind.",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht unbefugten Zugriff auf die Datenbank mit potenziell administrativen Rechten. Dies kann zu einer vollständigen Kompromittierung der Vertraulichkeit, Integrität und Verfügbarkeit aller in der Datenbank gespeicherten Daten sowie zur Manipulation der DBMS-Konfiguration führen.",
      "asvs": "BSI IT-Grundschutz APP.4.4.A6 (Sicheres Administratorkonto für das DBMS)",
      "action": "Standard-Datenbankkonten sichern oder entfernen",
      "mitigation": "Alle Standardpasswörter für vorkonfigurierte Konten auf dem DBMS müssen sofort nach der Installation in starke, eindeutige Werte geändert werden. Unnötige oder ungenutzte Standardkonten sollten deaktiviert oder gelöscht werden. Der Zugriff auf administrative Konten muss streng kontrolliert und überwacht werden.",
      "check": "Überprüfen Sie, dass keine Standardkonten auf der Datenbank mit ihren ursprünglichen, öffentlich bekannten Passwörtern existieren. Prüfen Sie, ob ungenutzte Standardkonten deaktiviert oder entfernt wurden. Überprüfen Sie den Härtungsleitfaden der Datenbank und bestätigen Sie dessen Anwendung.",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets vom Technologietyp ",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist sehr hoch, da das Scannen nach Standard-Anmeldeinformationen ein gängiger automatisierter Angriffsvektor ist. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität (Vertraulichkeit und Integrität) der in der Datenbank gespeicherten Daten. Eine Datenbank, die ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Datenbank aus einem vorgehärteten "
    },
    "unencrypted-database-communication": {
      "title": "Unverschlüsselte Kommunikation zur Datenbank (BSI-abgeleitet)",
      "description": "In ihrer Standardkonfiguration verbinden sich viele Datenbankmanagementsysteme (DBMS) ohne Verschlüsselung mit Anwendungen.",
      "impact": "Das Abhören der Kommunikation kann zur Offenlegung sensibler Geschäftsdaten, personenbezogener Daten oder technischer Anmeldeinformationen führen.",
      "asvs": "V9.1 Datenschutz",
      "action": "Verschlüsselte Datenbankverbindungen erzwingen",
      "mitigation": "Konfigurieren Sie alle Kommunikationsverbindungen zwischen Anwendungen und Datenbanksystemen so, dass sie starke, hochmoderne Verschlüsselungsprotokolle (z. B. über TLS) verwenden.",
      "check": "Überprüfen Sie die Verbindungszeichenfolgen und die Konfiguration für alle Anwendungs-zu-Datenbank-Verbindungen. Stellen Sie sicher, dass ein verschlüsseltes Protokoll verwendet wird.",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, bei denen das Ziel eine ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit und Integrität der über die Verbindung übertragenen Daten-Assets bestimmt.",
      "falsePositives": "Kann auftreten, wenn ein benutzerdefiniertes oder nicht standardmäßiges Protokoll verwendet wird, das Verschlüsselung beinhaltet, aber n@SystemType:OT vom Tool erkannt wird."
    },
    "data-loss-in-database-due-to-failures": {
      "title": "Datenverlust in einer Datenbank aufgrund technischer oder menschlicher Fehler (BSI APP.4.3)",
      "description": "Daten können in einer Datenbank aufgrund von Hardware- oder Softwarefehlern sowie durch menschliche Fehlkonfigurationen oder Fehler verloren gehen.",
      "impact": "Da Datenbanken typischerweise für Anwendungen kritische Informationen speichern, kann der Verlust oder die Nichtverfügbarkeit von Daten zum Ausfall von Diensten oder ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein APP.4.3: Relationale Datenbanken.",
      "action": "Backup- und Wiederherstellungsverfahren und/oder Hochverfügbarkeit implementieren und regelmäßig testen.",
      "mitigation": "Erstellen Sie regelmäßig Backups der Datenbank. Speichern Sie Backups sicher und an einem separaten Ort (idealerweise extern oder in einer anderen Verfügbarkeitszone).",
      "check": "Werden regelmäßig Backups der Datenbank erstellt? Werden Backups sicher und separat gespeichert? Gibt es einen dokumentierten und getesteten Wiederherstellungsplan? Ist das Datenbank-Asset als ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets des Typs ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn Hochverfügbarkeits- oder Backup- und Wiederherstellungsmechanismen vorhanden sind, aber nicht modelliert wurden. Um dies zu beheben, markieren Sie das entsprechende Datenbank-Asset als "
    },
    "data-integrity-violation-in-database-con-4-a19": {
      "title": "Verletzung der Datenintegrität in einer Datenbank (BSI CON.4.A19)",
      "description": "Die Integrität von Informationen in einer Datenbank kann aufgrund von Fehlkonfigurationen, Softwarefehlern oder direkter Datenmanipulation verletzt werden.",
      "impact": "Wenn die Datenintegrität kompromittiert und nicht rechtzeitig erkannt wird, kann dies zu falschen Geschäftsentscheidungen, finanziellen Verlusten (z. B. durch fehlerhafte Abrechnungs- oder Steuerdaten) führen, ",
      "asvs": "V7.1.1",
      "action": "Datenintegritätskontrollen implementieren und durchsetzen",
      "mitigation": "Nutzen Sie datenbankeigene Integritätsbedingungen wie Primärschlüssel, Fremdschlüssel (referenzielle Integrität), UNIQUE-, NOT NULL- und CHECK-Bedingungen.",
      "check": "Überprüfen Sie das Datenbankschema auf die Verwendung von Integritätsbedingungen (Fremdschlüssel, Check-Bedingungen usw.). Analysieren Sie den Anwendungscode auf eine strikte serverseitige Validierungslogik vor dem Schreiben in die Datenbank. Gibt es Audit- oder Überwachungsmechanismen, um unbefugte oder unerwartete Datenänderungen zu erkennen?",
      "detectionLogic": "Löst bei im Geltungsbereich befindlichen technischen Assets des Typs ",
      "riskAssessment": "Die Auswirkung wird durch die höchste ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Datenintegrität vollständig und robust auf der Anwendungsebene durchgesetzt wird, dies aber nicht über das Mitigations-Tag im Modell dokumentiert ist."
    },
    "sql-injection-bsi": {
      "title": "SQL-Injection",
      "description": "Eine verbreitete Angriffsmethode auf Datenbanksysteme ist die SQL-Injection. Wenn eine Anwendung auf Daten aus einer SQL-Datenbank zugreift, werden Befehle als SQL-Anweisungen an das DBMS übermittelt. Wenn Eingabedaten in der Anwendung unzureichend validiert werden, können Angreifer eigene SQL-Befehle einschleusen, die dann mit den Berechtigungen der Anwendung verarbeitet werden.",
      "impact": "Angreifer können Daten lesen, manipulieren, löschen oder hinzufügen und potenziell Systembefehle ausführen. Obwohl SQL-Injections hauptsächlich auf Anwendungen abzielen, haben sie erhebliche Auswirkungen auf das Datenbanksystem selbst und die zugehörige Infrastruktur, was zu einer vollständigen Kompromittierung der Daten (Vertraulichkeit, Integrität), Systemausfällen (Verfügbarkeit) und weiteren Kompromittierungen der Infrastruktur führen kann.",
      "asvs": "V5.3.3: Überprüfen Sie, dass die Anwendung vor SQL-Injection-Angriffen schützt.",
      "action": "Eingabevalidierung implementieren und parametrisierte Abfragen verwenden",
      "mitigation": "Die primäre Abwehrmaßnahme ist die Verwendung von parametrisierten Abfragen (Prepared Statements) für alle Datenbankzugriffe. Alle vom Benutzer bereitgestellten Eingaben müssen serverseitig validiert, gefiltert oder bereinigt werden. Setzen Sie das Prinzip der geringsten Rechte für das Datenbank-Dienstkonto durch. Verwenden Sie ein ORM-Framework (Object-Relational Mapping), das die Parametrisierung korrekt handhabt. Vermeiden Sie die dynamische Erstellung von SQL-Abfragen mit unvalidierten Daten.",
      "check": "Werden alle vom Benutzer bereitgestellten Eingaben streng validiert? Werden für alle Datenbankinteraktionen parametrisierte Abfragen oder Prepared Statements verwendet? Besitzt das Datenbank-Dienstkonto die minimal notwendigen Berechtigungen? Wird die dynamische Erstellung von SQL-Abfragen mit unvalidierten Daten vermieden?",
      "detectionLogic": "Dieses Risiko wird für technische Assets (wie Webanwendungen oder Webdienste) ausgelöst, die individuell entwickelt wurden und eine direkte Kommunikationsverbindung zu einer Datenbank über ein SQL-basiertes Protokoll haben. Das Risiko ist erhöht, wenn das Asset dem Internet ausgesetzt ist oder Daten aus nicht vertrauenswürdigen Quellen verarbeitet, da dies einen Vektor für bösartige Eingaben darstellt.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit ist HOCH für individuell entwickelte Anwendungen, die dem Internet ausgesetzt sind und n@SystemType:OT ein modernes, sicheres ORM verwenden. Der Schaden steht in direktem Zusammenhang mit der Vertraulichkeit und Integrität der Daten in der angebundenen Datenbank. Wenn die Datenbank ",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn die Anwendung ein modernes, sicheres Framework (wie ein gut konfiguriertes ORM) verwendet, das SQLi standardmäßig verhindert, auch wenn das Modell das anfällige Muster zeigt. Die Überprüfung erfordert eine Code-Prüfung oder dynamische/statische Anwendungssicherheitstests (DAST/SAST)."
    },
    "unhardened-database-defaults": {
      "title": "Unsichere Standardkonfiguration des Datenbanksystems (BSI-DB-STD-CFG)",
      "description": "In der Standardkonfiguration eines Datenbankmanagementsystems (DBMS) sind oft unnötige Funktionen aktiviert. Dies kann es Angreifern erleichtern, Daten in der Datenbank zu lesen oder zu manipulieren. Beispielsweise könnten sich Angreifer aufgrund einer unveränderten Standardinstallation ohne Authentifizierung mit einer ungenutzten administrativen Programmierschnittstelle verbinden. Dies könnte unbefugten Zugriff auf die Institution ermöglichen.",
      "impact": "Wenn diese Schwachstelle ausgenutzt wird, könnte ein Angreifer unbefugten administrativen Zugriff auf die Datenbank erlangen. Dies würde ihm ermöglichen, sensible Daten zu lesen, zu ändern oder zu löschen, was zu einer Verletzung der Vertraulichkeit und Integrität führt. Es könnte auch zu einem Denial-of-Service führen, indem Datenbankkomponenten geändert oder gelöscht werden.",
      "asvs": "V14.2.1 (Sichere Konfiguration), V14.2.3 (Unnötige Funktionen deaktiviert)",
      "action": "Datenbankkonfiguration härten",
      "mitigation": "Überprüfen Sie die Standardkonfiguration des DBMS und deaktivieren Sie alle unnötigen Funktionen, Dienste und Programmierschnittstellen. Stellen Sie sicher, dass alle administrativen Schnittstellen eine starke Authentifizierung erfordern und nicht für nicht vertrauenswürdige Netzwerke zugänglich sind. Wenden Sie Leitfäden zur Härtung der Sicherheitskonfiguration des Herstellers oder vertrauenswürdiger Dritter an (z. B. CIS Benchmarks). Das Anwenden eines `@Hardened:Database`-Tags auf dem Asset kann bedeuten, dass dieser Überprüfungs- und Härtungsprozess abgeschlossen wurde.",
      "check": "Wird die Datenbankkonfiguration regelmäßig überprüft und gegen eine Sicherheits-Baseline (wie CIS Benchmarks) gehärtet? Sind alle ungenutzten Funktionen und Schnittstellen deaktiviert? Wird eine starke Authentifizierung an allen administrativen Zugangspunkten erzwungen?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset vom Typ `database` ausgelöst, das nicht explizit als gehärtet markiert wurde. Das Fehlen eines `@Hardened:Database`-Tags wird als Indikator verwendet. Es wird angenommen, dass eine Datenbank ohne explizite Bestätigung unsichere Standardeinstellungen beibehalten könnte.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Kann auftreten, wenn die Datenbank in der Realität gehärtet ist, aber im Bedrohungsmodell nicht entsprechend getaggt wurde. Die Überprüfung erfordert die Prüfung der tatsächlichen Konfiguration der Datenbankinstanz."
    },
    "unchecked-or-malicious-database-scripts": {
      "title": "Ungeprüfte oder bösartige Datenbankskripte (BSI APP.4.3.A19)",
      "description": "Datenbankmanagementsysteme ermöglichen oft die Automatisierung von Aktionen über Skripte, die im Datenbankkontext ausgeführt werden (z. B. PL/SQL, Trigger). Wenn diese Skripte ohne ordnungsgemäße Überprüfung durch verantwortliches Personal verwendet werden, erfüllen sie möglicherweise nicht die Anforderungen der Institution.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu Datenmanipulation, unbefugter Datenoffenlegung oder einem Denial-of-Service für die Datenbank führen. Dies kompromittiert die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der gespeicherten Daten und kann zu erheblichen Geschäftsunterbrechungen, finanziellen Verlusten und Reputationsschäden führen.",
      "asvs": "BSI IT-Grundschutz APP.4.3.A19 Schutz vor schädlichen Datenbank-Skripten",
      "action": "Strenge Änderungskontrolle und sichere Programmierpraktiken für Datenbankskripte implementieren",
      "mitigation": "Etablieren Sie einen formellen Prozess für die Entwicklung, Überprüfung und Bereitstellung aller Datenbankskripte, einschließlich Stored Procedures, Trigger und automatisierter Jobs. Dieser Prozess sollte Peer-Reviews und Sicherheitstests umfassen, um Schwachstellen und Qualitätsprobleme zu identifizieren. Der Zugriff zum Erstellen oder Ändern dieser Skripte sollte stark eingeschränkt sein. Überwachen Sie regelmäßig auf unbefugte Änderungen an Datenbankschemata und Kernfunktionen. Stellen Sie sicher, dass Entwickler in sicheren Datenbank-Programmierpraktiken geschult sind.",
      "check": "Gibt es einen obligatorischen Code-Review-Prozess für alle Datenbankskripte? Sind die Berechtigungen zum Erstellen von Stored Procedures und Triggern auf autorisierte Administratoren beschränkt? Gibt es eine aktive Überwachung auf Änderungen an der Datenbank?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets des Typs ",
      "riskAssessment": "Die Auswirkung wird durch die höchsten Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit der Datenbank und der darin gespeicherten Daten bestimmt. Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Organisation robuste, out-of-band Kontrollen für die Verwaltung von Datenbankskripten hat (z. B. alle Datenbankänderungen werden über einen GitOps-Workflow mit obligatorischen Genehmigungen verwaltet), die nicht im Threagile-Modell abgebildet sind."
    },
    "unprotected-administrative-access": {
      "title": "Ungeschützter administrativer Zugriff",
      "description": "Um Laufzeitumgebungen, Knoten und Container-Plattformen wie Kubernetes zu verwalten, benötigen Administratoren und automatisierte Werkzeuge administrativen Zugriff.",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, administrative Kontrolle über die betroffene Komponente zu erlangen. Dies kann zu beliebiger Codeausführung führen, ",
      "asvs": "V14.2.1: Sichere Komponentenkonfiguration",
      "action": "Authentifizierung und Verschlüsselung auf administrativen Schnittstellen erzwingen",
      "mitigation": "Stellen Sie sicher, dass alle administrativen Zugangspunkte (Netzwerkports, APIs, Sockets) für Infrastrukturkomponenten (wie Kubernetes, Datenbanken, Anwendungsserver) ",
      "check": "Überprüfen Sie die Konfiguration aller relevanten Infrastrukturkomponenten. Sind alle administrativen Netzwerkports und APIs mit obligatorischer Authentifizierung konfiguriert?",
      "detectionLogic": "Diese Regel prüft auf eingehende Kommunikationsverbindungen, die für ",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Bewertung des Ziel-Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Ein hochwertiges Asset führt zu einer hohen oder sehr hohen Auswirkung.",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn die administrative Schnittstelle durch andere, nicht im Detail modellierte kompensierende Kontrollen geschützt ist, "
    },
    "stolen-kubernetes-access-token": {
      "title": "Gestohlenes Kubernetes-Zugriffstoken aus einem Pod",
      "description": "Pods benötigen oft Zugriffstoken (die mit einem Service Account verbunden sind), um mit dem Kubernetes API-Server (Control Plane) zu interagieren.",
      "impact": "Mit einem gestohlenen Token kann ein Angreifer authentifizierte Aktionen gegen die Control Plane durchführen.",
      "asvs": "OWASP Kubernetes Top 10: K01 - Unsichere Workload-Konfigurationen",
      "action": "Das Prinzip der geringsten Rechte auf Service Accounts und Pods anwenden",
      "mitigation": "Stellen Sie sicher, dass Kubernetes Service Accounts die minimal erforderlichen Berechtigungen haben (RBAC).",
      "check": "Überprüfen Sie die Berechtigungen aller Service Accounts. Sind sie zu freizügig? Haben Pods, die nicht ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Container (`machine: container`) ausgeführt wird und nicht die Container-Plattform selbst ist.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird bei individuell entwickelten Teilen als höher angesehen, da sie eine größere Angriffsfläche als Standardsoftware bieten.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn der spezifische Service Account, der vom Pod verwendet wird, überhaupt keine Berechtigungen hat oder wenn das Token nachweislich nicht innerhalb des Pods gemountet ist."
    },
    "pod-resource-exhaustion-on-node": {
      "title": "Ressourcenauslastung des Knotens durch einen Pod (Denial of Service)",
      "description": "Einzelne Pods (Container) können den Knoten (Host-System) oder die Orchestrierungsplattform überlasten, indem sie übermäßige Ressourcen wie CPU oder Speicher verbrauchen.",
      "impact": "Wenn ein Container alle verfügbaren Ressourcen auf einem Knoten verbraucht, kann dies dazu führen, dass der Knoten nicht mehr reagiert. Dies führt zu einem Denial of Service (DoS) für alle anderen Anwendungen und Dienste, die auf diesem Knoten gehostet werden.",
      "asvs": "V13.2.3: Stellen Sie sicher, dass Ressourcennutzungsgrenzen vorhanden sind, um Denial-of-Service-Angriffe zu verhindern, z. B. für CPU, Speicher, Anzahl der Threads oder Festplattenspeicher.",
      "action": "Ressourcenquoten und -limits für Container durchsetzen",
      "mitigation": "Definieren und erzwingen Sie Ressourcenanforderungen (requests) und -limits für CPU und Speicher in allen Container-Spezifikationen.",
      "check": "Überprüfen Sie die Container-Definitionen, um sicherzustellen, dass `resources.requests` und `resources.limits` für CPU und Speicher angegeben sind.",
      "detectionLogic": "Diese Regel iteriert durch alle ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Verfügbarkeitsanforderung eines jeden Assets bestimmt, das auf der gemeinsam genutzten Laufzeitumgebung ausgeführt wird. Ein Knoten, der unternehmenskritische Komponenten hostet, hat eine sehr hohe Auswirkung, wenn er ausfällt.",
      "falsePositives": "Ein Risiko kann gemeldet werden, wenn Ressourcenlimits durch einen clusterweiten Admission Controller oder eine Policy Engine durchgesetzt werden, die nicht über Tags im Threagile-Modell abgebildet ist."
    },
    "unauthorized-deployment-via-cicd-pipeline": {
      "title": "Unbefugte Bereitstellung oder Host-Kompromittierung über CI/CD-Pipeline",
      "description": "Die Automatisierung, die CI/CD-Pipelines innewohnt, erfordert, dass diesen Werkzeugen privilegierter Zugriff auf Bereitstellungsziele wie Container-Cluster gewährt wird. Dies schafft ein Risiko für unbefugte Änderungen. Beispielsweise könnte eine Anwendungsversion bereitgestellt werden, die nicht ausreichend getestet wurde oder den offiziellen Freigabeprozess umgangen hat. Darüber hinaus könnten Fehlkonfigurationen oder Schwachstellen in der CI/CD-Umgebung selbst es Malware ermöglichen, in den Cluster einzudringen, was zu Datenexfiltration, -änderung oder -löschung führen kann.",
      "impact": "Eine kompromittierte CI/CD-Pipeline kann zur Bereitstellung von bösartiger oder fehlerhafter Software führen, was potenziell zu Dienstunterbrechungen (Verfügbarkeit), Datenschutzverletzungen (Vertraulichkeit) oder Datenkorruption (Integrität) führen kann. Sie umgeht Qualitätssicherungs- und Sicherheitsschleusen und gibt einem Angreifer effektiv einen vertrauenswürdigen Weg in die Produktionsumgebung.",
      "asvs": "BSI IT-Grundschutz CON.6.A6 (Steuerung des Softwareentwicklungs- und Freigabeprozesses) und CON.6.A21 (Sichere Bereitstellung von Entwicklungsumgebungen)",
      "action": "CI/CD-Pipeline und Bereitstellungsprozess absichern",
      "mitigation": "Implementieren Sie das Prinzip der geringsten Rechte für CI/CD-Dienstkonten; sie sollten nur die für die Bereitstellung und Verwaltung von Anwendungen erforderlichen Berechtigungen haben, nicht volle Cluster-Admin-Rechte. Erzwingen Sie geschützte Branches und fordern Sie mehrere Genehmigungen für Merges in Release-Branches. Integrieren Sie Sicherheitsscans (SAST, DAST, SCA) in die Pipeline, um Schwachstellen vor der Bereitstellung zu erkennen. Überprüfen Sie regelmäßig die CI/CD-Konfigurationen, Zugriffsberechtigungen und Protokolle. Verwenden Sie signierte Commits und signierte Container-Images, um die Integrität des Codes und der Artefakte von der Entwicklung bis zur Bereitstellung sicherzustellen.",
      "check": "Sind die Berechtigungen für CI/CD-Dienstkonten minimiert? Gibt es obligatorische Überprüfungs-/Genehmigungsschritte für Produktionsbereitstellungen? Werden Container-Images auf Schwachstellen gescannt und ihre Signaturen vor der Bereitstellung überprüft? Werden die Zugriffsprotokolle der CI/CD-Umgebung auf verdächtige Aktivitäten überwacht?",
      "detectionLogic": "Dieses Risiko wird durch Kommunikationsverbindungen von entwicklungsrelevanten Assets (wie Build-Pipeline, Quellcode-Repository, Artefakt-Registry) zu Laufzeitumgebungen (wie Container-Plattform, Anwendungsserver, Webserver) ausgelöst. Die Existenz eines solchen Bereitstellungspfades bildet die Grundlage für dieses Risiko.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell erfasst möglicherweise keine fein abgestuften Berechtigungen oder kompensierende Kontrollen (wie obligatorische manuelle Genehmigungen, Image-Signierung usw.), die dieses Risiko mindern. Das Risiko sollte durch die Untersuchung der tatsächlichen CI/CD-Pipeline-Konfiguration und der RBAC-Richtlinien auf dem Zielcluster überprüft werden."
    },
    "unrestricted-container-communication": {
      "title": "Uneingeschränkte Container-Kommunikation (BSI CON.1.A21)",
      "description": "Alle Pods in einem Cluster können im Allgemeinen miteinander, mit den Knoten in ihrem eigenen Cluster und mit allen anderen IT-Systemen kommunizieren.",
      "impact": "Wenn die Kommunikation zwischen containerisierten Assets nicht eingeschränkt ist, kann ein einzelner kompromittierter Container für laterale Bewegungen genutzt werden, um andere Container, die zugrunde liegenden Host-Knoten oder sogar den Cluster anzugreifen.",
      "asvs": "BSI IT-Grundschutz CON.1.A21 (Einschränkung des Netzwerkzugriffs für Container)",
      "action": "Netzwerksegmentierung für Container implementieren",
      "mitigation": "Erzwingen Sie eine fein abgestufte Netzwerksegmentierung zwischen containerisierten Assets mithilfe von Technologien wie Kubernetes Network Policies, Istio Authorization Policies oder anderen Service-Mesh-/CNI-Funktionen.",
      "check": "Befinden sich alle Container-Assets innerhalb einer Vertrauensgrenze vom Typ ",
      "detectionLogic": "Diese Regel identifiziert technische Assets vom Maschinentyp ",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Netzwerksegmentierung mit Mitteln erreicht wird, die nicht im Modell dargestellt sind, wie z. B. ein Service Mesh mit strengen mTLS-Autorisierungsrichtlinien, das nicht mit dedizierten Vertrauensgrenzen modelliert ist, oder eine strikte hostbasierte Firewall auf den Knoten."
    },
    "missing-sap-authorization-check": {
      "title": "Fehlende SAP-Berechtigungsprüfung in benutzerdefiniertem Code",
      "description": "In SAP-Systemen werden Berechtigungen nur geprüft, wenn Entwickler eine explizite Berechtigungsprüfung (z.B. `AUTHORITY-CHECK` in ABAP) im Programmcode implementieren. Ohne eine solche Prüfung verifiziert das System nicht, ob ein Benutzer wirklich berechtigt ist, eine Aktion durchzuführen. In eigenentwickeltem Code werden diese wesentlichen Sicherheitsprüfungen häufig vergessen.",
      "impact": "Dieses Versäumnis umgeht das gesamte SAP-Berechtigungskonzept und ermöglicht es unbefugten Benutzern, auf im SAP-System gespeicherte Daten zuzugreifen, diese zu ändern oder zu löschen. Dies kann zu schweren Compliance-Verstößen, Datenschutzverletzungen und erheblichen negativen Feststellungen bei Finanz- oder Sicherheitsprüfungen führen.",
      "asvs": "V4.1.1: Überprüfen Sie, dass die Anwendung bei jeder Anfrage von einer vertrauenswürdigen Quelle Zugriffskontrollregeln durchsetzt, außer bei öffentlichen Ressourcen.",
      "action": "Berechtigungsprüfungen in benutzerdefiniertem Code erzwingen",
      "mitigation": "Stellen Sie sicher, dass alle eigenentwickelten SAP-Programme und -Funktionen, die sensible Daten verarbeiten oder kritische Aktionen durchführen, explizite Berechtigungsprüfungen enthalten. Verwenden Sie für ABAP konfigurierte statische Anwendungssicherheitstests (SAST), um fehlende Prüfungen zu finden. Führen Sie regelmäßige Code-Reviews mit Fokus auf die Zugriffskontrolle durch. Machen Sie Entwicklerschulungen zu sicheren SAP-Entwicklungspraktiken, einschließlich der korrekten Verwendung des Berechtigungskonzepts, zur Pflicht.",
      "check": "Gibt es Prozesse (wie obligatorische SAST-Scans oder Peer-Reviews), um zu überprüfen, ob benutzerdefinierter SAP-Code die notwendigen Berechtigungsprüfungen enthält, bevor er bereitgestellt wird? Sind Entwickler ausreichend in den sicheren SAP-Programmierstandards geschult?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als eigenentwickeltes Teil (`custom_developed_parts: true`) gekennzeichnet und mit einer Technologie ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird für jede benutzerdefinierte SAP-Komponente als hoch angesehen, da dies ein sehr häufiger und bekannter Entwicklungsfehler ist. Die Auswirkung ist direkt proportional zur Vertraulichkeit und Integrität der von der Komponente verarbeiteten Daten-Assets. Eine fehlende Prüfung bei einer Komponente, die Finanzdaten verarbeitet (",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn die benutzerdefinierte Komponente keine sensiblen Aktionen durchführt oder auf geschützte Daten zugreift, oder wenn es sich um einen einfachen Wrapper handelt, der alle Aktionen an standardmäßige, sichere SAP-Transaktionen delegiert, die ordnungsgemäße Prüfungen haben. Manuelle Überprüfung des Codes."
    },
    "bypass-sap-security-via-custom-abap": {
      "title": "Umgehung von SAP-Sicherheitsmechanismen durch benutzerdefinierten ABAP-Code",
      "description": "SAP-Systeme enthalten oft unternehmenskritische Informationen, die durch verschiedene standardmäßige Sicherheitsmechanismen geschützt sind.",
      "impact": "Fehlerhafte benutzerdefinierte ABAP-Programme können zu unbefugter Manipulation (Manipulation) kritischer Daten oder zur Exfiltration (Informationsweitergabe) führen.",
      "asvs": "ASVS V4.1.1: Überprüfen Sie, dass die Anwendung Zugriffskontrollregeln auf einer vertrauenswürdigen Dienstschicht durchsetzt, insbesondere wenn clientseitige Zugriffskontrolle vorhanden ist und umgangen werden könnte.",
      "action": "Sichere Code-Prüfung und statische/dynamische Analyse für benutzerdefinierte ABAP-Entwicklungen",
      "mitigation": "Alle benutzerdefinierten ABAP-Codes müssen vor der Bereitstellung in Produktionsumgebungen einer obligatorischen und strengen Sicherheitsüberprüfung unterzogen werden.",
      "check": "Gibt es einen formellen, durchgesetzten Prozess zur Überprüfung aller benutzerdefinierten ABAP-Codes auf Sicherheitslücken vor der Bereitstellung? Werden SAST/DAST-Werkzeuge für die ABAP-Analyse eingesetzt? Erhalten Entwickler spezifische Schulungen zur sicheren ABAP-Programmierung?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als ERP-System identifiziert (oder mit ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als hoch angesehen, wenn benutzerdefinierter ABAP-Code vorhanden ist, da das Potenzial für menschliche Fehler oder mangelndes Sicherheitsbewusstsein während der Entwicklung erheblich ist.",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn das `customDevelopedParts`-Flag gesetzt ist, der benutzerdefinierte Code jedoch nachweislich nicht sicherheitsrelevant oder minimal ist oder bereits einer gründlichen und dokumentierten Sicherheitsprüfung unterzogen wurde, die seine Robustheit gegen gängige ABAP-Schwachstellen bestätigt."
    },
    "injection-vulnerability-in-custom-code": {
      "title": "Injection-Schwachstelle in eigenentwickeltem Code (BSI-basiert)",
      "description": "Injection-Schwachstellen entstehen, wenn Angreifer Steuerzeichen oder Befehle in eine Anwendung einschleusen können, oft über Dateneingabefelder.",
      "impact": "Ein erfolgreicher Injection-Angriff kann zu einer vollständigen Systemkompromittierung, unbefugtem Datenzugriff (Vertraulichkeit), Datenänderung (Integrität) oder einem Denial-of-Service (Verfügbarkeit) führen.",
      "asvs": "V5 Eingabevalidierung und -kodierung",
      "action": "Robuste Eingabevalidierung implementieren und sichere APIs verwenden",
      "mitigation": "Behandeln Sie alle Eingaben aus externen Quellen als nicht vertrauenswürdig. Implementieren Sie eine starke, auf einer Positivliste basierende Eingabevalidierung für alle Daten.",
      "check": "Werden alle externen Eingaben gegen ein strenges Schema oder eine Positivliste validiert? Wird für alle Datenbankinteraktionen eine parametrisierte Abfrage-API verwendet?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen, eigenentwickelten technischen Assets ausgelöst, die potenziell komplexe Datenformate (wie JSON, XML, Dateien) akzeptieren.",
      "riskAssessment": "Die Wahrscheinlichkeit dieser Schwachstelle ist in eigenentwickeltem Code signifikant. Sie steigt, wenn das Asset eine Webanwendung oder ein Dienst ist, der mit einer Datenbank kommuniziert.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Anwendung mit einem modernen, sicheren Framework erstellt wurde, das einen starken Standardschutz gegen Injection-Fehler bietet (z. B. ORMs mit nicht verketteten Abfragen, Template-Engines mit automatischer Maskierung), und diese Architekturentscheidung n@SystemType:OT im Modell erfasst ist."
    },
    "bypass-of-sap-security-in-custom-code": {
      "title": "Umgehung der Standard-SAP-Sicherheit in benutzerdefiniertem ABAP-Code (BSI APP.4.6)",
      "description": "Standard-SAP-Systeme (und andere ERPs) bieten verschiedene Datenschutzmechanismen wie Mandantentrennung, Identitäts- und Zugriffsmanagement (IAM) und Rollen/Berechtigungen.",
      "impact": "Die Umgehung dieser Kontrollen kann zu schweren Sicherheitsvorfällen führen, einschließlich unbefugtem Zugriff über Geschäftsmandanten hinweg (in mandantenfähigen Umgebungen), Privilegienerweiterung, Datenmanipulation und Informationsweitergabe.",
      "asvs": "BSI IT-Grundschutz APP.4.6 SAP ABAP-Programmierung, z.B. A1–A4, A6, A9, A10, A12, A20; OWASP Top 10 2021: A01-Broken Access Control",
      "action": "Sichere Code-Prüfung und statische Analyse für benutzerdefinierten ABAP-Code",
      "mitigation": "Erzwingen Sie obligatorische, sicherheitsorientierte Code-Reviews für alle benutzerdefinierten Entwicklungen und Änderungen.",
      "check": "Unterliegen alle benutzerdefinierten Entwicklungen vor der Bereitstellung einer Sicherheits-Code-Prüfung? Ist ein SAST-Tool in den Entwicklungslebenszyklus für das ERP integriert?",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes im Geltungsbereich befindliche technische Asset vom Technologietyp ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird für jeden benutzerdefinierten Code in einem ERP-System als hoch angesehen, da Entwicklerfehler oder Versehen in komplexen Berechtigungslandschaften häufig sind.",
      "falsePositives": "Kann auftreten, wenn der benutzerdefinierte Code trivial ist und nicht mit Berechtigungsprüfungen oder Datenzugriffslogik interagiert."
    },
    "insufficient-exchange-outlook-regulations": {
      "title": "Unzureichende Regelungen für Exchange und Outlook (BSI APP.5.2)",
      "description": "Übergreifende Regelungen und Spezifikationen für Exchange und Outlook sind notwendig, um die Sicherheit der von ihnen verarbeiteten Informationen zu gewährleisten.",
      "impact": "Ein Mangel an klaren Sicherheitsregelungen für das Mailsystem kann zu Fehlkonfigurationen führen, die die Vertraulichkeit, Integrität oder Verfügbarkeit von E-Mail-Daten gefährden.",
      "asvs": "BSI IT-Grundschutz: APP.5.2 Microsoft Exchange und Outlook",
      "action": "Sicherheitsrichtlinien für das Mailsystem definieren und durchsetzen",
      "mitigation": "Etablieren und erzwingen Sie umfassende Sicherheitsrichtlinien für den gesamten Lebenszyklus der Exchange/Outlook-Umgebung. Dies muss Folgendes umfassen:",
      "check": "Sind Client-zu-Server-Verbindungen für Maildienste immer verschlüsselt und authentifiziert? Ist die Verbindung vom Mailserver zum Identitätsanbieter (z. B. Active Directory) verschlüsselt?",
      "detectionLogic": "Dieses Risiko wird durch die Erkennung spezifischer technischer Fehlkonfigurationen identifiziert, die auf einen Mangel an übergreifender Sicherheitsrichtlinie für das Mailsystem hinweisen. Die Regel prüft auf:",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn Klartextprotokolle oder fehlende Authentifizierung für sensible Zugriffe verwendet werden. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität der über den unsicheren Kanal übertragenen Daten und der Kritikalität des Mailservers selbst. Beispielsweise unverschlüsselter Zugriff auf einen Mailserver, der ",
      "falsePositives": "Die Regel könnte Verbindungen innerhalb eines hochsicheren, physisch isolierten Netzwerksegments kennzeichnen, in dem Verschlüsselung per Richtlinie als unnötig erachtet wird. Dies ist jedoch im Allgemeinen keine empfohlene Praxis. Solche Fälle sollten überprüft, begründet und formell akzeptiert werden."
    },
    "faulty-exchange-migration": {
      "title": "Fehlerhafte Exchange-Migration",
      "description": "Exchange-Systeme werden oft migriert anstatt neu installiert. Ein Upgrade auf eine neue Version kann ein Betriebssystem-Upgrade erfordern, was sich auf das bestehende Domänendesign und die Verzeichnisdienste auswirken kann.",
      "impact": "Eine fehlerhafte Migration kann die Produktivität durch die Unterbrechung von Maildiensten erheblich reduzieren. Fehlkonfigurationen bei der Authentifizierung, Verschlüsselung oder allgemeinen Einstellungen können zu Integritätsproblemen, unbefugtem Zugriff und Informationsweitergabe führen und die Vertraulichkeit, Integrität und Verfügbarkeit der vom Server abgewickelten Kommunikation gefährden.",
      "asvs": "BSI IT-Grundschutz: OPS.1.1.5 Change Management, SYS.3.2.1 Mailserver",
      "action": "Einen sicheren, getesteten Migrationsprozess implementieren",
      "mitigation": "Entwickeln Sie einen umfassenden Migrationsplan, der alle Abhängigkeiten (Betriebssystem, Verzeichnisdienste) berücksichtigt.",
      "check": "Gibt es einen dokumentierten Migrationsplan, der Test- und Rollback-Verfahren enthält?",
      "detectionLogic": "Diese Regel kennzeichnet jedes technische Asset mit dem ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird auf ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein ausgereifter und robuster, aber nicht modellierter, Change-Management- und Migrationsprozess existiert."
    },
    "insecure-mail-server-web-access-bsi-app-3-2": {
      "title": "Unsicherer Web-Zugriff auf Mail-Server (BSI APP.3.2)",
      "description": "Wenn Benutzer über einen Browser auf ihre E-Mail-Konten zugreifen können, werden oft Komponenten wie die Internet Information Services (IIS) verwendet. Wenn diese Funktion unsachgemäß geplant und falsch konfiguriert ist, kann dies potenziell zu unkontrolliertem Zugriff auf das interne Netzwerk von außen führen und ein erhebliches Sicherheitsrisiko darstellen.",
      "impact": "Wenn E-Mails über das Internet mit einem Browser abgerufen werden, birgt dies ein großes Gefahrenpotenzial. Ohne direkten Zugriff auf die Institution",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein APP.3.2 Exchange Server und Outlook Web Access. Relevante OWASP ASVS-Kapitel umfassen V4 (Konfiguration) und V14 (Zugriffskontrolle).",
      "action": "Sichere Konfiguration und Härtung von web-zugänglichen Mail-Komponenten",
      "mitigation": "Härten Sie den Webserver (z. B. IIS) und den Mailserver.",
      "check": "Ist der Webserver, der den Mail-Zugriff bereitstellt, ordnungsgemäß gehärtet und gepatcht? Befindet er sich in einer DMZ? Ist der Zugriff durch starke Authentifizierung geschützt und über HTTPS verschlüsselt? Wird eine WAF verwendet?",
      "detectionLogic": "Dieses Risiko wird ausgelöst, wenn ein technisches Asset, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn eine unverschlüsselte Verbindung verwendet wird oder wenn das exponierte Asset sich n@SystemType:OT innerhalb einer gut gesicherten Vertrauensgrenze (wie einer DMZ) befindet. Die Auswirkung wird durch die Vertraulichkeits- und Integritätsanforderungen der vom Mailserver verarbeiteten Daten bestimmt, die aufgrund der sensiblen Natur der E-Mail-Kommunikation typischerweise hoch bis sehr hoch sind.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn kompensierende Kontrollen wie eine Web Application Firewall (WAF), eine strikte Netzwerksegmentierung (DMZ) und eine obligatorische Multi-Faktor-Authentifizierung vorhanden sind, aber n@SystemType:OT vollständig im Bedrohungsmodell dargestellt sind."
    },
    "improper-foreign-system-connection-to-exchange": {
      "title": "Unsachgemäße Anbindung von Drittsystemen an den Exchange Server",
      "description": "Microsoft Exchange-Systeme sind eng in das Windows-Betriebssystem integriert und verwenden oft Konnektoren, um mit Drittsystemen zu interagieren. Diese Konnektoren ermöglichen es anderen E-Mail-Systemen, E-Mails über Standardprotokolle wie SMTP, POP3 oder IMAP zu senden oder abzurufen. Aus diesen Integrationen ergeben sich jedoch mehrere Risiken.",
      "impact": "Wenn Drittsysteme unsicher an einen Exchange-Server angebunden sind, kann dies zum Verlust der Vertraulichkeit und Integrität von E-Mails und anderen sensiblen Daten führen. Angreifer könnten über unverschlüsselte Verbindungen übertragene E-Mails abfangen, lesen oder verändern. Fehlende ordnungsgemäße Authentifizierung kann es unbefugten Systemen ermöglichen, sich zu verbinden. Dies kann auch zu einem Denial-of-Service führen, der das Mailsystem blockiert und die kritische Geschäftskommunikation stört. Insgesamt kann dies zu Datenschutzverletzungen, finanziellen Verlusten und Reputationsschäden führen.",
      "asvs": "BSI IT-Grundschutz APP.4.2.A11 Anbindung von Fremdsystemen an den Exchange Server",
      "action": "Konnektoren von Drittsystemen sicher konfigurieren und verwalten",
      "mitigation": "Stellen Sie sicher, dass alle Konnektoren zu Drittsystemen dokumentiert, aktiv verwaltet und auf Kompatibilität mit der aktuellen Exchange-Version überprüft werden, insbesondere nach Migrationen. Erzwingen Sie starke Sicherheitseinstellungen für alle Verbindungen zu externen Systemen, einschließlich der obligatorischen Verwendung von verschlüsselten Protokollen (z. B. SMTPS, POP3S, IMAPS mit STARTTLS) und robusten Authentifizierungsmechanismen. Vermeiden Sie die Verwendung unverschlüsselter Protokolle oder anonymen Zugriffs. Die Verwaltung der angebundenen Systeme sollte konsistent sein und derselben Sicherheitsbaseline folgen. Überprüfen Sie diese Verbindungen regelmäßig auf Einhaltung der Sicherheitsrichtlinien.",
      "check": "Sind alle Verbindungen zu Drittsystemen vom Exchange-Server dokumentiert? Wird die Verwendung von verschlüsselten Protokollen und starker Authentifizierung für alle externen Mail-Verbindungen erzwungen? Wurde die Kompatibilität aller Konnektoren überprüft? Gibt es regelmäßige Audits dieser externen Verbindungssicherheitseinstellungen?",
      "detectionLogic": "Diese Regel prüft technische Assets, die als Microsoft Exchange-Server identifiziert wurden (über den Technologietyp ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn unverschlüsselte Protokolle verwendet werden, da dies triviale Abhör- oder Manipulationsangriffe ermöglicht. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität (CIA-Bewertungen) des Exchange-Servers und der von ihm verarbeiteten Daten-Assets (E-Mails). Ein unternehmenskritischer Exchange-Server, der streng vertrauliche Daten verarbeitet, führt zu einer sehr hohen Auswirkung.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das verbundene "
    },
    "excessive-permissions-on-mail-server": {
      "title": "Übermäßige Berechtigungen auf dem Mail-Server (basierend auf BSI APP.5.2)",
      "description": "Wenn Zugriffsrechte für einen E-Mail-Client oder auf Daten, die auf einem E-Mail-Server (z. B. Exchange) gespeichert sind, unsachgemäß erstellt oder verwaltet werden, können erhebliche Sicherheitslücken entstehen. Dies gilt insbesondere, wenn Berechtigungen den notwendigen Umfang überschreiten (Verletzung des Prinzips der geringsten Rechte) und potenziell unbefugten Personen den Zugriff, die Änderung oder das Löschen sensibler Informationen ermöglichen.",
      "impact": "Die primäre Auswirkung ist die unbefugte Offenlegung vertraulicher Informationen (Verlust der Vertraulichkeit). Es kann auch zu Datenmanipulation (Verlust der Integrität) oder unbefugtem Löschen von E-Mails/Postfächern (Verlust der Verfügbarkeit) führen. Dies kann zu Datenschutzverletzungen, Nichteinhaltung von Datenschutzvorschriften (wie @DataType:PII) und Reputationsschäden führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein APP.5.2 ",
      "action": "Prinzip der geringsten Rechte für Postfach- und Datenzugriff durchsetzen",
      "mitigation": "Implementieren Sie ein strenges, rollenbasiertes Zugriffskontrollmodell (RBAC) für alle mailbezogenen Daten. Zugriffsberechtigungen müssen auf Basis des ",
      "check": "Gibt es ein dokumentiertes RBAC-Modell für den Mail-Server? Werden Berechtigungen regelmäßig überprüft? Wird der Zugriff auf Basis von dokumentierten und genehmigten Anfragen gewährt? Wird die Identität des Endbenutzers für Berechtigungsprüfungen anstelle von generischen Dienstkonten verwendet?",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein technisches Asset vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeit und Integrität der Daten-Assets bestimmt, die an den Mail-Server gesendet oder von ihm empfangen werden. Wenn hochsensible Daten betroffen sind, ist die Auswirkung hoch. Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein kompensierender Zugriffskontrollmechanismus außerhalb des modellierten Systems existiert, wie z. B. ein ausgeklügeltes Berechtigungssystem innerhalb der Mail-Server-Anwendung selbst, das nicht durch das "
    },
    "incorrect-email-client-configuration": {
      "title": "Falsche E-Mail-Client-Konfiguration (in Anlehnung an BSI APP.5.2)",
      "description": "Der E-Mail-Client (z. B. Outlook) ist ein entscheidender Teil eines Exchange-basierten E-Mail-Systems. Für die Sicherheit des gesamten Systems müssen die Clients korrekt konfiguriert sein. Die Wahl eines ungeeigneten Kommunikationsprotokolls kann schwerwiegende Sicherheitsschwächen einführen. Eine Fehlkonfiguration kann Probleme wie einen Verlust der Vertraulichkeit durch unbefugten Zugriff verursachen und die Verschlüsselung auf Netzwerkebene (z. B. TLS) unwirksam machen.",
      "impact": "Wenn ein E-Mail-Client unverschlüsselte Protokolle zur Kommunikation mit dem Mail-Server verwendet, können alle übertragenen Daten, einschließlich Anmeldeinformationen und E-Mail-Inhalte, von einem Angreifer im Netzwerk abgefangen und gelesen werden. Dies führt zu einem direkten Verlust der Vertraulichkeit und kann weitere Angriffe wie Kontoübernahme und Identitätsdiebstahl ermöglichen.",
      "asvs": "BSI IT-Grundschutz APP.5.2 Microsoft Exchange und Outlook",
      "action": "Sichere Konfigurationsstandards für Outlook/E-Mail-Clients durchsetzen",
      "mitigation": "Definieren und erzwingen Sie sichere Konfigurations-Baselines für alle Outlook/E-Mail-Clients. Dies muss die obligatorische Verwendung von verschlüsselten Kommunikationsprotokollen (z. B. IMAPS, SMTP mit STARTTLS, POP3S) für alle Verbindungen zum Exchange/Mail-Server umfassen. Verwenden Sie Konfigurationsmanagement-Tools (z. B. GPO, MDM/Intune), um diese Einstellungen bereitzustellen und zu sperren. Blockieren Sie unverschlüsselte E-Mail-Protokolle auf Netzwerk- oder Mail-Server-Ebene, wo immer möglich. Wenn clientseitige Verschlüsselung (z. B. S/MIME) verwendet wird, stellen Sie die sichere Speicherung und Handhabung privater Schlüssel auf dem Client-Gerät sicher.",
      "check": "Werden Client-Konfigurationen zentral verwaltet? Ist die Verwendung von unverschlüsselten E-Mail-Protokollen blockiert oder wird sie überwacht? Sind alle Kommunikationsverbindungen von Clients zu Exchange/Mail-Servern so konfiguriert, dass sie Verschlüsselung (TLS) verwenden?",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die als Clients (z. B. Desktop, mobile App) identifiziert wurden und mit einem Mail-Server kommunizieren. Sie löst ein Risiko aus, wenn die Kommunikationsverbindung zwischen ihnen ein unverschlüsseltes E-Mail-Protokoll (SMTP, IMAP, POP3) anstelle seiner sicheren, TLS-umschlossenen Variante verwendet.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist sehr hoch, wenn unverschlüsselte Protokolle verwendet werden, da das Abhören von Netzwerkverkehr ein Standard-Angriffsvektor ist. Die Auswirkung hängt direkt von der Sensibilität der per E-Mail übertragenen Daten ab. Wenn Daten-Assets mit ",
      "falsePositives": "Dieses Risiko ist unwahrscheinlich ein Fehlalarm, wenn die Bedingungen erfüllt sind. Eine mögliche Ausnahme könnte ein Szenario sein, in dem die Verbindung vollständig in einem physisch sicheren, vertrauenswürdigen Netzwerksegment enthalten ist, in dem das Abhören keine glaubwürdige Bedrohung darstellt, oder wenn eine andere kompensierende Kontrolle wie ein obligatorisches, systemweites VPN für alle Client-Verbindungen strikt durchgesetzt wird (was mit dem "
    },
    "abuse-of-api-and-macros": {
      "title": "Missbrauch von APIs und Makros in Outlook (BSI-basiert)",
      "description": "Viele Softwareprodukte, einschließlich Outlook, bieten Anwendungsprogrammierschnittstellen (APIs) und Makrofunktionen, um die Funktionalität zu erweitern oder sich in andere Programme zu integrieren.",
      "impact": "Eine erfolgreiche Ausnutzung kann zur unbefugten Offenlegung (Vertraulichkeit), Änderung (Integrität) oder Löschung (Verfügbarkeit) von Daten führen.",
      "asvs": "BSI-Modul: APP.5.2 Microsoft Exchange und Outlook",
      "action": "API- und Makroausführung härten und einschränken",
      "mitigation": "Deaktivieren Sie APIs und Makroausführung standardmäßig, wo sie nicht für geschäftskritische Funktionen erforderlich sind.",
      "check": "Sind Makro- und Skripting-Funktionen standardmäßig auf Endbenutzersystemen deaktiviert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets generiert, die leistungsstarke, potenziell missbrauchbare Skripting- oder Makrofunktionalitäten unterstützen, insbesondere solche mit eigenentwickelten Teilen oder die sensible Daten verarbeiten.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist bei allgemeinen Client-Systemen (Desktops, Browser) und Anwendungen mit benutzerdefinierten Erweiterungen höher.",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn das Asset über starke, im Modell unsichtbare kompensierende Kontrollen verfügt, wie z. B. eine obligatorische, durchgesetzte Codesignierungsrichtlinie für alle Skripte und eine robuste EDR-Lösung, die nicht im Bedrohungsmodell dokumentiert sind."
    },
    "unsuitable-software-selection": {
      "title": "Ungeeignete Softwareauswahl (basierend auf BSI APP.6, Abschnitt 2.1)",
      "description": "Für verschiedene Anwendungen und Zwecke stehen viele unterschiedliche Softwarelösungen zur Verfügung. Wenn eine ungeeignete Software ausgewählt wird, die nicht den Anforderungen der Organisation entspricht",
      "impact": "Insbesondere wenn die Software die Anforderungen der Organisation nicht erfüllt",
      "asvs": "V4.0.3-2.1.1, V4.0.3-2.1.2, V4.0.3-4.1.1",
      "action": "Softwarebewertung und -beschaffung formalisieren",
      "mitigation": "Etablieren Sie einen formellen Softwarebeschaffungs- und -bewertungsprozess. Definieren Sie klare Sicherheitsanforderungen für alle neuen Softwareprodukte, basierend auf dem beabsichtigten Anwendungsfall, der Einsatzumgebung und der Sensibilität der Daten, die sie verarbeiten werden. Überprüfen Sie vor der Bereitstellung, ob die Software diese Anforderungen erfüllt, insbesondere in Bezug auf Authentifizierung, Zugriffskontrolle, Datenverschlüsselung und Protokollierung. Stellen Sie bei internetfähigen Systemen oder Diensten, die sensible Daten verarbeiten, sicher, dass eine starke Authentifizierung auf allen exponierten Schnittstellen erzwungen wird.",
      "check": "Gibt es einen formellen Prozess zur Bewertung der Sicherheit neuer Software? Werden Sicherheitsanforderungen für Authentifizierung und Zugriffskontrolle vor der Bereitstellung überprüft? Sind alle Kommunikationsverbindungen zu sensiblen Komponenten ordnungsgemäß authentifiziert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Ziele unauthentifizierter Kommunikation sind, insbesondere wenn diese Verbindungen Vertrauensgrenzen überschreiten oder aus dem Internet stammen. Die Regel identifiziert Assets (wie Webanwendungen, Dienste oder Datenbanken), denen eine Authentifizierung bei eingehenden Datenflüssen fehlt, was ein Zeichen dafür ist, dass die Software für ihren Einsatzkontext ungeeignet ist.",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeits- und Integritätsanforderungen der vom anfälligen Asset verarbeiteten oder gespeicherten Daten bestimmt. Eine höhere Datenklassifizierung führt zu einer höheren Auswirkung. Die Wahrscheinlichkeit wird für Assets, die dem Internet ausgesetzt sind, als höher angesehen als für solche, die nur in einem internen Netzwerk zugänglich sind. Der Gesamtschweregrad ist eine Kombination aus dieser berechneten Auswirkung und Wahrscheinlichkeit.",
      "falsePositives": "Ein Risiko kann ein Fehlalarm sein, wenn andere kompensierende Kontrollen existieren, die nicht modelliert sind, wie z. B. eine Web Application Firewall (WAF) oder ein Reverse-Proxy, der die Authentifizierung erzwingt, bevor der Datenverkehr das Ziel-Asset erreicht."
    },
    "misconfiguration-information-disclosure": {
      "title": "Informationsweitergabe durch fehlkonfigurierte Software (BSI APP.6)",
      "description": "Wenn Software unsicher konfiguriert oder mit unnötigen Funktionen aktiviert ist, können sensible Informationen unbeabsichtigt preisgegeben werden.",
      "impact": "Die Offenlegung sensibler oder personenbezogener Daten (z. B. @DataType:PII) kann zu finanziellen Verlusten, behördlichen Strafen und Reputationsschäden führen, ",
      "asvs": "BSI IT-Grundschutz APP.6 (insb. 2.2 Offenlegung durch fehlerhafte Konfiguration) und CON.1 A15 (Sichere Basiskonfiguration); OWASP ASVS V19: Konfiguration.",
      "action": "Softwarekonfigurationen härten und unnötige Funktionen deaktivieren",
      "mitigation": "Etablieren Sie gehärtete Baselines pro Komponente und Herstelleranleitung; deaktivieren Sie unnötige Dienste, Funktionen und Ports; wenden Sie das Prinzip der geringsten Funktionalität und der geringsten Rechte an; ",
      "check": "Sind sichere Baselines definiert und werden sie überprüft? Sind unnötige Funktionen/Dienste standardmäßig deaktiviert? Wird Konfigurationsdrift mit Warnungen überwacht?",
      "detectionLogic": "Diese Regel kennzeichnet Assets, die (1) Datenspeicher mit Vertraulichkeit ≥ Eingeschränkt sind und über eine Vertrauensgrenze, ins Internet oder zu einer ExternalEntity kommunizieren — ",
      "riskAssessment": "Die Auswirkung skaliert mit der höchsten Vertraulichkeit und Integrität des betroffenen Assets. Die Wahrscheinlichkeit steigt bei eigenentwickelten Teilen und bei Assets mit ausgehenden Verbindungen ",
      "falsePositives": "Verbindungen zu externen Parteien können beabsichtigt und streng kontrolliert sein (z. B. verschlüsselte, verwaltete Replikation, gut auditierte, DLP-genehmigte Exporte)."
    },
    "software-from-unreliable-sources": {
      "title": "Software aus unzuverlässigen Quellen (BSI CON.3.A13)",
      "description": "Wenn Software aus unzuverlässigen Quellen bezogen wird, kann nicht garantiert werden, dass eine unveränderte, originale Version verwendet wird.",
      "impact": "Die Installation kompromittierter Software kann die Integrität und Verfügbarkeit von IT-Systemen beeinträchtigen, was zu Systemausfällen, Datenbeschädigung oder der Ausführung bösartiger Funktionen führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Kompendium CON.3, Anforderung A13 ",
      "action": "Richtlinien für den Erwerb von vertrauenswürdiger Software und die Integritätsprüfung festlegen und durchsetzen",
      "mitigation": "Definieren und erzwingen Sie strenge Richtlinien für den Softwareerwerb, die Installationen nur aus geprüften, vertrauenswürdigen Quellen erlauben (z. B. offizielle Herstellerseiten, kuratierte interne Artefakt-Repositories).",
      "check": "Gibt es eine definierte Richtlinie für vertrauenswürdige Softwarequellen? Werden alle Softwarekomponenten, einschließlich Abhängigkeiten und Bibliotheken, aus verifizierten Quellen bezogen? Gibt es einen Prozess zur Überprüfung der Integrität neuer Software vor der Bereitstellung (z. B. Signaturprüfung)? Wird für eigenentwickelte Komponenten eine sichere Software-Lieferkette (z. B. CI/CD-Pipeline mit einem Artefakt-Repository) verwendet?",
      "detectionLogic": "Dieses Risiko wird für eigenentwickelte technische Assets ausgelöst, die Code ausführen, aber anscheinend nicht aus einer kontrollierten Software-Lieferkette stammen.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell repräsentiert möglicherweise nicht die gesamte Software-Lieferkette. Eine Organisation könnte starke Offline-Prozesse zur Überprüfung und Bereitstellung von Software haben, die nicht als explizite Datenflüsse modelliert sind. Dieses Risiko sollte durch Überprüfung der tatsächlichen Softwareentwicklungs-, Abhängigkeitsmanagement- und Bereitstellungsprozesse bestätigt werden."
    },
    "@Maintenance:Unmaintained-dependencies": {
      "title": "@Maintenance:Ungepflegte Abhängigkeiten oder Komponenten",
      "description": "Sicherheitslücken und Softwareschwächen können während des gesamten Software-Lebenszyklus entdeckt werden. Dies kann die Informationssicherheit der mit der Software verarbeiteten Daten gefährden, indem beispielsweise Anmeldefunktionen umgangen oder Verschlüsselungen gebrochen werden können. Sicherheitslücken und Schwachstellen können nicht zeitnah behoben werden, wenn kein geeigneter Wartungsvertrag mit dem Hersteller oder Lieferanten abgeschlossen wurde oder wenn die Software einfach über den Wartungszeitraum hinaus verwendet wird. Verstöße gegen die Lizenzbedingungen können ebenfalls dazu führen, dass (Auto-)Update-Mechanismen deaktiviert werden und die Software somit nicht mehr gewartet wird.",
      "impact": "Wenn @Maintenance:Ungepflegte Komponenten mit bekannten Schwachstellen verwendet werden, können Angreifer diese ausnutzen, um die Vertraulichkeit, Integrität oder Verfügbarkeit des gesamten Systems oder der damit verarbeiteten Daten zu kompromittieren. Dies kann zu einer vollständigen Übernahme der Komponente, zu Datenschutzverletzungen oder zu Dienstausfällen führen.",
      "asvs": "V14.2.1",
      "action": "Anfällige Komponente patchen oder aktualisieren",
      "mitigation": "Etablieren Sie einen Prozess zur Verwaltung von Drittanbieter- und Open-Source-Komponenten, einschließlich der Führung eines vollständigen Inventars (z. B. einer Software Bill of Materials (SBOM)). Verwenden Sie Werkzeuge zur Software Composition Analysis (SCA), um regelmäßig nach bekannten Schwachstellen in allen Abhängigkeiten zu suchen. Stellen Sie sicher, dass für alle kommerziellen Softwareprodukte ein aktiver Wartungs- und Supportvertrag besteht. Komponenten, die das Ende ihrer Lebensdauer erreicht haben (d.h., ",
      "check": "Sind alle Drittanbieterkomponenten und ihre Versionen inventarisiert? Gibt es einen automatisierten Prozess (SCA) zum Scannen nach anfälligen Abhängigkeiten? Gibt es ein dokumentiertes Verfahren zum Patchen oder Ersetzen von anfälligen oder @Maintenance:Ungepflegten Komponenten?",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset ausgelöst, das explizit mit dem Tag ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als sehr hoch angesehen für jede Komponente, die keine Sicherheitspatches mehr erhält, da ständig neue Schwachstellen von Forschern entdeckt werden. Wenn die Komponente dem Internet ausgesetzt ist, wird die Wahrscheinlichkeit als häufig angesehen. Die Auswirkung einer erfolgreichen Ausnutzung hängt direkt von der Sensibilität (Vertraulichkeit, Integrität und Verfügbarkeit) des technischen Assets selbst und der von ihm verarbeiteten oder gespeicherten Daten-Assets ab.",
      "falsePositives": "Dieses Risiko basiert auf dem Vorhandensein des "
    },
    "accidental-data-loss-or-corruption-by-misuse": {
      "title": "Versehentlicher Datenverlust oder -beschädigung durch Software-Fehlbedienung (BSI APP.6 – 2.5)",
      "description": "Falsche oder unachtsame Nutzung von Software kann zum unbeabsichtigten Löschen, Überschreiben oder zur Beschädigung von Informationen führen.",
      "impact": "Integrität und Verfügbarkeit sind primär betroffen. Die Folgen umfassen angehaltene Prozesse, Wiederherstellungskosten, Verlust kritischer Aufzeichnungen, Verletzung von Geschäftszielen und – in regulierten Kontexten – potenzielle Nichteinhaltung von Vorschriften.",
      "asvs": "Zugeordnet zu BSI APP.6 (Abschnitt 2.5: Datenverlust durch fehlerhafte Nutzung von Software) und OPS.1.2.2 (Betriebspersonal) für Verantwortlichkeiten bei Backup/Restore.",
      "action": "Schutzmaßnahmen einführen, um versehentliches Löschen/Beschädigen zu verhindern und eine robuste Wiederherstellung zu gewährleisten.",
      "mitigation": "Wenden Sie das Prinzip der geringsten Rechte, Bestätigungsdialoge für destruktive Aktionen, klare UI-Texte und sichere Standardeinstellungen an. Bieten Sie, wo machbar, eine Rückgängig-/Versionierungsfunktion. Schulen Sie Benutzer im korrekten Umgang.",
      "check": "Werden destruktive Aktionen bestätigt und sind sie umkehrbar? Sind die Berechtigungen auf das Minimum beschränkt? Sind die Benutzer geschult? Existieren getestete Backups für gespeicherte/verarbeitete Daten?",
      "detectionLogic": "Auslösen, wenn ein nicht ausgeschlossenes technisches Asset wahrscheinlich von Menschen falsch bedient wird UND sensible Verfügbarkeits-/Integritätsdaten verarbeitet oder komplexe Verschlüsselung involviert ist.\n",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei eigenentwickelten Komponenten aufgrund potenziell weniger ausgereifter UX und Schutzmechanismen höher. Die Auswirkung skaliert mit den höchsten Integritäts-/Verfügbarkeitsbewertungen des Assets: ",
      "falsePositives": "Kann ein Fehlalarm sein, wenn die Anwendung eine außergewöhnliche fehlervermeidende UX, strikte Nur-Lese-Standardeinstellungen, ein Vier-Augen-Prinzip bei destruktiven Aktionen hat, "
    },
    "insufficient-system-resources": {
      "title": "Unzureichende Systemressourcen für kritische Operationen (BSI CON.3.A5)",
      "description": "Wenn IT-Systeme nicht über ausreichende Ressourcen (z. B. CPU, Speicher, Festplatten-I/O) verfügen, um die erforderliche Software auszuführen,",
      "impact": "Ein Mangel an Systemressourcen wirkt sich direkt auf die Verfügbarkeit von Diensten aus. Dies kann Dienste unbrauchbar machen,",
      "asvs": "ASVS V14.1.1: Überprüfen Sie, ob die Anwendung oder das System in der Lage ist, Anfragen zu bearbeiten und bei einem Denial-of-Service-Angriff ordnungsgemäß auszufallen.",
      "action": "Ressourcenüberwachung und Kapazitätsplanung implementieren",
      "mitigation": "Implementieren Sie eine robuste Überwachung für wichtige Systemressourcen (CPU, Speicher, Festplattenspeicher, Netzwerkbandbreite).",
      "check": "Werden wichtige Systemressourcen überwacht? Gibt es einen Kapazitätsplan? Ist das Asset so konfiguriert, dass es redundant ist oder automatisch skaliert?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die eine hohe oder kritische Verfügbarkeitsanforderung haben, aber nicht als redundant modelliert sind.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeitsbewertung des technischen Assets ab.",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle Formen der Redundanz. Beispielsweise könnte ein Asset Teil eines externen Hochverfügbarkeitsclusters sein,"
    },
    "poor-usability-leads-to-shadow-it": {
      "title": "Schlechte Benutzerfreundlichkeit führt zu Schatten-IT",
      "description": "Wenn eine Software ihre funktionalen Anforderungen erfüllt, aber umständlich oder kompliziert zu bedienen ist, wird sie möglicherweise von den Benutzern nicht akzeptiert.",
      "impact": "Wenn Benutzer aufgrund schlechter Benutzerfreundlichkeit unsichere Umgehungslösungen schaffen, kann dies zur Datenexfiltration in unkontrollierte Umgebungen (z. B. private Laptops, öffentliche Cloud-Dienste) führen,",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.1 (Allgemeiner Client), Anforderung CON.1.A23 (Nutzung privater IT-Geräte).",
      "action": "Anwendungsfreundlichkeit verbessern und nicht genehmigte Umgehungslösungen verbieten",
      "mitigation": "Beziehen Sie Endbenutzer in die Design- und Testphasen einer Anwendung ein, um eine hohe Benutzerfreundlichkeit (UX/UI) sicherzustellen.",
      "check": "Wurden formale Usability-Tests mit den Zielbenutzern durchgeführt? Gibt es einen Feedback-Kanal für Probleme mit der Benutzererfahrung?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die explizit als schlecht benutzbar (`@Usability:Poor`) gekennzeichnet sind.",
      "riskAssessment": "Die Auswirkung wird durch die Sensibilität der von der schlecht benutzbaren Anwendung verarbeiteten Daten bestimmt. Wenn Benutzer ",
      "falsePositives": "Ein System mag komplex sein, aber gut geschulte Benutzer haben, die nicht auf Umgehungslösungen zurückgreifen. Dieses Risiko lässt sich am besten validieren durch "
    },
    "inadequate-office-product-procurement": {
      "title": "Unzureichende Beschaffung und Anpassung von Office-Produkten",
      "description": "Wenn Office-Produkte ohne eine dokumentierte Anforderungsbasis beschafft oder angepasst werden, können Betriebsabläufe gestört werden: bestehende Vorlagen und Dokumente können inkompatibel werden, Integrationen mit Partnersystemen können fehlschlagen und die Leistung oder Benutzerfreundlichkeit kann sich verschlechtern. Die Anpassung der Software an die institutionellen Bedürfnisse ist unerlässlich, um Prozessunterbrechungen und Fehler zu vermeiden.",
      "impact": "Die primäre Auswirkung betrifft die Integrität und Verfügbarkeit aufgrund von unterbrochenen Prozessen, inkompatiblen Formaten oder Workflow-Fehlern; eine sekundäre Auswirkung auf die Vertraulichkeit kann auftreten, wenn Dokumente über Grenzen hinweg falsch gehandhabt werden.",
      "asvs": "Basiert auf BSI IT-Grundschutz APP.1.1 Office-Produkte; bezogen auf APP.4.4 Allgemeine Anwendungssoftware und moderne Praktiken des Anwendungslebenszyklus.",
      "action": "Einen formalen Prozess für die Anforderungserhebung und Beschaffung von Office-Produkten einführen und durchsetzen.",
      "mitigation": "Definieren Sie einen wiederholbaren Beschaffungsprozess, einschließlich Anforderungserhebung (funktionale, Interoperabilitäts-, Vorlagen-/Formatkompatibilitätsanforderungen), nicht-funktionaler Kriterien (Leistung, Benutzerfreundlichkeit) und Integrationsprüfungen. Führen Sie Pilotprojekte mit repräsentativen Arbeitslasten durch und validieren Sie diese gegen bestehende Makros/Vorlagen vor dem Rollout.",
      "check": "Gibt es einen dokumentierten Beschaffungs- und Anpassungsprozess? Überprüft er die Kompatibilität mit bestehenden Assets und Partnersystemen? Werden Pilottests und Leistungs-/Usability-Prüfungen vor der Bereitstellung durchgeführt?",
      "detectionLogic": "Bewertung mit mehreren Signalen: Office-Kontext-Tags, Akzeptanz von dokumentenähnlichen Formaten, Kommunikation über Vertrauensgrenzen hinweg (und ob internet-zugewandt), Vorhandensein von Dokumenten-/‘doc-ish’-Protokollen, Datenübertragung auf Verbindungen, VDI-/Terminal-Server-Hinweise und Makro-Indikatoren. OT/ICS-Assets werden strikt ausgeschlossen. Reine E-Mail-Stacks werden explizit auf ‘Unwahrscheinlich’ gesetzt, unabhängig von der Bewertung. Assets, die den Mindest-Schwellenwert erreichen, werden gekennzeichnet.",
      "riskAssessment": "Die Wahrscheinlichkeit leitet sich aus der Evidenzbewertung ab. Die Auswirkung wird von den höchsten Verfügbarkeits-/Integritätsbewertungen des Assets abgeleitet und erhöht, wenn StrictlyConfidential-Daten eine Netzwerk-Vertrauensgrenze überqueren. Missionskritische Prozesse erhöhen die Auswirkung auf SehrHoch.",
      "falsePositives": "Kann reduziert (aber nicht eliminiert) werden, wenn ein robuster Beschaffungs-/Testprozess existiert. Assets, die mit ‘procurement-process-followed’ getaggt sind, erhalten eine niedrigere Bewertung. Die Bestätigung sollte die Architektur- und Beschaffungsverantwortlichen einbeziehen."
    },
    "malicious-content-in-office-documents": {
      "title": "Bösartiger Inhalt in Office-Dokumenten",
      "description": "Office-Dokumente können aktive Inhalte oder Makros enthalten, die für die Automatisierung nützlich sind, aber auch bösartigen Code verbergen können.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu Datenmanipulation, Informationsweitergabe und Systemkompromittierung führen. Dies kann Geschäftsfunktionen stören,",
      "asvs": "BSI IT-Grundschutz: CON.3 Malware-Schutz; APP.4.4 Filterung von Daten und Informationen.",
      "action": "Inhaltssicherheit für die Dokumentenverarbeitung implementieren",
      "mitigation": "Deaktivieren Sie aktive Inhalte (z. B. Makros) in Office-Dokumenten standardmäßig, insbesondere für Dokumente aus nicht vertrauenswürdigen Quellen.",
      "check": "Ist aktiver Inhalt für eingehende Dokumente standardmäßig deaktiviert? Werden alle verarbeiteten Dateien auf Malware gescannt?",
      "detectionLogic": "Identifiziert technische Assets, die so konfiguriert sind, dass sie dateibasierte Datenformate akzeptieren und Technologietypen verwenden, die üblicherweise ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei internet-zugewandten Assets, die direkt Dateien von externen Quellen erhalten, als höher angesehen.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das Asset, obwohl es Dateien akzeptiert, andere wirksame, nicht modellierte Minderungsmaßnahmen hat,"
    },
    "unauthorized-modification-of-office-documents": {
      "title": "Unbefugte Änderung von Office-Dokumenten (in Anlehnung an BSI APP.1.1, Abschnitt 2.3)",
      "description": "Die Integrität von Dokumenten (wie Office-Dateien, PDFs usw.) kann durch unbeabsichtigte oder absichtliche Inhaltsänderungen kompromittiert werden.",
      "impact": "Wenn Geschäftsprozesse auf unentdeckt gefälschten Dokumenten basieren oder Entscheidungen darauf beruhen, kann dies zu falschen strategischen Ergebnissen, Prozessausfällen, finanziellen Verlusten und erheblichen Reputationsschäden für die Organisation führen.",
      "asvs": "BSI IT-Grundschutz-Baustein APP.1.1 Office-Produkte, Abschnitt 2.3 (Integritätsverlust von Office-Dokumenten)",
      "action": "Kontrollen zur Dokumentenintegrität implementieren und durchsetzen",
      "mitigation": "Verwenden Sie technische Mechanismen wie digitale Signaturen, um die Integrität und Authentizität von Dokumenten zu gewährleisten.",
      "check": "Werden digitale Signaturen oder ähnliche Integritätsmechanismen für kritische Dokumente verwendet? Sind die Dateiberechtigungen auf Speichersystemen angemessen eingeschränkt, um unbefugte Änderungen zu verhindern? Wird das Bewusstsein der Benutzer zu diesem Thema geschult? Ist eine FIM-Lösung vorhanden?",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets vom Typ Datastore oder Process ausgelöst, die dateibasierte Daten (`DataFormat.File`) akzeptieren und für Daten-Assets mit ",
      "riskAssessment": "Die Auswirkung dieses Risikos leitet sich direkt aus der Integritätsanforderung der verarbeiteten Daten ab (",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die verarbeiteten Dateien nicht geschäftskritisch sind (z. B. temporäre Protokolldateien), trotz einer hohen Integritätsbewertung, oder wenn robuste kompensierende Kontrollen existieren, die nicht explizit modelliert sind (z. B. ein separates, sicheres Dokumentenmanagementsystem)."
    },
    "inadequate-contractual-agreements-with-service-providers": {
      "title": "Unzureichende oder fehlende vertragliche Sicherheitsanforderungen für externe Dienstleister",
      "description": "Wenn Verträge mit externen Dienstleistern (ESPs) keine klaren, durchsetzbaren Informationssicherheitsklauseln, Verantwortlichkeiten und Leistungsparameter enthalten, können wesentliche Schutzmaßnahmen übersehen oder unzureichend umgesetzt werden. Dies ist besonders riskant, wenn ESPs Systeme entwickeln, integrieren oder warten, die sensible Daten verarbeiten oder kritische Geschäftsdienste untermauern.",
      "impact": "Schwache oder mehrdeutige Lieferantenverträge können zur Nichteinhaltung von Gesetzen und Vorschriften, zu Datenschutzverletzungen, unklarer Rechenschaftspflicht und unzureichender Prüfbarkeit führen. Die Folgen sind Vertraulichkeitsverletzungen, Integritätsverluste, Dienstausfälle, finanzielle Strafen und Reputationsschäden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.1 (Lieferantenbeziehungsmanagement), insbesondere Anforderung CON.1.A4 (Festlegung von Informationssicherheitsanforderungen für Lieferantenbeziehungen).",
      "action": "Sicherheitsanforderungen für alle externen Anbieter, die Ihre Daten oder Systeme handhaben, definieren, vertraglich festlegen und überprüfen.",
      "mitigation": "Stellen Sie sicher, dass jeder ESP-Vertrag Folgendes spezifiziert: Sicherheitsverantwortlichkeiten und SLAs; Datenhandhabung und -schutz (einschl. personenbezogener Daten/PII); sichere Entwicklung und Änderungskontrolle; Melde-/Benachrichtigungsfristen für Vorfälle; Schwachstellenmanagement und Patch-SLAs; Prüfungsrecht und Bereitstellung von Nachweisen; Kontrollen von Unterauftragsverarbeitern; Datenstandort und -souveränität; Unterstützung bei Vertragsbeendigung/Übergang (z. B. Escrow); und Einhaltung relevanter Standards und Gesetze.",
      "check": "Werden ESP-Verträge vor der Unterzeichnung von Sicherheit/Recht geprüft? Enthalten sie explizite Klauseln für Informationssicherheit, Datenschutz, Incident Response, Schwachstellen-/Patch-SLAs, Prüfungsrechte und Kontrolle von Subunternehmern? Gibt es eine dokumentierte Lieferantenrisikobewertung und einen kontinuierlichen Überwachungsprozess?",
      "detectionLogic": "Automatisch erkannt, wenn ein technisches Asset eine externe Entität darstellt (Typ = ExternalEntity) oder mit @ExternalServiceProvider getaggt ist. Die Auswirkung leitet sich von den höchsten CIA-Bewertungen der Daten ab, die der Anbieter verarbeitet oder speichert. Wenn der Anbieter mandantenfähig ist, erhöht das Modell die Auswirkung. Die Regel hebt auch das sensibelste referenzierte Datenasset hervor, um die Überprüfung zu erleichtern.",
      "riskAssessment": "Die Wahrscheinlichkeit wird standardmäßig auf Wahrscheinlich gesetzt (Governance-Lücken sind häufig). Die Auswirkung skaliert mit der Sensibilität und Kritikalität der verarbeiteten/gespeicherten Daten: Eingeschränkt/Wichtig ⇒ Mittel, Vertraulich/Kritisch ⇒ Hoch, StrengVertraulich/Missionskritisch ⇒ SehrHoch. Mandantenfähige Anbieter erhöhen die Auswirkung um eine Stufe bis zu einem Maximum von SehrHoch. Der Gesamtschweregrad ist CalculateSeverity(Wahrscheinlich, Auswirkung).",
      "falsePositives": "Kann auch dann ausgelöst werden, wenn die Verträge robust sind – dies ist beabsichtigt, um eine Überprüfung anzustoßen. Markieren Sie als "
    },
    "conceptual-flaws-from-component-reuse": {
      "title": "Konzeptionelle Fehler durch Wiederverwendung von Komponenten (BSI APP.2.2)",
      "description": "Bei der Konzeption von Anwendungen, Programmen und Protokollen können sicherheitsrelevante konzeptionelle Fehler entstehen.",
      "impact": "Die Wiederverwendung von Komponenten in einem unbeabsichtigten Sicherheitskontext kann grundlegende Sicherheitsannahmen umgehen und zu Schwachstellen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein APP.2 (Webanwendungen). Dieses Risiko betrifft grundlegende architektonische Designfehler.",
      "action": "Wiederverwendete Komponenten für neue Einsatzkontexte überprüfen und härten",
      "mitigation": "Stellen Sie sicher, dass jede Komponente, die in einem neuen Sicherheitskontext wiederverwendet wird (z. B. die Bereitstellung eines internen Dienstes im Internet), einer gründlichen Sicherheitsüberprüfung und einer Aktualisierung des Bedrohungsmodells unterzogen wird.",
      "check": "Gibt es einen formellen Überprüfungsprozess für Komponenten, wenn sich ihr Einsatzkontext ändert?",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von Kommunikationsverbindungen von internet-zugewandten technischen Assets zu Assets, die nicht internet-zugewandt sind, erkannt,",
      "riskAssessment": "Die Auswirkung wird durch die Bewertung von Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der internen Komponente bestimmt, die exponiert wird.",
      "falsePositives": "Ein Risiko kann gekennzeichnet werden, wenn eine Verbindung durch andere Mittel, die nicht vollständig im Modell erfasst sind (z. B. strenge Netzwerk-ACLs, mTLS mit kurzlebigen Zertifikaten), stark eingeschränkt ist."
    },
    "undocumented-functions": {
      "title": "Undokumentierte Funktionen (Backdoors)",
      "description": "Viele Anwendungen enthalten undokumentierte Funktionen, die vom Hersteller eingebaut wurden, oft für Entwicklungs- oder Supportzwecke. Diese sind den Benutzern in der Regel unbekannt und nicht Teil der offiziellen Dokumentation.",
      "impact": "Wenn diese Funktionen das Umgehen wesentlicher Sicherheitsmechanismen, wie z. B. der Zugriffskontrolle, ermöglichen, können die Vertraulichkeit, Integrität und Verfügbarkeit der verarbeiteten Daten erheblich beeinträchtigt werden. Dies kann zu unbefugtem Zugriff, Datenmanipulation oder Dienstunterbrechungen führen.",
      "asvs": "V14.2.1: Überprüfen Sie, dass die Anwendung keine Hintertüren oder anderen absichtlich bösartigen Code enthält.",
      "action": "Code-Prüfung, Komponentenanalyse und Penetrationstests",
      "mitigation": "Überprüfen und testen Sie alle eigenentwickelten oder Drittanbieter-Komponenten gründlich auf undokumentierte Funktionen. Dies umfasst statische und dynamische Code-Analyse (SAST/DAST) und Penetrationstests, die speziell auf Backdoors oder versteckte administrative Schnittstellen abzielen. Fordern Sie von Drittanbietern, alle Funktionen zu dokumentieren, einschließlich derer für Support und Wartung. Implementieren Sie eine starke Netzwerksegmentierung und Überwachung, um die Auswirkungen zu begrenzen und die Entdeckungswahrscheinlichkeit zu erhöhen, falls eine solche Funktion entdeckt und ausgenutzt wird.",
      "check": "Gibt es einen Prozess zur Überprüfung von Drittanbieter- und eigenentwickeltem Code auf versteckte Funktionalität? Wurde die Anwendung Penetrationstests unterzogen, die die Suche nach Backdoors beinhalten? Fordern Lieferantenverträge die vollständige Offenlegung aller Anwendungsfunktionen, einschließlich Diagnose- und Support-Endpunkten?",
      "detectionLogic": "Dieses Risiko gilt für technische Assets, die eigenentwickelt sind oder eigenentwickelte Teile enthalten, wie durch das `custom_developed_parts`-Flag angezeigt. Das Vorhandensein von benutzerdefiniertem Code erhöht die Wahrscheinlichkeit, dass undokumentierte Funktionen, ob absichtlich oder unabsichtlich, existieren könnten.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei komplexen, eigenentwickelten Systemen höher, insbesondere bei solchen mit langer Historie oder mehreren Entwicklungsteams. Die Auswirkung ist direkt proportional zur CIA-Bewertung des Assets und der von ihm verarbeiteten oder gespeicherten Daten. Eine Hintertür in einem System, das ",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn die eigenentwickelten Teile rigoros geprüft und getestet wurden und keine solchen Funktionen gefunden wurden. Das `custom_developed_parts`-Flag ist ein starker Indikator für ein potenzielles Risiko, aber kein endgültiger Beweis für eine Hintertür. Dieses Risiko sollte durch gezielte Sicherheitstests überprüft werden."
    },
    "weak-or-missing-security-controls": {
      "title": "Schwache oder fehlende Sicherheitskontrollen (BSI CON.2)",
      "description": "Sicherheitsmechanismen oder -funktionen innerhalb einer Anwendung sollen sicherstellen, dass die Vertraulichkeit, Integrität und Verfügbarkeit von Informationen im erforderlichen Maße während der Verarbeitung gewährleistet sind.",
      "impact": "Wenn kritische Sicherheitskontrollen schwach sind oder fehlen, können sie Informationen und Systeme nicht angemessen schützen. Dies kann zu unbefugtem Zugriff, Datenmanipulation, Informationsweitergabe oder Dienstunterbrechungen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.2 (Softwareentwicklung und -herstellung), Anforderung CON.2.A5 (Security by Design in der Softwareentwicklung).",
      "action": "Security by Design und Defense-in-Depth implementieren",
      "mitigation": "Stellen Sie bei allen eigenentwickelten Komponenten sicher, dass Sicherheit eine Kernanforderung während des gesamten Entwicklungslebenszyklus ist.",
      "check": "Sind alle Kommunikationsverbindungen, die sensible Daten über Vertrauensgrenzen hinweg transportieren, verschlüsselt?",
      "detectionLogic": "Dieses Risiko wird für eigenentwickelte technische Assets ausgelöst, die eingehende Kommunikationsverbindungen mit schwachen oder fehlenden Sicherheitskontrollen aufweisen.",
      "riskAssessment": "Die Auswirkung wird durch die höchste CIA-Anforderung der über die unsichere Kommunikationsverbindung übertragenen oder vom Ziel-Asset verarbeiteten Daten-Assets bestimmt.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn andere kompensierende Kontrollen vorhanden sind, die nicht modelliert sind, wie z. B. eine Web Application Firewall (WAF) oder ein API Gateway, das TLS beendet und die Authentifizierung zentral handhabt."
    },
    "insufficient-development-control": {
      "title": "Unzureichende Kontrolle der kundenspezifischen Softwareentwicklung",
      "description": "Wenn die Softwareentwicklung nicht ausreichend vom Auftraggeber kontrolliert und gesteuert wird,",
      "impact": "Fehlende, schwache oder falsch priorisierte Sicherheitsfunktionen in kundenspezifisch entwickelter Software können zu einer Vielzahl von Schwachstellen führen,",
      "asvs": "ASVS V1.1 (Anforderungen an Architektur, Design und Bedrohungsmodellierung), ASVS V1.3 (Anforderungen an Architektur und Design)",
      "action": "Klare Sicherheitsanforderungen und Governance für Entwicklungsprojekte etablieren",
      "mitigation": "Der Auftraggeber muss vor und während der Entwicklung von kundenspezifischer Software klare und testbare Sicherheitsanforderungen definieren.",
      "check": "Gibt es dokumentierte Sicherheitsanforderungen für diese kundenspezifische Komponente? Gibt es einen definierten Prozess für die Projektsteuerung, an dem der Auftraggeber/Produktverantwortliche beteiligt ist?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das als mit ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die kundenspezifische Software unter einem starken, sicherheitsbewussten Governance-Modell entwickelt wurde."
    },
    "inadequate-developer-expertise": {
      "title": "Unzureichende Entwicklerkompetenz oder -ressourcen",
      "description": "Die Beauftragung ungeeigneter Softwareentwickler kann zu verschiedenen Bedrohungen führen. Ein Mangel an technischem Fachwissen",
      "impact": "Wenn Entwicklern die erforderliche Sicherheitsexpertise oder die Ressourcen fehlen, kann dies zur Einführung kritischer Schwachstellen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz CON.1 (Allgemeine Softwareentwicklung und -beschaffung). Bezieht sich auch auf OWASP Top 10 A05:2021 - Security Misconfiguration und allgemeine sichere Programmierpraktiken.",
      "action": "Eignung der Entwickler sicherstellen und sichere Entwicklungspraktiken durchsetzen",
      "mitigation": "Überprüfen Sie Entwickler vor und während Projekten auf die erforderliche technische und sicherheitstechnische Expertise.",
      "check": "Gibt es einen formellen Prozess zur Überprüfung der Entwicklerfähigkeiten, einschließlich Sicherheit? Ist ein Secure SDLC dokumentiert und wird er befolgt?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als mit ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des technischen Assets und der von ihm verarbeiteten Daten bestimmt.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das Entwicklungsteam nachweislich über starke Sicherheitsexpertise verfügt und einem robusten Secure SDLC folgt,"
    },
    "flawed-authorization-in-web-applications": {
      "title": "Fehlerhafte Autorisierung in Webanwendungen (BSI-basiert)",
      "description": "Bei einem Angriff wird oft versucht, auf Funktionen oder Daten von Webanwendungen zuzugreifen, die nur mit bestimmten Zugriffsrechten verfügbar sind.",
      "impact": "Wenn Autorisierungsprüfungen fehlen oder fehlerhaft sind, können Angreifer ihre Berechtigungen erhöhen, was zu unbefugtem Zugriff auf sensible Daten und kritische Funktionalitäten führt.",
      "asvs": "V4.1: Überprüfen Sie, dass die Anwendung bei jeder Anfrage von einem Client Zugriffskontrollregeln durchsetzt und dass sie keine sensiblen Daten oder Funktionalitäten für unbefugte Benutzer preisgibt.",
      "action": "Korrekte Autorisierungslogik implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass jede Anfrage an eine geschützte Ressource auf der Serverseite den Benutzer erneut validiert.",
      "check": "Werden serverseitige Autorisierungsprüfungen für jede Anfrage an eine geschützte Ressource durchgeführt? Ist es möglich, diese Prüfungen durch Manipulation von Anfrageparametern, URLs oder Headern zu umgehen?",
      "detectionLogic": "Dieses Risiko wird für web-zugewandte Assets (wie Webanwendungen, Webdienste) identifiziert, die eingehende Kommunikationsverbindungen ohne spezifizierten Autorisierungsmechanismus haben (`authorization: ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeits- und Integritätsbewertung der von der Webanwendung verarbeiteten oder gespeicherten Daten bestimmt.",
      "falsePositives": "Ein Risiko kann ein Fehlalarm sein, wenn der Endpunkt absichtlich öffentlich ist (z. B. eine Anmeldeseite oder eine öffentlich zugängliche API ohne sensible Daten)."
    },
    "improper-input-validation-and-output-encoding-bsi-app-4-a7": {
      "title": "Unsachgemäße Eingabevalidierung und Ausgabekodierung (XSS) (BSI APP.4.A7)",
      "description": "Wenn eine Webanwendung unvalidierte Eingabedaten verarbeitet, können Schutzmechanismen umgangen werden. Dieses Risiko erhöht sich, wenn gleichzeitig die Ausgabedaten der Webanwendung ohne ausreichende Kodierung direkt an den Webbrowser, die aufrufende Anwendung oder nachgelagerte IT-Systeme übermittelt werden. Solche Ausgabedaten können bösartigen Code (z. B. JavaScript) enthalten, der dann auf den Zielsystemen interpretiert oder ausgeführt wird, was zu einem Cross-Site-Scripting (XSS)-Angriff führt.",
      "impact": "Eine erfolgreiche Ausnutzung kann zur Ausführung nicht autorisierter Skripte in einem Benutzer führen.",
      "asvs": "OWASP ASVS V4.0.3: 5.1 Eingabevalidierung, 5.2 Bereinigung und Sandboxing, 5.3 Ausgabekodierung und Injection-Prävention",
      "action": "Robuste Eingabevalidierung und kontextsensitive Ausgabekodierung implementieren",
      "mitigation": "Alle Eingabedaten müssen gegen eine strikte Positivliste erwarteter Zeichen, Formate und Längen validiert werden. Entscheidend ist, dass alle Daten unmittelbar vor der Ausgabe kodiert werden, wobei ein kontextsensitiver Ansatz verwendet wird (z. B. für HTML-Körper, HTML-Attribute, JavaScript, CSS oder URLs). Verwenden Sie standardmäßige, vertrauenswürdige Bibliotheken für die Kodierung. Implementieren Sie eine starke Content Security Policy (CSP) als eine Maßnahme der Tiefenverteidigung, um die Ausführung nicht vertrauenswürdiger Skripte einzuschränken.",
      "check": "Werden alle vom Benutzer bereitgestellten Eingaben gegen eine strikte Positivliste validiert? Wird eine kontextsensitive Ausgabekodierung auf alle Daten angewendet, bevor sie im Browser gerendert oder an andere Systeme gesendet werden? Ist eine Content Security Policy (CSP) vorhanden?",
      "detectionLogic": "Diese Regel löst bei Webanwendungen oder Webdiensten aus, insbesondere bei solchen mit eigenentwickelten Teilen, die Daten empfangen und dann Daten an eine clientseitige Komponente (wie einen Browser) senden. Das Risiko wird als vorhanden angesehen, es sei denn, das Asset ist explizit als mit Kontrollen für Eingabevalidierung und Ausgabekodierung versehen gekennzeichnet.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei internet-zugewandten, eigenentwickelten Anwendungen hoch. Die Auswirkung wird durch die Sensibilität (Vertraulichkeit und Integrität) der über die betroffene Kommunikationsverbindung übertragenen Daten bestimmt. Ein Angriff auf ein System, das streng vertrauliche Daten verarbeitet oder kritische Operationen ermöglicht, hat eine hohe Auswirkung.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Anwendung eine effektive Eingabevalidierung und Ausgabekodierung verwendet, dies aber nicht durch Tags im Modell widergespiegelt wird."
    },
    "improper-error-handling-web-app": {
      "title": "Unsachgemäße Fehlerbehandlung in Webanwendungen",
      "description": "Wenn Fehler, die während des Betriebs einer Webanwendung auftreten, nicht korrekt behandelt werden, können sowohl der Betrieb der Webanwendung als auch der Schutz ihrer Funktionen und Daten beeinträchtigt werden. Beispielsweise kann ein Fehler dazu führen, dass die Webanwendung nicht mehr korrekt ausgeführt wird und für Clients unerreichbar wird. Zusätzlich können Aktionen nur teilweise ausgeführt werden, zwischengespeicherte Aktionen und Daten können verloren gehen oder Sicherheitsmechanismen können ausfallen.",
      "impact": "Eine unsachgemäße Fehlerbehandlung kann zu verschiedenen Sicherheitsbedrohungen führen. Ausführliche Fehlermeldungen können sensible Systeminformationen preisgeben (Informationsweitergabe). Eine unbehandelte Ausnahme kann einen Denial-of-Service verursachen. Wenn eine Anwendung in einen nicht sicheren Zustand übergeht, kann dies die Umgehung von Sicherheitskontrollen (Privilegienerweiterung) oder Datenkorruption (Manipulation) ermöglichen.",
      "asvs": "V7.1.1: Stellen Sie sicher, dass alle Anwendungskomponenten Fehler und Ausnahmen so behandeln, dass die Sicherheit und Integrität der Anwendung gewahrt bleiben, einschließlich der Nichtoffenlegung sensibler Informationen in Fehlerantworten.",
      "action": "Robuste und sichere Fehlerbehandlung implementieren",
      "mitigation": "Implementieren Sie einen zentralisierten und robusten Fehlerbehandlungsmechanismus für die gesamte Anwendung. Alle Ausnahmen sollten abgefangen und ordnungsgemäß behandelt werden. Stellen Sie sicher, dass Fehlermeldungen für Benutzer generisch sind und keine internen Systemdetails, Stack-Traces oder Datenbankfehler preisgeben. Protokollieren Sie detaillierte Fehlerinformationen sicher auf der Serverseite zur Fehlersuche und Analyse. Die Anwendung sollte in einen sicheren Zustand übergehen und so eine mögliche Umgehung von Sicherheitskontrollen verhindern.",
      "check": "Überprüfen Sie den Quellcode auf die konsistente Verwendung von try-catch-Blöcken oder einem globalen Ausnahmebehandler. Überprüfen Sie, dass die Benutzer-Fehlerseiten generisch sind. Lösen Sie Fehler in der Anwendung aus, um zu überprüfen, dass keine sensiblen Informationen in der HTTP-Antwort preisgegeben werden. Stellen Sie sicher, dass die Anwendung nach einem Fehler in einem sicheren und konsistenten Zustand bleibt.",
      "detectionLogic": "Dieses Risiko wird automatisch für alle im Geltungsbereich befindlichen, eigenentwickelten technischen Assets identifiziert, die Webanwendungen, Webserver oder Webdienste sind. Die Verwendung von benutzerdefiniertem Code erhöht die Wahrscheinlichkeit von Programmierfehlern wie unsachgemäßer Fehlerbehandlung erheblich.",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird für jede eigenentwickelte Webkomponente als hoch angesehen, da die Fehlerbehandlung ein häufiger Bereich für Fehler ist. Die Auswirkung hängt direkt von den CIA-Anforderungen des Assets und der von ihm verarbeiteten Daten ab. Ein Fehler in einer Anwendung, die ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn das Entwicklungsteam ein ausgereiftes, konsistent angewandtes und sicheres Fehlerbehandlungsframework nachweisen kann, das in der gesamten Anwendung verwendet wird."
    },
    "insufficient-logging-in-web-application": {
      "title": "Unzureichende Protokollierung in Webanwendungen (basierend auf BSI)",
      "description": "Wenn sicherheitsrelevante Ereignisse von einer Webanwendung nicht ausreichend protokolliert werden, wird es schwierig oder unmöglich, Sicherheitsvorfälle später zu rekonstruieren. Die Ursache eines Vorfalls kann möglicherweise nicht mehr ermittelt werden. Beispielsweise können Konfigurationsfehler übersehen werden, wenn sie nicht zu Fehlermeldungen in den Protokolldateien führen. Schwachstellen sind bei unzureichender Protokollierung ebenfalls schwer oder unmöglich zu erkennen und zu beheben.",
      "impact": "Ein Mangel an ordnungsgemäßer Protokollierung verhindert oder erschwert die Reaktion auf Vorfälle, die forensische Analyse und eine effektive Überprüfung. Es ermöglicht Angreifern, mit geringerer Entdeckungswahrscheinlichkeit zu operieren, ihre Spuren leichter zu verwischen und macht es schwierig, den Umfang einer Kompromittierung zu bewerten. Dies kann zu längeren Systemkompromittierungen, unentdeckten Datenschutzverletzungen und der Nichteinhaltung von Compliance-Anforderungen für Audits und Rechenschaftspflicht führen.",
      "asvs": "OWASP ASVS V7: Fehlerbehandlung und Protokollierung",
      "action": "Umfassende und strukturierte Sicherheitsprotokollierung implementieren",
      "mitigation": "Stellen Sie sicher, dass die Webanwendung alle sicherheitsrelevanten Ereignisse protokolliert, einschließlich Authentifizierungsversuchen (Erfolg und Misserfolg), Zugriffskontrollentscheidungen, signifikanten serverseitigen Fehlern, Sitzungsmanagementereignissen und Eingabevalidierungsfehlern. Protokolle sollten in einem strukturierten Format (z. B. JSON) vorliegen, ausreichenden Kontext (Zeitstempel, Quell-IP, Benutzer-ID, Ereigniskorrelations-ID) enthalten und vor unbefugtem Zugriff oder Änderung geschützt sein. Es ist bewährte Praxis, Protokolle an ein zentralisiertes und gesichertes Protokollmanagementsystem zur Aggregation, Überwachung und Alarmierung weiterzuleiten.",
      "check": "Überprüfen Sie die Anwendung",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als Webanwendungen oder Webdienste identifiziert wurden (z. B. unter Verwendung von Technologien wie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei eigenentwickelten Anwendungen als höher angesehen, da eine umfassende Protokollierung oft eine übersehene Anforderung ist. Die Auswirkung steht in direktem Zusammenhang mit den Vertraulichkeits- und Integritätsanforderungen der von der Anwendung verarbeiteten oder gespeicherten Daten. Eine Anwendung, die ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein robuster, zentralisierter Protokollierungsmechanismus vorhanden ist und Protokolle vom Asset sammelt, aber nicht explizit als `Monitoring`- oder `IDS`/`IPS`-Asset mit einer Kommunikationsverbindung von der Webanwendung modelliert ist. Dieses generische Risiko sollte immer gegen die tatsächlichen Implementierungsdetails überprüft werden."
    },
    "information-leakage-via-web-application": {
      "title": "Informationsleck technischer Details über eine Webanwendung",
      "description": "Websites und von einer Webanwendung generierte und bereitgestellte Daten können Informationen über Backend-Systeme enthalten, ",
      "impact": "Wenn ein Angreifer die spezifischen Technologien und Versionen kennt, die von der Webanwendung verwendet werden, kann er bekannte Schwachstellen leichter finden und ausnutzen.",
      "asvs": "V6.2.5 (ASVS 4.0.3), V14.2.1",
      "action": "Webserver und Anwendung konfigurieren, um Informationslecks zu verhindern",
      "mitigation": "Konfigurieren Sie den Webserver und das Anwendungsframework so, dass die Offenlegung spezifischer Softwareversionen und anderer technischer Details vermieden wird.",
      "check": "Werden HTTP-Antwortheader bereinigt, um Versionsinformationen zu entfernen? Vermeiden Fehlermeldungen die Anzeige technischer Details wie Stack-Traces oder interner Serverdaten?",
      "detectionLogic": "Dieses Risiko wird automatisch für alle im Geltungsbereich befindlichen technischen Assets vom Typ Webserver, Webanwendung, Anwendungsserver oder Webdienst (REST/SOAP) geprüft.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dies kann ein Fehlalarm sein, wenn eine Sicherheitskontrolle vor der Anwendung (wie eine WAF oder ein Reverse-Proxy) so konfiguriert ist, dass diese Informationen aus allen Antworten entfernt werden."
    },
    "automated-threats-against-web-application": {
      "title": "Automatisierte Bedrohungen gegen Webanwendungen (basierend auf BSI APP.3.1)",
      "description": "Wenn Funktionen von Webanwendungen automatisiert genutzt werden, können in kurzer Zeit zahlreiche Operationen ausgeführt werden.",
      "impact": "Ein fehlender Schutz vor automatisierten Angriffen kann zu Kontoübernahmen (durch Brute-Force), Offenlegung sensibler Daten (durch Enumeration) führen,",
      "asvs": "BSI IT-Grundschutz APP.3.1 (Webanwendungen), insbesondere A11 (Härtung), A17 (Schutz vor DoS) und A19 (Fehlerbehandlung). Bezieht sich auch auf OWASP ASVS V4.3 (Authentifizierung) und V10.4 (Verfügbarkeit).",
      "action": "Schutz vor automatisierten und hochfrequenten Angriffen implementieren",
      "mitigation": "Implementieren Sie technische Kontrollen zur Erkennung und Blockierung automatisierter Angriffe. Dazu gehören Ratenbegrenzung an sensiblen Endpunkten (z. B. Login, Suche, API-Aufrufe),",
      "check": "Gibt es Mechanismen wie Ratenbegrenzung, CAPTCHAs oder temporäre Kontosperrungen bei sensiblen Funktionen (Login, Passwort-Reset, komplexe Suchen)?",
      "detectionLogic": "Dieses Risiko gilt für internet-zugewandte technische Assets, die Webanwendungen oder Webdienste sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jede öffentlich zugängliche Webanwendung, der diese Schutzmaßnahmen fehlen, als hoch angesehen. Die Auswirkung wird durch die CIA-Bewertung des Assets bestimmt.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn der Schutz vor automatisierten Angriffen durch eine zugrunde liegende Komponente (z. B. eine WAF, ein API-Gateway oder Cloud Armor/Shield) implementiert ist."
    },
    "insufficient-session-management": {
      "title": "Unzureichendes Sitzungsmanagement",
      "description": "Unzureichendes Sitzungsmanagement kann es einem Angreifer ohne besondere Zugriffsrechte ermöglichen, die Sitzungs-ID eines Kontos mit weitreichenden Privilegien zu ermitteln. Diese ID kann dann verwendet werden, um auf geschützte Funktionen und Ressourcen der Webanwendung zuzugreifen, beispielsweise bei einem Session-Fixation-Angriff. Bei einem solchen Angriff erhält ein Angreifer zunächst eine Sitzungs-ID mit begrenzten Rechten von der Webanwendung. Diese ID wird dann an einen höher privilegierten Benutzer gesendet, zum Beispiel über einen Link in einer E-Mail. Wenn der höher privilegierte Benutzer diesem Link folgt und sich unter dieser Sitzungs-ID bei der Webanwendung authentifiziert, kann der Angreifer die Anwendung anschließend mit den vollen Zugriffsrechten des legitimen Kontos nutzen.",
      "impact": "Wenn ein Angreifer erfolgreich einen legitimen Benutzer übernimmt",
      "asvs": "V3 Sitzungsmanagement, insbesondere V3.3.1 und V3.4.1",
      "action": "Sitzungsmanagement-Mechanismen stärken",
      "mitigation": "Implementieren Sie ein robustes Sitzungsmanagement. Zu den wichtigsten Maßnahmen gehören: 1. Generierung einer neuen, hoch-entropischen Sitzungs-ID nach erfolgreicher Benutzerauthentifizierung, um Session-Fixation zu verhindern. 2. Ungültigmachen der Sitzungs-ID nach dem Abmelden oder nach einer angemessenen Zeit der Inaktivität. 3. Verwendung der `Secure`- und `HttpOnly`-Flags für Sitzungscookies. 4. Vermeiden Sie die Offenlegung von Sitzungs-IDs in URLs. 5. Implementierung strenger Timeout-Mechanismen für alle Sitzungen.",
      "check": "Überprüfen Sie die Anwendung",
      "detectionLogic": "Dieses Risiko wird für technische Assets generiert, die als Webanwendungen oder Dienste identifiziert wurden. Es wird ausgelöst, wenn eine eingehende Kommunikationsverbindung von einem client-ähnlichen Asset (z. B. Browser) eine sitzungsbasierte Authentifizierung verwendet (",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko kann als Fehlalarm betrachtet werden, wenn die Anwendung die besten Praktiken des Sitzungsmanagements korrekt umsetzt (z. B. die Erneuerung von Sitzungs-IDs nach erfolgreicher Authentifizierung). Dies kann nicht allein aus dem Architekturmodell überprüft werden und erfordert eine Code-Prüfung oder einen dynamischen Anwendungssicherheitstest (DAST)."
    },
    "unauthorized-disclosure-of-classified-information": {
      "title": "Unbefugte Offenlegung von Verschlusssachen (VS-NfD / Geheimschutz)",
      "description": "Eine erhebliche Bedrohung für Verschlusssachen (deutsch: ",
      "impact": "Wenn Verschlusssachen an unbefugte Parteien weitergegeben werden, kann dies der Organisation oder dem Staat schaden. Durchgesickerte Informationen (z. B. Netzwerkpläne, Sicherheitskonzepte) können ausgenutzt werden, um weitere Eindringlinge zu erleichtern.",
      "asvs": "OWASP ASVS V4.0.3: 6.2.2 (Data-at-rest-Verschlüsselung) und 6.2.5 (Sicheres Löschen temporärer Dateien)",
      "action": "Data-at-Rest-Verschlüsselung und sichere Datenhandhabung auf nicht-flüchtigen Systemen durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Assets, die Verschlusssachen speichern (entsprechend ",
      "check": "Sind alle Datenspeicher, die ",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die hochsensible Daten ohne adäquate eingebaute Schutzmechanismen verarbeiten, die in Threagile modelliert sind.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Vertraulichkeitsstufe des betroffenen Daten-Assets ab (",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn kompensierende Kontrollen existieren, die nicht in Threagile modelliert sind, wie z. B. eine obligatorische OS-Level-Festplattenverschlüsselung auf allen Servern, die das "
    },
    "insider-threat-theft-of-classified-information": {
      "title": "Insider-Bedrohung: Diebstahl von Verschlusssachen (BSI-Gefährdung: Insider)",
      "description": "Bösartige Insider (interne oder externe Mitarbeiter mit legitimem Zugriff) stehlen absichtlich vertrauliche oder Verschlusssachen. Diese Personen verfügen über umfassende Kenntnisse interner Prozesse und haben autorisierte Zugriffsrechte, die sie missbrauchen können, um die Erfolgswahrscheinlichkeit eines Angriffs zu erhöhen. Sie können ihre Angriffe auch so timen, dass sie mit Perioden geringer Überwachung, wie z. B. Wartungsfenstern, zusammenfallen, um eine Entdeckung zu vermeiden.",
      "impact": "Ein erfolgreicher Informationsdiebstahl durch einen Insider führt dazu, dass unbefugte Dritte Zugang zu sensiblen oder Verschlusssachen erhalten. Dies kann zu schweren Schäden für die Organisation führen, einschließlich finanzieller Verluste, Reputationsschäden, Verlust von Wettbewerbsvorteilen und potenziellen rechtlichen oder regulatorischen Strafen. Für staatliche Stellen kann dies den nationalen Interessen schaden.",
      "asvs": "BSI ORP.4 (Identitäts- und Zugriffsmanagement), OPS.1.1.5 (Protokollierung); OWASP ASVS V1.4 (Zugriffskontrolle - Geringste Rechte), V7.1 (Protokollierung und Überwachung)",
      "action": "Schichtverteidigung, Überwachung und Zugriffskontrolle für Insider-Bedrohungen implementieren",
      "mitigation": "Die Minderung erfordert einen mehrschichtigen Ansatz. Erzwingen Sie das Prinzip der geringsten Rechte (PoLP) und die Funktionstrennung (SoD), um den potenziellen Schadensumfang zu begrenzen. Implementieren Sie eine umfassende Protokollierung und Überwachung des Zugriffs auf kritische Assets und sensible Daten und nutzen Sie die Anomalieerkennung (z. B. UEBA), um verdächtiges Verhalten zu identifizieren. Setzen Sie Data Loss Prevention (DLP)-Lösungen ein, um Datenexfiltrationskanäle zu kontrollieren. Führen Sie regelmäßige Zugriffsüberprüfungen durch, um sicherzustellen, dass die Berechtigungen aktuell und notwendig sind. Der ",
      "check": "Werden die Prinzipien der geringsten Rechte und der Funktionstrennung strikt durchgesetzt? Wird jeder Zugriff auf sensible Daten und Systeme protokolliert und regelmäßig überprüft? Gibt es Anomalieerkennungs- oder UEBA-Systeme? Gibt es eine DLP-Lösung? Werden die Benutzerzugriffsrechte regelmäßig überprüft?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset generiert, das Daten mit einer Vertraulichkeitsbewertung von ",
      "riskAssessment": "Die Auswirkung leitet sich direkt von der Vertraulichkeitsbewertung der gefährdeten Daten ab (",
      "falsePositives": "Dieses Risiko kann als Fehlalarm oder akzeptiert betrachtet werden, wenn umfassende, spezifische Gegenmaßnahmen gegen Insider-Bedrohungen (wie dedizierte User and Entity Behavior Analytics (UEBA), robuste DLP und strikte, auditierte PoLP) für das identifizierte Asset vorhanden sind und ihre Wirksamkeit bestätigt wurde. Ein generisches "
    },
    "inadequate-key-management": {
      "title": "Unzureichendes Schlüsselmanagement (BSI CON.1.G1)",
      "description": "Unzureichendes Schlüsselmanagement kann dazu führen, dass bei einem Angriff unverschlüsselte Informationen offengelegt werden.",
      "impact": "Wenn kryptografische Schlüssel nicht ordnungsgemäß verwaltet werden, kann dies zu einem Verlust der Vertraulichkeit verschlüsselter Daten führen. Es kann auch zu einem Denial-of-Service führen, wenn abgelaufene Schlüssel oder Zertifikate kritische Systemfunktionen unbrauchbar machen.",
      "asvs": "BSI IT-Grundschutz CON.1: Kryptokonzept (CON.1.G1 Unzureichendes Schlüsselmanagement)",
      "action": "Eine Schlüsselmanagement-Richtlinie festlegen und durchsetzen",
      "mitigation": "Ein umfassender Prozess für den Lebenszyklus des Schlüsselmanagements muss etabliert werden. Dies umfasst die sichere Schlüsselerzeugung, -verteilung, -speicherung, -rotation und -vernichtung.",
      "check": "Gibt es eine dokumentierte Schlüsselmanagement-Richtlinie? Werden Schlüssel und Daten getrennt gespeichert? Werden Schlüsselmanagementsysteme wie ein Vault oder HSM verwendet? Gibt es einen Prozess zur Überwachung und Behandlung des Ablaufs von Schlüsseln/Zertifikaten?",
      "detectionLogic": "Dieses Risiko wird auf zwei primäre Arten erkannt.",
      "riskAssessment": "Die Auswirkung auf die Verfügbarkeit wird durch die Verfügbarkeitsbewertung des betroffenen Assets bestimmt. Die Auswirkung auf die Vertraulichkeit wird durch die Vertraulichkeitsbewertung der gefährdeten Daten bestimmt.",
      "falsePositives": "Das Modell zeigt möglicherweise nicht explizit die Verwendung eines vom Cloud-Anbieter verwalteten Schlüsseldienstes (wie AWS KMS oder Azure Key Vault), der möglicherweise korrekt verwendet wird, aber nicht als "
    },
    "legal-crypto-restrictions": {
      "title": "Rechtliche und regulatorische Beschränkungen der Kryptographie",
      "description": "Wenn Institutionen Hardware oder Software mit kryptographischen Funktionen verwenden, müssen sie verschiedene rechtliche Rahmenbedingungen einhalten.",
      "impact": "Ein Konflikt zwischen rechtlichen Anforderungen – wo ein Land starke Verschlüsselung vorschreibt (z. B. zum Datenschutz), während ein anderes sie ohne Genehmigung verbietet – kann eine legale Kommunikation unmöglich machen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.1 (Kryptokonzept), insbesondere Abschnitt 2.2, und Datenschutzvorschriften wie der DSGVO (Art. 32, 44-50), die die Datensicherheit und internationale Transfers regeln.",
      "action": "Jurisdiktionelle Kryptographie-Vorschriften überprüfen und einhalten",
      "mitigation": "Führen Sie eine gründliche rechtliche Überprüfung für alle Gerichtsbarkeiten durch, in denen verschlüsselte Daten gesendet oder verarbeitet werden. Verwenden Sie kryptographische Module, die den Vorschriften in allen relevanten Ländern entsprechen.",
      "check": "Werden verschlüsselte Daten über nationale Grenzen hinweg übertragen? Wurden die Kryptographiegesetze des Herkunfts- und Ziellandes überprüft?",
      "detectionLogic": "Diese Regel kennzeichnet Kommunikationsverbindungen, die (a) verschlüsselt sind (z. B. HTTPS/TLS), (b) ein VPN verwenden oder (c) Daten mit einer Vertraulichkeit ≥ Eingeschränkt transportieren und die nationale Grenzen überschreiten.",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Ein Risiko kann ein Fehlalarm sein, wenn eine spezifische rechtliche Vereinbarung oder Genehmigung vorliegt, die den Transfer erlaubt, aber nicht im Modell erfasst ist."
    },
    "improper-or-missing-use-of-cryptography": {
      "title": "Unsachgemäße oder fehlende Verwendung von Kryptographie",
      "description": "Wenn kryptographische Funktionen nicht oder falsch verwendet werden, können sie den beabsichtigten Schutz für Informationen nicht bieten.",
      "impact": "Das Versäumnis, sensible Daten sowohl bei der Übertragung als auch im Ruhezustand korrekt zu verschlüsseln, kann zur unbefugten Offenlegung von Informationen führen und deren Vertraulichkeit verletzen.",
      "asvs": "V7: Anforderungen zur Überprüfung der Kommunikationssicherheit, V6: Anforderungen zur Überprüfung gespeicherter Kryptographie",
      "action": "Korrekte und durchgesetzte Verwendung von Kryptographie sicherstellen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationskanäle, die sensible Daten übertragen, starke, hochmoderne Verschlüsselungsprotokolle (z. B. TLS 1.2/1.3) verwenden.",
      "check": "Sind alle Kommunikationsverbindungen, die sensible Daten transportieren, verschlüsselt? Wird die Data-at-Rest-Verschlüsselung für alle Datenspeicher mit sensiblen Informationen angewendet? Werden die verwendeten kryptographischen Protokolle und Algorithmen als stark angesehen und sind sie korrekt konfiguriert?",
      "detectionLogic": "Diese Regel prüft auf zwei primäre Bedingungen:",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist bei Assets und Verbindungen, die mit dem Internet verbunden sind, höher.",
      "falsePositives": "Dieses Risiko kann bei Kommunikationsverbindungen innerhalb einer hochsicheren und isolierten Umgebung, in der Verschlüsselung als unnötiger Aufwand angesehen wird, gekennzeichnet werden."
    },
    "flaw-in-crypto-implementation": {
      "title": "Fehler in der kryptographischen Implementierung",
      "description": "Schwachstellen oder Fehler in Hardware oder Software mit kryptographischen Funktionen können die Sicherheit der verwendeten kryptographischen Methoden beeinträchtigen.",
      "impact": "Wenn ein Implementierungsfehler in einer kryptographischen Funktion ausgenutzt wird, kann dies zu einem vollständigen Verlust der Vertraulichkeit der damit geschützten Daten führen.",
      "asvs": "BSI IT-Grundschutz CON.1 Kryptokonzept; OWASP Top 10 2021 A02: Kryptographische Fehler.",
      "action": "Kryptographische Implementierungen validieren und überprüfen",
      "mitigation": "Verwenden Sie gut überprüfte, standardmäßige und aktuelle kryptographische Bibliotheken und Algorithmen aus vertrauenswürdigen Quellen.",
      "check": "Basieren kryptographische Implementierungen auf standardmäßigen, aktuellen Bibliotheken? Gibt es einen Prozess zum Patchen von kryptographischen Komponenten?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Kryptographie verwenden, entweder für Daten im Ruhezustand oder für Daten während der Übertragung.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei eigenentwickelter Kryptographie höher und bei standardmäßigen, gepatchten Komponenten niedriger. Die Auswirkung ist direkt ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn eine Komponente als "
    },
    "hardware-crypto-failure-con8-a23": {
      "title": "Ausfall nicht-redundanter kryptographischer Hardware (BSI CON.8.A23)",
      "description": "Hardware mit kryptographischen Funktionen (z. B. Hardware Security Modules (HSM) oder hardwaregestützte Vaults) kann aufgrund technischer Defekte, Stromausfällen oder physischer Schäden ausfallen.",
      "impact": "Ein Ausfall nicht-redundanter kryptographischer Hardware kann dazu führen, dass ganze Geschäftsprozessketten zum Erliegen kommen, insbesondere wenn andere Anwendungen oder Dienste von den nun unzugänglichen Informationen abhängen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.8 (Kryptographie), Anforderung CON.8.A23 (Redundanz von kryptographischen Komponenten).",
      "action": "Redundanz und Notfallwiederherstellung für kritische kryptographische Hardware sicherstellen",
      "mitigation": "Kritische Hardwarekomponenten mit kryptographischen Funktionen, wie HSMs, sollten redundant ausgelegt sein (z. B. in einer Cluster-Konfiguration).",
      "check": "Ist das technische Asset mit dem Flag `redundant: true` konfiguriert? Gibt es dokumentierte und getestete Notfallwiederherstellungspläne für diese Hardwarekomponente?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets vom Technologietyp ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass eine einzelne Hardwarekomponente während ihrer Betriebsdauer ausfällt, wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Komponente nicht für geschäftskritische Echtzeitoperationen verwendet wird oder wenn alternative, effektive und getestete Wiederherstellungsverfahren existieren, die nicht durch das `redundant`-Flag im Modell erfasst sind."
    },
    "insecure-cryptographic-algorithms": {
      "title": "Verwendung unsicherer oder veralteter kryptographischer Algorithmen",
      "description": "Unsichere oder veraltete kryptographische Algorithmen können mit geringem Aufwand gebrochen werden. Bei Verschlüsselungsalgorithmen bedeutet dies, dass ein Angreifer den ursprünglichen Klartext aus dem verschlüsselten Text ableiten kann, ohne zusätzliche Informationen wie den kryptographischen Schlüssel zu benötigen.",
      "impact": "Die Nichtverwendung starker, aktueller Kryptographie kann zur Kompromittierung der Vertraulichkeit und Integrität von Daten führen, sowohl bei der Übertragung als auch im Ruhezustand. Dies kann zu Datenschutzverletzungen, unbefugtem Zugriff und Manipulation führen, was finanzielle Verluste, Reputationsschäden und Nichteinhaltung von Vorschriften zur Folge hat.",
      "asvs": "V6 Kryptographie, V13 Transport Layer Security",
      "action": "Starke, hochmoderne Kryptographie verwenden",
      "mitigation": "Stellen Sie sicher, dass alle Daten bei der Übertragung durch starke, hochmoderne Verschlüsselungsprotokolle (z. B. TLS 1.2+ mit modernen Cipher-Suiten) geschützt sind. Stellen Sie sicher, dass alle sensiblen Daten im Ruhezustand mit geprüften, branchenüblichen Algorithmen und starken Schlüsselmanagementpraktiken verschlüsselt sind.",
      "check": "Verwenden alle Kommunikationsverbindungen, die sensible Daten transportieren, ein verschlüsseltes Protokoll? Sind alle Datenspeicher mit sensiblen Informationen für die Verschlüsselung im Ruhezustand konfiguriert? Gibt es eine definierte Richtlinie für kryptographische Standards, die regelmäßig überprüft und aktualisiert wird?",
      "detectionLogic": "Diese Regel erkennt zwei primäre Bedingungen:",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung steigt erheblich, wenn unverschlüsselte Kommunikation Netzwerk-Vertrauensgrenzen überschreitet oder internet-zugewandte Assets involviert sind. Die Auswirkung wird durch die Vertraulichkeits- und Integritätsanforderungen der übertragenen oder gespeicherten Daten bestimmt. Eine Datenschutzverletzung wird als wahrscheinlich angesehen, wenn hochsensible Daten ungeschützt bleiben.",
      "falsePositives": "Diese Regel kann unverschlüsselte Kommunikation innerhalb eines physisch sicheren Netzwerks oder innerhalb eines äußeren verschlüsselten Tunnels (wie VPN oder IPsec) kennzeichnen, der nicht explizit modelliert ist. Sie erkennt möglicherweise auch keine Verschlüsselung auf Anwendungsebene, wenn die Daten über ein unverschlüsseltes Protokoll gesendet werden, da dies tiefere Modelldetails erfordert."
    },
    "corruption-of-encrypted-data-or-keys": {
      "title": "Beschädigung von verschlüsselten Daten oder Schlüsseln führt zu Datenverlust",
      "description": "Wenn verschlüsselte Informationen (Chiffretext) oder der zugehörige kryptographische Schlüssel, selbst geringfügig, verändert werden, kann es unmöglich werden, die ursprünglichen Daten zu entschlüsseln.",
      "impact": "Die primäre Auswirkung ist ein Verlust der Verfügbarkeit für alle Daten, die mit dem kompromittierten Schlüssel verschlüsselt wurden oder deren Chiffretext beschädigt wurde.",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz-Bausteinen CON.1 (Kryptokonzept) und CON.8 (Schlüsselmanagement). Bezieht sich auch auf OWASP Top 10 A02:2021 - Kryptographische Fehler.",
      "action": "Robuste Daten-@Backup:Target, Schlüsselmanagement und Integritätsprüfung implementieren",
      "mitigation": "Führen Sie regelmäßige, automatisierte Backups aller kritischen Daten durch. Stellen Sie entscheidend sicher, dass auch kryptographische Schlüssel sicher gesichert werden, zum Beispiel in einem Hardware Security Module (HSM), einem Vault oder einem anderen Schlüsselmanagementsystem.",
      "check": "Gibt es einen regelmäßig getesteten @Backup:Target- und Wiederherstellungsprozess für verschlüsselte Datenspeicher? Werden kryptographische Schlüssel sicher in einem separaten, widerstandsfähigen System (z. B. Vault, HSM) gespeichert und gesichert?",
      "detectionLogic": "Diese Regel zielt auf Datenspeicher ab, die Verschlüsselung verwenden, aber keine explizite Bestätigung eines getesteten @Backup:Target-Prozesses haben.",
      "riskAssessment": "Die Auswirkung dieses Risikos ist direkt proportional zur Verfügbarkeitsanforderung der gespeicherten Daten.",
      "falsePositives": "Ein Risiko kann gemeldet werden, wenn der @Backup:Target- und Wiederherstellungsprozess existiert, aber nicht im Modell über die "
    },
    "compromise-of-cryptographic-keys": {
      "title": "Kompromittierung von kryptographischen Schlüsseln (BSI)",
      "description": "Die Sicherheit kryptographischer Mechanismen hängt entscheidend von der Vertraulichkeit der verwendeten kryptographischen Schlüssel ab.",
      "impact": "Wenn ein Angreifer Zugang zu kryptographischen Schlüsseln erhält, müssen alle mit diesen Schlüsseln verschlüsselten Daten als kompromittiert betrachtet werden. Dies führt zu einem schweren Verlust der Vertraulichkeit und kann die Integrität und Authentizität von Daten untergraben, wenn die Schlüssel auch zum Signieren verwendet werden.",
      "asvs": "BSI IT-Grundschutz: CON.1 Kryptokonzept",
      "action": "Sicheres Schlüsselmanagement und -speicherung implementieren",
      "mitigation": "Speichern Sie kryptographische Schlüssel an einem sicheren, dedizierten Ort, wie einem Hardware Security Module (HSM) oder einem vertrauenswürdigen Key-Vault-Dienst.",
      "check": "Werden kryptographische Schlüssel in einem dedizierten sicheren Managementsystem (HSM, Vault) gespeichert? Werden Schlüssel jemals im Klartext in Konfigurationsdateien, Quellcode oder ungesicherten Backups gespeichert? Gibt es eine Schlüsselrotationsrichtlinie?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die Verschlüsselung auf Anwendungsebene verwenden, aber keine spezialisierten Schlüsselmanagementsysteme (wie Vaults oder HSMs) sind und anscheinend nicht mit einem solchen kommunizieren.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei eigenentwickelten Komponenten, die ihre eigene Verschlüsselung ohne Integration eines dedizierten Schlüsselmanagementsystems durchführen, hoch.",
      "falsePositives": "Ein Risiko kann ein Fehlalarm sein, wenn ein Asset einen sicheren, aber nicht modellierten Schlüsselmanagementmechanismus verwendet (z. B. die Verwendung sicherer OS-Schlüsselspeicher oder eines Schlüsselmanagementdienstes, der nicht als separates Asset im Modell dargestellt ist)."
    },
    "forged-certificates": {
      "title": "Fälschung von Zertifikaten (BSI CON.4)",
      "description": "Zertifikate werden verwendet, um einen öffentlichen kryptographischen Schlüssel an eine Identität (Person, IT-System oder Institution) zu binden.",
      "impact": "Wenn ein gefälschtes Zertifikat akzeptiert wird, kann ein Angreifer ein legitimes System oder einen Benutzer imitieren, was zu Man-in-the-Middle (MITM)-Angriffen führt.",
      "asvs": "V14.2.1",
      "action": "Robuste Zertifikats- und Vertrauenskettenvalidierung implementieren",
      "mitigation": "Die Client-Anwendung, die sich mit einem Dienst verbindet, muss eine strikte Validierung des vorgelegten TLS-Zertifikats durchführen. Dies umfasst:",
      "check": "Validiert der Anwendungscode die vollständige Zertifikatskette jedes Kommunikationspartners? Führt er eine Hostnamen-Überprüfung durch? Ist eine Sperrlistenprüfung implementiert? Werden selbstsignierte oder abgelaufene Zertifikate abgelehnt?",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung ausgelöst, die ein zertifikatbasiertes Protokoll (z. B. HTTPS, LDAPS) verwendet oder eine Client-Zertifikatsauthentifizierung erfordert.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist bei der Kommunikation über Netzwerk-Vertrauensgrenzen hinweg höher, da dies die Möglichkeit für MITM-Angriffe erhöht.",
      "falsePositives": "Dies kann ein Fehlalarm sein, wenn die Anwendung explizit entwickelt wurde, um alle erforderlichen Zertifikatsvalidierungsschritte korrekt durchzuführen."
    },
    "fundamental-rights-interference": {
      "title": "Ungenügend geminderte Eingriffe in Grundrechte (BSI Risikotyp A)",
      "description": "Dieses Risiko betrifft Szenarien, in denen die Verarbeitung personenbezogener Daten in die Grundrechte von Einzelpersonen eingreift, ohne dass dies ausreichend gemindert oder minimiert wird (",
      "impact": "Die unzureichende Minderung der Auswirkungen der Datenverarbeitung auf die Grundrechte kann zu schwerwiegenden rechtlichen und finanziellen Konsequenzen führen, einschließlich erheblicher Bußgelder nach der DSGVO und anderen Datenschutzgesetzen.",
      "asvs": "Dieses Konzept ist zentral für rechtliche Rahmenwerke wie die DSGVO, insbesondere Artikel 5 (Grundsätze für die Verarbeitung personenbezogener Daten) und Artikel 25 (Datenschutz durch Technikgestaltung und durch datenschutzfreundliche Voreinstellungen). Es ist auch ein Kernprinzip des BSI",
      "action": "Datenschutz durch Technikgestaltung und durch datenschutzfreundliche Voreinstellungen (DPbDD) implementieren",
      "mitigation": "Halten Sie sich strikt an die Grundsätze der Datenminimierung und Zweckbindung. Erheben, verarbeiten und speichern Sie nur personenbezogene Daten, die für einen klar definierten und legitimen Zweck absolut notwendig sind.",
      "check": "Wurde eine Datenschutz-Folgenabschätzung (DSFA) durchgeführt? Sind alle verarbeiteten personenbezogenen Daten für den definierten Geschäftszweck unbedingt erforderlich?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die eine erhebliche Menge hochsensibler personenbezogener Daten verarbeiten oder speichern.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Vertraulichkeits- und Kritikalitätsbewertung des Daten-Assets ab, da dies den potenziellen Schaden für die Einzelperson widerspiegelt.",
      "falsePositives": "Diese Regel kann bei Systemen auslösen, die rechtmäßig und legal große Mengen sensibler personenbezogener Daten verarbeiten (z. B. ein Krankenhaus"
    },
    "inherent-risk-of-processing-@DataType:PII-gdpr75": {
      "title": "Inhärentes Risiko der Verarbeitung personenbezogener Daten (DSGVO Erwägungsgrund 75)",
      "description": "Die Verarbeitung personenbezogener Daten birgt inhärent Risiken für die Rechte und Freiheiten natürlicher Personen, mit unterschiedlicher Eintrittswahrscheinlichkeit und Schwere. Diese Risiken können zu physischem, materiellem oder immateriellem Schaden führen, wenn Daten kompromittiert werden, zum Beispiel durch unbefugten Zugriff, Verarbeitung oder Offenlegung.",
      "impact": "Eine Verletzung, die personenbezogene Daten betrifft, kann schwerwiegende Folgen haben, einschließlich Diskriminierung, Identitätsdiebstahl oder -betrug, finanzielle Verluste, Reputationsschäden, Verlust der Vertraulichkeit von Daten, die dem Berufsgeheimnis unterliegen, unbefugte Aufhebung der Pseudonymisierung oder andere erhebliche wirtschaftliche oder soziale Nachteile. Einzelpersonen können die Kontrolle über ihre personenbezogenen Daten verlieren, insbesondere wenn besondere Kategorien von Daten (z. B. Gesundheit, ethnische Herkunft, politische Meinungen) betroffen sind, wenn Profiling durchgeführt wird oder wenn schutzbedürftige Personen betroffen sind.",
      "asvs": "DSGVO Erwägungsgrund 75",
      "action": "Geeignete technische und organisatorische Maßnahmen (TOMs) implementieren",
      "mitigation": "Implementieren Sie eine tiefgreifende Verteidigungsstrategie, die auf einer Datenschutz-Folgenabschätzung (DSFA) basiert. Zu den wichtigsten Maßnahmen gehören eine starke Zugriffskontrolle, Datenminimierung, Pseudonymisierung und Verschlüsselung (sowohl bei der Übertragung als auch im Ruhezustand). Wenden Sie die Grundsätze von Security-by-Design und Security-by-Default an. Testen, bewerten und evaluieren Sie regelmäßig die Wirksamkeit der umgesetzten Maßnahmen. Stellen Sie sicher, dass die Datenverarbeitung auf das für den angegebenen Zweck Notwendige beschränkt ist.",
      "check": "Gibt es eine Datenschutz-Folgenabschätzung (DSFA) für die Verarbeitung dieser Daten? Sind die Daten-Assets korrekt klassifiziert? Ist der Zugriff streng auf einer ",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das Daten-Assets verarbeitet oder speichert, die als personenbezogene Informationen identifiziert wurden (über Tags oder hohe Vertraulichkeit). Das Risikoniveau wird basierend auf der Sensibilität und Menge der Daten sowie der Exposition des technischen Assets (z. B. internet-zugewandt) angepasst.",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit der Vertraulichkeit und der Menge der verarbeiteten oder gespeicherten personenbezogenen Daten. Besondere Kategorien von Daten (z. B. Gesundheitsdaten) oder Daten über schutzbedürftige Personen erhöhen die Auswirkung erheblich. Die Wahrscheinlichkeit einer Ausnutzung steigt, wenn das Asset internet-zugewandt, eigenentwickelt oder Teil einer weniger kontrollierten Umgebung (wie einem Client-Gerät) ist, da diese Faktoren die Angriffsfläche vergrößern.",
      "falsePositives": "Das Risiko kann gemeldet werden, auch wenn starke, nicht modellierte kompensierende Kontrollen vorhanden sind. Eine formale DSFA hat möglicherweise das Risiko bewertet und es mit den bestehenden Kontrollen als akzeptabel eingestuft. Dieses generierte Risiko sollte als Anstoß dienen, um zu überprüfen, dass solche Bewertungen und Kontrollen existieren und wirksam sind."
    },
    "incorrectly-assessed-protection-requirement-for-@DataType:PII": {
      "title": "Falsch eingeschätzter Schutzbedarf für personenbezogene Daten (BSI-Stil)",
      "description": "Eine Institution könnte den Schutzbedarf für personenbezogene Daten falsch einschätzen und ihn typischerweise zu niedrig ansetzen. Dies kann passieren, wenn die erweiterten Datenschutzziele (über die Standard-CIA hinaus) ignoriert werden, wenn es",
      "impact": "Die falsche Einschätzung des Schutzbedarfs für personenbezogene Daten kann zu unzureichenden Schutzmaßnahmen führen. Dies erhöht das Risiko von Datenschutzverletzungen und verletzt die Grundrechte und -freiheiten der betroffenen Personen. Die Folgen können erhebliche rechtliche und finanzielle Strafen (z. B. nach der DSGVO), Reputationsschäden und der Verlust des Kundenvertrauens sein.",
      "asvs": "Abgeleitet von Datenschutzprinzipien wie denen in der DSGVO (Art. 5, Art. 25, Art. 32) und dem BSI",
      "action": "CIA-Bewertungen für personenbezogene Daten überprüfen und korrigieren",
      "mitigation": "Stellen Sie sicher, dass alle Daten-Assets, die personenbezogene Informationen enthalten, korrekt identifiziert und gekennzeichnet sind (z. B. mit `@DataType:PII`). Führen Sie eine ordnungsgemäße Datenschutz-Folgenabschätzung (DSFA) durch, um das wahre Risiko für die betroffenen Personen zu ermitteln. Passen Sie die Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen im Bedrohungsmodell an, um die Ergebnisse der DSFA widerzuspiegeln und sicherzustellen, dass die Schutzstufen angemessen sind und den gesetzlichen Anforderungen wie der DSGVO entsprechen. Die Begründung für die Bewertung sollte dokumentiert werden.",
      "check": "Sind alle Daten-Assets, die personenbezogene Informationen enthalten, angemessen gekennzeichnet (z. B. `@DataType:PII`)? Spiegeln die CIA-Bewertungen dieser Assets die potenziellen Auswirkungen einer Verletzung auf die betroffenen Personen wider, in Übereinstimmung mit Datenschutzgesetzen wie der DSGVO?",
      "detectionLogic": "Diese Regel sucht nach Daten-Assets, die als personenbezogene Daten (`@DataType:PII`) gekennzeichnet sind, aber verdächtig niedrige Vertraulichkeits-, Integritäts- oder Verfügbarkeitsbewertungen aufweisen. Ein Risiko wird dann für jedes technische Asset ausgelöst, das diese unzureichend geschützten Daten verarbeitet oder speichert, da dies auf ein Versäumnis beim Datenschutz durch Technikgestaltung hinweist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn eine Fehlkonfiguration erkannt wird, da sie eine dauerhafte Schwäche darstellt. Die Auswirkung einer Verletzung personenbezogener Daten auf die betroffene Person ist an sich hoch. Das Modell berechnet den Schweregrad auf dieser Grundlage, und das Risiko wird als potenzieller Modellfehler gekennzeichnet, weil das Modell",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn die Daten effektiv pseudonymisiert oder anonymisiert wurden, was das Risiko für die betroffene Person erheblich senkt, diese Nuance aber nicht im Modell erfasst ist."
    },
    "insufficient-or-ineffective-controls-bsi-type-b": {
      "title": "Unzureichende oder unwirksame Kontrollen (BSI Risikotyp B)",
      "description": "Dieses Risiko beschreibt ein Szenario, in dem die Sicherheitsmaßnahmen, die ein System und seine Daten schützen sollen (d. h. die ",
      "impact": "Die Nichtumsetzung und -aufrechterhaltung wirksamer Kontrollen untergräbt direkt die Schutzziele Vertraulichkeit, Integrität und Verfügbarkeit. Dies kann zu unbefugtem Zugriff, Datenmanipulation, Dienstunterbrechung, Datenschutzverletzungen und Nichteinhaltung gesetzlicher/vertraglicher Verpflichtungen führen, was erhebliche finanzielle, rufschädigende und rechtliche Schäden zur Folge hat.",
      "asvs": "BSI IT-Grundschutz DER.1.A7 (Überprüfung der Funktionsfähigkeit von Sicherheitsfunktionen) und die breiteren Konzepte von CON.1 (Sicherheitstests).",
      "action": "Einen robusten Lebenszyklus für Sicherheitskontrollen implementieren",
      "mitigation": "Stellen Sie eine tiefgreifende Verteidigungsstrategie sicher, bei der Kontrollen geschichtet sind. Alle Sicherheitskontrollen (z. B. Authentifizierung, Autorisierung, Verschlüsselung, Eingabevalidierung, Netzwerkfilterung) müssen explizit entworfen, korrekt implementiert und gründlich getestet werden. Etablieren Sie einen kontinuierlichen Überwachungs- und Auditprozess, einschließlich regelmäßiger Schwachstellenscans, Penetrationstests und Protokollanalysen, um zu überprüfen, dass alle Sicherheitskontrollen effektiv arbeiten und sich im Laufe der Zeit nicht verschlechtert haben.",
      "check": "Sind alle Sicherheitskontrollen für das Asset dokumentiert? Gibt es einen Prozess zur regelmäßigen Überprüfung der Wirksamkeit dieser Kontrollen (z. B. Audit, Pentest)? Gibt es eine aktive Sicherheitsüberwachung (z. B. SIEM, IDS/IPS), um Kontrollfehler oder Umgehungsversuche zu erkennen? Werden Sicherheitsprotokolle regelmäßig überprüft?",
      "detectionLogic": "Dies ist ein Metarisiko, das schwer automatisch zu erkennen ist. Es wird für jedes im Geltungsbereich befindliche technische Asset mit einer nicht-trivialen CIA-Bewertung (d. h. über dem Niveau öffentlich/archiviert) ausgelöst. Das Vorhandensein des Risikos dient als obligatorischer Prüfpunkt, um manuell zu verifizieren, dass die dokumentierten und implementierten Sicherheitskontrollen für das Asset vollständig, wirksam und kontinuierlich überwacht werden.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein Asset robuste, wirksame und gut überwachte Kontrollen hat, die nicht vollständig im Bedrohungsmodell detailliert sind. Das Risiko sollte nach einer manuellen Überprüfung und Bestätigung der Kontrolllandschaft akzeptiert oder als Fehlalarm markiert werden."
    },
    "incomplete-or-ineffective-security-measures": {
      "title": "Unvollständige oder unwirksame Sicherheitsmaßnahmen (BSI Risikotyp C)",
      "description": "Dieses Risiko entsteht, wenn die durch Informationssicherheitsrichtlinien (z. B. gemäß BSI IT-Grundschutz) geforderten Sicherheitsmaßnahmen nicht vollständig umgesetzt, nicht mit ausreichender Wirksamkeit betrieben oder nicht kontinuierlich überwacht, auditiert und bewertet werden. Ein Mangel an Überwachung und Kontrolle über kritische Systemkomponenten ist ein primärer Indikator für diese Schwäche, da er die Erkennung von Angriffen und Betriebsstörungen verhindert und Schwachstellen ungeschützt lässt.",
      "impact": "Das Versäumnis, Sicherheitsmaßnahmen effektiv zu implementieren, zu betreiben und zu kontrollieren, kann zur Kompromittierung der Vertraulichkeit, Integrität und Verfügbarkeit kritischer Assets führen. Ohne angemessene Überwachung können Sicherheitsvorfälle unbemerkt bleiben, was Angreifern längere Zeit ermöglicht, sich auszubreiten, Privilegien zu eskalieren und Daten zu exfiltrieren. Dies kann zu schweren Datenschutzverletzungen, Systemausfällen, finanziellen Verlusten und Reputationsschäden führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein DER.1: Sicherheitsüberwachung und -erkennung. Dieses Risiko bezieht sich direkt auf Anforderungen wie DER.1.A2 (Vernetzte Protokollierung) und DER.1.A4 (Auswahl geeigneter protokollierungswürdiger Ereignisse).",
      "action": "Umfassende Sicherheitsüberwachung implementieren und betreiben",
      "mitigation": "Etablieren Sie eine robuste Sicherheitsüberwachungs- und Erkennungsfähigkeit. Wichtige Komponenten sollten relevante Sicherheits- und Betriebsprotokolle an ein zentrales, geschütztes Protokollierungssystem (z. B. SIEM) senden. Definieren und überwachen Sie Ereignisse, die auf potenzielle Sicherheitsvorfälle für alle kritischen Assets hinweisen. Stellen Sie sicher, dass die Überwachungssysteme selbst sicher sind und dass definierte Prozesse zur Analyse von Ereignissen und zur Reaktion auf Alarme vorhanden sind. Überprüfen und auditieren Sie regelmäßig die Wirksamkeit der Überwachungskontrollen.",
      "check": "Sind alle kritischen technischen Assets so konfiguriert, dass sie Protokolle an ein zentrales Überwachungssystem senden? Gibt es Alarme für verdächtige Aktivitäten? Gibt es einen definierten Prozess für die Erkennung und Reaktion auf Vorfälle basierend auf Überwachungsereignissen? Sind die Überwachungsprotokolle vor Manipulation geschützt?",
      "detectionLogic": "Diese Regel identifiziert kritische technische Assets, denen eine modellierte Kommunikationsverbindung zu einem Überwachungssystem fehlt. Sie kennzeichnet im Geltungsbereich befindliche Assets, die als sensibel gelten (aufgrund hoher CIA-Bewertungen) oder von einem kritischen Technologietyp sind (wie Webanwendungen, Datenbanken oder Identitätsanbieter), aber anscheinend keine Daten an ein Asset mit dem ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Vertraulichkeits- und Integritätsbewertung des nicht überwachten technischen Assets ab. Die Wahrscheinlichkeit einer unentdeckten Kompromittierung wird als ",
      "falsePositives": "Ein Fehlalarm kann auftreten, wenn die Überwachungsarchitektur nicht vollständig im Modell dargestellt ist. Beispielsweise kann die Überwachung durch einen Agenten auf einem gemeinsam genutzten Host oder über Netzwerk-Taps auf Netzwerkebene erfolgen, die nicht als explizite Kommunikationsverbindungen von jedem Asset modelliert sind. Dieses Risiko sollte gegen die tatsächliche Überwachungsimplementierung validiert werden."
    },
    "inadequate-data-protection-in-security-measures-bsi-d": {
      "title": "Unzureichender Datenschutz in Sicherheitsmaßnahmen (BSI Risikotyp D)",
      "description": "Informationssicherheitsmaßnahmen wie Protokollierung, Überwachung oder Verkehrsinspektionssysteme (WAF, IDS/IPS) werden nicht immer so betrieben, dass sie den Datenschutzgrundsätzen ausreichend entsprechen.",
      "impact": "Wenn Sicherheitsmaßnahmen sensible oder personenbezogene Daten unsachgemäß handhaben, kann dies zu schweren Datenschutzverletzungen und Datenlecks führen.",
      "asvs": "BSI IT-Grundschutz CON.1.A5 Datenminimierung",
      "action": "Sicherstellen, dass Sicherheitsmaßnahmen den Datenschutzgrundsätzen entsprechen",
      "mitigation": "Überprüfen Sie die Konfiguration aller sicherheitsrelevanten Komponenten (z. B. WAFs, IDS/IPS, APM, Überwachungs-/Protokollierungssysteme), um eine strikte Datenminimierung sicherzustellen.",
      "check": "Verarbeiten Sicherheitskomponenten nur die für ihre Funktion minimal erforderlichen Daten? Werden sensible Daten (Anmeldeinformationen, Token, @DataType:PII) in Protokollen und Traces redigiert oder maskiert?",
      "detectionLogic": "Dieser Generator wird nur ausgeführt, wenn der ausgewählte Bedrohungsstandard ",
      "riskAssessment": "Die Auswirkung skaliert mit der Vertraulichkeit der von der Sicherheitskomponente verarbeiteten Daten: die Verarbeitung von ",
      "falsePositives": "Ein Befund kann ein Fehlalarm sein, wenn die Sicherheitskomponente explizit so konfiguriert und überprüft wurde, dass sie datenschutzkonform ist (z. B. redigiert sie alle sensiblen Felder vor der Verarbeitung oder Protokollierung und erzwingt eine minimale Aufbewahrungsfrist)."
    },
    "inadequate-consideration-of-privacy-risks": {
      "title": "Unzureichende Berücksichtigung von Datenschutzrisiken",
      "description": "Das BSI merkt an: ",
      "impact": "Die unzureichende Bewertung von Datenschutzrisiken für Systeme, die personenbezogene Daten verarbeiten, kann zu Verletzungen der Rechte der betroffenen Personen führen.",
      "asvs": "Abgeleitet von den Grundsätzen des Artikels 35 der DSGVO (Datenschutz-Folgenabschätzung - DSFA), der die Bewertung von Risiken für die Rechte und Freiheiten natürlicher Personen vorschreibt.",
      "action": "Eine Datenschutz-Folgenabschätzung (DSFA) durchführen",
      "mitigation": "Führen Sie für alle Komponenten, die personenbezogene oder sensible Daten verarbeiten, eine Datenschutz-Folgenabschätzung (DSFA) durch und dokumentieren Sie diese. Dieser Prozess sollte über die standardmäßige Bedrohungsmodellierung hinausgehen, um Risiken für die betroffenen Personen explizit zu identifizieren und zu bewerten.",
      "check": "Gibt es eine dokumentierte DSFA für Systeme, die personenbezogene Daten verarbeiten? Berücksichtigt das Risikoinventar für diese Systeme datenschutzspezifische Bedrohungen? Wurden die Grundsätze der Datenminimierung und Zweckbindung angewendet?",
      "detectionLogic": "Diese Regel identifiziert heuristisch technische Assets, die hochsensible Daten verarbeiten (basierend auf der Vertraulichkeitsbewertung oder @DataType:PII-Tags), aber eine überraschend geringe Anzahl identifizierter Risiken oder nur Risiken mit geringem Schweregrad aufweisen. Dies deutet darauf hin, dass die spezifischen, oft komplexen Datenschutzrisiken, die mit den Daten verbunden sind, während des Bedrohungsmodellierungsprozesses möglicherweise übersehen wurden.",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Governance-Fehlers wird als hoch angesehen, wenn eine Komponente sensible personenbezogene Daten verarbeitet, ohne dass ein entsprechendes hochgradiges Risiko identifiziert wurde, was auf eine unvollständige Analyse hindeutet. Die Auswirkung ist direkt proportional zur Sensibilität und Menge der verarbeiteten personenbezogenen Daten, da dies den potenziellen Schaden für die betroffenen Personen und die rechtliche Haftung für die Organisation bestimmt.",
      "falsePositives": "Ein System kann wirklich gut konzipiert und sicher sein, was zu wenigen identifizierten Risiken führt. Dieses Risiko soll eine manuelle Überprüfung auslösen: "
    },
    "non-compliant-data-processing-purpose-limitation": {
      "title": "Nicht konforme Datenverarbeitung (Zweckbindung & Transparenz)",
      "description": "Die Verarbeitung personenbezogener Daten ist nicht konform, wenn die Zwecke undefiniert, überdehnt oder von der ursprünglichen Rechtsgrundlage (DSGVO Art. 5) losgelöst sind. Dies schließt intransparente Verarbeitung oder fehlende Integritätssicherungen ein, insbesondere wenn Hilfs-/Entwicklungs-/Überwachungssysteme Produktionsdaten ohne einen dokumentierten, legitimen Zweck berühren.",
      "impact": "Verstöße können behördliche Strafen (z. B. DSGVO), Schadensersatz, Vertrauensverlust und Missbrauch sensibler Daten auslösen. Die Auswirkung wächst mit den Vertraulichkeits- und Integritätsanforderungen der Daten und mit der Entfernung zwischen dem Zweck des Systems und der beabsichtigten Nutzung der Daten.",
      "asvs": "Abgeleitet von DSGVO Artikel 5(1)(b) ",
      "action": "Rechtmäßige Zwecke dokumentieren und technische Zweckbindung durchsetzen",
      "mitigation": "Definieren und dokumentieren Sie spezifische, explizite, legitime Zwecke pro Daten-Asset (z. B. in RoPA/DSFA). Setzen Sie das Prinzip der geringsten Rechte und zweckgebundene Zugriffspfade durch, sodass Hilfs-/Entwicklungs-/Überwachungstools standardmäßig keine produktiven personenbezogenen Daten verarbeiten können. Minimieren, pseudonymisieren oder verwenden Sie synthetische/Testdaten für nicht-produktive Zwecke. Überprüfen Sie regelmäßig die Datenflüsse, um Zweckentfremdung zu verhindern und ungenutzte Zugriffe zu widerrufen.",
      "check": "Ist der Zweck jedes Daten-Assets dokumentiert und mit einer Rechtsgrundlage verknüpft? Werden Hilfs-/Entwicklungs-/Überwachungstools (durch Design) daran gehindert, auf produktive personenbezogene Daten zuzugreifen? Sind die RoPA/DSFA-Einträge aktuell und sind die Protokollierungs-/Überwachungskontrollen transparent und gerechtfertigt? Gibt es eine regelmäßige Überprüfung auf Zweckentfremdung und nicht wesentlichen Datenzugriff?",
      "detectionLogic": "Kennzeichnet technische Assets mit Hilfs-, Entwicklungs- oder Überwachungsfunktionen, die sensible oder geschäftskritische Daten-Assets verarbeiten oder speichern. Die Regel berücksichtigt Technologiehinweise (Entwicklungsrelevanz oder Toleranz unnötiger Daten) und Datenattribute (Vertraulichkeit/Integrität). Die Wahrscheinlichkeit steigt, wenn modellierte Datenflüsse zeigen, dass diese Assets Produktions- oder Geschäftsdaten verarbeiten.",
      "riskAssessment": "Die Auswirkung skaliert mit der Vertraulichkeit/Integrität der beteiligten Daten: hoch bei streng vertraulichen oder kritischen Integritätsdaten, mittel bei eingeschränkten/wichtigen, ansonsten niedrig. Die Wahrscheinlichkeit wird auf ",
      "falsePositives": "Kann akzeptabel sein, wenn eine dokumentierte Rechtsgrundlage und technische Schutzmaßnahmen existieren (z. B. autorisierte Sicherheitsinspektion sensibler Ströme, eng gefasste Fehlerbehebung mit pseudonymisierten Daten oder synthetische Daten in Nicht-Produktionsumgebungen). Nur mit klarer Begründung in RoPA/DSFA und Zugriffsprotokollen als Fehlalarm markieren."
    },
    "inherent-risk-of-processing-personal-data": {
      "title": "Inhärentes Risiko der Verarbeitung personenbezogener Daten (basierend auf der BSI-Datenschutzsicht)",
      "description": "Aus datenschutzrechtlicher Sicht stellt jede Institution, die personenbezogene Daten verarbeitet (z. B. sammelt, speichert, übermittelt oder löscht), grundsätzlich ein Risiko für die betroffenen Personen dar. Dieses Risiko ist dem Akt der Datenverarbeitung selbst inhärent und besteht auch dann, wenn alle Operationen rechtlich konform gestaltet sind (z. B. nach DSGVO). Es ist das Grundrisiko, das durch Sicherheitsmaßnahmen gemanagt und gemindert werden soll.",
      "impact": "Sollte sich dieses inhärente Risiko zu einer Datenschutzverletzung entwickeln, kann die Kompromittierung personenbezogener Daten zu erheblichem Schaden für Einzelpersonen führen, einschließlich Identitätsdiebstahl, finanziellem Verlust, Diskriminierung und Reputationsschaden. Für die Institution können die Folgen schwere rechtliche Strafen, Verlust des Kundenvertrauens und erhebliche finanzielle Auswirkungen sein.",
      "asvs": "Dieses Konzept ist ein grundlegendes Prinzip von Datenschutzrahmen wie der DSGVO (Art. 5, 24, 25, 32) und wird nicht von einem einzelnen ASVS-Punkt abgedeckt. Es bezieht sich auf die Gesamtverantwortung des Datenverantwortlichen.",
      "action": "Inhärentes Datenverarbeitungsrisiko anerkennen, managen und minimieren",
      "mitigation": "Obwohl dieses inhärente Risiko nicht vollständig beseitigt werden kann, muss es durch die Implementierung eines mehrschichtigen ",
      "check": "Erkennt die Organisation die inhärenten Risiken der Verarbeitung personenbezogener Daten an? Werden Datenschutz-Folgenabschätzungen (DSFAs) durchgeführt, wo erforderlich? Werden Prinzipien wie Datenminimierung und ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset generiert, das Daten-Assets verarbeitet oder speichert, die mit hoher Sensibilität klassifiziert sind (d. h. ",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann nur als "
    },
    "data-access-beyond-original-purpose": {
      "title": "Unbefugter Datenzugriff über den ursprünglichen Zweck hinaus",
      "description": "Ein in der Praxis häufig auftretendes Risiko ist der Zugriff auf Daten, der nicht dem Zweck der ursprünglichen Datenverarbeitung dient.",
      "impact": "Der Zugriff auf Daten über ihren beabsichtigten und rechtlich begründeten Zweck hinaus kann zu schweren Datenschutzverletzungen (wie personenbezogene Daten/PII) führen, was zu erheblichen Bußgeldern, Reputationsschäden und dem Verlust des Kundenvertrauens führt. Es kompromittiert direkt die Vertraulichkeit und Integrität der beteiligten Daten-Assets.",
      "asvs": "ASVS V13.1 (Datenschutz)",
      "action": "Zweckbindung und strenge Zugriffskontrolle durchsetzen",
      "mitigation": "Implementieren Sie strenge, rollenbasierte Zugriffskontrollen, die auf dem Prinzip der geringsten Rechte basieren (",
      "check": "Gibt es ein dokumentiertes Verzeichnis der Datenverarbeitungszwecke? Sind alle Datenflüsse, insbesondere zu externen Entitäten oder über verschiedene Nutzungskontexte (Business, DevOps) hinweg, durch einen dokumentierten Zweck und eine Rechtsgrundlage gerechtfertigt? Wird der Zugriff auf sensible Daten protokolliert und auf Anomalien überprüft?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, bei denen Daten zwischen verschiedenen Kontexten fließen, was auf eine potenzielle Zweckverletzung hindeutet.",
      "riskAssessment": "Die Auswirkung wird durch die Sensibilität (Vertraulichkeit und Integrität) der übertragenen Daten bestimmt. Je höher die Sensibilität, desto höher die Auswirkung einer Zweckverletzung.",
      "falsePositives": "Legitime und gut dokumentierte Datenübertragungen an Partner oder Dienstleister können gekennzeichnet werden."
    },
    "lack-of-standardized-process-for-third-party-access": {
      "title": "Fehlender standardisierter Prozess für den Zugriff Dritter",
      "description": "Ein Risiko besteht sowohl für Einzelpersonen als auch für die verantwortliche Institution, wenn es keine standardisierten Prozesse für den legitimen Zugriff auf IT-Dienste oder die Datenübertragung durch Dritte gibt. Das Risiko wird verschärft, wenn die Legitimität dieser Aktionen nicht durch Protokolle und Dokumentation nachgewiesen werden kann.",
      "impact": "Dies kann zu unbefugtem oder nicht nachvollziehbarem Zugriff führen, was es unmöglich macht, Dritte für ihre Handlungen zur Rechenschaft zu ziehen. Es erleichtert die Abstreitbarkeit, bei der ein Dritter seine Handlungen leugnen kann. Dies kann zu Datenschutzverletzungen, unbefugten Änderungen oder Dienstunterbrechungen mit erheblichen rechtlichen, finanziellen und rufschädigenden Konsequenzen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.2 (Lieferantenmanagement), insbesondere Anforderungen wie ORP.2.A5 (Festlegung und Umsetzung von Regeln für den Informationsaustausch) und ORP.2.A8 (Überwachung, Überprüfung und Auditierung von Lieferantendiensten).",
      "action": "Standard-Zugriffsverfahren für Dritte definieren und durchsetzen",
      "mitigation": "Etablieren Sie klare, dokumentierte Verfahren für die Gewährung, Überwachung und den Widerruf des Zugriffs durch Dritte. Alle Kommunikationsverbindungen von externen Entitäten müssen eine starke Authentifizierung (z. B. Token, Client-Zertifikate) und Autorisierung erzwingen. Stellen Sie sicher, dass jeder Zugriff mit ausreichenden Details protokolliert wird, um einen Audit-Trail zu erstellen, der die externe Entität, die Zugriffszeit und die durchgeführten Aktionen identifiziert. Erwägen Sie die Verwendung von VPN oder strikter IP-Filterung als kompensierende Kontrollen.",
      "check": "Gibt es einen dokumentierten Prozess für den Zugriff Dritter? Erfordern alle Kommunikationsverbindungen von externen Entitäten Authentifizierung und Autorisierung? Werden Zugriffsprotokolle erstellt und regelmäßig überprüft?",
      "detectionLogic": "Dieses Risiko wird durch die Analyse von Kommunikationsverbindungen erkannt, die von einer ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine Authentifizierung verwendet wird. Die Auswirkung hängt von der Sensibilität (CIA-Bewertungen) der übertragenen Daten-Assets und der Kritikalität des technischen Ziel-Assets ab. Der Zugriff auf unternehmenskritische Systeme oder streng vertrauliche Daten ohne prüfbaren Nachweis ist ein Ereignis mit hoher Auswirkung.",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn kompensierende Kontrollen außerhalb des Modells existieren, die nicht auf der Kommunikationsverbindung selbst dokumentiert sind."
    },
    "data-loss-without-@Backup:Target": {
      "title": "Risiko des dauerhaften Datenverlusts aufgrund fehlender @Backup:Target-Strategie (BSI)",
      "description": "Wenn Daten verloren gehen und zuvor nicht gesichert wurden, kann dies existenzielle Folgen für eine Institution haben.",
      "impact": "Der dauerhafte Verlust von Daten beeinträchtigt deren Verfügbarkeit und Integrität. Abhängig von der Kritikalität der betroffenen Daten kann dies ",
      "asvs": "BSI IT-Grundschutz CON.3 (Datensicherungskonzept). Obwohl kein direkter OWASP ASVS-Punkt, entspricht dies den allgemeinen Prinzipien der betrieblichen Widerstandsfähigkeit und des Datenschutzes.",
      "action": "Eine widerstandsfähige @Backup:Target- und Wiederherstellungsstrategie implementieren",
      "mitigation": "Implementieren Sie eine umfassende Daten-@Backup:Target- und Wiederherstellungsstrategie für alle kritischen Systeme, die Daten speichern.",
      "check": "Gibt es einen dokumentierten und regelmäßig getesteten @Backup:Target- und Wiederherstellungsplan für das Asset? Werden Backups an einem separaten, sicheren Ort gespeichert?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die typischerweise signifikante Daten speichern (z. B. Datenbanken, Dateiserver, Data Lakes) ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Ereignisses, das zu Datenverlust führt (z. B. Hardwarefehler, menschliches Versagen, Malware), wird als ",
      "falsePositives": "Eine @Backup:Target- und Wiederherstellungsstrategie kann für das Asset existieren, wurde aber nicht im Modell mit dem "
    },
    "ransomware-attack": {
      "title": "Ransomware-Angriff (BSI OPS.1.1.5)",
      "description": "Eine spezialisierte Form von Malware ist Ransomware, die Daten auf infizierten IT-Systemen verschlüsselt. Nach der Verschlüsselung wird ein Lösegeld gefordert, damit das Opfer die Daten wieder entschlüsseln kann.",
      "impact": "Wenn dieses Risiko ausgenutzt wird, werden Daten auf betroffenen Systemen verschlüsselt und unzugänglich, was zu einer massiven Störung der Geschäfts- und IT-Abläufe führt.",
      "asvs": "BSI IT-Grundschutz-Baustein OPS.1.1.5 Schutz vor Schadcode (bezogen auf Bedrohung T 5.143 Ransomware)",
      "action": "Mehrschichtige Ransomware-Abwehr implementieren",
      "mitigation": "Implementieren Sie eine robuste, mehrschichtige Verteidigungsstrategie. Dazu gehören: 1. Regelmäßige, automatisierte und getestete Backups. 2. Sicherstellen, dass primäre @Backup:Target-Kopien offline, mit Air-Gap oder in unveränderlichem Speicher gespeichert werden, um sie für Ransomware, die sich im Netzwerk ausbreitet, unzugänglich zu machen.",
      "check": "Werden Backups regelmäßig erstellt und getestet? Sind die @Backup:Target-Datenspeicher vor Schreibzugriff aus dem regulären Netzwerk geschützt (d. h. offline oder unveränderlich)? Werden die Berechtigungen für Dateifreigaben auf Datenspeichern überprüft und nach dem Prinzip der geringsten Rechte eingeschränkt?",
      "detectionLogic": "Diese Regel prüft auf Datenspeicher, die eingehende Kommunikationsverbindungen haben, die nicht ",
      "riskAssessment": "Die Wahrscheinlichkeit eines erfolgreichen Angriffs ist erheblich erhöht, wenn die schreibbare Verbindung von einem Client-Typ-Asset (z. B. Desktop, Browser) stammt, da diese häufige anfängliche Infektionsvektoren sind.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn der Schreibzugriff durch andere, nicht in Threagile modellierte Mechanismen streng kontrolliert wird (z. B. Anwendungslogik, spezifische OS-Benutzerberechtigungen) oder wenn das Quellsystem außergewöhnlich gehärtet und isoliert ist."
    },
    "untested-backups": {
      "title": "Ungetestete Backups führen zu Wiederherstellungsfehlern (BSI CON.3)",
      "description": "Wenn Daten regelmäßig gesichert werden, garantiert dies nicht automatisch, dass sie ohne Probleme wiederhergestellt werden können.",
      "impact": "Das Scheitern der Wiederherstellung aus Backups führt zu einem Verlust der Datenverfügbarkeit und potenziell der Integrität. Dies kann den Geschäftsbetrieb stören,",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein CON.3: Datensicherungskonzept.",
      "action": "Ein Backup- und Wiederherstellungsverfahren implementieren und regelmäßig testen",
      "mitigation": "Etablieren Sie einen formellen Backup- und Wiederherstellungsplan für alle kritischen Systeme. Testen Sie regelmäßig den Wiederherstellungsprozess für kritische Datenspeicher, um die Datenintegrität und die rechtzeitige Wiederherstellung sicherzustellen.",
      "check": "Gibt es einen dokumentierten Backup- und Wiederherstellungsplan? Werden die Wiederherstellungsverfahren regelmäßig getestet? Werden die Ergebnisse dieser Tests dokumentiert und überprüft? Kann das Team eine erfolgreiche Wiederherstellung aus einem aktuellen Backup nachweisen?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Daten speichern (z. B. Typ ",
      "riskAssessment": "Die Auswirkung ist direkt proportional zu den Verfügbarkeits- und Integritätsanforderungen des Assets und der von ihm gespeicherten Daten. Ein Datenspeicher für ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn Wiederherstellungstests durchgeführt, aber nicht im Bedrohungsmodell über die "
    },
    "unsafe-storage-of-@Backup:Target-media": {
      "title": "Unsichere Lagerung von @Backup:Target-Medien",
      "description": "@Backup:Target-Medien, ob traditionelle Bänder oder moderne Speichersysteme, enthalten sensible Informationen.",
      "impact": "Die Kompromittierung von @Backup:Target-Medien kann zu schweren Verletzungen der Vertraulichkeit (Datendiebstahl), Integrität (Datenmanipulation) und Verfügbarkeit (Datenverlust) führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium, speziell Baustein OPS.1.1.4 (Datensicherung). Dies adressiert Bedrohungen wie G 0.25 (Diebstahl von Geräten oder Datenträgern) und G 0.14 (Ausfall von Backup-Medien) und bezieht sich auf Anforderungen wie OPS.1.1.4.A7 (Schutz von @Backup:Target-Medien vor unbefugtem Zugriff) und OPS.1.1.4.A8 (Sachgemäße Lagerung von @Backup:Target-Medien).",
      "action": "Sichere physische und umwelttechnische Lagerung für @Backup:Target-Medien sicherstellen",
      "mitigation": "Lagern Sie alle @Backup:Target-Medien an einem sicheren, zugangskontrollierten Ort (z. B. einem verschlossenen Raum, einem feuerfesten Safe).",
      "check": "Werden @Backup:Target-Medien an einem verschlossenen, klimatisierten und zugangsbeschränkten Ort gelagert? Sind die Daten auf den @Backup:Target-Medien verschlüsselt? Gibt es eine dokumentierte Richtlinie für den Umgang, die Lagerung und den Transport von @Backup:Target-Medien?",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird basierend auf den höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen der auf dem @Backup:Target-Asset gespeicherten Daten berechnet.",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn das Asset, obwohl es so getaggt ist, bereits robusten physischen und umwelttechnischen Kontrollen unterliegt, die die Minderungsanforderungen erfüllen oder übertreffen. Solche Kontrollen liegen außerhalb des Geltungsbereichs eines typischen Bedrohungsmodells und müssen durch ein Audit oder eine Überprüfung der betrieblichen Verfahren bestätigt werden."
    },
    "inadequate-backup-and-recovery-documentation-con3": {
      "title": "Unzureichende Backup- und Wiederherstellungsdokumentation (BSI CON.3)",
      "description": "Wenn Datensicherungen und insbesondere Wiederherstellungsmaßnahmen nicht oder nur unzureichend dokumentiert sind, kann dies die Wiederherstellung nach einem Vorfall wie einem Hardwareausfall oder einem Ransomware-Angriff erheblich verzögern.",
      "impact": "Das Versäumnis, Systeme aufgrund schlechter oder unzugänglicher Dokumentation rechtzeitig wiederherzustellen, beeinträchtigt direkt die Geschäftskontinuität. Es kann zu erheblichen finanziellen Verlusten durch Betriebsausfälle, Reputationsschäden und dem dauerhaften Verlust kritischer oder sensibler Daten führen, was gegen die Prinzipien der Integrität und Verfügbarkeit verstößt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.3 (Datensicherungskonzept), insbesondere den Anforderungen CON.3.A5 (Wiederherstellungstests) und CON.3.A6 (Dokumentation von Datensicherungen).",
      "action": "Einen Wiederherstellungsplan erstellen, dokumentieren und regelmäßig testen",
      "mitigation": "Erstellen Sie einen detaillierten und klaren Wiederherstellungsplan für alle kritischen datenspeichernden Assets. Diese Dokumentation sollte regelmäßig durch Wiederherstellungsübungen getestet werden, um ihre Genauigkeit und Wirksamkeit sicherzustellen.",
      "check": "Gibt es einen dokumentierten Wiederherstellungsplan für das Asset? Wird er regelmäßig getestet? Wird eine Kopie sicher offline aufbewahrt und ist im Katastrophenfall zugänglich?",
      "detectionLogic": "Diese Regel zielt auf im Geltungsbereich befindliche technische Assets ab, die vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die Verfügbarkeits- und Integritätsbewertung des betroffenen Assets und seiner Daten bestimmt. Ein Asset mit ",
      "falsePositives": "Ein Wiederherstellungsplan kann existieren, wurde aber möglicherweise nicht im Modell getaggt. Diese Regel dient dazu, das Fehlen dieser Zusicherung im Modell hervorzuheben und eine Überprüfung anzustoßen."
    },
    "non-compliance-in-data-@Backup:Target-con3": {
      "title": "Nichteinhaltung gesetzlicher Anforderungen bei der Datensicherung (@Backup:Target) (BSI CON.3)",
      "description": "Wenn gesetzliche und regulatorische Anforderungen (z. B. @DataType:PII, branchenspezifische Datenschutzgesetze) während des Datensicherungsprozesses (@Backup:Target) nicht beachtet werden, ist die Organisation erheblichen Risiken ausgesetzt. Dies schließt das Versäumnis ein, notwendige Sicherheitskontrollen wie Verschlüsselung, Zugriffskontrolle und definierte Aufbewahrungsrichtlinien auf @Backup:Target-Daten anzuwenden. Ein unverschlüsseltes @Backup:Target sensibler Daten ist ein direkter Verstoß gegen die Sicherheitsprinzipien, die von den meisten Datenschutzgesetzen vorgeschrieben werden.",
      "impact": "Die Nichteinhaltung gesetzlicher Anforderungen für Datensicherungen kann schwerwiegende Konsequenzen haben. Aufsichtsbehörden können hohe Geldstrafen verhängen, und betroffene Parteien können Schadensersatz fordern. Dies kann zu erheblichen finanziellen Verlusten, Rechtsstreitigkeiten und schweren Reputationsschäden führen. Darüber hinaus sind unsachgemäß gesicherte Backups ein Hauptziel für Angreifer, und ihre Kompromittierung kann zu einer großen Datenschutzverletzung führen, die die Vertraulichkeit und Integrität sensibler Informationen verletzt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.3 (Datensicherungskonzept)",
      "action": "Sicherstellen, dass die @Backup:Target-Strategie den gesetzlichen und regulatorischen Anforderungen entspricht",
      "mitigation": "Die @Backup:Target-Strategie muss alle anwendbaren gesetzlichen, regulatorischen und vertraglichen Anforderungen berücksichtigen. Sensible Daten in Backups müssen durch starke Verschlüsselung im Ruhezustand geschützt werden. Der Zugriff auf @Backup:Target-Medien und -Systeme muss streng kontrolliert und protokolliert werden. Implementieren und erzwingen Sie Datenaufbewahrungs- und -löschrichtlinien für Backups, um sicherzustellen, dass Daten nicht länger als notwendig aufbewahrt werden. Testen Sie regelmäßig den @Backup:Target- und Wiederherstellungsprozess, um sowohl die technische Funktionalität als auch die Compliance zu überprüfen.",
      "check": "Sind alle gesetzlichen Anforderungen für Datensicherungen identifiziert und dokumentiert? Sind Backups, die sensible Daten enthalten, im Ruhezustand verschlüsselt? Werden die Zugriffskontrollen für Backups strikt durchgesetzt und auditiert? Gibt es definierte und durchgesetzte Aufbewahrungs-/Löschrichtlinien für Backups?",
      "detectionLogic": "Diese Regel identifiziert Datenspeicher-Assets, die für Backups verwendet zu werden scheinen, aber keine Verschlüsselung aufweisen. Ein @Backup:Target wird durch das ",
      "riskAssessment": "Die Auswirkung wird direkt anhand der höchsten Sensibilität (Vertraulichkeit und Integrität) der im @Backup:Target gespeicherten Daten bewertet. Die Wahrscheinlichkeit wird als hoch angesehen, da das Fehlen einer grundlegenden Kontrolle wie Verschlüsselung bei einem @Backup:Target sensibler Daten einen Compliance-Verstoß und eine potenzielle Datenschutzverletzung sehr wahrscheinlich macht.",
      "falsePositives": "Ein Asset könnte fälschlicherweise als @Backup:Target identifiziert werden, wenn es ein "
    },
    "risk-outsourced-@Backup:Target": {
      "title": "Risiken von ausgelagerten Datensicherungen (BSI-basiert)",
      "description": "Wenn Datensicherungen an eine Drittinstitution ausgelagert werden, können Angriffe auf den Anbieter die Organisation beeinträchtigen.",
      "impact": "Eine Vertraulichkeitsverletzung beim @Backup:Target-Anbieter kann zur Offenlegung sensibler oder kritischer Daten führen. Ein Verfügbarkeitsausfall kann zu verlängerten Ausfallzeiten in einem Wiederherstellungsszenario führen, was die Geschäftskontinuität beeinträchtigt und bei dauerhaftem Datenverlust potenziell zum Scheitern der Mission führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein CON.1 (Redundanz), insbesondere der Anforderung zur Analyse von Abhängigkeiten von externen Anbietern (CON.1.A5) und der Sicherstellung der Verfügbarkeit von Informationen zur Wiederherstellung (CON.1.A11).",
      "action": "Ausgelagerte @Backup:Target-Lösung und Verträge sichern und überprüfen",
      "mitigation": "Für die Vertraulichkeit: Stellen Sie sicher, dass die Daten *bevor* sie an den Anbieter gesendet werden, verschlüsselt sind (clientseitige Verschlüsselung) und auch vom Anbieter verschlüsselt im Ruhezustand gespeichert werden. Verwenden Sie starke, einzigartige Verschlüsselungsschlüssel, die von der Organisation verwaltet werden. Überprüfen Sie den Anbieter",
      "check": "Sind die Daten beim @Backup:Target-Anbieter bei der Übertragung und im Ruhezustand verschlüsselt? Kontrolliert die Organisation die Verschlüsselungsschlüssel? Gibt es vertraglich definierte RTO/RPO-SLAs? Werden die Wiederherstellungsverfahren regelmäßig getestet? Ist der Anbieter",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, die anscheinend Backups an eine externe Entität senden. Sie wird bei Datenflüssen von einem im Geltungsbereich befindlichen Asset zu einem `datastore` oder `external-entity` über eine Netzwerk-Vertrauensgrenze ausgelöst. Das Risiko ist signifikant höher, wenn die Daten hohe CIA-Anforderungen haben und Minderungsmaßnahmen wie Verschlüsselung im Ruhezustand oder Redundanz auf dem Ziel-Asset nicht modelliert sind.",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus den Vertraulichkeits- und Verfügbarkeitsbewertungen der gesicherten Daten-Assets ab. Eine hohe Auswirkung wird für ",
      "falsePositives": "Ein generisches "
    },
    "insufficient-@Backup:Target-storage-capacity": {
      "title": "Unzureichende Backup-Speicherkapazität (BSI CON.3.G5)",
      "description": "Wenn Speichermedien für Datensicherungen nicht über ausreichende freie Kapazität verfügen, können aktuelle Daten möglicherweise nicht gesichert werden.",
      "impact": "Dies kann zu einem teilweisen oder vollständigen Verlust der Datenintegrität und -verfügbarkeit führen. In einem Wiederherstellungsszenario ist die Unfähigkeit, ",
      "asvs": "BSI IT-Grundschutz CON.3 Datensicherungskonzept",
      "action": "Kapazitätsplanung und -überwachung für Backup-Speicher implementieren",
      "mitigation": "Implementieren Sie eine robuste Kapazitätsplanung und -überwachung für alle Backup-Speichersysteme. Konfigurieren Sie die Überwachung so, dass sie Warnungen sendet, wenn die Kapazität vordefinierte Schwellenwerte erreicht (z. B. 80 %, 90 %).",
      "check": "Gibt es eine aktive Kapazitätsüberwachung für Backup-Datenspeicher? Sind Alarmmechanismen für geringe Speicherkapazität vorhanden? Gibt es einen dokumentierten Prozess für den Umgang mit Kapazitätswarnungen und die Verwaltung der Datenaufbewahrung auf Backup-Medien?",
      "detectionLogic": "Dieses Risiko wird für Datenspeicher-Assets ausgelöst, die mit `@Backup:Target` getaggt sind. Das Risiko wird als höher angesehen, wenn das Asset nicht mit einem ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine Überwachung vorhanden ist, um vor Kapazitätsgrenzen zu warnen. Die Auswirkung hängt von den Verfügbarkeits- und Integritätsanforderungen der gesicherten Daten ab.",
      "falsePositives": "Ein Risiko kann für einen Datenspeicher generiert werden, der von einem externen System überwacht wird, das nicht im Modell dargestellt ist. Dieses Risiko ist hauptsächlich organisatorischer und betrieblicher Natur, und sein tatsächlicher Status hängt von den implementierten Überwachungsprozessen ab."
    },
    "inadequate-data-@Backup:Target-concept-con3": {
      "title": "Unzureichendes Datensicherungskonzept (@Backup:Target) (BSI CON.3)",
      "description": "Wenn kein angemessenes Konzept für Datensicherungsmaßnahmen (@Backup:Target) erstellt wird, können die technischen Anforderungen der betroffenen Geschäftsprozesse übersehen werden.",
      "impact": "Das Versäumnis, Daten aus Backups aufgrund eines unzureichenden Konzepts wiederherzustellen, kann zu schweren Geschäftsunterbrechungen, dauerhaftem Datenverlust und der Nichterfüllung von geschäftlichen, rechtlichen und vertraglichen Verpflichtungen führen.",
      "asvs": "BSI IT-Grundschutz-Kompendium: CON.3 Datensicherungskonzept (@Backup:Target and Recovery Concept)",
      "action": "Ein robustes Datensicherungs- und Wiederherstellungskonzept entwickeln, implementieren und testen",
      "mitigation": "Etablieren Sie ein umfassendes @Backup:Target- und Wiederherstellungskonzept, das die Geschäftsanforderungen für Wiederherstellungszeitziele (RTO) und Wiederherstellungspunktziele (RPO) erfüllt.",
      "check": "Gibt es ein dokumentiertes @Backup:Target-Konzept? Sind RTOs/RPOs definiert und werden sie eingehalten? Werden verschlüsselte Backups verwendet? Wenn ja, wo werden die Entschlüsselungsschlüssel gespeichert? Ist der Schlüsselspeicher von den Primärsystemen isoliert? Werden die Wiederherstellungsverfahren regelmäßig und erfolgreich getestet?",
      "detectionLogic": "Diese Regel prüft auf kritische Fehler in der modellierten @Backup:Target-Strategie, mit Fokus auf das Schlüsselmanagement für verschlüsselte Backups.",
      "riskAssessment": "Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Die Regel geht davon aus, dass ein Schlüsselmanagementsystem (wie ein Vault), das sich in derselben Vertrauensgrenze wie eine Datenquelle befindet, die Schlüssel für diese Quelle speichern könnte."
    },
    "@Backup:Target-process-time-exceeds-window": {
      "title": "Dauer des @Backup:Target-Prozesses überschreitet das zugewiesene Zeitfenster (BSI CON.1)",
      "description": "Zusätzlich zum für die Datensicherung (@Backup:Target) benötigten Speicherplatz steigt auch die für die Durchführung einer Datensicherung (@Backup:Target) erforderliche Zeit mit dem Datenvolumen.",
      "impact": "Wenn @Backup:Target-Jobs unvollständig sind oder das @Backup:Target-System ausfällt, ist die Fähigkeit zur Datenwiederherstellung stark beeinträchtigt. Dies bedroht direkt die Integrität und Verfügbarkeit geschäftskritischer Informationen in einem Notfallwiederherstellungsszenario und kann zu erheblichem Datenverlust und verlängerten Ausfallzeiten führen.",
      "asvs": "BSI IT-Grundschutz CON.1: Datensicherungskonzept",
      "action": "@Backup:Target-Strategie und -Ressourcen überprüfen und optimieren",
      "mitigation": "Überwachen Sie regelmäßig die Laufzeiten der @Backup:Target-Jobs und richten Sie Alarme ein, wenn diese sich der Grenze des @Backup:Target-Fensters nähern.",
      "check": "Werden die Laufzeiten der @Backup:Target-Jobs kontinuierlich überwacht? Gibt es ein klar definiertes und eingehaltenes @Backup:Target-Fenster? Berücksichtigt die @Backup:Target-Strategie das Datenwachstum? Gibt es regelmäßige Datenbereinigungs- oder Archivierungsprozesse?",
      "detectionLogic": "Dieses Risiko wird für Datenspeicher ausgelöst, die eine große Datenmenge enthalten. Es wird angenommen, dass jeder Datenspeicher einem @Backup:Target-Verfahren unterliegt.",
      "riskAssessment": "Die Wahrscheinlichkeit, dass dieses Risiko eintritt, steigt mit der Menge der gespeicherten Daten. Ein ",
      "falsePositives": "Das Modell kennt nicht die spezifische @Backup:Target-Strategie (z. B. könnten inkrementelle Backups sehr schnell sein) oder die Leistung der @Backup:Target-Infrastruktur. Eine Organisation könnte ein leistungsstarkes @Backup:Target-System und ein großes Zeitfenster haben, was dieses Risiko mindern würde."
    },
    "insecure-data-deletion-con8": {
      "title": "Unsicheres Löschen von Informationen und Datenträgern (BSI CON.8)",
      "description": "Wenn es keine sicheren Prozesse und Verfahren zum Löschen und Vernichten von Informationen und Datenträgern gibt, oder wenn diese nicht korrekt angewendet werden, ist nicht gewährleistet, dass vertrauliche Informationen sicher gelöscht oder vernichtet werden. Es ist daher unmöglich vorherzusagen, wo diese Informationen verbleiben und ob sie für Dritte zugänglich sein werden. Dieses Risiko ist besonders hoch bei digitalen Datenträgern und IT-Systemen, die außer Betrieb genommen werden sollen, da nicht immer sofort ersichtlich ist, welche (Rest-)Informationen sich darauf befinden. Diese Informationen könnten von unbefugten Dritten gelesen werden. Wenn es sich dabei um besonders sensible Informationen handelt, wie z. B. personenbezogene Daten, die nach Artikel 9 der DSGVO besonderen Schutz erfordern, oder um Geschäftsgeheimnisse, kann dies zu hohen Bußgeldern führen.",
      "impact": "Das Versäumnis, Daten von außer Betrieb genommenen Assets sicher zu löschen, kann zu Datenremanenz führen, bei der sensible Informationen für unbefugte Personen zugänglich bleiben, die Zugang zu der Hardware erhalten. Dies beeinträchtigt direkt die Vertraulichkeit und kann zu schweren Datenschutzverletzungen, behördlichen Bußgeldern (z. B. nach der DSGVO), dem Verlust von Geschäftsgeheimnissen und erheblichen Reputationsschäden führen.",
      "asvs": "BSI IT-Grundschutz-Baustein CON.8 (Löschen und Vernichten)",
      "action": "Sichere Löschverfahren etablieren und durchsetzen",
      "mitigation": "Definieren und implementieren Sie eine formelle Richtlinie für das sichere Löschen und Vernichten von Daten und Datenträgern. Die Richtlinie sollte unterschiedliche Verfahren je nach Datenklassifizierung und Medientyp festlegen (z. B. kryptographisches Löschen für SSDs, mehrfaches Überschreiben für HDDs, physische Zerstörung für hochsensible Daten oder beschädigte Medien). Führen Sie eine dokumentierte Nachweiskette für alle Medien, die zur Entsorgung oder Wiederverwendung bestimmt sind. Stellen Sie sicher, dass das Personal in diesen Verfahren geschult ist. Verwenden Sie den ",
      "check": "Gibt es eine dokumentierte Richtlinie für das Löschen von Daten und die Vernichtung von Medien? Entsprechen die verwendeten Methoden Standards wie NIST SP 800-88? Gibt es ein Inventar von außer Betrieb genommenen Assets und einen Nachweis über deren sichere Bereinigung oder Zerstörung?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die Daten speichern (d. h. der Asset-Typ ist ",
      "riskAssessment": "Die Auswirkung dieses Risikos ist direkt proportional zur Vertraulichkeit der auf dem Asset gespeicherten Daten. Ein höheres Vertraulichkeitsniveau führt zu einer höheren Auswirkung. Die Eintrittswahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn ein robuster, organisationsweiter Prozess zur Außerbetriebnahme und Datenvernichtung existiert, aber nicht explizit mit einem Tag auf dem spezifischen Asset modelliert ist. Das Modell kann physische, außerhalb des Bandes liegende Prozesse nicht überprüfen."
    }
  }
}
