{
  "meta": {
    "part": 8,
    "totalParts": 8,
    "risksInThisPart": 81,
    "totalRisks": 669,
    "instructions": [
      "TRANSLation INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 8 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "gpo-misconfiguration": {
      "title": "Risiko von GPO-Fehlkonfigurationen auf Windows-Systemen",
      "description": "Gruppenrichtlinienobjekte (GPOs) sind ein mächtiger Mechanismus zur Konfiguration von Sicherheitseinstellungen auf Windows-Systemen, insbesondere innerhalb einer Domäne. Aufgrund der Vielzahl an Optionen kann ein unsystematisches Vorgehen jedoch leicht zu widersprüchlichen oder inkompatiblen Konfigurationen führen oder dazu, dass ganze Sicherheitsbereiche übersehen werden. Falsch verstandene Vererbungsregeln und Filter können sogar dazu führen, dass GPOs überhaupt nicht angewendet werden und Systeme in einem standardmäßigen, potenziell unsicheren Zustand verbleiben.",
      "impact": "Unsachgemäßes GPO-Management kann zu schwerwiegenden Schwachstellen auf Servern und verbundenen Clients, Betriebsstörungen und einer allgemeinen Schwächung der Sicherheitslage führen. Das Nichtanwenden beabsichtigter Sicherheitseinstellungen kann die Vertraulichkeit, Integrität und Verfügbarkeit der verwalteten Systeme und der von ihnen verarbeiteten Daten gefährden.",
      "asvs": "Dies ist eine Kontrolle auf Plattformebene. Ihr Prinzip bezieht sich auf ASVS V14.1 (Konfiguration), das vorschreibt, dass die Sicherheitskonfiguration definiert, implementiert und gewartet werden muss.",
      "action": "Systematisches GPO-Management und -Review implementieren",
      "mitigation": "Verfolgen Sie einen strukturierten Ansatz für das GPO-Management. Nutzen Sie Sicherheits-Baselines (z. B. von Microsoft oder CIS) als Grundlage. Alle GPO-Änderungen sollten dokumentiert, in einer Nicht-Produktionsumgebung getestet und vor der Bereitstellung überprüft werden. Überprüfen Sie GPOs regelmäßig auf Konflikte, Redundanzen und unerwartete Ergebnisse mit Tools wie ",
      "check": "Gibt es einen dokumentierten Prozess für die Erstellung, das Testen und die Bereitstellung von GPOs? Werden GPOs regelmäßig anhand von Sicherheits-Baselines überprüft? Wird ein Audit-Trail von GPO-Änderungen geführt? Werden Tools verwendet, um auf Konflikte zu prüfen und ob Einstellungen effektiv angewendet werden?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die typischerweise durch GPOs in einer Windows-Umgebung verwaltet werden, wie z. B. LDAP-Server (Domänencontroller), Identitätsanbieter (AD FS) und Dateiserver. Das Risiko kann auch durch das explizite Taggen eines Assets mit `@gpo-managed:true` ausgelöst werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird basierend auf dem Asset"
    },
    "insufficient-server-hardening": {
      "title": "Ungenügende Härtung oder Fehlkonfiguration des Server-Betriebssystems",
      "description": "Server-Betriebssysteme wie Windows Server bieten zahlreiche Sicherheitsfunktionen zum Schutz der Integrität der verarbeiteten Informationen. Diese Funktionen können jedoch selbst Schwachstellen enthalten oder, was häufiger vorkommt, aus Bequemlichkeit inkonsistent konfiguriert sein. Eine unzureichende Sicherheitshärtung kann es Unbefugten ermöglichen, Informationen und Systemprozesse zu manipulieren, ihre Spuren zu verwischen oder Malware einzuschleusen, um Daten aus der Ferne zu manipulieren.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu einem schwerwiegenden Integritätsverlust von Daten und Systemprozessen führen. Angreifer könnten kritische Geschäftsdaten ändern, Hintertüren installieren, Dienste stören (Denial-of-Service) und Privilegien im Netzwerk eskalieren. Dies kann zu finanziellen Verlusten, Reputationsschäden und Betriebsausfällen führen.",
      "asvs": "BSI IT-Grundschutz: SYS.1.1 (Allgemeiner Server), OWASP ASVS v4.0.3: 1.1.1 (Sichere Konfiguration)",
      "action": "Sichere Basiskonfigurationen (Härtung) implementieren und durchsetzen",
      "mitigation": "Definieren, implementieren und überprüfen Sie regelmäßig eine Sicherheits-Baseline (Härtungsleitfaden) für alle Server-Betriebssysteme. Dies sollte das Deaktivieren unnötiger Dienste und Ports, die Durchsetzung starker Zugriffskontrollen und Protokollierung, das zeitnahe Anwenden von Sicherheitspatches und die Verwendung von Konfigurationsmanagement-Tools zur Verhinderung von Konfigurationsabweichungen umfassen. Verwenden Sie regelmäßig Schwachstellenscanner und Integritätsüberwachungstools (z. B. einen Dateiintegritätsmonitor), um Abweichungen von der Baseline und potenzielle Kompromittierungen zu erkennen.",
      "check": "Gibt es dokumentierte, versionierte Härtungsleitfäden für alle im Einsatz befindlichen Server-Betriebssysteme? Gibt es einen Prozess, um sicherzustellen, dass neue Systeme gemäß diesen Leitfäden erstellt werden? Werden Systeme regelmäßig anhand der Baseline überprüft? Ist ein automatisiertes Konfigurationsmanagement vorhanden, um den sicheren Zustand durchzusetzen?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die serverseitige Technologien darstellen, die häufige Ziele für Fehlkonfigurationen sind (z. B. Webserver, Anwendungsserver, Datenbanken). Das Risiko ist höher für Assets, die direkt dem Internet ausgesetzt sind oder hochkritische oder vertrauliche Daten verarbeiten, da sie attraktivere Ziele darstellen.",
      "riskAssessment": "Das Ausmaß des Schadens wird durch die Integritäts- und Vertraulichkeitsanforderungen des Assets selbst und der von ihm verarbeiteten Daten bestimmt. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn ein robuster, automatisierter Konfigurationsmanagement- und Härtungsprozess (z. B. mit Ansible, Puppet oder ähnlichen Tools mit geprüften Playbooks) vorhanden ist, auch wenn dieser nicht explizit modelliert wurde. Dies muss durch eine Überprüfung der betrieblichen Sicherheitsprozesse verifiziert werden."
    },
    "abuse-of-administrative-functions": {
      "title": "Missbrauch von administrativen Funktionen",
      "description": "Die routinemäßige Arbeit mit Standardberechtigungen ist mittlerweile gängige Praxis. Administratoren müssen jedoch zu bestimmten Zeiten ihre Privilegien erhöhen, was Angreifern die Möglichkeit bietet, privilegierten Zugriff zu erlangen. Auch der Missbrauch von Privilegien durch legitime Administratoren ist ein relevantes Bedrohungsszenario. Angreifer können kompromittierte administrative Anmeldeinformationen nutzen, um sich seitlich im Netzwerk zu bewegen, beispielsweise durch den Einsatz von Pass-the-Hash oder ähnlichen Techniken.",
      "impact": "Da administrative Rollen hochprivilegiert sind, hat eine Kompromittierung in der Regel erhebliche Auswirkungen, insbesondere bei Domänenadministratoren. Dies kann zum vollständigen Verlust der Vertraulichkeit, Integrität und Verfügbarkeit aller von dieser Rolle verwalteten Systeme führen, wodurch Angreifer Daten exfiltrieren, Systeme zerstören oder Ransomware in der gesamten Infrastruktur einsetzen können.",
      "asvs": "V4.0.3-4.1.2: Geringste Privilegien (Least Privilege)",
      "action": "Prinzip der geringsten Privilegien durchsetzen und privilegierten Zugriff überwachen",
      "mitigation": "Setzen Sie das Prinzip der geringsten Privilegien strikt um. Verwenden Sie separate, dedizierte Konten und gehärtete Workstations (Privileged Access Workstations - PAWs) für administrative Aufgaben. Erzwingen Sie eine starke Multi-Faktor-Authentifizierung (MFA) für alle administrativen Zugriffe. Protokollieren, überwachen und überprüfen Sie regelmäßig alle privilegierten Aktivitäten. Setzen Sie Privileged Access Management (PAM)-Lösungen ein, um Anmeldeinformationen zu kontrollieren, zu sichern und zu rotieren. Nutzen Sie moderne Mechanismen zum Schutz von Anmeldeinformationen wie Windows Credential Guard, um Angriffe zum Diebstahl von Anmeldeinformationen wie Pass-the-Hash zu verhindern.",
      "check": "Werden administrative Aufgaben von dedizierten, gehärteten Systemen aus durchgeführt? Wird MFA für alle administrativen Zugriffe erzwungen? Werden alle privilegierten Aktivitäten protokolliert und regelmäßig überprüft? Werden PAM-Lösungen zur Verwaltung und Sicherung administrativer Anmeldeinformationen eingesetzt?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die von administrativen Rollen verwaltet werden. Diese Rollen werden durch Tags wie `role:administrator`, `role:fachadministrator` oder das hochkritische `role:domain-administrator` identifiziert. Das Risiko ist besonders hoch für Assets, die Identitätsspeicher oder zentrale Verwaltungskomponenten darstellen (z. B. Identitätsanbieter, LDAP-Server).",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko kann geringer sein, wenn starke kompensierende Kontrollen wie eine ausgereifte PAM-Lösung, eine umfassende EDR/SIEM-Überwachung und regelmäßige Audits vorhanden sind, aber nicht explizit modelliert wurden. Dies erfordert eine manuelle Überprüfung der Organisation"
    },
    "unmanaged-cloud-integration-in-os": {
      "title": "Unverwaltete oder nicht genehmigte integrierte Cloud-Funktionen auf Windows Server",
      "description": "Windows Server wird mit integrierten Anbindungen an Microsoft-Clouddienste ausgeliefert (z. B. Azure Backup, Online-BitLocker-Schlüsselhinterlegung, Telemetrie-Upload). Wenn diese Integrationen ohne Richtlinie, Überprüfung oder explizite Härtung verwendet werden, können sie etablierte Datenhandhabungs- und Lieferantenkontrollen umgehen.",
      "impact": "Unverwaltete Cloud-Integrationen können sensible Informationen (z. B. Anmeldeinformationen, Wiederherstellungsschlüssel, Absturzabbilder) preisgeben und versteckte Abhängigkeiten von Dritten schaffen. Die Beendigung oder der Ausfall des externen Dienstes kann Backup-/Wiederherstellungs- oder administrative Arbeitsabläufe unterbrechen und die Verfügbarkeit von Geschäftsprozessen beeinträchtigen.",
      "asvs": "ASVS V14.2.5 (Konfiguration: Externes Verhalten), V1.14 (Sichere Standardeinstellungen)",
      "action": "BS-integrierte Cloud-Funktionen über Richtlinien, Tagging und Konfigurations-Baselines steuern",
      "mitigation": "Führen Sie eine Unternehmensrichtlinie für BS-integrierte Cloud-Funktionen ein. Setzen Sie diese über Gruppenrichtlinien/Intune-Baselines durch, um nicht genehmigte Optionen standardmäßig zu deaktivieren. Erlauben Sie nur geprüfte Anwendungsfälle und kennzeichnen Sie solche Assets mit `@cloud-integration:managed`; kennzeichnen Sie gehärtete/deaktivierte Hosts mit `@cloud-integration:disabled`. Überwachen Sie den ausgehenden Datenverkehr zu öffentlichen Cloud-Endpunkten und überprüfen Sie die Telemetrie-/Diagnoseeinstellungen (auf das praktisch minimale Niveau einstellen). Führen Sie eine Risikobewertung durch, bevor Sie Funktionen wie Azure Backup oder die Online-Schlüsselhinterlegung aktivieren.",
      "check": "Überprüfen Sie, ob eine schriftliche Richtlinie existiert, Baseline-Einstellungen bereitgestellt werden, Assets konsistent getaggt sind (`managed` oder `disabled`) und die Netzwerküberwachung bei unerwarteten Cloud-Endpunkten alarmiert. Bestätigen Sie, dass Wiederherstellungsschlüssel und Diagnosedaten nicht ohne Genehmigung an externe Mandanten gesendet werden.",
      "detectionLogic": "Implementierungsdetail: Die Regel kennzeichnet jedes relevante technische Asset, das mit `@os:windows-server` getaggt ist und NICHT auch mit `@cloud-integration:managed` oder `@cloud-integration:disabled` getaggt ist. Fehlende explizite Steuerung impliziert, dass das Standardverhalten des Betriebssystems Cloud-Anbindungen (Backup, Schlüsselhinterlegung, Telemetrie) ermöglichen kann, was die Risiken von Datenexfiltration und Lieferantenabhängigkeit erhöht.",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich (Funktionen sind oft standardmäßig aktiviert/nutzbar und werden bei der Härtung häufig übersehen). Die Auswirkung skaliert mit den Vertraulichkeits- und Verfügbarkeitsanforderungen des Assets: Server, die eingeschränkte/vertrauliche Daten verarbeiten oder wichtige/kritische Dienste bereitstellen, sind stärker betroffen.",
      "falsePositives": "Kann ein Fehlalarm sein, wenn der ausgehende Netzwerkverkehr zu relevanten Cloud-Diensten zentral blockiert wird oder wenn das OS-Tag falsch ist. Berücksichtigen Sie auch Fälle, in denen eine Steuerung existiert, aber die Tags fehlen; aktualisieren Sie die Tags, anstatt die Regel zu unterdrücken."
    },
    "insecure-remote-administration-windows": {
      "title": "Unsichere Fernadministration von Windows Server (BSI SYS.1.2.3)",
      "description": "Windows Server bietet mehrere Fernadministrationsfunktionen (z. B. RDP, WinRM), die bei unsachgemäßer Absicherung missbraucht werden können. ",
      "impact": "Ein Angreifer, der unsicheren Fernzugriff ausnutzt, kann weitreichende Kontrolle über den Server erlangen und so die Vertraulichkeit, Integrität und Verfügbarkeit seiner Daten und Dienste gefährden. ",
      "asvs": "BSI IT-Grundschutz SYS.1.2.3 Windows Server, Anforderungen A5 (Sichere Authentifizierung und Autorisierung) und A6 (Sicherheit für den Remote-Desktop-Zugriff).",
      "action": "Fernadministrationskanäle und Authentifizierung absichern",
      "mitigation": "Stellen Sie sicher, dass alle Fernadministrationsprotokolle starke, verschlüsselte Kanäle verwenden (z. B. über ein sicheres VPN oder einen SSH-Tunnel). Erzwingen Sie eine starke Multi-Faktor-Authentifizierung (MFA), anstatt sich nur auf Passwörter zu verlassen. ",
      "check": "Sind alle Fernadministrationsverbindungen verschlüsselt? Wird eine starke Authentifizierung (MFA) für alle administrativen Zugriffe erzwungen? Gibt es Zugriffslisten (IP-Filterung) für Fernwartungsschnittstellen? Sind unnötige Fernwartungsdienste deaktiviert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als `os:windows-server` gekennzeichnet sind und eingehende Kommunikationsverbindungen haben, die Fernadministrationsprotokolle (z. B. RDP oder WinRM) mit schwacher Authentifizierung (`none` oder `credentials`) verwenden. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist HOCH, insbesondere wenn schwache Authentifizierung mit einer Internetverbindung kombiniert wird. Das Schadenausmaß ist SEHR HOCH, wenn der Server hochwertige Daten verarbeitet oder speichert (hohe CIA-Bewertungen) oder mit anderen kritischen Systemen verbunden ist, da eine Kompromittierung weitreichenden Schaden und potenzielle seitliche Bewegung ermöglicht.",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn außerhalb des Modells kompensierende Kontrollen existieren, wie z. B. ein obligatorisches Unternehmens-VPN mit MFA, das das gesamte Netzwerksegment schützt, was nicht explizit in der Kommunikationsverbindung modelliert ist."
    },
    "uncontrolled-windows-telemetry": {
      "title": "Unkontrollierte Übermittlung von Diagnose- und Telemetriedaten von Windows Server",
      "description": "Standardmäßig sendet Windows Server Diagnosedaten an den Hersteller Microsoft. ",
      "impact": "Wenn sensible Daten (wie Informationen aus Speicherabbildern oder Systemereignisprotokollen) über Telemetriedienste an Microsoft übermittelt werden, ",
      "asvs": "BSI IT-Grundschutz SYS.1.2.3 Windows Server; zugehörige Anforderung: SYS.1.2.3.A3 Telemetrie- und Nutzungsdaten unter Windows Server. Verwandte Gefährdungen sind G 0.40 Abhören und G 0.14 Missbrauch von administrativen und Wartungsfunktionen.",
      "action": "Konfiguration des Telemetriedienstes härten",
      "mitigation": "Die Telemetrie- und Diagnosedatendienste auf allen Windows-Server-Systemen sollten explizit auf ein Niveau konfiguriert werden, das mit der Organisation",
      "check": "Sind alle Windows-Server-Assets auf ein minimales, richtlinienkonformes Telemetrie-Niveau konfiguriert? Gibt es eine Gruppenrichtlinie oder ein anderes Konfigurationsmanagement-Tool, um diese Einstellung durchzusetzen?",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das mit ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Fehlalarm kann auftreten, wenn die Telemetrieeinstellungen durch einen Mechanismus gehärtet wurden, der im Modell nicht abgebildet ist"
    },
    "forensic-investigation-hindered-by-vsm": {
      "title": "Forensische Untersuchung durch Virtual Secure Mode (VSM) behindert (BSI-basiert)",
      "description": "Die Verwendung des Virtual Secure Mode (VSM) kann forensische Untersuchungen, beispielsweise im Rahmen der Reaktion auf einen Sicherheitsvorfall, erheblich behindern oder sogar verhindern. Prozesse, die durch den Secure Kernel oder den Isolated User Mode (IUM) geschützt sind – wie z. B. Credential Guard – sind für eine Analyse nicht mehr zugänglich. Beispielsweise können Speicherabbilder dieser geschützten Prozesse aufgrund kryptografischer Schutzmaßnahmen nicht untersucht werden.",
      "impact": "Wenn ein Sicherheitsvorfall auf einem System mit VSM auftritt, kann es unmöglich sein, die Ursache, das Ausmaß des Angriffs oder die Aktionen des Angreifers zu ermitteln. Dies verhindert eine effektive Behebung, Rechenschaftslegung und das Lernen aus dem Vorfall, was es Angreifern möglicherweise ermöglicht, ihre Präsenz aufrechtzuerhalten oder den Angriff zu wiederholen. Es beeinträchtigt direkt die Fähigkeiten zur Reaktion auf Sicherheitsvorfälle.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz DER.1 Detektion und Behandlung von Sicherheitsvorfällen, insbesondere DER.1.A4 Durchführung einer forensischen Analyse, die durch VSM behindert werden kann.",
      "action": "Abwägung zwischen proaktiver Härtung und reaktiver Forensik bewerten und dokumentieren",
      "mitigation": "Erkennen Sie den Zielkonflikt zwischen der präventiven Sicherheit von VSM und den reaktiven Anforderungen der forensischen Analyse an. Wenn Speicherforensik für die Einhaltung von Vorschriften oder die Betriebssicherheit entscheidend ist, sollten Sie in Erwägung ziehen, VSM/IUM-Funktionen auf Systemen zu deaktivieren, auf denen eine detaillierte Vorfallsanalyse erforderlich ist. Alternativ stellen Sie sicher, dass andere, von VSM unbeeinflusste Protokollierungs- und Überwachungsmechanismen (z. B. EDR, erweiterte Protokollierung) ausreichende Transparenz für die Reaktion auf Sicherheitsvorfälle bieten. Dokumentieren Sie diese Entscheidung im Sicherheitskonzept des Systems und lassen Sie sie vom Incident-Response-Team genehmigen.",
      "check": "Verwendet das System Virtual Secure Mode (VSM), Credential Guard oder andere IUM-basierte Technologien? Hat das Incident-Response-Team diese Konfiguration genehmigt und bestätigt, dass es über alternative, ausreichende Untersuchungsmethoden verfügt?",
      "detectionLogic": "Wird bei technischen Assets ausgelöst, die explizit mit `@VSM-Enabled` gekennzeichnet sind, was darauf hindeutet, dass sie Technologien wie Virtual Secure Mode oder Credential Guard verwenden, die die Speicheranalyse behindern.",
      "riskAssessment": "Die Wahrscheinlichkeit basiert auf der Wahrscheinlichkeit eines Sicherheitsvorfalls, der eine tiefgehende forensische Analyse erfordert. Die Auswirkung wird durch die Kritikalität (CIA-Bewertung) des Assets bestimmt; die Unfähigkeit, eine Kompromittierung eines geschäftskritischen Assets zu untersuchen, ist ein Ereignis mit hoher Auswirkung.",
      "falsePositives": "Dieses Risiko ist valide, wenn VSM oder eine ähnliche Technologie aktiviert ist. Ein Fehlalarm könnte geltend gemacht werden, wenn die Organisation dieses Risiko formell akzeptiert hat oder kompensierende Kontrollen (z. B. umfangreiche, unveränderliche externe Protokollierung) implementiert hat, die eine direkte Speicherforensik für ihre spezifischen Incident-Response-Verfahren unnötig machen."
    },
    "uncontrolled-webserver-admin-access": {
      "title": "Unkontrollierter administrativer Zugriff auf einen Webserver",
      "description": "Wenn ein Angreifer administrativen Zugriff auf einen Webserver erlangt, kann er eine manipulierte Webseite ausliefern (Defacement), Falschinformationen veröffentlichen oder Daten, die vom Server verarbeitet oder gespeichert werden, exfiltrieren. ",
      "impact": "Ein erfolgreicher Angriff kann zu erheblichem Reputationsschaden führen, wenn die Webseite verunstaltet oder zur Verbreitung von Fehlinformationen genutzt wird. ",
      "asvs": "Basiert auf den Konzepten des BSI IT-Grundschutzes zur Absicherung von Webservern (APP.3.2 Webserver) und allgemeinen Servern (SYS.1.1). Stimmt mit OWASP ASVS V14.2 (Konfiguration) und V1.5 (Anforderungen an Architektur, Design und Bedrohungsmodellierung) überein.",
      "action": "Webserver härten und administrativen Zugriff streng kontrollieren",
      "mitigation": "Implementieren Sie das Prinzip der geringsten Privilegien für alle Server- und Anwendungskonten. Der administrative Zugriff (z. B. über SSH, RDP oder ein Admin-Panel) muss streng kontrolliert, protokolliert und überwacht werden. ",
      "check": "Sind administrative Schnittstellen direkt dem Internet ausgesetzt? Wird MFA für alle administrativen Zugriffe erzwungen? ",
      "detectionLogic": "Dieses Risiko gilt für alle technischen Assets, die als Webserver, Webanwendungen oder Anwendungsserver fungieren, da sie häufige Ziele für solche Angriffe sind. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist für jeden dem Internet ausgesetzten Webserver aufgrund ständiger automatisierter Scans und gezielter Angriffe erhöht. ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm für Webserver betrachtet werden, die in einer stark eingeschränkten Umgebung (z. B. einem isolierten Netzwerksegment) mit starken, mehrschichtigen Zugriffskontrollen gehostet werden, die im Modell nicht vollständig beschrieben sind."
    },
    "unauthorized-web-server-file-manipulation": {
      "title": "Unbefugte Manipulation von Webserver-Dateien (BSI APP.3.2)",
      "description": "Bei einem Angriff könnten sich Unbefugte Zugriff auf einen Webserver verschaffen und dessen Dateien manipulieren. ",
      "impact": "Eine erfolgreiche Manipulation von Webserver-Dateien kann zu erheblichem Schaden führen. Die Änderung der Konfiguration könnte zu Dienstausfällen (Verfügbarkeit) führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein APP.3.2 Webserver, mit Fokus auf den Schutz der Integrität von Web-Inhalten und Konfigurationen.",
      "action": "Webserver härten und Integritätsüberwachung implementieren",
      "mitigation": "Implementieren Sie starke Zugriffskontrollen und wenden Sie das Prinzip der geringsten Privilegien für alle Datei- und Verzeichnisberechtigungen auf dem Server an. ",
      "check": "Sind die Datei- und Verzeichnisberechtigungen auf dem Webserver ordnungsgemäß eingeschränkt? Gibt es einen Patch-Management-Prozess, der eingehalten wird? ",
      "detectionLogic": "Dieses Risiko wird für alle Assets generiert, die als Webserver, Webanwendungen oder Webdienste identifiziert wurden. ",
      "riskAssessment": "Das Ausmaß dieses Risikos wird durch die Integritäts- und Verfügbarkeitsanforderungen des technischen Assets und der von ihm verarbeiteten Daten bestimmt. ",
      "falsePositives": "Ein Risiko könnte als Fehlalarm betrachtet werden, wenn das identifizierte "
    },
    "denial-of-service-against-web-services-app4-t35": {
      "title": "Denial-of-Service gegen Webserver (BSI APP.3.2)",
      "description": "DoS-Angriffe können gezielt die Verfügbarkeit eines Webdienstes beeinträchtigen, beispielsweise durch das Sperren einzelner Konten durch wiederholte fehlgeschlagene Anmeldeversuche. ",
      "impact": "Für viele Institutionen kann ein solcher Ausfall schnell geschäftskritisch werden, zum Beispiel bei Online-Shops. ",
      "asvs": "BSI IT-Grundschutz-Kompendium: APP.3.2 Webserver (Denial of Service)",
      "action": "Anti-DoS/DDoS-Maßnahmen implementieren",
      "mitigation": "Verwenden Sie eine mehrschichtige Verteidigungsstrategie. Dies umfasst die Verwendung einer Web Application Firewall (WAF) oder eines spezialisierten Anti-DDoS-Dienstleisters zur Filterung von bösartigem Datenverkehr. ",
      "check": "Ist das Asset durch eine WAF oder einen vorgeschalteten Anti-DDoS-Dienst geschützt? Gibt es Ratenbegrenzungen für ressourcenintensive Endpunkte? Ist die Infrastruktur skalierbar ausgelegt, um Verkehrsspitzen zu bewältigen?",
      "detectionLogic": "Dieses Risiko gilt für alle dem Internet ausgesetzten technischen Assets, die webbasierte Dienste bereitstellen (z. B. Webserver, Webanwendungen, REST/SOAP-Dienste, Reverse-Proxys). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als **sehr hoch** für jeden ungeschützten, dem Internet zugewandten Webdienst aufgrund der Verbreitung von automatisierten Scan- und Angriffswerkzeugen angesehen. Die Auswirkung steht in direktem Zusammenhang mit der **Verfügbarkeits**-Bewertung des Assets und seiner Daten. Ein ",
      "falsePositives": "Ein Risiko könnte fälschlicherweise gemeldet werden, wenn umfassende Anti-DoS-Maßnahmen vorhanden sind, aber nicht modelliert wurden. Dies ist häufig der Fall, wenn der Schutz durch eine vorgeschaltete Infrastrukturkomponente (z. B. einen Cloud-Anbieter"
    },
    "weak-or-outdated-cryptography-on-link": {
      "title": "Schwache oder veraltete Kryptografie auf der Kommunikationsverbindung",
      "description": "Viele Webserver verwenden immer noch veraltete kryptografische Verfahren wie RC4 oder SSL. ",
      "impact": "Wenn die Kommunikation nicht ordnungsgemäß mit starken, modernen kryptografischen Standards verschlüsselt ist, können sensible Daten an Angreifer preisgegeben werden (z. B. Sitzungs-Cookies, Anmeldeinformationen, persönliche Daten). ",
      "asvs": "V9.1.1, V9.2.1",
      "action": "Starke, moderne Verschlüsselung für die gesamte Kommunikation erzwingen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, insbesondere solche, die Vertrauensgrenzen überschreiten oder sensible Daten beinhalten, ein starkes, verschlüsseltes Protokoll verwenden (z. B. HTTPS, WSS, JDBC-verschlüsselt, FTPS). ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen in der Architektur. Ist das Protokoll für jede Verbindung eine verschlüsselte Variante? ",
      "detectionLogic": "Diese Regel überprüft alle Kommunikationsverbindungen im Modell. Sie löst ein Risiko aus, wenn eine Kommunikationsverbindung ein unverschlüsseltes Protokoll verwendet ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird dadurch bestimmt, ob die unverschlüsselte Kommunikation eine Vertrauensgrenze überschreitet und ob einer der Endpunkte dem Internet ausgesetzt ist. ",
      "falsePositives": "Ein Risiko kann ein Fehlalarm sein, wenn die Verbindung vollständig innerhalb eines physisch gesicherten, isolierten Netzwerksegments betrieben wird, in dem ein Abfangen als unmöglich angesehen wird, "
    },
    "violation-of-regulatory-requirements-for-web-content": {
      "title": "Nichteinhaltung gesetzlicher Anforderungen für Webinhalte (BSI APP.3.2 · CON.3 · DER.1)",
      "description": "Die Veröffentlichung von Webinhalten unterliegt mehreren gesetzlichen Anforderungen. Neben dem Telemedien- und Datenschutzrecht (z.B. @DataType:PII) gelten auch urheber- und verbraucherschutzrechtliche Regelungen. ",
      "impact": "Die Nichteinhaltung kann zu Geldstrafen, Unterlassungsanordnungen, Abschaltverfügungen, Rechtsstreitigkeiten und Reputationsschäden führen. ",
      "asvs": "BSI IT-Grundschutz: APP.3.2 (Webserver), CON.3 (Webanwendungen), DER.1 (Datenschutz)",
      "action": "Rechtliche und regulatorische Konformitätsprüfungen für alle veröffentlichten Webinhalte und Dienste etablieren und durchsetzen.",
      "mitigation": "Führen Sie eine dokumentierte Überprüfung vor der Veröffentlichung einschließlich rechtlicher Freigabe ein. Stellen Sie ein korrektes, leicht zugängliches Impressum und eine Datenschutzerklärung sicher. ",
      "check": "Gibt es eine formale rechtliche Überprüfung vor der Veröffentlichung? Sind Impressum und Datenschutzerklärung vollständig, aktuell und auf jeder Seite sichtbar? ",
      "detectionLogic": "Dieses Risiko für technische Assets auslösen, die als Webserver/Anwendungen/CMS/Berichtsgeneratoren identifiziert wurden und dem Internet zugewandt sind, ",
      "riskAssessment": "Wahrscheinlichkeit: Wahrscheinlich, da rechtliche Versäumnisse ohne explizite Prozesse häufig sind. ",
      "falsePositives": "Kann ein Fehlalarm für rein interne, informative oder statische Seiten ohne Tracking sein, oder wenn starke, nachweisbare rechtliche Überprüfungsprozesse existieren, die im Modell nicht sichtbar sind."
    },
    "inadequate-error-handling-bsi-app-3-2": {
      "title": "Fehlende oder unzureichende Fehlerbehandlung (BSI APP.3.2)",
      "description": "Wenn während des Betriebs eines Webservers Fehler auftreten, kann dies seine Verfügbarkeit beeinträchtigen, dazu führen, dass Inhalte unvollständig angezeigt werden, oder zum Versagen von Sicherheitsmechanismen führen. ",
      "impact": "Eine unsachgemäße Fehlerbehandlung kann zu Denial-of-Service und, was noch kritischer ist, zur Preisgabe sensibler Systeminformationen (z. B. Stack-Traces, Datenbankabfragen, interne Dateipfade) führen, die Angreifer zur Planung weiterer Angriffe nutzen können. Sie kann auch dazu führen, dass Sicherheitskontrollen im Fehlerfall offen bleiben und Authentifizierungs- oder Autorisierungsprüfungen umgangen werden.",
      "asvs": "BSI IT-Grundschutz APP.3.2: Webserver, Anforderung APP.3.2.A12: Angemessener Umgang mit Fehlern und Fehlermeldungen.",
      "action": "Robuste und sichere Fehler- und Ausnahmebehandlung implementieren.",
      "mitigation": "Implementieren Sie eine umfassende Fehlerbehandlung (z. B. try-catch-finally-Blöcke) in der gesamten Anwendungslogik. ",
      "check": "Gibt es einen globalen Ausnahmebehandler? Sind die für den Benutzer sichtbaren Fehlerseiten allgemein gehalten und frei von technischen Details? ",
      "detectionLogic": "Dieses Risiko wird für jede Webanwendung oder jeden Webserver ausgelöst, insbesondere für solche mit benutzerdefinierten Teilen, bei denen die Fehlerbehandlung oft falsch implementiert ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Möglicher Fehlalarm, wenn die Anwendung ein modernes, ausgereiftes Framework verwendet, das standardmäßig eine sichere Fehlerbehandlung erzwingt und dies überprüft wurde."
    },
    "user-enumeration-via-system-tools-bsi-t4.19": {
      "title": "Benutzeraufzählung und Aktivitätsprofilierung über Systemwerkzeuge (BSI T 4.19)",
      "description": "Verschiedene Unix-ähnliche Programme (z.B. ",
      "impact": "Angreifer können detaillierte Nutzungsprofile für bestimmte Konten (wie z.B. Systemadministratoren) erstellen, indem sie diese Informationen regelmäßig auswerten. ",
      "asvs": "ASVS V14.2.2: Die Anwendung wurde gehärtet, um alle unnötigen Funktionalitäten, Dateien und Dienste vom Anwendungsserver zu entfernen.",
      "action": "Systemhärtung und Konfiguration der Zugriffskontrolle",
      "mitigation": "Härten Sie das Betriebssystem, indem Sie unnötige Netzwerkdienste wie ",
      "check": "Sind veraltete Dienste wie ",
      "detectionLogic": "Dieses Risiko wird für technische Assets generiert, die explizit als `multi_tenant` gekennzeichnet sind oder für Technologietypen, die typischerweise mehrere Benutzer unterstützen (z. B. Anwendungsserver, Datenbanken, Mainframes oder Allzweck-Server-Betriebssysteme). Das Risiko wird als schwerwiegender angesehen, wenn das Asset hochsensible Daten verarbeitet, da der Wert der Aufklärung zunimmt.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das System ordnungsgemäß gehärtet ist (z. B. Dienste deaktiviert, Berechtigungen streng, obligatorische Zugriffskontrolle verwendet), aber das Modell nur angibt, dass es sich um eine Mehrbenutzertechnologie handelt. Die Überprüfung erfordert die Prüfung der tatsächlichen Systemkonfiguration und Härtungsmaßnahmen."
    },
    "abuse-of-scripting-on-unix": {
      "title": "Missbrauch von Skriptsprachen auf Unix-ähnlichen Systemen (BSI OPS.1.1.5.A1)",
      "description": "Unix-ähnliche Betriebssysteme verwenden oft leistungsstarke Skriptsprachen. Skripte, bei denen es sich um Textdateien mit einer Reihe von Befehlen handelt, können von der Befehlszeile aus ausgeführt werden. Aufgrund der umfangreichen Funktionalität dieser Skriptumgebungen können Angreifer Skripte für eine Vielzahl bösartiger Zwecke missbrauchen. Darüber hinaus ist es sehr schwierig, die Fähigkeiten dieser Skriptsprachen nach ihrer Aktivierung einzudämmen oder einzuschränken.",
      "impact": "Wenn ein Angreifer Skripte auf einem kompromittierten System ausführen oder ändern kann, kann er Privilegien eskalieren, Malware installieren, Daten exfiltrieren, Systemdateien manipulieren oder einen Denial-of-Service verursachen. Dies gefährdet die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und der von ihm verarbeiteten Daten.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Katalog (z.B. OPS.1.1.5 Linux- und Unix-Server). Obwohl es keine direkte Übereinstimmung gibt, bezieht sich dies auf OWASP ASVS V14.2 (Validierung, Sanitisierung und Kodierung) und V1.10 (Härtung und Konfiguration).",
      "action": "System härten und Skriptausführung einschränken",
      "mitigation": "Wenden Sie das Prinzip der geringsten Rechte an. Deaktivieren Sie unnötige Skript-Interpreter (wie Perl, Python, Bash, falls nicht benötigt). Verwenden Sie obligatorische Zugriffskontrollsysteme (wie AppArmor oder SELinux), um einzuschränken, welche Skripte wo und von wem ausgeführt werden können. Stellen Sie sicher, dass die Dateiberechtigungen für Skripte und Verzeichnisse sicher sind, um unbefugte Änderungen zu verhindern. Überwachen Sie regelmäßig auf verdächtige Skriptausführungen mittels EDR oder Protokollierung.",
      "check": "Sind Skriptsprachen, die nicht für die Anwendung unerlässlich sind",
      "detectionLogic": "Dieses Risiko wird für alle relevanten technischen Assets ausgelöst, die als Unix-ähnliches Betriebssystem (`os:unix`) gekennzeichnet sind. Das Risiko ist generisch für die Betriebssystemplattform und ihr Missbrauchspotenzial, wenn sie nicht ordnungsgemäß gehärtet ist.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Systemen mit Internetanbindung erhöht. Die Auswirkung steht in direktem Zusammenhang mit der CIA-Bewertung des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten. Eine Kompromittierung eines geschäftskritischen Datenbankservers durch Skriptmissbrauch hat eine sehr hohe Auswirkung.",
      "falsePositives": "Das Risiko könnte als Fehlalarm betrachtet werden, wenn das System, obwohl es Unix-ähnlich ist, über ausgereifte und robuste Härtungsmaßnahmen verfügt (z. B. SELinux im Enforcing-Modus mit einer strengen Richtlinie, minimale Pakete installiert), die im Bedrohungsmodell nicht erfasst sind."
    },
    "ld-preload-hijacking": {
      "title": "Dynamic Linker Hijacking über LD_PRELOAD (BSI-Stil)",
      "description": "Auf Unix-ähnlichen Systemen kann die Umgebungsvariable LD_PRELOAD das Laden einer vom Benutzer angegebenen Shared Library erzwingen, bevor jede andere von einer Anwendung benötigte Bibliothek geladen wird. ",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, beliebigen Code mit den Berechtigungen der Zielanwendung auszuführen. Dies kann zu einer vollständigen Kompromittierung des Assets führen, einschließlich des Diebstahls oder der Manipulation aller von ihm verarbeiteten Daten (Verlust der Vertraulichkeit und Integrität), der Störung seiner Funktion (Verlust der Verfügbarkeit) und es kann als leistungsstarker Mechanismus zur Privilegienerweiterung und Persistenz im System verwendet werden.",
      "asvs": "Dies ist in erster Linie ein Konfigurations- und Sicherheitsproblem auf Host-Ebene und keine Webanwendungsschwachstelle, wie sie von OWASP ASVS abgedeckt wird. Es bezieht sich auf die Prinzipien in V14 Konfiguration, insbesondere V14.2.5 (Dateisystemberechtigungen) und V14.4 (Integrität von Abhängigkeiten).",
      "action": "Ausführungsumgebung härten und Prozessausführungskontrollen verwenden",
      "mitigation": "Beschränken Sie die Schreibberechtigungen für Verzeichnisse, in denen sich Anwendungsbinärdateien befinden. Verwenden Sie Sicherheitsmodule wie SELinux oder AppArmor, um strenge Richtlinien zu erstellen, welche Prozesse ausgeführt werden können und welche Umgebungsvariablen sie verwenden dürfen. Deaktivieren Sie LD_PRELOAD systemweit, wenn es für keinen legitimen Zweck erforderlich ist (z. B. über /etc/ld.so.preload). Überwachen Sie die Prozesserstellung und die zugehörigen Umgebungsvariablen auf verdächtige Verwendung von LD_PRELOAD. Ziehen Sie für kritische Anwendungen die Verwendung statisch gelinkter Binärdateien in Betracht, um die Abhängigkeit von dynamischen Bibliotheken zu vermeiden.",
      "check": "Sind die Dateiberechtigungen für Anwendungsbinärdateien und Systembibliotheksfade ordnungsgemäß eingeschränkt? Werden obligatorische Zugriffskontrollsysteme (SELinux, AppArmor) verwendet, um das Anwendungsverhalten einzuschränken? Wird die Prozessausführung auf unbefugte Verwendung von Umgebungsvariablen wie LD_PRELOAD überwacht?",
      "detectionLogic": "Dieses Risiko ist für jedes prozessbasierte technische Asset relevant, das auf einem Maschinentyp läuft, der für diesen Angriff anfällig ist (d.h. nicht serverlos). Die Regel identifiziert Assets, die auf physischen, virtuellen oder containerisierten Maschinen laufen, da diese Umgebungen potenziell von einem Angreifer mit einem Fuß in der Tür manipuliert werden können.",
      "riskAssessment": "Die Auswirkung ist direkt proportional zur Sensibilität des Assets und der von ihm verarbeiteten Daten. Codeausführung auf einem Asset, das ",
      "falsePositives": "Das Risiko könnte bei einem Asset gemeldet werden, bei dem das Host-Betriebssystem andere mildernde Kontrollen hat (z. B. einen gehärteten Kernel, strenge AppArmor-Profile), die im Bedrohungsmodell nicht sichtbar sind. Einige spezifische Entwickler- oder Profiling-Tools könnten LD_PRELOAD für legitime Zwecke verwenden, was möglicherweise akzeptiert werden muss."
    },
    "uncontrolled-software-source-bsi-sys-1-2": {
      "title": "Unkontrollierte Softwareinstallation aus ungeprüften Quellen (BSI SYS.1.2)",
      "description": "Auf Unix-ähnlichen IT-Systemen laden Benutzer manchmal Software-Quellcode selbst herunter und kompilieren ihn oder installieren vorkompilierte Pakete aus Drittanbieterquellen, anstatt offizielle, geprüfte Paket-Repositories zu verwenden. Jede dieser alternativen Methoden der Softwareinstallation birgt zusätzliche Risiken, da sie zur Installation fehlerhafter, inkompatibler oder bösartiger Software führen kann.",
      "impact": "Die Installation von Software aus nicht vertrauenswürdigen Quellen kann Malware einschleusen, was zu einer Kompromittierung von Vertraulichkeit, Integrität und Verfügbarkeit führt. Sie kann auch zu Systeminstabilität führen und den Geschäftsbetrieb aufgrund fehlerhafter oder inkompatibler Softwarekomponenten stören.",
      "asvs": "V14.2.1: Überprüfen Sie, dass alle Drittanbieterkomponenten aus einer vertrauenswürdigen Quelle stammen und einen sicheren und überprüfbaren Liefermechanismus haben.",
      "action": "Verwendung von geprüften Softwarequellen und Repositories durchsetzen",
      "mitigation": "Etablieren und erzwingen Sie eine strikte Richtlinie, nach der alle Software aus offiziellen, vertrauenswürdigen und signierten Paket-Repositories installiert werden muss. Verwenden Sie Konfigurationsmanagement-Tools (z. B. Ansible, Puppet, Chef), um Softwareinstallationen zu automatisieren und zu kontrollieren. Implementieren Sie eine Zulassungsliste für Softwarequellen und Repositories. Scannen Sie Systeme regelmäßig auf nicht autorisierte oder manuell installierte Software. Wenn das Kompilieren aus dem Quellcode absolut notwendig ist, muss dies in einer kontrollierten, isolierten Build-Umgebung nach einer rigorosen Quellcode-Überprüfung und Sicherheitsbewertung erfolgen.",
      "check": "Gibt es eine dokumentierte Richtlinie für die Softwareinstallation? Werden Systemkonfigurationen von einem automatisierten Tool verwaltet? Sind Paket-Repositories auf eine vertrauenswürdige Zulassungsliste beschränkt? Werden Systeme auf nicht autorisierte Softwarepakete gescannt?",
      "detectionLogic": "Dieses Risiko wird für relevante technische Assets ausgelöst, die auf Container-, virtuellen oder physischen Maschinen laufen, insbesondere solche, bei denen administrativer oder Entwicklerzugriff üblich ist (z. B. Anwendungsserver, Build-Pipelines). Die Wahrscheinlichkeit dieses Risikos wird als höher angesehen, wenn das Asset benutzerdefinierte Teile hat oder explizit mit `@Control:unvetted-software-sources` gekennzeichnet ist.",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Anforderungen des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Eine Kompromittierung eines geschäftskritischen Systems hat eine sehr hohe Auswirkung. Die Wahrscheinlichkeit ist hoch, wenn die Praxis bekanntermaßen auftritt (angezeigt durch das Tag) oder wenn keine präventiven Kontrollen auf anfälligen Systemtypen vorhanden sind. Ohne das explizite Tag wird ein allgemeines Risiko für relevante Asset-Typen ausgelöst, um die Überprüfung der operativen Kontrollen zu fördern.",
      "falsePositives": "Dieses Risiko könnte in isolierten Sandboxes oder Entwicklungsumgebungen akzeptabel sein, in denen Experimente erforderlich sind, vorausgesetzt, diese Umgebungen können Produktionssysteme nicht beeinträchtigen und werden regelmäßig gelöscht oder neu abgebildet. Es kann auch ein Fehlalarm sein, wenn starke kompensierende Kontrollen (wie strikte AppArmor/SELinux-Richtlinien, Netzwerksegmentierung und regelmäßige Audits) nachweislich vorhanden und wirksam sind."
    },
    "unclear-responsibilities-on-virtualization-platform": {
      "title": "Unklare Verantwortlichkeiten und Rechtetrennung auf der Virtualisierungsplattform (BSI APP.4.4)",
      "description": "Wenn die technische und organisatorische Integration von Virtualisierungsservern in die bestehende Infrastruktur nicht ausreichend geplant ist, ",
      "impact": "Das Versäumnis, administrative Verantwortlichkeiten und Zugriffsrechte auf einer gemeinsam genutzten Virtualisierungsplattform ordnungsgemäß zu trennen, kann einem Angreifer oder böswilligen Insider eine Privilegienerweiterung ermöglichen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium APP.4.4 Virtualisierung, insbesondere Anforderungen A1 (Planung des Virtualisierungseinsatzes), A4 (Administration der Virtualisierungslösung) und A6 (Trennung der administrativen Rollen).",
      "action": "Ein granulares Rollen- und Rechtekonzept für die Virtualisierungsplattform definieren und durchsetzen",
      "mitigation": "Implementieren Sie ein detailliertes Rollen- und Rechtekonzept, das eine Funktionstrennung für verschiedene administrative Bereiche durchsetzt (z. B. Hypervisor-Admin, Netzwerk-Admin, Storage-Admin und einzelne Gast-/Anwendungs-Admins). ",
      "check": "Gibt es ein dokumentiertes Rollen- und Rechtekonzept für die Virtualisierungsplattform? Sind die administrativen Zugriffe nach Rollen getrennt (z. B. Hypervisor-Admin vs. Gast-Admin)? Wird dies durch technische Kontrollen wie RBAC durchgesetzt? Werden die Zugriffsprotokolle für die Plattform regelmäßig überprüft?",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit ist ",
      "falsePositives": "Das Modell kann die tatsächliche Implementierungsqualität des RBAC auf der Virtualisierungsplattform nicht überprüfen. Das Risiko wird aufgrund der gemeinsamen Nutzung generiert, aber die Plattform könnte über ausgezeichnete, nicht modellierte Kontrollen verfügen, die die Mandanten effektiv trennen."
    },
    "incorrect-placement-of-high-value-virtual-asset": {
      "title": "Falsche Platzierung eines hochwertigen virtualisierten Assets in einer öffentlichen Netzwerkzone (BSI APP.3.2.A5)",
      "description": "Die Virtualisierung vereinfacht und beschleunigt die Bereitstellung von IT-Systemen. Ressourcen wie CPU, RAM und Netzwerkverbindungen werden typischerweise über ein zentrales Managementsystem konfiguriert, wodurch festverdrahtete Einschränkungen entfallen. ",
      "impact": "Wenn ein hochwertiges virtualisiertes Asset fälschlicherweise dem Internet ausgesetzt wird, umgeht es die Sicherheitskontrollen am Perimeter und wird zu einem direkten Ziel für eine breite Palette von Angriffen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein APP.3.2 (Virtualisierung). Die Anforderung APP.3.2.A5 (Zuordnung von VMs zu virtuellen Netzen) spricht direkt die Notwendigkeit der korrekten Netzwerkzuweisung an.",
      "action": "Strikte Netzwerkkonfigurations- und Bereitstellungsprozesse für virtualisierte Umgebungen implementieren und durchsetzen",
      "mitigation": "Etablieren Sie ein strenges Änderungsmanagement und einen ",
      "check": "Gibt es einen dokumentierten und durchgesetzten Prozess zur Zuweisung von virtuellen Maschinen zu Netzwerkzonen? Unterliegen Änderungen an virtuellen Netzwerkkonfigurationen einer Überprüfung und Genehmigung? ",
      "detectionLogic": "Diese Regel sucht nach technischen Assets, die virtualisiert sind (`virtual` oder `container`) und mindestens eine mittlere Sensibilitätsbewertung haben. ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Vertraulichkeits- und Integritätsbewertung des fehlplatzierten Assets ab. Ein ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn ein Asset absichtlich und sicher so konzipiert ist, dass es dem Internet zugewandt ist, obwohl sein Technologietyp dies nicht vermuten lässt (z. B. ein spezialisiertes, gehärtetes API-Gateway, das auf einer Technologie basiert, die normalerweise nicht für diesen Zweck verwendet wird). "
    },
    "inadequate-resources-on-virtualization-host-g-0-4": {
      "title": "Unzureichende Ressourcen auf dem Virtualisierungs-Host (BSI G 0.4)",
      "description": "Virtualisierungsserver benötigen Ressourcen wie Festplattenspeicher, CPU-Leistung, RAM und Netzwerkbandbreite, um die virtuellen IT-Systeme zu betreiben, die sie hosten. Wenn diese Ressourcen nicht ausreichend geplant oder bereitgestellt werden, können erhebliche Risiken für die Verfügbarkeit der virtuellen Systeme und die Integrität der darin verarbeiteten Informationen entstehen. Dies gilt insbesondere, wenn Funktionen wie Snapshots oder Ressourcenüberbuchung (Overbooking) verwendet werden. Ressourcenengpässe können dazu führen, dass virtuelle Systeme sich gegenseitig stören, fehlerhaft funktionieren oder ganz ausfallen.",
      "impact": "Eine Ressourcenerschöpfung auf einem Virtualisierungs-Host kann zu einem Denial-of-Service (DoS)-Zustand führen, bei dem gehostete virtuelle Systeme nicht mehr reagieren oder abstürzen. Dies kann auch zu Datenkorruption (Verlust der Integrität) führen, wenn Systeme während eines Ausfalls Daten nicht korrekt schreiben können. Die Gesamtwirkung ist die Störung von Geschäftsprozessen, die auf diesen virtuellen Systemen basieren.",
      "asvs": "BSI IT-Grundschutz G 0.4 (Unzureichende Ressourcen) im Baustein OPS.1.1.2 (Virtualisierung)",
      "action": "Kapazitätsplanung und Ressourcenüberwachung für Virtualisierungsplattformen implementieren",
      "mitigation": "Implementieren Sie einen robusten Prozess zur Kapazitätsplanung und -verwaltung für alle Virtualisierungsplattformen, der den Spitzenressourcenbedarf aller gehosteten Systeme berücksichtigt. Verwenden Sie Überwachungstools, um die Ressourcennutzung (CPU, RAM, Speicher, Netzwerk-I/O) zu verfolgen und Alarme zu konfigurieren, wenn vordefinierte Schwellenwerte erreicht werden. Vermeiden Sie eine übermäßige Überbuchung von Ressourcen, es sei denn, die Workload-Eigenschaften sind gut verstanden und werden aktiv verwaltet. Wenn eine umfassende Kapazitätsmanagement- oder Auto-Scaling-Lösung vorhanden ist, kennzeichnen Sie die entsprechende `Shared-Runtime`-Komponente im Modell mit `mitigation:capacity-management-in-place` oder `mitigation:auto-scaling-resources`, um diese Minderung zu bestätigen.",
      "check": "Gibt es einen dokumentierten Kapazitätsmanagementprozess für Virtualisierungsplattformen? Werden die Ressourcennutzungsgrade aktiv mit Alarmierung überwacht? Gibt es eine Richtlinie zur Ressourcenüberbuchung?",
      "detectionLogic": "Dieses Risiko wird für jede im Modell identifizierte `Shared-Runtime`-Komponente ausgelöst, da sie einen Virtualisierungs-Host oder eine Plattform darstellt, auf der mehrere technische Assets gemeinsame zugrunde liegende physische Ressourcen teilen, was ein Potenzial für Ressourcenkonflikte schafft. Das Risiko",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm betrachtet werden, wenn die zugrunde liegende Virtualisierungsplattform ein verwalteter Dienst mit praktisch unbegrenzten, automatisch skalierenden Ressourcen ist (z. B. ein großer Cloud-Anbieter) oder wenn ein sehr robuster Kapazitätsmanagementprozess vorhanden ist, der im Bedrohungsmodell möglicherweise nicht vollständig erfasst ist. In solchen Fällen wird die Anwendung eines Minderungstags empfohlen."
    },
    "improper-vm-snapshot-handling": {
      "title": "Risiken unsachgemäßer Handhabung von Snapshots virtueller Maschinen",
      "description": "Ein Snapshot kann den Zustand einer virtuellen Maschine einfrieren und speichern. Wenn ein solcher Snapshot zu einem späteren Zeitpunkt wiederhergestellt wird, gehen alle in der Zwischenzeit vorgenommenen Änderungen verloren. Dadurch können auch bereits geschlossene Sicherheitslücken wieder geöffnet werden. Des Weiteren können durch zum Zeitpunkt des Snapshots geöffnete Dateien, Dateiübertragungen oder Datenbanktransaktionen inkonsistente Daten entstehen. Darüber hinaus können Snapshots bei Angriffen missbraucht werden, um unberechtigten Zugriff auf die Daten eines virtuellen IT-Systems zu erlangen, denn wenn der Snapshot während des Betriebs erstellt wurde, wurden auch die Inhalte des Hauptspeichers auf die Festplatte gespeichert und können in einer virtuellen Umgebung außerhalb der ursprünglichen IT-Infrastruktur wiederhergestellt und analysiert werden. Ebenso können Snapshots sehr groß werden, wodurch die verfügbare Speicherkapazität knapp werden kann.",
      "impact": "Eine unsachgemäße Handhabung von VM-Snapshots kann zu schwerwiegenden Sicherheitsvorfällen führen. Das Wiederherstellen alter Snapshots kann kritische Schwachstellen wieder einführen, Sicherheitspatches rückgängig machen und das System bekannten Exploits aussetzen (Integritätsverlust). Snapshots von laufenden Systemen erfassen Speicherinhalte, die von einem Angreifer offline analysiert werden können, um Geheimnisse wie Schlüssel, Passwörter und sensible Daten zu extrahieren (Vertraulichkeitsverlust). Der Prozess kann auch zu Datenkorruption führen, wenn er während aktiver Transaktionen durchgeführt wird (Integritätsverlust). Schließlich kann eine Ansammlung großer Snapshots die Speicherressourcen erschöpfen und zu einem Denial-of-Service führen (Verfügbarkeitsverlust).",
      "asvs": "BSI IT-Grundschutz CON.6 Virtualisierung",
      "action": "Eine Richtlinie für das Lebenszyklusmanagement von Snapshots implementieren und durchsetzen",
      "mitigation": "Implementieren Sie eine formale Richtlinie für das Snapshot-Management, die Snapshots als temporäre, kurzfristige Mechanismen behandelt (d.h. nicht als Backups). Löschen Sie Snapshots umgehend, nachdem ihr Zweck erfüllt ist (z. B. nach der Patch-Validierung). Verwenden Sie Automatisierung, um Richtlinien für den Lebenszyklus von Snapshots durchzusetzen (Erstellung, Löschung und Alarmierung). Sichern Sie den zugrunde liegenden Datenspeicher, in dem Snapshots gespeichert sind, mit strengen Zugriffskontrollen und ziehen Sie die Verschlüsselung im Ruhezustand für die Snapshot-Dateien in Betracht. Um Dateninkonsistenzen zu vermeiden, sollten Anwendungen und Dateisysteme vor der Erstellung eines Snapshots in einen Ruhezustand versetzt (quiesced) werden. Um das Austreten von Daten aus Speicherabbildern zu mindern, vermeiden Sie es, langlebige Geheimnisse im Speicher von virtuellen Maschinen zu speichern, wo dies möglich ist. Überwachen Sie kontinuierlich die Speicherkapazität, um Verfügbarkeitsprobleme zu vermeiden.",
      "check": "Gibt es eine formale Richtlinie für das Lebenszyklusmanagement von VM-Snapshots? Werden Snapshots regelmäßig überprüft und gelöscht? Ist der Speicher für Snapshots gesichert und überwacht? Werden Anwendungen vor der Erstellung von Snapshots zur Datenkonsistenz in einen Ruhezustand versetzt?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die für den Betrieb auf virtuellen Maschinen konfiguriert sind (`machine: virtual`). Das Risiko ist besonders hoch für VMs, die sensible Daten verarbeiten oder speichern, da ihre Speicherinhalte (in Snapshots erfasst) und ihr Datenzustand wertvolle Ziele sind.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko kann überbewertet sein, wenn die Organisation über starke, extern durchgesetzte Snapshot-Management-Richtlinien verfügt (z. B. über einen Cloud-Anbieter"
    },
    "single-point-of-failure-virtualization-management-server": {
      "title": "Single Point of Failure: Virtualisierungs-Management-Server (BSI)",
      "description": "Da alle Funktionen einer virtuellen Infrastruktur über den Management-Server gesteuert und administriert werden, bedeutet ein Ausfall dieses Managementsystems, dass keine Konfigurationsänderungen an der virtuellen Infrastruktur vorgenommen werden können. ",
      "impact": "Ein Ausfall des zentralen Management-Servers führt zu einer erheblichen Beeinträchtigung der Betriebsfähigkeit. Obwohl bestehende virtuelle Systeme möglicherweise weiterlaufen, kann die Unfähigkeit, sie zu verwalten, neu zu konfigurieren oder wiederherzustellen, schnell zu größeren Dienstunterbrechungen eskalieren, insbesondere in dynamischen Umgebungen. Dies beeinträchtigt direkt die Gesamtverfügbarkeit der auf der virtuellen Infrastruktur gehosteten Dienste.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.4 Redundanz",
      "action": "Hochverfügbarkeit für den Virtualisierungs-Management-Server sicherstellen",
      "mitigation": "Der Virtualisierungs-Management-Server sollte für Hochverfügbarkeit ausgelegt sein. Dies kann durch Clustering, Failover-Mechanismen oder redundante Instanzen erreicht werden. Das Asset sollte im Modell als `redundant: true` markiert sein, um diese Minderung widerzuspiegeln. Testen Sie regelmäßig Failover-Verfahren, um sicherzustellen, dass sie wie erwartet funktionieren.",
      "check": "Überprüfen Sie die Architektur der Virtualisierungs-Management-Komponenten. Ist das für die Verwaltung der virtuellen Infrastruktur verantwortliche technische Asset (z. B. ein ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als zentrale Verwaltungskomponente für eine virtualisierte Umgebung fungieren (z. B. Technologie ",
      "riskAssessment": "Die Ausfallwahrscheinlichkeit für ein nicht redundantes kritisches System wird als ",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn Redundanz durch externe Mittel erreicht wird, die nicht im Modell erfasst sind (z. B. ein Cloud-Anbieter"
    },
    "guest-tool-privilege-risk": {
      "title": "Hohe Privilegien von Gast-Tools in virtuellen Maschinen",
      "description": "Gast-Tools (z. B. VMware Tools, VirtualBox Guest Additions) laufen oft mit sehr hohen Privilegien (SYSTEM/root) innerhalb von virtuellen Maschinen. ",
      "impact": "Wenn diese Schwachstelle ausgenutzt wird, kann dies zu einem Denial-of-Service der betroffenen virtuellen Maschine führen. Die schwerwiegendste Auswirkung ist eine vollständige Übernahme des Virtualisierungs-Hosts, was die Vertraulichkeit, Integrität und Verfügbarkeit aller anderen auf demselben Host laufenden Assets kompromittiert.",
      "asvs": "BSI IT-Grundschutz SYS.1.3 Virtualisierung",
      "action": "Virtualisierungskomponenten härten und auf dem neuesten Stand halten",
      "mitigation": "Aktualisieren Sie regelmäßig sowohl die Gast-Tools innerhalb der virtuellen Maschine als auch die Virtualisierungs-Host-Plattform selbst, um bekannte Schwachstellen zu beheben. ",
      "check": "Werden Gast-Tools und die Virtualisierungsplattform mit Sicherheitspatches auf dem neuesten Stand gehalten? Ist die virtuelle Maschine als Teil eines ",
      "detectionLogic": "Findet alle technischen Assets, die mit `machine: virtual` konfiguriert sind. Das Risiko ist inhärent bei der Verwendung von Virtualisierung mit Gast-Tools, da diese eine tiefe Integration mit dem Gast-Betriebssystem-Kernel erfordern.",
      "riskAssessment": "Die Auswirkung wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm oder von geringerer Schwere betrachtet werden, wenn starke kompensierende Kontrollen vorhanden sind, wie z. B. fortschrittliche EDR/Sandboxing-Technologien innerhalb des Gastes oder die Verwendung von Virtualisierungstechnologien, die nicht auf traditionelle privilegierte Gast-Tools angewiesen sind (z. B. bestimmte Mikro-VM-Implementierungen)."
    },
    "compromise-of-hypervisor": {
      "title": "Kompromittierung des Hypervisors (basiert auf BSI)",
      "description": "Die Virtualisierungssoftware (Hypervisor) ist die zentrale Komponente eines Virtualisierungsservers. ",
      "impact": "Eine erfolgreiche Kompromittierung des Hypervisors gewährt einem Angreifer die volle Kontrolle über alle gehosteten virtuellen Maschinen. ",
      "asvs": "Abgeleitet von Konzepten des BSI IT-Grundschutzes, insbesondere im Zusammenhang mit der Virtualisierungssicherheit (z. B. APP.3.1 Virtualisierung). Das Kernrisiko betrifft die Plattformintegrität.",
      "action": "Hypervisor-Plattform härten und sichern",
      "mitigation": "Wenden Sie Sicherheitspatches für den Hypervisor zeitnah an. Verwenden Sie ein dediziertes und isoliertes Verwaltungsnetzwerk für den Hypervisor. ",
      "check": "Werden Hypervisor-Sicherheitspatches zeitnah angewendet? Ist die Hypervisor-Verwaltungsschnittstelle von Produktions- und Benutzernetzwerken isoliert? ",
      "detectionLogic": "Erkennt `shared_runtime`-Komponenten, die mit `@Hypervisor` gekennzeichnet sind und eine oder mehrere `technical_asset`(s) des Maschinentyps `virtual` ausführen. ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit, Integrität und Verfügbarkeit jeder auf dem Hypervisor laufenden virtuellen Maschine bestimmt, da eine Kompromittierung des Hypervisors alle laufenden VMs kompromittiert. ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm betrachtet oder akzeptiert werden, wenn der Hypervisor Teil eines vollständig verwalteten Dienstes eines großen Cloud-Anbieters ist (z. B. AWS Nitro, Azure Hypervisor), bei dem der Kunde keine direkte Kontrolle über das Patchen oder die Konfiguration hat. "
    },
    "vulnerable-or-malicious-container-images": {
      "title": "Schwachstellen oder bösartige Komponenten in Container-Images (basiert auf BSI CON.8)",
      "description": "Container werden hauptsächlich aus vorgefertigten Images erstellt, die aus dem Internet bezogen oder intern erstellt werden können. ",
      "impact": "Die Ausnutzung von Schwachstellen innerhalb eines Containers kann zu einer vollständigen Kompromittierung dieses Assets führen. Dies kann zum Verlust der Vertraulichkeit, Integrität und Verfügbarkeit (CIA) aller vom Container verarbeiteten oder gespeicherten Daten führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.8 (Containerisierung), insbesondere Anforderung CON.8.A4 (Prüfung von Images auf Schwachstellen).",
      "action": "Image-Scanning und Lebenszyklusmanagement implementieren",
      "mitigation": "Verwenden Sie einen dedizierten Schwachstellenscanner für Container-Images innerhalb der CI/CD-Pipeline, um bekannte Schwachstellen in Basis-Images und Anwendungsabhängigkeiten zu erkennen. ",
      "check": "Werden Container-Images vor der Bereitstellung auf Schwachstellen gescannt? Gibt es eine definierte Richtlinie für vertrauenswürdige Image-Quellen? Werden Basis-Images regelmäßig aktualisiert und Anwendungen neu erstellt?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Container (`machine: container`) ausgeführt wird. ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als hoch angesehen, insbesondere für Images, die auf Komponenten von Drittanbietern basieren (`custom_developed_parts: false`). ",
      "falsePositives": "Ein Risiko könnte auch dann gemeldet werden, wenn ein effektiver Image-Scanning-Prozess existiert, dieser aber nicht im Modell über das Tag `@Control:image-vulnerability-scanner` dokumentiert ist. "
    },
    "unprotected-container-administration": {
      "title": "Ungeschützte Container-Administrationsschnittstelle (BSI CON.7.A12)",
      "description": "Um Container-Dienste auf einem Host zu verwalten, ist administrativer Zugriff erforderlich. Dieser Zugriff wird oft als Dienste realisiert, die entweder lokal (z. B. über Sockets) oder über das Netzwerk angesprochen werden können. ",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, die volle administrative Kontrolle über die Container-Plattform zu erlangen. Dies kann zur Ausführung beliebiger Befehle, zur Bereitstellung bösartiger Container, zum Diebstahl oder zur Änderung von Daten in allen Containern und zu einem Denial-of-Service für alle auf dem Host laufenden Anwendungen führen. Dies stellt eine vollständige Kompromittierung des Hosts und all seiner Workloads dar.",
      "asvs": "BSI IT-Grundschutz CON.7 Containerisierung, Anforderung CON.7.A12 ",
      "action": "Container-Administrationsschnittstellen absichern",
      "mitigation": "Aktivieren Sie eine starke Authentifizierung und Autorisierung für alle Container-Management-Schnittstellen (z. B. Docker-Daemon-API, Kubernetes-API-Server). ",
      "check": "Sind alle Management-Schnittstellen der Container-Plattform mit starker, obligatorischer Authentifizierung geschützt? Ist der gesamte administrative Netzwerkverkehr verschlüsselt? Ist der Netzwerkzugriff auf Management-Schnittstellen auf einen minimalen Satz vertrauenswürdiger Quellen beschränkt? Sind die Dateiberechtigungen für lokale Management-Sockets ordnungsgemäß eingeschränkt?",
      "detectionLogic": "Diese Regel zielt auf technische Assets vom Typ ",
      "riskAssessment": "Das Schadensausmaß wird als ",
      "falsePositives": "Ein Risiko könnte für eine Container-Plattform generiert werden, die über kompensierende Kontrollen (z. B. eine Hardware-Firewall) verfügt, die nicht in Threagile modelliert sind. Die Unterscheidung zwischen einem Management-Knoten und einem Worker-Knoten ist möglicherweise nicht aus dem Modell ersichtlich, was dazu führen kann, dass ein Risiko für einen Worker-Knoten ausgelöst wird, bei dem der lokale Zugriff weniger kritisch ist."
    },
    "container-resource-exhaustion-on-host": {
      "title": "Ressourcenerschöpfung des Hosts durch Container (BSI CON.7)",
      "description": "Ein einzelner Container kann, wenn er nicht ordnungsgemäß ressourcenbeschränkt ist, eine übermäßige Menge der Host-",
      "impact": "Eine erfolgreiche Ausnutzung dieser Schwachstelle führt zu einem Denial of Service. Dies beeinträchtigt die Verfügbarkeit aller Dienste, die in Containern auf dem betroffenen Host laufen, sowie potenziell das Host-System selbst. Geschäftsprozesse, die von diesen Diensten abhängen, werden gestört, was potenziell zu finanziellen Verlusten führt.",
      "asvs": "BSI IT-Grundschutz CON.7.A12 Ressourcenbegrenzung von Containern.",
      "action": "Container-Ressourcenlimits durchsetzen",
      "mitigation": "Definieren und erzwingen Sie strenge Ressourcenquoten (CPU, Speicher, PID-Limits, I/O) für jeden Container. Dies sollte auf der Ebene des Container-Orchestrators (z. B. Kubernetes LimitRanges, Pod-Ressourcenanforderungen/-limits) oder über die Konfiguration der Container-Laufzeitumgebung implementiert werden. Überwachen Sie die Ressourcennutzung kontinuierlich, um abnormalen Verbrauch zu erkennen und zu alarmieren, bevor er den Host beeinträchtigt. Erwägen Sie die Verwendung eines Tags wie `resource-limits-applied` auf der Shared-Runtime oder den Containern, um die Minderung zu kennzeichnen.",
      "check": "Sind Ressourcenlimits (CPU, Speicher, PIDs) für alle containerisierten Assets, die auf einem gemeinsamen Host laufen, definiert und durchgesetzt? Gibt es eine aktive Überwachung der Container-Ressourcennutzung im Vergleich zu ihren definierten Quoten?",
      "detectionLogic": "Dieses Risiko wird automatisch erkannt, wenn ein ",
      "riskAssessment": "Das Schadensausmaß wird durch die höchste Verfügbarkeitsanforderung eines jeden containerisierten Assets bestimmt, das auf dem gemeinsamen Host läuft. Ein Host, der ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn der zugrunde liegende Host oder Orchestrator standardmäßig eine starke Ressourcenisolierung zwischen den Mandanten implementiert. Das Risiko kann als gemindert oder als Fehlalarm markiert werden, wenn explizite Ressourcenlimits für alle Container auf dem Host bestätigt werden."
    },
    "unrestricted-container-communication-con5": {
      "title": "Uneingeschränkte Container-Kommunikation (BSI CON.5)",
      "description": "Alle Container auf einem Host können im Allgemeinen miteinander, mit dem Host und mit allen anderen Hosts kommunizieren. ",
      "impact": "Das Versäumnis, die Container-Kommunikation einzuschränken, kann zu lateralen Bewegungen innerhalb der Infrastruktur führen, wodurch sich eine Kompromittierung von einem Container auf andere oder auf das Host-System ausbreiten kann. ",
      "asvs": "BSI IT-Grundschutz CON.5 Containerisierung",
      "action": "Netzwerksegmentierung und Egress/Ingress-Filterung für Container implementieren",
      "mitigation": "Für die Inter-Container-Kommunikation auf demselben Host implementieren Sie feingranulare Netzwerkrichtlinien, um ein ",
      "check": "Sind Container, die auf demselben Host laufen, durch Netzwerkrichtlinien voneinander isoliert? Werden nur interne Container-Dienste daran gehindert, von außen zugänglich zu sein? Gibt es eine Default-Deny-Richtlinie für den ein- und ausgehenden Container-Verkehr?",
      "detectionLogic": "Diese Regel prüft auf zwei Bedingungen basierend auf BSI CON.5:\n",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als ",
      "falsePositives": "Ein Modell könnte eine `NetworkPolicyNamespaceIsolation`-Vertrauensgrenze nicht explizit enthalten, selbst wenn eine in der realen Implementierung existiert, was zu einem Fehlalarm führt. Ebenso könnte ein als `@Visibility:internal` getaggter Dienst absichtlich aus einem bestimmten, gerechtfertigten Grund exponiert sein, der im Modell nicht erfasst ist."
    },
    "container-breakout": {
      "title": "Container-Ausbruch (BSI)",
      "description": "Wenn es möglich ist, benutzerdefinierten Code innerhalb eines Containers auszuführen, kann ein Angreifer möglicherweise die Container-",
      "impact": "Ein erfolgreicher Angriff könnte es einem Angreifer ermöglichen, die Kontrolle über das Host-System oder andere Systeme in der Infrastruktur zu erlangen. ",
      "asvs": "BSI IT-Grundschutz APP.4.4.A12 (Härtung des Host-Betriebssystems) und APP.4.4.A13 (Härtung der Container-Engine).",
      "action": "Container-Host, Laufzeitumgebung und Images härten",
      "mitigation": "Härten Sie das Host-System, indem Sie ein minimales, container-optimiertes Betriebssystem verwenden und den Kernel sowie alle Systemkomponenten gepatcht halten. ",
      "check": "Werden Host-Systeme und Kernel regelmäßig gepatcht? Werden minimale Host-Betriebssystem-Images verwendet? Werden Sicherheitsprofile wie Seccomp und AppArmor durchgesetzt? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset generiert, das so modelliert ist, dass es in einem ",
      "riskAssessment": "Die Auswirkung wird basierend auf den höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen (CIA) *aller* Assets berechnet, die auf demselben Host laufen ",
      "falsePositives": "Das Risiko könnte durch fortschrittliche Sandboxing-Technologien (z. B. gVisor, Kata Containers) oder außergewöhnliche Host-Härtung und Laufzeit- "
    },
    "improper-container-shutdown": {
      "title": "Unsachgemäßes Herunterfahren von Containern (BSI CON.6)",
      "description": "Bei der Verwaltung von Containern können diese heruntergefahren werden, ohne der darin laufenden Software die Möglichkeit zu geben, ihre aktuellen Prozesse, wie z. B. das Schreiben von Daten, abzuschließen (d. h. ein nicht ordnungsgemäßes Herunterfahren). Wenn zu diesem Zeitpunkt Daten vom Container verarbeitet werden, gehen diese verloren. Auch persistent im Container gespeicherte Daten können auf diese Weise dauerhaft verloren gehen oder beschädigt werden.",
      "impact": "Ein nicht ordnungsgemäßes Herunterfahren eines Containers kann zu Datenverlust oder -beschädigung führen, was sich direkt auf die Verfügbarkeit und Integrität der verarbeiteten oder gespeicherten Informationen auswirkt. Dies kann zu inkonsistenten Anwendungszuständen, zur Unterbrechung von Geschäftsprozessen und zum dauerhaften Verlust kritischer Daten führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.6 (Containerisierung). Bezieht sich auch auf die Best Practices von Kubernetes für den Pod-Terminierungslebenszyklus.",
      "action": "Ordnungsgemäßes Herunterfahren von Containern sicherstellen",
      "mitigation": "Anwendungen, die in Containern laufen, müssen so konzipiert sein, dass sie Terminierungssignale (wie SIGTERM) ordnungsgemäß behandeln. Dies beinhaltet das Speichern des Zustands, das Abschließen kritischer Operationen und das Schließen von Verbindungen vor dem Beenden. Die Container-Orchestrierungsplattform (z. B. Kubernetes) muss mit einer angemessenen `terminationGracePeriodSeconds` konfiguriert sein, um den Anwendungen genügend Zeit für ein sauberes Herunterfahren zu geben. Vermeiden Sie die Verwendung von erzwungenen Terminierungsbefehlen (wie `kill -9` oder `docker kill`) in automatisierten Skripten oder manuellen Operationen, es sei denn, dies ist absolut notwendig.",
      "check": "Behandelt die Anwendung im Container SIGTERM-Signale, um ein ordnungsgemäßes Herunterfahren durchzuführen? Ist die Container-Plattform",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Container (`machine: container`) identifiziert wird und Daten verarbeitet oder speichert. Das Risiko ist bei kundenspezifisch entwickelten Anwendungen höher, da diese eher dazu neigen, die Implementierung ordnungsgemäßer Herunterfahrverfahren zu übersehen.",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die höchste Verfügbarkeits- und Integritätsbewertung der vom Container verarbeiteten oder gespeicherten Datenassets bestimmt. Eine höhere Bewertung führt zu einer höheren Auswirkung. Die Wahrscheinlichkeit wird bei kundenspezifisch entwickelten Teilen als höher angesehen, da Standardsoftware oft eine robustere Lebenszyklusbehandlung aufweist. Ein unsachgemäßes Herunterfahren eines Containers, der geschäftskritische Daten verarbeitet, stellt ein Risiko mit sehr hoher Auswirkung dar.",
      "falsePositives": "Ein Modell kann nicht bestimmen, ob der Anwendungscode innerhalb eines Containers Terminierungssignale korrekt behandelt. Daher kann dieses Risiko auch dann gemeldet werden, wenn die Anwendung korrekt implementiert ist. Dies muss durch eine Code-Überprüfung oder durch Überprüfung der Anwendung"
    },
    "hardcoded-credentials-in-container-environment": {
      "title": "Hartcodierte oder unsicher gespeicherte Anmeldeinformationen in der Container-Umgebung",
      "description": "Die Prinzipien des Erstellens und Bauens von Images für Container erfordern, dass Zugangsdaten, wie z. B. Datenbank-Anmeldeinformationen, im Container verfügbar sind. Diese Zugangsdaten können durch die Images selbst, die zur Erstellung der Images verwendeten Skripte (z. B. Dockerfiles), die Versionskontrolle der Skripte oder unverschlüsselte Laufzeit-Umgebungsvariablen in unbefugte Hände gelangen. Dies stellt ein erhebliches Risiko für den Vertraulichkeitsverlust dieser sensiblen Anmeldeinformationen dar.",
      "impact": "Wenn Anmeldeinformationen für sensible Systeme wie Datenbanken kompromittiert werden, kann ein Angreifer unbefugten Zugriff erlangen. Dies kann zum Diebstahl sensibler Daten (Verletzung der Vertraulichkeit), zur unbefugten Änderung oder Löschung von Daten (Verletzung der Integrität) und zu einer potenziellen Störung abhängiger Dienste (Auswirkung auf die Verfügbarkeit) führen.",
      "asvs": "V6.4.2: Überprüfen Sie, dass Anmeldeinformationen und andere Geheimnisse nicht im Quellcode hartcodiert sind, sondern an einem sicheren Ort gespeichert werden, z. B. in einem verwalteten Geheimnisspeicher.",
      "action": "Verwenden Sie eine sichere Lösung zur Verwaltung von Geheimnissen für Container",
      "mitigation": "Hartcodieren Sie keine Anmeldeinformationen oder andere Geheimnisse in Container-Images, Dockerfiles oder in Dateien, die in die Versionskontrolle eingecheckt werden. Vermeiden Sie die Übergabe von Geheimnissen als Klartext-Umgebungsvariablen. Verwenden Sie stattdessen eine dedizierte Lösung zur Verwaltung von Geheimnissen (wie HashiCorp Vault, AWS Secrets Manager, Azure Key Vault), um Geheimnisse zur Laufzeit sicher in Container zu injizieren. Nutzen Sie die nativen Geheimnisverwaltungsfunktionen Ihres Container-Orchestrators (z. B. Kubernetes Secrets, Docker Swarm Secrets) und stellen Sie sicher, dass sie für den Produktionseinsatz ordnungsgemäß konfiguriert sind (z. B. mit RBAC, Verschlüsselung im Ruhezustand).",
      "check": "Überprüfen Sie Dockerfiles und zugehörige Build-Skripte auf hartcodierte Anmeldeinformationen. Überprüfen Sie Quellcode-Repositories auf eingecheckte Geheimnisse. Stellen Sie sicher, dass Geheimnisse nicht als Klartext-Umgebungsvariablen in Bereitstellungskonfigurationen übergeben werden. Bestätigen Sie, dass ein Tool zur Verwaltung von Geheimnissen oder ein plattformnatives Geheimnisobjekt verwendet wird, um dem Container zur Laufzeit Anmeldeinformationen bereitzustellen.",
      "detectionLogic": "Diese Regel wird für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit dieser Schwachstelle wird als hoch angesehen, wenn eine containerisierte Anwendung Datenbank-Anmeldeinformationen benötigt, da sie",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn Geheimnisse sicher verwaltet und zur Laufzeit durch einen nicht modellierten Mechanismus injiziert werden, wie z. B. einen benutzerdefinierten Sidecar-Injector oder einen externen Prozess, der nicht durch ein "
    },
    "loss-of-control-via-cicd": {
      "title": "Kontrollverlust über bereitgestellte Komponenten in Container-Umgebungen",
      "description": "Im Gegensatz zu traditionellen Installationen, die vom IT-Betrieb verwaltet werden und bei denen die Kontrolle über bereitgestellte Anwendungen, Komponenten und Dienste vollständig beim Betriebsteam liegt, geht diese Kontrolle in automatisierten Umgebungen wie CI/CD-Pipelines, die auf Container-Plattformen bereitstellen, verloren. ",
      "impact": "Wenn Entwickler ungeprüfte Komponenten und deren Abhängigkeiten direkt in eine Produktions- oder produktionsnahe Umgebung bereitstellen können, besteht ein hohes Risiko, dass Schwachstellen, Malware oder nicht konforme Software eingeführt werden. Dies kann zu Datenpannen, Systeminstabilität und einem Verlust der allgemeinen Sicherheitslage führen, was die Vertraulichkeit, Integrität und Verfügbarkeit der auf der Plattform laufenden Dienste gefährdet.",
      "asvs": "V11.3 Sicherheit der Build-Pipeline",
      "action": "Governance und Sicherheitsschleusen in CI/CD-Pipelines implementieren",
      "mitigation": "Um den Kontrollverlust zu mindern, implementieren Sie robuste Sicherheitsschleusen innerhalb der CI/CD-Pipeline. Dazu gehören Statische Anwendungssicherheitsprüfung (SAST), Software-Kompositionsanalyse (SCA) zur Überprüfung auf anfällige Abhängigkeiten und das Scannen von Container-Images. ",
      "check": "Gibt es eine CI/CD-Pipeline, die direkt auf einer Container-Plattform bereitstellen kann? Sind Sicherheitsprüfungen wie SAST, SCA und Image-Scanning als obligatorische Schleusen in der Pipeline integriert? Verwendet die Container-Plattform einen Admission Controller, um Sicherheitsrichtlinien durchzusetzen (z. B. das Blockieren von Images mit kritischen Schwachstellen)? Sind alle bereitgestellten Images kryptografisch signiert und werden vor der Bereitstellung überprüft?",
      "detectionLogic": "Dieses Risiko wird erkannt, wenn ein entwicklungsbezogenes Asset (wie ein ",
      "riskAssessment": "Die Wahrscheinlichkeit wird standardmäßig als hoch angesehen, da dieses Bereitstellungsmodell absichtlich die Kontrolle an die Entwicklungsteams abgibt. Die Auswirkung wird durch die höchste Sensibilität (CIA-Bewertungen) aller containerisierten Anwendungen bestimmt, die auf der betroffenen Plattform laufen, da eine Kompromittierung eine oder alle von ihnen betreffen könnte.",
      "falsePositives": "Ein Modell könnte eine direkte Bereitstellungsverbindung zeigen, aber in Wirklichkeit verfügt die CI/CD-Pipeline oder die Container-Plattform über starke, nicht umgehbare Sicherheitsschleusen (wie obligatorische Schwachstellenscans oder Admission Controller), die nicht im Modell dargestellt sind. Solche Fälle können als Fehlalarme betrachtet werden, wenn die Kontrollen als wirksam erachtet werden."
    },
    "insecure-zos-configuration": {
      "title": "Unsichere z/OS-Konfiguration (BSI APP.4.4)",
      "description": "Die Konfiguration eines z/OS-Betriebssystems ist hochkomplex und erfordert in vielen Bereichen Eingriffe durch Systemadministratoren. ",
      "impact": "Ein unsicher konfiguriertes z/OS-System kann es Angreifern ermöglichen, wesentliche Sicherheitskontrollen zu umgehen, was zu unbefugtem Zugriff, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein APP.4.4 (z/OS) Anforderung APP.4.4.A19 (Sichere Konfiguration von z/OS).",
      "action": "Sichere Konfiguration und Härtung von z/OS",
      "mitigation": "Implementieren und erzwingen Sie eine strenge Sicherheits-Baseline für die z/OS-Konfiguration, basierend auf den Best Practices des Herstellers und etablierten Härtungsleitfäden. ",
      "check": "Ist das z/OS-System gemäß einer dokumentierten Sicherheits-Baseline konfiguriert? Ist der Zugriff auf kritische Systemdatensätze streng kontrolliert? ",
      "detectionLogic": "Dieses Risiko gilt für jedes technische Asset, das als Mainframe identifiziert wurde, da die Komplexität der z/OS-Konfiguration inhärent ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der inhärenten Komplexität von z/OS als hoch angesehen, was manuelle Konfigurationen fehleranfällig macht. ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm betrachtet werden, wenn die Organisation nachweisen kann, dass sie über ausgereifte, gut dokumentierte und automatisierte Prozesse "
    },
    "insecure-racf-default-configuration": {
      "title": "Unsichere Standard-RACF-Konfiguration unter z/OS (BSI-Stil)",
      "description": "Auf einem z/OS-Betriebssystem ist ein spezialisiertes Sicherheitssystem wie RACF für die Benutzerauthentifizierung und Ressourcenautorisierung zuständig. ",
      "impact": "Wenn unbefugte Benutzer aufgrund einer schwachen RACF-Konfiguration privilegierte Systembefehle ausführen können, können sie die Systemstabilität (Verfügbarkeit) stören, ",
      "asvs": "BSI IT-Grundschutz SYS.2.2 z/OS, insbesondere Anforderung SYS.2.2.A25 (Angemessene Konfiguration des Sicherheitssystems unter z/OS)",
      "action": "RACF-Konfiguration härten",
      "mitigation": "Die Standard-RACF-Konfiguration muss umfassend überprüft und nach dem Prinzip der geringsten Privilegien gehärtet werden. ",
      "check": "Ist das technische Asset ein Mainframe mit z/OS? Wurde seine RACF-Konfiguration über den Standardzustand hinaus überprüft und gehärtet? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset des Technologietyps ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn der "
    },
    "mainframe-maloperation-risk": {
      "title": "Mainframe-Fehlbedienungsrisiko aufgrund von Komplexität",
      "description": "Aufgrund der inhärenten Komplexität eines z/OS-Betriebssystems und seiner Komponenten können Bedienungsfehler oder Fehlkonfigurationen durch das Personal nicht vollständig ausgeschlossen werden. ",
      "impact": "Ein Ausfall eines Mainframe-Systems aufgrund von Fehlbedienung oder Ressourcenkonflikten kann zu einem erheblichen Denial-of-Service für alle abhängigen Geschäftsanwendungen führen. ",
      "asvs": "Abgeleitet von der Methodik des BSI IT-Grundschutzes (bezogen auf die Betriebssicherheit komplexer Systeme). Dieses Risiko wird nicht direkt von einem einzelnen ASVS-Punkt abgedeckt, bezieht sich aber auf Prinzipien der Betriebssicherheit.",
      "action": "Robuste Mainframe-Überwachung, Schulung und Betriebsverfahren implementieren",
      "mitigation": "Die Minderung umfasst eine Kombination aus qualifiziertem Personal und technischen Kontrollen: 1. Stellen Sie sicher, dass Mainframe-Operatoren hochqualifiziert sind und Zugang zu kontinuierlicher Weiterbildung haben. ",
      "check": "Gibt es ein engagiertes, erfahrenes Mainframe-Betriebsteam? Sind Betriebshandbücher verfügbar und werden sie regelmäßig aktualisiert? Ist eine automatisierte Überwachung der Ressourcennutzung und von Konflikten vorhanden? ",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset ausgelöst, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko könnte überbewertet sein, wenn die Organisation über ein sehr erfahrenes Mainframe-Betriebsteam mit umfassender Erfahrung, robuster Automatisierung und gut getesteten Wiederherstellungsverfahren verfügt. "
    },
    "unprotected-mainframe-interfaces": {
      "title": "Ungeschützte Mainframe-Schnittstellen",
      "description": "z/OS-Systeme können über eine Vielzahl von Schnittstellen beeinflusst und verwaltet werden, wie z.B. die Hardware Management Console (HMC), lokale und entfernte MCS-Konsolen, Automatisierungsprozesse und Fernwartungszugänge. Wenn beispielsweise der physische oder logische Zugriff auf diese Schnittstellen unzureichend geschützt ist, könnten Unbefugte die z/OS-Systeme manipulieren.",
      "impact": "Eine unbefugte Manipulation von Mainframe-Schnittstellen kann die Integrität und Verfügbarkeit des gesamten Systems direkt gefährden. Dies kann zu unbefugten Systembefehlen, dem Herunterfahren kritischer Dienste, Datenmanipulation oder einer vollständigen Systemübernahme führen, was zu katastrophalen Geschäftsunterbrechungen und potenziellen Datenlecks führt.",
      "asvs": "Abgeleitet von der Bedrohung für z/OS-Systeme im BSI IT-Grundschutz-Katalog (SYS.1.6 z/OS, Bedrohung T 5.14 Manipulation von z/OS-Systemen über ungeschützte Schnittstellen).",
      "action": "Alle Mainframe-Management- und Zugriffsschnittstellen absichern",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen zu Mainframe-Systemen, insbesondere solche für Management, Automatisierung oder Fernzugriff, starke, hochmoderne Authentifizierung (z.B. Multi-Faktor-Authentifizierung) und verschlüsselte Protokolle (wie SSH, FTPS oder HTTPS) verwenden. Der Zugriff sollte streng kontrolliert und über Netzwerksegmentierung, VPNs oder IP-Filterung, wo anwendbar, eingeschränkt werden. Die Autorisierung muss feingranular sein und dem Prinzip der geringsten Rechte folgen. Deaktivieren oder entfernen Sie alle ungenutzten oder veralteten Schnittstellen.",
      "check": "Überprüfen Sie alle eingehenden Kommunikationsverbindungen für Assets mit `technology: mainframe`. Verifizieren Sie, dass jede Verbindung ein verschlüsseltes Protokoll verwendet und eine Authentifizierungsmethode hat, die stärker als `none` ist. Überprüfen Sie, ob der Zugriff weiter durch `vpn: true` oder `ip_filtered: true` eingeschränkt ist, wenn die Verbindung eine Vertrauensgrenze überschreitet.",
      "detectionLogic": "Diese Regel inspiziert alle eingehenden Kommunikationsverbindungen zu technischen Assets, die als Mainframes (`technology: mainframe`) identifiziert wurden. Sie löst ein Risiko aus, wenn eine Verbindung ein unverschlüsseltes Protokoll verwendet oder die Authentifizierung auf `none` gesetzt ist, da dies unzureichend geschützte Schnittstellen darstellt.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist erheblich erhöht, wenn keine Authentifizierung vorhanden ist. Die Auswirkung leitet sich direkt aus der Integritäts- und Verfügbarkeitsbewertung des Mainframe-Assets selbst ab. Ein `geschäftskritischer` Mainframe, der manipuliert werden kann, stellt ein Risiko mit `sehr hoher` Auswirkung dar.",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn kompensierende Kontrollen vorhanden sind, die nicht modelliert sind (z.B. ein physisch separates und gesichertes Verwaltungsnetzwerk). Die fehlende Verschlüsselung und Authentifizierung auf der Verbindung selbst bleibt jedoch eine erhebliche Schwäche."
    },
    "network-attack-on-zos": {
      "title": "Netzwerkbasierte Angriffe auf z/OS-Systeme (BSI G 0.21)",
      "description": "z/OS-Mainframe-Systeme, die an TCP/IP-Netzwerke angeschlossen sind, insbesondere solche, die Unix System Services verwenden, sind gängigen netzwerkbasierten Angriffen ausgesetzt. ",
      "impact": "Erfolgreiche Angriffe können zu Denial-of-Service (DoS) gegen kritische Mainframe-Dienste, unbefugtem Zugriff auf oder Manipulation von sensiblen Daten während der Übertragung (Informationspreisgabe, Manipulation), ",
      "asvs": "BSI IT-Grundschutz: APP.4.4 z/OS, Gefährdung G 0.21 Netz-Angriffe auf z/OS-Systeme",
      "action": "Netzwerkkommunikation und Zugriff auf den Mainframe sichern",
      "mitigation": "Erzwingen Sie die Verwendung verschlüsselter Protokolle für den gesamten Datenaustausch (z. B. HTTPS, SFTP, FTPS, LDAPS, JDBC-verschlüsselt). Segmentieren Sie das Netzwerk, um den Mainframe von nicht vertrauenswürdigen Zonen zu isolieren. ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen zum Mainframe. Werden unverschlüsselte Protokolle wie HTTP, FTP, LDAP oder reines JDBC verwendet? Ist der Mainframe von Netzwerken mit geringerem Vertrauensniveau ohne VPN oder IP-Filterung zugänglich? ",
      "detectionLogic": "Diese Regel identifiziert Assets mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn unverschlüsselte Protokolle über Netzwerkgrenzen hinweg verwendet werden oder wenn der Zugriff nicht ordnungsgemäß segmentiert ist. ",
      "falsePositives": "Ein Risiko könnte ein Fehlalarm sein, wenn kompensierende Kontrollen existieren, die nicht modelliert sind, wie z. B. ein separates Hardware-Verschlüsselungsgerät, das die Verbindung sichert, oder wenn ein "
    },
    "incorrect-character-set-translation-ebcdic-ascii": {
      "title": "Fehlerhafte Zeichensatzübersetzung (EBCDIC-ASCII/Unicode)",
      "description": "EBCDIC, ASCII und Unicode sind Zeichensätze, die definieren, wie Buchstaben, Zahlen und andere Zeichen durch Bits dargestellt werden. ",
      "impact": "Datenkorruption aufgrund fehlerhafter Zeichensatzübersetzung gefährdet die Integrität der Informationen. Dies kann zu fehlerhafter Datenverarbeitung, ",
      "asvs": "Abgeleitet aus dem Text des BSI IT-Grundschutz-Katalogs zum Datenaustausch mit z/OS. Dies kann auf Anforderungen der Anwendungssicherheit wie ASVS V4.0.3: 13.2.3 abgebildet werden. ",
      "action": "Korrekte und validierte Codepage-Übersetzung sicherstellen",
      "mitigation": "Stellen Sie sicher, dass alle Datenaustauschkanäle zwischen EBCDIC-basierten Systemen (z. B. Mainframes) und ASCII/Unicode-basierten Systemen korrekt konfigurierte und validierte Codepage-Übersetzungstabellen verwenden. ",
      "check": "Sind Codepage-Übersetzungstabellen für alle Kommunikationsverbindungen zwischen Mainframes und anderen Systemen explizit definiert und getestet? Gibt es einen Prozess zur Überprüfung der Datenintegrität nach der Übertragung? Werden Sonderzeichen in Testfällen korrekt behandelt?",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung zwischen einem technischen Asset der Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das spezifische Kommunikationsprotokoll oder die Anwendungsschicht transparent und korrekt die Zeichensatzübersetzung standardmäßig handhabt, oder wenn die ausgetauschten Daten rein binär sind und keine Zeichenübersetzung erfordern."
    },
    "insecure-default-configuration-of-storage-components": {
      "title": "Unsichere Standardkonfiguration von Speicherkomponenten (basiert auf BSI-Leitlinien)",
      "description": "Speicherkomponenten werden oft mit Standardkonfigurationen ausgeliefert, die auf Benutzerfreundlichkeit und breite Funktionalität optimiert sind, nicht auf Sicherheit. ",
      "impact": "Die Verwendung von Speicherkomponenten mit unsicheren Werkseinstellungen ermöglicht einen leichteren unbefugten Zugriff. Dies kann zu Dienstunverfügbarkeit (Denial of Service), ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.1.2: Datenbanken, insbesondere Anforderungen wie SYS.1.2.A11 (Schutz der Management- und Administrationsschnittstellen) und SYS.1.2.A16 (Sichere Konfiguration der Datenbank).",
      "action": "Konfiguration von Speicherkomponenten härten und sichern",
      "mitigation": "Überprüfen und härten Sie die Konfiguration aller Speicherkomponenten vor dem Produktionseinsatz. Deaktivieren Sie alle unnötigen Protokolle und Dienste (z. B. HTTP, Telnet, FTP). ",
      "check": "Sind Speicherkomponenten gemäß einer Sicherheits-Härtungs-Baseline konfiguriert? Verwenden alle eingehenden Kommunikationsverbindungen zu Datenspeichern verschlüsselte Protokolle? Sind die Standardanmeldeinformationen geändert?",
      "detectionLogic": "Diese Regel sucht nach technischen Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist sehr hoch, wenn ein unsicheres Protokoll aktiv für den Zugriff verwendet wird, da dies das triviale Abfangen von Daten und Anmeldeinformationen ermöglicht. ",
      "falsePositives": "Das Risiko könnte nur dann ein Fehlalarm sein, wenn die Kommunikation innerhalb eines vollständig isolierten, physisch gesicherten Netzwerksegments stattfindet, in dem Sniffing als unmöglich angesehen wird und andere starke kompensierende Kontrollen vorhanden sind. "
    },
    "improper-san-segmentation-bridging-networks": {
      "title": "Unsachgemäße SAN-Segmentierung überbrückt Netzwerke (basiert auf BSI)",
      "description": "Ein falsch konfiguriertes Storage Area Network (SAN) kann unbeabsichtigt verschiedene Netzwerksegmente überbrücken. ",
      "impact": "Diese Art von Sicherheitslücke kann Sicherheits- und Überwachungsmaßnahmen wie Firewalls oder Intrusion Detection Systems (IDS) umgehen, ",
      "asvs": "BSI IT-Grundschutz NET.1.1 Netzwerkarchitektur und -design, insbesondere Anforderung NET.1.1.A7 Anforderungen an die Netzwerksegmentierung.",
      "action": "Strikte SAN- und Netzwerksegmentierung (Zoning) implementieren",
      "mitigation": "Stellen Sie sicher, dass Storage Area Networks ordnungsgemäß segmentiert sind, indem Sie Techniken wie Zoning (hardwarebasiert) und LUN-Masking verwenden. ",
      "check": "Gibt es eine dokumentierte Netzwerkarchitektur, die die Segmentierung zeigt? Wird SAN-Zoning und LUN-Masking implementiert und regelmäßig überprüft? ",
      "detectionLogic": "Dieses Risiko wird durch das Finden von Datenspeichern vom Typ ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als hoch angesehen, wenn eine dem Internet zugewandte Komponente mit einem gemeinsamen SAN verbunden ist, da diese Komponenten Hauptziele für Angreifer sind. ",
      "falsePositives": "Das Modell unterscheidet möglicherweise nicht zwischen ordnungsgemäßem logischem SAN-Zoning und einem flachen, unsegmentierten SAN-Fabric. "
    },
    "unencrypted-storage-replication": {
      "title": "Unverschlüsselter Speicherreplikationsverkehr (basiert auf BSI)",
      "description": "Speicherbasierte Replikationsmethoden werden verwendet, um gespeicherte oder archivierte Daten in Echtzeit über ein Speichernetzwerk zu duplizieren, um Redundanz zu gewährleisten und Datenverlust zu verhindern. ",
      "impact": "Wenn der Replikationsverkehr abgefangen wird, ist die Vertraulichkeit der duplizierten Datenassets gefährdet. Dies kann zu schweren Datenpannen, behördlichen Geldstrafen und dem Verlust des Kundenvertrauens führen, insbesondere wenn die Daten sensibel sind.",
      "asvs": "V6.2.1 (Schutz von Daten bei der Übertragung)",
      "action": "Replikationsverkehr verschlüsseln",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, die für die Datenreplikation zwischen Speichersystemen verwendet werden, ein Protokoll verwenden, das eine starke, hochmoderne Verschlüsselung bietet. ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen zwischen Assets vom Typ Datenspeicher, Datenbank, Dateiserver, Blockspeicher usw. Stellen Sie sicher, dass das verwendete Protokoll verschlüsselt ist oder die Verbindung als durch ein VPN geschützt gekennzeichnet ist.",
      "detectionLogic": "Diese Regel wird für jede Kommunikationsverbindung zwischen zwei technischen Assets ausgelöst, die typischerweise Daten speichern (z. B. Datenbank, Dateiserver, Blockspeicher), wenn die Verbindung Daten sendet und das Protokoll nicht verschlüsselt ist. ",
      "riskAssessment": "Das Ausmaß dieses Risikos wird durch die höchste Vertraulichkeitsstufe der Datenassets bestimmt, die über die unverschlüsselte Verbindung gesendet werden. ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die Netzwerkverbindung physisch isoliert und gesichert ist (z. B. dedizierte Dark Fiber), was im Bedrohungsmodell nicht erfasst ist"
    },
    "wwn-iqn-spoofing-on-block-storage": {
      "title": "Identitäts-Spoofing auf Blockspeicher (WWN/IQN-Spoofing)",
      "description": "Storage Area Networks (SANs), insbesondere solche auf Fibre-Channel-Basis (FC), verwenden oft World Wide Names (WWNs) zur Verwaltung und Zuweisung von Zugriffsrechten, ähnlich wie MAC-Adressen in Ethernet-Netzwerken verwendet werden. ",
      "impact": "Erfolgreiches Identitäts-Spoofing führt zu unbefugtem Zugriff auf sensible Daten, die auf dem Blockspeichersystem gespeichert sind. Dies gefährdet die Vertraulichkeit und Integrität der Daten. In einer mandantenfähigen Umgebung wird die Auswirkung verstärkt, da dies zu einem mandantenübergreifenden Datenleck führen kann, was erhebliche finanzielle, rufschädigende und rechtliche Schäden verursacht.",
      "asvs": "BSI IT-Grundschutz CON.3.A12 (Zoning in einem SAN). Obwohl Zoning eine primäre Verteidigung darstellt, ist es anfällig für WWN-Spoofing, wenn es nicht mit einer stärkeren Authentifizierung kombiniert wird.",
      "action": "Starke Authentifizierung für den Zugriff auf SAN/Blockspeicher implementieren",
      "mitigation": "Verlassen Sie sich nicht ausschließlich auf Identifikatoren wie WWN oder IQN für die Zugriffskontrolle. Implementieren Sie ein starkes, kryptografisch abgesichertes Authentifizierungsprotokoll wie das Challenge-Handshake Authentication Protocol (CHAP) für alle Verbindungen zum Blockspeichersystem. ",
      "check": "Werden Verbindungen zu Blockspeichersystemen mit Methoden authentifiziert, die stärker sind als nur ein einfacher Identifikator (z. B. wird CHAP oder ein ähnliches Protokoll verwendet)? Sind die Zugriffskontrollen innerhalb des SAN (Zoning, LUN-Masking) so konfiguriert, dass unbefugter systemübergreifender Zugriff verhindert wird?",
      "detectionLogic": "Diese Regel wird ausgelöst auf ",
      "riskAssessment": "Das Schadensausmaß dieses Risikos wird höher bewertet, wenn das Blockspeichersystem mandantenfähig ist oder Daten mit hohen Vertraulichkeits- oder Integritätsanforderungen verarbeitet/speichert. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn andere, nicht modellierte Kontrollen vorhanden sind, wie z. B. eine strikte Port-Sicherheit auf den SAN-Fabric-Switches, die Identitäts-Spoofing verhindern. Sich jedoch auf solche Kontrollen ohne kryptografische Authentifizierung zu verlassen, ist keine robuste Verteidigung."
    },
    "inadequate-vsan-separation-for-multi-tenancy": {
      "title": "Unzureichende Trennung von mandantenfähigen Speichernetzwerken (BSI NET.3.2.A5)",
      "description": "Wenn die Netzwerkstrukturen verschiedener Mandanten durch virtuelle Speichernetzwerke (VSANs) anstelle von physisch getrennten Netzwerken getrennt werden, kann die Informationssicherheit der Institution beeinträchtigt werden. ",
      "impact": "Ein erfolgreicher Exploit dieser Schwachstelle könnte es einem Angreifer, der einen Mandanten kompromittiert hat, ermöglichen,",
      "asvs": "BSI IT-Grundschutz NET.3.2: Trennung und Partitionierung von Netzen, Anforderung A5 (Logische Netztrennung)",
      "action": "Starke logische und kryptografische Mandantentrennung implementieren",
      "mitigation": "Stellen Sie sicher, dass mandantenfähige Speichersysteme eine strikte Trennung zwischen den Mandanten auf Netzwerk- und Datenebene durchsetzen. Verwenden Sie separate VLANs, Netzwerksicherheitsgruppen oder ähnliche Netzwerksegmentierungskontrollen für jeden Mandanten",
      "check": "Wird ein mandantenfähiges Speichersystem verwendet? Wie werden die verbindenden Client-Systeme verschiedener Mandanten logisch voneinander getrennt? Hat das gemeinsam genutzte Speichersystem direkte Verbindungen von Assets in verschiedenen Vertrauensgrenzen? Werden mandantenspezifische Verschlüsselungsschlüssel verwendet?",
      "detectionLogic": "Diese Regel wird für mandantenfähige Datenspeicher (insbesondere Blockspeicher oder Dateiserver) ausgelöst. Sie prüft auf eingehende Verbindungen von Client-Assets. Ein Risiko wird identifiziert, wenn die Client-Assets, die sich mit demselben gemeinsam genutzten Speicher verbinden, in unterschiedlichen Vertrauensgrenzen liegen, da dies darauf hindeutet, dass der Speicher unterschiedliche Sicherheitszonen ohne garantierte Trennung überbrückt, was ein mandantenübergreifendes Zugriffsrisiko darstellt.",
      "riskAssessment": "Die Auswirkung wird durch die höchsten Vertraulichkeits- und Integritätsanforderungen der auf dem gemeinsam genutzten Asset gespeicherten Daten bestimmt. ",
      "falsePositives": "Diese Regel könnte einen Fehlalarm generieren, wenn das virtuelle Speichersystem selbst eine robuste, kryptografisch durchgesetzte Mandantentrennung implementiert, die im Modell nicht sichtbar ist"
    },
    "component-failure-in-storage-solution-sys1.6.t5": {
      "title": "Komponentenausfall in einer komplexen Speicherlösung (BSI SYS.1.6 T5)",
      "description": "Komplexe netzwerkbasierte Speicherlösungen bestehen oft aus vielen miteinander verbundenen Komponenten (z. B. Fibre-Channel-Switches, Speichercontroller, Virtualisierungs-Appliances). Der Ausfall einer einzelnen, nicht redundanten Komponente kann dazu führen, dass die gesamte Speicherlösung nicht mehr verfügbar ist oder fehlerhaft funktioniert, was abhängige Anwendungen gefährdet.",
      "impact": "Wenn eine kritische Komponente einer Speicherlösung ausfällt, funktionieren wichtige Anwendungen, die darauf angewiesen sind, möglicherweise nicht mehr korrekt. Dies kann zu erheblichen Störungen im Geschäftsbetrieb, Datenkorruption oder dauerhaftem Datenverlust führen und somit die Verfügbarkeit und Integrität der gespeicherten Informationen beeinträchtigen.",
      "asvs": "BSI IT-Grundschutz SYS.1.6 Speicherlösungen, Gefährdung T 5.150 Ausfall der Speicherlösung.",
      "action": "Redundanz und Hochverfügbarkeit für Speicherkomponenten implementieren",
      "mitigation": "Stellen Sie sicher, dass die Speicherlösung für hohe Verfügbarkeit ausgelegt ist, indem Sie redundante Komponenten (z. B. redundante Controller, Netzteile, Netzwerkpfade) und robuste Failover-Mechanismen verwenden. Das ",
      "check": "Ist das technische Asset, das die Speicherlösung darstellt, als ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Speicherlösung identifiziert und nicht als redundant (`redundant: false`) gekennzeichnet ist. Speicherlösungen umfassen Datenbanken, Dateiserver, Blockspeicher, Data Lakes und andere ähnliche Technologien.",
      "riskAssessment": "Die Wahrscheinlichkeit eines dienstbeeinträchtigenden Ausfalls wird als ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die Redundanz auf einer höheren Ebene implementiert ist, die nicht im Modell erfasst ist (z. B. Replikation auf Anwendungsebene), oder wenn das Asset"
    },
    "insufficient-physical-access-control-for-storage": {
      "title": "Ungenügende physische Zugangskontrolle für Speichersystemkomponenten (BSI-Stil)",
      "description": "Wenn es unzureichende oder keine physischen Zugangskontrollen für die Komponenten eines Speichersystems gibt, könnte ein Angreifer physischen Zugang zu bestehenden Fibre Channel (FC) SAN-Switches erlangen oder zusätzliche, nicht autorisierte Switches an das Netzwerk anschließen.",
      "impact": "Das Ziel eines solchen Angriffs könnte darin bestehen, auf die verteilte Zoning-Datenbank zuzugreifen und diese zu modifizieren, welche den Speicherzugriff steuert. Dies würde es dem Angreifer ermöglichen, logische Zugangskontrollen zu umgehen und unbefugten Zugriff auf Speichersysteme zu erlangen, wodurch die Vertraulichkeit und Integrität der gespeicherten Daten gefährdet werden.",
      "asvs": "BSI IT-Grundschutz INF.5.A6 (Zutrittskontrolle)",
      "action": "Strikte physische Zugangskontrollen implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Komponenten des Speichersystems, einschließlich SAN-Switches und Speicher-Arrays, sich in physisch sicheren Bereichen befinden (z. B. abgeschlossene Serverräume, sichere Racks). Implementieren Sie strikte physische Zugangskontrollen mit Protokollierung und Überwachung. Netzwerkports in ungesicherten Bereichen sollten deaktiviert werden. Überprüfen Sie regelmäßig die physischen Sicherheitsmaßnahmen.",
      "check": "Befinden sich die Speicherkomponenten in einem abgeschlossenen, zugangskontrollierten Raum? Wird der physische Zugang protokolliert und überwacht? Sind ungenutzte physische Netzwerkports an Switches deaktiviert? Gibt es ein formelles Verfahren zur Autorisierung des physischen Zugangs zum Rechenzentrum oder Serverraum?",
      "detectionLogic": "Dieses Risiko wird für physische Datenspeicher-Assets (d.h. Maschinentyp ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn sich die Komponenten in einem zugänglichen oder schlecht überwachten Bereich befinden. Die Auswirkung steht in direktem Zusammenhang mit der Vertraulichkeit und Integrität der auf dem System gespeicherten Daten. Unbefugter physischer Zugang zu einem Speichersystem, das streng vertrauliche Daten enthält, stellt eine sehr hohe Auswirkung dar.",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn das Tag "
    },
    "usability-impairment-due-to-latency-or-overload": {
      "title": "Beeinträchtigung der Nutzbarkeit durch Latenz oder Überlastung (BSI)",
      "description": "Anwendungen, die von einem zentralen Server (wie einem Terminalserver oder einer VDI-Umgebung) bereitgestellt werden, werden in Echtzeit genutzt. Wenn der Server",
      "impact": "Hohe Latenzzeiten oder Serverüberlastung können Benutzer daran hindern, effizient mit den bereitgestellten Anwendungen zu arbeiten oder überhaupt zu arbeiten. Dies stellt einen Denial-of-Service dar, der sich direkt auf die Geschäftskontinuität und Produktivität auswirkt. Dies kann zu verpassten Fristen und finanziellen Verlusten führen, wenn die betroffenen Anwendungen für den Geschäftsbetrieb kritisch sind.",
      "asvs": "Abgeleitet von den Bedrohungsbeschreibungen des BSI IT-Grundschutz-Katalogs für Terminalserver (z.B. ehemals `SYS.3.2.1 Terminal-Server`) und allgemeinen Gefährdungen wie `G 0.35 Ausfall oder Störung von Kommunikationsnetzen` und `G 0.26 Ausfall von Geräten oder Systemen`. Dies ist hauptsächlich ein operatives Verfügbarkeitsrisiko.",
      "action": "Kapazitätsplanung, Leistungsüberwachung und Qualitätssicherung des Netzwerks implementieren",
      "mitigation": "Stellen Sie sicher, dass der Server (CPU, RAM, Speicher) für die erwartete Spitzenlast der Benutzer ausreichend dimensioniert ist. Verwenden Sie Lastausgleich bei einer hohen Anzahl von Benutzern. Gewährleisten Sie Netzwerkpfade mit geringer Latenz und hoher Bandbreite zwischen Clients und dem Server. Alle zwischengeschalteten Komponenten (z. B. VPN-Gateways, Firewalls, Reverse-Proxys) müssen so dimensioniert und konfiguriert sein, dass sie den Datenverkehr ohne nennenswerte Verzögerung bewältigen können. Überwachen Sie kontinuierlich die Ressourcennutzung des Servers, die Netzwerklatenz und die Reaktionsfähigkeit der Anwendung, um Engpässe proaktiv zu identifizieren und zu beheben.",
      "check": "Sind die Leistungs- und Kapazitätsanforderungen für den Dienst definiert und getestet? Wird die Server- und Netzwerkinfrastruktur auf Leistungsengpässe (Latenz, Paketverlust, CPU-/Speichernutzung) überwacht? Wurde überprüft, dass zwischengeschaltete Sicherheitsgateways unter Last keinen Leistungsengpass darstellen?",
      "detectionLogic": "Dieses Risiko wird für serverseitige technische Assets mit hohen Verfügbarkeitsanforderungen ausgelöst, die eine erhebliche Anzahl von Verbindungen von clientseitigen Assets erhalten. Die Wahrscheinlichkeit steigt, wenn der Server nicht als redundant gekennzeichnet ist, eine kleinere Größe hat (z. B. ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeitsbewertung des technischen Assets ab (von Mittel für ",
      "falsePositives": "Das Risiko kann ein Fehlalarm sein, wenn das Architekturmodell die tatsächliche Kapazität des Servers oder die Leistung des Netzwerks nicht genau erfasst. Eine Komponente könnte mit einem kleinen "
    },
    "terminal-server-availability-failure": {
      "title": "Verfügbarkeitsausfall in Terminalserver-Umgebungen",
      "description": "In einer Terminalserver-basierten Umgebung werden Anwendungen zentral ausgeführt und ihre Ausgabe an die entsprechenden Clients übertragen. Wenn der Terminalserver nicht verfügbar ist, können keine Eingaben verarbeitet werden und die von ihm bereitgestellten Anwendungen fallen sofort aus. Wenn Clients ihre gesamte Benutzeroberfläche vom Terminalserver erhalten, scheint das IT-System aus Sicht des Benutzers komplett ausgefallen zu sein",
      "impact": "Ausfälle des Netzwerks oder des Terminalservers betreffen in der Regel mehr als nur einzelne Clients. In vielen Fällen hängen zahlreiche oder sogar alle Clients einer Institution vom Terminalserver ab. Fällt der Terminalserver aus, sind eine große Anzahl von Clients gleichzeitig betroffen, was zu weitreichenden Betriebsstörungen führt.",
      "asvs": "BSI IT-Grundschutz SYS.1.4 Terminalserver (klassisch)",
      "action": "Hochverfügbarkeit für zentrale Komponenten sicherstellen",
      "mitigation": "Um das Risiko eines Single Point of Failure zu mindern, implementieren Sie Redundanz für das zentrale Terminalserver-Asset. Dies kann durch Clustering, Lastausgleich und Failover-Mechanismen erreicht werden. Stellen Sie sicher, dass die Netzwerkpfade zwischen Clients und Servern ebenfalls redundant sind. Das technische Asset im Modell, das den Terminalserver darstellt, sollte als `redundant: true` markiert sein, um diese Maßnahmen widerzuspiegeln. Eine kontinuierliche Überwachung der Servergesundheit, der Ressourcennutzung und der Netzwerkkonnektivität ist entscheidend für die frühzeitige Erkennung potenzieller Verfügbarkeitsprobleme.",
      "check": "Ist das als Terminalserver fungierende technische Asset für Hochverfügbarkeit ausgelegt (z. B. geclustert, lastverteilt)? Sind die Netzwerkverbindungen zum Server redundant? Ist das Asset",
      "detectionLogic": "Diese Regel identifiziert nicht redundante zentrale technische Assets (wie Anwendungsserver oder virtuelle Desktops), die mehrere Clients bedienen. Ein Ausfall eines solchen Assets würde einen Single Point of Failure darstellen und einen Denial of Service für alle abhängigen Clients verursachen.",
      "riskAssessment": "Die Auswirkung des Risikos wird durch die Verfügbarkeitsanforderung des zentralen Server-Assets selbst bestimmt. Ein ",
      "falsePositives": "Die Regel könnte einen Standard-Anwendungsserver als "
    },
    "terminal-server-as-pivot-point-for-lateral-movement": {
      "title": "Terminalserver als Dreh- und Angelpunkt für seitliche Bewegungen (basierend auf BSI T 5.150)",
      "description": "Terminalserver hosten oft client-ähnliche Anwendungen (z. B. Webbrowser, Office-Suiten) für Endbenutzer, was ihnen ein geringeres intrinsisches Vertrauensniveau verleiht, ähnlich wie bei einem Standard-Client-Rechner. ",
      "impact": "Ein Angreifer, der die Kontrolle über einen Terminalserver erlangt, kann weitere Angriffe auf andere Server im selben Netzwerksegment starten. Dies kann zu unbefugtem Zugriff auf sensible Daten und kritische Backend-Dienste führen, was potenziell Datenpannen, Dienstunterbrechungen und die Kompromittierung der gesamten Serverumgebung zur Folge hat.",
      "asvs": "ASVS V14.2.1: Überprüfen Sie, dass das System in einer Umgebung bereitgestellt wird, die über Sicherheitskontrollen verfügt, um es vor anderen Anwendungen auf demselben Server und anderen Servern in derselben Umgebung zu schützen.",
      "action": "Terminalserver in einem dedizierten, eingeschränkten Netzwerksegment isolieren",
      "mitigation": "Platzieren Sie Terminalserver in einem eigenen dedizierten Netzwerksegment (DMZ oder ein spezifisches ",
      "check": "Überprüfen Sie das Netzwerkarchitekturdiagramm und die Firewall-Regelsätze. Befindet sich das als Terminalserver fungierende technische Asset in derselben Netzwerkvertrauensgrenze wie andere Backend-Server (z. B. Datenbanken, Anwendungsdienste)? Sind ausgehende Verbindungen vom Terminalserver auf das absolut Notwendige beschränkt?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die mit `stereotype:terminal-server` getaggt sind. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als ",
      "falsePositives": "Dies könnte ein Fehlalarm sein, wenn starke, nicht modellierte kompensierende Kontrollen vorhanden sind, wie z. B. hostbasierte Firewalls auf dem Terminalserver oder Mikrosegmentierung auf Hypervisor-Ebene, die die Assets trotz ihrer Zugehörigkeit zur gleichen logischen Netzwerkzone effektiv isolieren."
    },
    "weak-isolation-in-shared-environment": {
      "title": "Schwache Isolierung in gemeinsam genutzter Umgebung (Risiko im Stil von Terminal-Servern)",
      "description": "Wenn mehrere Anwendungen oder dedizierte Instanzen für verschiedene Clients/Mandanten auf demselben zugrunde liegenden Betriebssystem ohne starke Isolierung ausgeführt werden, besteht das Risiko einer Überschreitung der Sicherheitsgrenzen. Dies ist in klassischen Terminalserver- oder anderen mandantenfähigen Umgebungen üblich, in denen Ressourcen wie der Kernel, Bibliotheken und Dateisysteme gemeinsam genutzt werden. ",
      "impact": "Ein erfolgreicher Exploit kann zur unbefugten Offenlegung von Informationen (z. B. Lesen von Daten aus einer anderen Sitzung",
      "asvs": "V14.4 Konfiguration",
      "action": "Starke Isolierung und Härtung für gemeinsam genutzte Umgebungen durchsetzen",
      "mitigation": "Bevorzugen Sie die Verwendung von Umgebungen mit starker Isolierung auf Kernel-Ebene, wie moderne Container-Plattformen (z. B. Docker, Podman) oder vollständige Virtualisierung (separate VMs), gegenüber einfacher mandantenfähiger Nutzung eines gemeinsamen Betriebssystems. Wenden Sie das Prinzip der geringsten Rechte auf alle Benutzersitzungen und Anwendungsdienstkonten an und beschränken Sie den Zugriff auf Dateisystem und Ressourcen strikt. ",
      "check": "Laufen mehrere Anwendungen von verschiedenen Mandanten oder Vertrauensstufen auf einem einzigen gemeinsam genutzten Betriebssystem? Welche Isolierungsmechanismen sind vorhanden (z. B. Container, Sandboxing, Virtualisierung)? Sind die Sitzungsberechtigungen minimiert? Werden die Host-Umgebung und alle gehostete Software mit Sicherheitspatches auf dem neuesten Stand gehalten?",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Auswirkung wird durch die sensibelsten Daten oder die kritischste Funktion eines jeden Assets innerhalb der gemeinsam genutzten Laufzeitumgebung bestimmt. Eine Verletzung der Isolation betrifft das wertvollste Ziel. ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die Technologie der gemeinsam genutzten Laufzeitumgebung, obwohl abstrakt modelliert, eine starke, effektive Isolation implementiert, die im Modell nicht sichtbar ist (z. B. fortgeschrittene SELinux-Richtlinien, AppArmor-Profile oder andere Sandboxing-Technologien)."
    },
    "insecure-terminal-server-communication": {
      "title": "Unsichere Terminalserver-Kommunikation",
      "description": "Viele Terminalserver-Protokolle bieten eine authentifizierte und verschlüsselte Kommunikation. Dies reicht jedoch nicht immer aus, um die Kommunikation abzusichern. Wenn das Protokoll veraltete und anfällige Mechanismen verwendet oder wenn wichtige Sicherheitsfunktionen aufgrund von Fehlkonfigurationen deaktiviert sind, kann die Kommunikation zwischen Clients und dem Terminalserver abgefangen werden. Zusätzlich können Schwachstellen in der Protokollimplementierung innerhalb der Terminalserver- oder Client-Software den Server direkt Angriffen aussetzen.",
      "impact": "Informationen, die zwischen dem Terminalserver und den Clients übertragen werden, können abgefangen oder verändert werden. Dazu gehören Authentifizierungsdetails, Benutzereingaben, Bildschirminhalte, Zwischenablagedaten und Dateiübertragungen. Dies kann zu Datenpannen, Sitzungsübernahmen und direkten Angriffen auf den Terminalserver selbst führen, was die Vertraulichkeit, Integrität und Verfügbarkeit gefährdet.",
      "asvs": "OWASP ASVS V4.0.3 - 8.1.1 (Überprüfen Sie, dass alle Kommunikationen zu externen Diensten oder Drittanbieterdiensten über einen vertrauenswürdigen und verschlüsselten Kanal gesendet werden.)",
      "action": "Sichere Kommunikation für Terminaldienste gewährleisten",
      "mitigation": "Verwenden Sie starke, verschlüsselte Protokolle (wie RDP mit NLA, SSH oder HTTPS-basierte Lösungen) für die gesamte Terminaldienst-Kommunikation. Stellen Sie sicher, dass die Protokolle so konfiguriert sind, dass sie moderne, starke Chiffren und Algorithmen verwenden. Deaktivieren Sie veraltete Protokolle und Funktionen (z. B. Telnet, unverschlüsseltes RDP). Halten Sie sowohl die Terminalserver- als auch die Client-Software auf dem neuesten Stand, um Implementierungsschwachstellen zu beheben. Erwägen Sie zusätzliche Sicherheit durch VPNs oder IP-Filterung als zusätzliche Schutzschicht.",
      "check": "Ist das für den Terminalzugriff verwendete Kommunikationsprotokoll standardmäßig verschlüsselt? Sind veraltete Protokolle deaktiviert? Ist die Kommunikation durch ein VPN geschützt? Werden sowohl Server- als auch Client-Komponenten regelmäßig gepatcht?",
      "detectionLogic": "Sucht nach Kommunikationsverbindungen zwischen clientartigen Assets und terminalserverähnlichen Assets (z. B. Anwendungsserver, Desktop, Mainframe), die ein unverschlüsseltes Protokoll verwenden und nicht durch andere Mittel wie ein VPN geschützt sind.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein unverschlüsseltes Protokoll über eine Netzwerkgrenze hinweg verwendet wird. Die Auswirkung hängt von der Sensibilität (CIA-Bewertung) des Terminalservers und der von ihm verarbeiteten Daten ab. Ein Server, der ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die Kommunikation durch einen zugrunde liegenden Mechanismus gesichert ist, der nicht modelliert wurde, wie z. B. ein separater Hardware-VPN-Tunnel oder netzwerkbasiertes IPSec, das nicht durch das "
    },
    "use-of-group-accounts-on-terminal-server": {
      "title": "Verwendung von Gruppenkonten auf dem Terminalserver (basierend auf BSI)",
      "description": "Wenn mehrere Personen eine Anwendung auf einem Terminalserver zu unterschiedlichen Zeiten nutzen müssen, werden oft gemeinsame oder Gruppenkonten eingerichtet. ",
      "impact": "Die Unfähigkeit, Benutzeraktionen nachzuverfolgen (Mangel an Nichtabstreitbarkeit), kann die Reaktion auf Vorfälle behindern, gegen rechtliche und Compliance-Anforderungen (wie GDPR) verstoßen und böswillige oder fehlerhafte Aktivitäten verschleiern. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.4 (Identitäts- und Berechtigungsmanagement), insbesondere Anforderung ORP.4.A13 (Nutzung von Gruppen-Benutzerkonten), die empfiehlt, Gruppenkonten zu vermeiden, wo eine persönliche Authentifizierung erforderlich ist.",
      "action": "Authentifizierung mit individuellen Benutzerkonten durchsetzen",
      "mitigation": "Stellen Sie sicher, dass jeder Benutzer, der auf den Terminalserver zugreift, sich mit einem einzigartigen, individuellen Konto authentifiziert. ",
      "check": "Werden Gruppenkonten für den interaktiven Zugriff auf den Terminalserver verwendet? Können alle auf dem Server durchgeführten Aktionen eindeutig auf eine bestimmte Person zurückgeführt werden? ",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von technischen Assets erkannt, die als `@Service:TerminalServer` getaggt sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, da das Modell explizit einen Mangel an individueller Benutzeridentitätsweitergabe zeigt. ",
      "falsePositives": "Ein Fehlalarm kann auftreten, wenn das Modell ungenau ist, zum Beispiel, wenn ein `enduser-identity-propagation`-Mechanismus vorhanden, aber nicht korrekt in der Kommunikationsverbindung dokumentiert ist"
    },
    "overly-restrictive-terminal-server-config": {
      "title": "Übermäßig restriktive Terminalserver-Konfiguration führt zu unsicheren Umgehungslösungen",
      "description": "Ein Terminalserver oder ein ähnlicher Mehrbenutzer-Anwendungshost kann sowohl als Server als auch für die darauf laufenden Anwendungen als Client fungieren. ",
      "impact": "Wenn wesentliche Aufgaben durch übermäßig restriktive Richtlinien blockiert werden, greifen Benutzer möglicherweise auf unsichere und unüberwachte Umgehungslösungen zurück. ",
      "asvs": "Abgeleitet von den Prinzipien des BSI IT-Grundschutzes für den sicheren Systembetrieb. Obwohl es sich nicht um eine direkte ASVS-Webanwendungsanforderung handelt, bezieht es sich auf das breitere Sicherheitsprinzip der ordnungsgemäßen Zugriffskontrolle (ASVS V4.0.3 Kapitel 4) und der sicheren Konfiguration.",
      "action": "Sicherheitseinschränkungen des Terminalservers mit Benutzererfahrung und Funktionalität in Einklang bringen",
      "mitigation": "Überprüfen Sie die Konfiguration von Terminalservern und ähnlichen Anwendungshosts, um sicherzustellen, dass Sicherheitsbeschränkungen wesentliche Geschäftsfunktionen nicht behindern. ",
      "check": "Werden die Zugriffskontrollrichtlinien auf terminalserverähnlichen Assets auf ihre Benutzerfreundlichkeit überprüft? Gibt es sanktionierte und einfach zu bedienende Methoden für den Datenimport/-export, die den Benutzeranforderungen entsprechen? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als Mehrbenutzer-Anwendungshosts fungieren (z. B. `application-server`, `desktop`) und direkt von menschlichen Clients verwendet werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als höher angesehen, wenn sensible Daten verarbeitet werden, da der Druck auf die Benutzer, ihre Aufgaben zu erledigen, sie dazu verleiten kann, größere Risiken einzugehen. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das Asset"
    },
    "insufficient-testing-of-terminal-server-compatibility": {
      "title": "Ungenügendes Testen der Anwendungskompatibilität auf Terminalserver / VDI (BSI SYS.3.2.2)",
      "description": "Nicht alle Anwendungen können auf jedem Terminalserver oder jeder virtuellen Desktop-Infrastruktur (VDI) bereitgestellt werden. ",
      "impact": "Das Versäumnis, die Kompatibilität für hardwareabhängige Anwendungen auf einer gemeinsam genutzten oder virtualisierten Plattform sicherzustellen, kann zu einem erheblichen oder vollständigen Verlust der Verfügbarkeit für diese Anwendung führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.3.2.2 Terminalserver. Dieses Risiko befasst sich mit der Sicherstellung der Betriebstauglichkeit von Anwendungen in einer Terminalserver-Umgebung.",
      "action": "Gründliche Kompatibilitätstests vor der Bereitstellung",
      "mitigation": "Bevor eine Anwendung mit speziellen Hardwareanforderungen (wie GPU-Beschleunigung oder spezifische Peripheriegeräte) auf einem Terminalserver, VDI oder einer anderen gemeinsam genutzten Laufzeitumgebung bereitgestellt wird, ",
      "check": "Wurde die Anwendung vollständig auf der Ziel-Terminalserver- oder Shared-Runtime-Umgebung getestet? ",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein technisches Asset (die ",
      "riskAssessment": "Die Auswirkung dieses Risikos steht in direktem Zusammenhang mit der Verfügbarkeitsanforderung der betreffenden Anwendung. Wenn eine ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn umfassende Kompatibilitätstests bereits erfolgreich abgeschlossen und für die spezifische Anwendung auf der spezifischen Zielumgebung dokumentiert wurden. "
    },
    "malware-on-client-systems": {
      "title": "Malware-Infektion auf Client-Systemen (BSI DER.1)",
      "description": "Malware ist darauf ausgelegt, unerwünschte und bösartige Funktionen auf IT-Systemen auszuführen, oft verdeckt ohne den Benutzer",
      "impact": "Eine erfolgreiche Malware-Infektion auf einem Client kann zur Kompromittierung der Vertraulichkeit (z.B. Diebstahl von Anmeldeinformationen und sensiblen Daten), Integrität (z.B. Datenmanipulation, Ransomware-Verschlüsselung) und Verfügbarkeit (z.B. Systemabstürze, Denial-of-Service) führen. Die Infektion kann auch als Brückenkopf für weitere Angriffe in das Unternehmensnetzwerk dienen und den potenziellen Schaden erheblich vergrößern.",
      "asvs": "BSI IT-Grundschutz: DER.1 Bedrohungen durch Schadprogramme, SYS.2.1 Allgemeiner Client",
      "action": "Mehrschichtigen Endgeräteschutz und Benutzerbewusstsein implementieren",
      "mitigation": "Verwenden Sie eine tief gestaffelte Verteidigungsstrategie für Clients. Dazu gehören zentral verwaltete und aktuelle Endgeräteschutzsoftware (Antivirus/EDR), Anwendungs-Whitelisting, hostbasierte Firewalls und regelmäßiges Einspielen von Sicherheitspatches. Beschränken Sie die Benutzerberechtigungen auf das absolut Notwendige. Implementieren Sie Web- und E-Mail-Filterung, um bösartige Inhalte am Gateway zu blockieren. Kontrollieren Sie die Verwendung von Wechselmedien. Ergänzen Sie technische Maßnahmen durch ein kontinuierliches Sicherheitsprogramm für alle Benutzer.",
      "check": "Sind alle Client-Systeme mit verwalteter und aktualisierter Endgerätesicherheitssoftware ausgestattet? Werden Betriebssysteme und Anwendungen regelmäßig gepatcht? Wird das Prinzip der geringsten Rechte für Benutzerkonten durchgesetzt? Gibt es technische Kontrollen für Web, E-Mail und Wechselmedien? Gibt es ein aktives Sicherheitsprogramm?",
      "detectionLogic": "Dieses Risiko wird automatisch für alle technischen Assets erkannt, die als Client-Systeme identifiziert wurden (z. B. Browser, Desktop, Mobile App). Das Risiko",
      "riskAssessment": "Die Infektionswahrscheinlichkeit wird für internetfähige Clients, die von Menschen bedient werden, als hoch angesehen. Die Auswirkung wird durch die CIA-Anforderungen des Clients selbst, der von ihm verarbeiteten Daten und der Kritikalität der Backend-Systeme, mit denen er verbunden ist, bestimmt. Ein Client, der zur Verwaltung geschäftskritischer Systeme verwendet wird, stellt ein Risiko mit sehr hoher Auswirkung dar.",
      "falsePositives": "Das Risiko kann überschätzt werden, wenn das Modell spezifische Härtungsmaßnahmen oder kompensierende Kontrollen wie eine vollständig restriktive VDI-Umgebung oder einen Kiosk-Modus nicht erfasst. Eine manuelle Überprüfung des Clients"
    },
    "exclusive-local-data-storage": {
      "title": "Ausschließlich lokale Datenspeicherung",
      "description": "Trotz gegenteiliger Empfehlungen werden wichtige Daten oft ausschließlich lokal gespeichert, zum Beispiel in lokalen Dateiverzeichnissen oder E-Mail-Archiven anstatt auf einem zentralen Dateiserver. ",
      "impact": "Die ausschließliche Speicherung wichtiger Daten auf lokalen Systemen stellt ein erhebliches Risiko für deren Verfügbarkeit und Integrität dar. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz CON.3 (Datensicherungskonzept) und APP.4.5 (Notebooks).",
      "action": "Zentralisierte Datenspeicherung und -sicherung implementieren und durchsetzen",
      "mitigation": "Etablieren und erzwingen Sie eine klare Richtlinie für die Speicherung aller wichtigen institutionellen Daten auf zentralen, verwalteten Systemen (z. B. Dateiserver, Datenbanken, Unternehmens-Cloud-Speicher). ",
      "check": "Gibt es eine Richtlinie, die eine zentrale Speicherung für wichtige Daten vorschreibt? Stehen geeignete zentrale Speichersysteme zur Verfügung, sind sie den Benutzern bekannt und werden sie aktiv genutzt? ",
      "detectionLogic": "Diese Regel identifiziert clientartige technische Assets (z. B. Desktops, mobile Apps), die wichtige Daten lokal speichern, aber keine modellierte Kommunikationsverbindung zu einem zentralen Datenspeicher (wie einer Datenbank oder einem Dateiserver) haben. ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Hardwarefehlers oder eines anderen Verlustereignisses wird als ",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn ein Sicherungs- oder Synchronisierungsmechanismus (z. B. ein Cloud-Sync-Client wie OneDrive oder Dropbox) auf dem Client-System aktiv ist, aber nicht als Kommunikationsverbindung im Modell dargestellt wird. "
    },
    "physical-damage-to-client-devices": {
      "title": "Physische Beschädigung von Client-Geräten (BSI T 0.15, T 0.16)",
      "description": "Im Gegensatz zu zentralen IT-Systemen wie Servern interagieren Benutzer direkt mit Client-Geräten. Diese Nähe bedeutet, dass Benutzer das Gerät absichtlich oder unabsichtlich beschädigen könnten. ",
      "impact": "Wenn ein Client-Gerät beschädigt, verloren oder gestohlen wird, kann es nicht wie vorgesehen verwendet werden, bis es repariert oder ersetzt wird, was sich direkt auf die Verfügbarkeit auswirkt. ",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz-Gefährdungen T 0.15 (Ausfall oder Störung von Geräten oder Systemen) und T 0.16 (Zerstörung von Geräten oder Datenträgern), die oft in Modulen wie OPS.1.2.2 (Laptops) behandelt werden.",
      "action": "Physischen und umgebungsbedingten Schutz für Client-Geräte implementieren",
      "mitigation": "Verwenden Sie Schutzhüllen und Displayschutzfolien für mobile Geräte. Implementieren Sie ein robustes Kabelmanagement, um Stolpergefahren zu reduzieren. ",
      "check": "Gibt es physische Schutzmaßnahmen für Client-Geräte (z. B. Laptoptaschen, sichere Arbeitsplätze)? Ist die Festplattenverschlüsselung durchgesetzt? ",
      "detectionLogic": "Dieses Risiko wird für alle relevanten technischen Assets ausgelöst, die als clientartige Technologien unter Verwendung des ",
      "riskAssessment": "Die Auswirkung ist direkt proportional zur Verfügbarkeitsanforderung des Assets und der von seinem Benutzer ausgeführten Arbeit. ",
      "falsePositives": "Dieses Risiko könnte als Fehlalarm oder mit geringerer Wahrscheinlichkeit betrachtet werden, wenn sich das Client-Gerät in einer stark kontrollierten Umgebung befindet, in der eine vom Benutzer verursachte physische Beschädigung äußerst unwahrscheinlich ist (z. B. ein Kiosk in einem abgeschlossenen, geschützten Gehäuse)."
    },
    "unauthorized-client-access-sys3.1": {
      "title": "Unbefugter Client-Zugriff (BSI SYS.3.1)",
      "description": "Identifikation und Authentifizierung sollen die unbefugte Nutzung eines Clients verhindern. IT-Systeme, die eine Benutzer-ID- und Passwort-Authentifizierung erfordern, können jedoch dennoch unbefugt genutzt werden, wenn es einem Angreifer gelingt, die Anmeldeinformationen auszuspionieren oder zu erraten. Wenn keine Bildschirmsperre aktiviert ist, kann der Client auch bei kurzen Abwesenheiten unbefugt genutzt werden.",
      "impact": "Unbefugter Zugriff auf ein Client-System kann zum Diebstahl sensibler Daten (Gefährdung der Vertraulichkeit), zur Manipulation von Daten oder Systemfunktionen (Gefährdung der Integrität) und zum Missbrauch des Systems für weitere Angriffe innerhalb des Netzwerks führen. Dies kann zu finanziellen Verlusten, Reputationsschäden und Verstößen gegen gesetzliche oder vertragliche Verpflichtungen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.3.1 (Client unter Windows), insbesondere Anforderungen SYS.3.1.A5 (Authentisierung am Client) und SYS.3.1.A6 (Bildschirmsperre).",
      "action": "Starke Client-Authentifizierung und automatische Bildschirmsperre durchsetzen",
      "mitigation": "Erzwingen Sie starke Authentifizierungsmechanismen auf allen Client-Systemen, vorzugsweise Multi-Faktor-Authentifizierung (MFA). Implementieren und erzwingen Sie eine strenge Passwortrichtlinie für Komplexität, Rotation und Historie, wo Passwörter verwendet werden. Konfigurieren Sie alle Clients so, dass der Bildschirm nach einer kurzen Inaktivitätszeit automatisch gesperrt wird. Schulen Sie Benutzer über die Risiken schwacher Anmeldeinformationen, Shoulder Surfing und Social-Engineering-Angriffe.",
      "check": "Ist MFA für die Client-Anmeldung erforderlich? Gibt es eine Passwortrichtlinie und wird sie durchgesetzt? Sind alle Client-Geräte so konfiguriert, dass sie nach einer kurzen Inaktivitätszeit automatisch sperren? Werden Benutzer zur Sicherheit von Anmeldeinformationen geschult?",
      "detectionLogic": "Dieses Risiko gilt für alle relevanten technischen Assets, die als von Menschen bediente Clients identifiziert wurden (z. B. Technologietypen ",
      "riskAssessment": "Die Wahrscheinlichkeit ist HOCH für Clients ohne Authentifizierung oder nur mit einem einfachen Passwort. Sie ist MITTEL für Clients mit starken Passwörtern, aber ohne MFA. Sie ist NIEDRIG für Clients, die MFA oder biometrische Authentifizierung erzwingen. Die Auswirkung wird durch die CIA-Bewertung des Client-Assets selbst und die Sensibilität der von ihm verarbeiteten oder gespeicherten Daten bestimmt.",
      "falsePositives": "Diese Regel könnte einen Fehlalarm generieren, wenn die Client-Authentifizierungsmethode von einem externen Identitätsanbieter verwaltet wird und dies nicht im Modell über Tags widergespiegelt wird. Das Risiko sollte manuell anhand der tatsächlichen Client-Konfiguration überprüft werden."
    },
    "unnecessary-software-on-client": {
      "title": "Unnötige Software auf dem Client (Härtungsprinzip nach BSI-Art)",
      "description": "Bei der Installation eines Betriebssystems besteht in der Regel die Möglichkeit, optionale Software zu installieren. ",
      "impact": "Die Ausnutzung einer Schwachstelle in unnötiger und ungepatchter Software kann zu einer vollständigen Kompromittierung des Client-Systems führen. ",
      "asvs": "Abgeleitet von allgemeinen Best Practices zur Systemhärtung, ähnlich den CIS Benchmarks. Es entspricht dem Prinzip der Minimierung der Angriffsfläche.",
      "action": "Strikte Softwareinstallationsrichtlinien und Härtung implementieren",
      "mitigation": "Erzwingen Sie eine strikte Richtlinie, nach der nur wesentliche, genehmigte Software auf Client-Systemen installiert wird. ",
      "check": "Gibt es eine Anwendung-Whitelisting-Lösung auf den Clients? Gibt es einen formellen Prozess zur Genehmigung und Installation von Software? ",
      "detectionLogic": "Dieses Risiko gilt für alle relevanten technischen Assets, die als Clients identifiziert wurden (z. B. Desktops, mobile Apps, Entwickler-Clients). ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist bei Clients mit Internetzugang höher. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Organisation über starke, durchgesetzte Härtungsrichtlinien verfügt, die nicht im Modell über Tags widergespiegelt werden. "
    },
    "unauthorized-eavesdropping-via-client-devices": {
      "title": "Unbefugtes Abhören über Client-Geräteperipherie",
      "description": "Viele Client-Systeme, einschließlich Desktops, mobile Geräte und IoT-Geräte wie Intelligente Persönliche Assistenten (IPAs), sind mit Mikrofonen und Kameras ausgestattet. ",
      "impact": "Die unbefugte Aktivierung von Mikrofonen oder Kameras führt zu einer direkten Verletzung der Vertraulichkeit. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz; ähnliche Konzepte in OWASP MASVS (Mobile App Security) V8.1: ",
      "action": "Client-Endpunkte härten und strenge Zugriffskontrolle auf Peripheriegeräte durchsetzen",
      "mitigation": "Implementieren Sie eine robuste Endpunktsicherheitsrichtlinie für alle Client-Geräte. Dies sollte die Härtung des Betriebssystems, die Verwendung von Endpoint Detection and Response (EDR)-Lösungen und die strikte Verwaltung von Anwendungsberechtigungen für den Zugriff auf Hardware wie Mikrofone und Kameras umfassen. ",
      "check": "Gibt es eine Endpunktsicherheitslösung für alle Client-Geräte? Werden die Anwendungsberechtigungen zur Nutzung von Mikrofonen und Kameras regelmäßig überprüft? ",
      "detectionLogic": "Dieses Risiko wird für jedes relevante technische Asset ausgelöst, das als clientartige Technologie klassifiziert ist (z. B. ClientSystem, MobileApp, IoTDevice) und als mit einem Mikrofon oder einer Kamera ausgestattet getaggt ist. ",
      "riskAssessment": "Die Auswirkung dieses Risikos ist direkt proportional zur Vertraulichkeit der Informationen in der physischen Umgebung, in der sich das Gerät befindet. Ein Gerät in einem öffentlichen Bereich hat eine geringe Auswirkung, während eines in einem Sitzungssaal eine sehr hohe Auswirkung hat. ",
      "falsePositives": "Das Risiko könnte ein Fehlalarm sein, wenn sich das Gerät in einer nicht sensiblen Umgebung befindet, in der niemals vertrauliche Informationen besprochen werden, oder wenn die Peripheriegeräte nachweislich physisch getrennt sind."
    },
    "misconfiguration-or-improper-use-of-client-system": {
      "title": "Fehlkonfiguration oder unsachgemäße Nutzung des Client-Systems (BSI-Stil)",
      "description": "Moderne Client-Betriebssysteme sind hochkomplex. Fehlkonfigurationen von Komponenten können die Sicherheit erheblich beeinträchtigen und zu Systemstörungen oder Kompromittierungen führen. ",
      "impact": "Wenn dieses Risiko ausgenutzt wird, könnte ein Angreifer unbefugten Zugriff auf das Client-System und alle verbundenen Ressourcen erlangen. Dies kann zur Kompromittierung von ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.3.1 (Clients unter Windows), SYS.3.2.1 (Clients unter Linux) und SYS.3.3 (Clients unter macOS). Dieses Risiko fasst die allgemeine Bedrohung der Fehlkonfiguration zusammen, die für alle Client-Systeme gilt.",
      "action": "Client-Systemkonfigurationen härten und sichern sowie sichere Benutzerpraktiken fördern",
      "mitigation": "Implementieren und erzwingen Sie gehärtete Standardkonfigurationen (Baselines) für alle Client-Systeme unter Verwendung von Konfigurationsmanagement-Tools wie GPO oder MDM. ",
      "check": "Gibt es dokumentierte, gehärtete Sicherheits-Baselines für alle im Einsatz befindlichen Client-Betriebssysteme? Ist ein zentralisiertes Konfigurationsmanagementsystem (wie GPO oder MDM) vorhanden, um diese Baselines durchzusetzen? ",
      "detectionLogic": "Dieses Risiko wird für alle relevanten technischen Assets ausgelöst, die als Client-Systeme identifiziert wurden (z. B. Desktops, mobile Apps, Browser usw.). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für internetfähige Clients als hoch und für rein interne Clients als mittel angesehen, vorausgesetzt, es sind keine spezifischen Härtungsmaßnahmen modelliert. ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die Client-Systeme bereits durch robuste, nicht im Modell abgebildete Prozesse (z. B. eine ausgereifte unternehmensweite GPO/MDM-Umgebung) verwaltet und gehärtet werden. "
    },
    "high-risk-profile-for-windows-systems": {
      "title": "Hohes Risikoprofil für Windows-Systeme (BSI-basiert)",
      "description": "Aufgrund der hohen Verbreitung von Windows-Betriebssystemen und der oft vorhandenen Abwärtskompatibilität zwischen den Systemgenerationen, ",
      "impact": "Wenn dieses Risiko eintritt, können Malware oder unbefugter Zugriff die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und der von ihm verarbeiteten Daten gefährden. ",
      "asvs": "BSI IT-Grundschutz: SYS.1.2 Windows Server, SYS.1.3 Windows Clients",
      "action": "Robuste Härtung, Patch-Management und Endgeräteschutz für Windows-Systeme implementieren",
      "mitigation": "Wenden Sie eine tiefgreifende Verteidigungsstrategie für alle Windows-Systeme an. Dies umfasst: ",
      "check": "Sind alle Windows-Systeme durch einen Patch-Management-Prozess mit definierten SLAs abgedeckt? Gibt es einen dokumentierten Härtungsstandard für Windows-Systeme, der aktiv durchgesetzt und überprüft wird? ",
      "detectionLogic": "Dieses Risiko wird für alle relevanten technischen Assets ausgelöst, die über das Tag `@OS:Windows` als Windows-System identifiziert wurden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der großen Angriffsfläche und der ständigen Flut von Angriffen auf Windows-Schwachstellen als hoch angesehen. ",
      "falsePositives": "Dieses verallgemeinerte Risiko ist selten ein vollständiger Fehlalarm, da die externe Bedrohungslandschaft für Windows eine gegebene Tatsache ist. "
    },
    "software-incompatibility-on-os-upgrade": {
      "title": "Software-Inkompatibilität bei Betriebssystem-Upgrade (basiert auf BSI)",
      "description": "Software, insbesondere ältere Anwendungen, die erfolgreich auf früheren Versionen eines Betriebssystems betrieben wurden, ist möglicherweise nicht mit aktuellen Betriebssystemversionen kompatibel. ",
      "impact": "Wenn eine Anwendung mit einem Betriebssystem-Upgrade inkompatibel ist, kann dies zu einem teilweisen oder vollständigen Verlust ihrer Funktionalität führen. ",
      "asvs": "Dies ist ein Problem der Konfiguration und des Lebenszyklusmanagements auf Plattformebene, das nicht direkt von OWASP ASVS abgedeckt wird, das sich auf die Sicherheit von Webanwendungen konzentriert. Das nächstliegende Konzept ist die Gewährleistung einer sicheren und stabilen Betriebsumgebung.",
      "action": "Einen Prozess zur Prüfung der Anwendungskompatibilität etablieren und durchführen",
      "mitigation": "Bevor größere Betriebssystem-Updates in Produktionsumgebungen bereitgestellt werden, müssen kritische Anwendungen in einer repräsentativen Staging-Umgebung auf Kompatibilität getestet werden. ",
      "check": "Gibt es einen formellen Prozess zum Testen der Anwendungskompatibilität vor Betriebssystem-Upgrades? Gibt es ein aktuelles Inventar kritischer Anwendungen und ihrer unterstützten Betriebssysteme? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die wahrscheinlich empfindlich auf Änderungen des zugrunde liegenden Betriebssystems reagieren. ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass dieses Risiko eintritt, ist bei Anwendungen, die explizit als veraltet gekennzeichnet sind, oder bei älterer, komplexer COTS-Software höher. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Organisation über einen robusten, konsequent durchgeführten Testprozess vor der Bereitstellung verfügt oder wenn die spezifische Anwendung bereits vom Anbieter als kompatibel bestätigt wurde. Das Risiko dient als Anstoß, zu überprüfen, ob diese operativen Kontrollen vorhanden sind."
    },
    "windows-telemetry-data-leakage": {
      "title": "Unerwünschte Übertragung von Windows-Telemetriedaten",
      "description": "Standardmäßig sendet Windows Diagnosedaten an den Hersteller Microsoft. Zusätzlich kann Microsoft über den integrierten Telemetriedienst gezielt Informationen von einem Client abfragen. ",
      "impact": "Wenn sensible Daten über den Telemetriedienst exfiltriert werden, stellt dies eine Verletzung der Vertraulichkeit dar. Dies könnte zur Offenlegung von Geschäftsgeheimnissen, personenbezogenen Daten oder anderen geschützten Informationen führen und potenziell rechtliche, finanzielle oder rufschädigende Konsequenzen haben.",
      "asvs": "Dies ist ein Konfigurationsrisiko auf Plattform-/Betriebssystemebene, das nicht direkt von OWASP ASVS abgedeckt wird. Es bezieht sich auf eine sichere Systemkonfiguration und Härtung, ähnlich dem Geist des BSI IT-Grundschutzes.",
      "action": "Windows-Telemetrie konfigurieren oder deaktivieren",
      "mitigation": "Im Rahmen des Client-Härtungsprozesses sollte die Menge der an Microsoft gesendeten Diagnosedaten explizit konfiguriert und eingeschränkt werden. ",
      "check": "Sind Windows-Clients so gehärtet, dass die Erfassung von Telemetriedaten eingeschränkt ist? Ist die Diagnosedatenstufe explizit auf ein minimal erforderliches Niveau eingestellt (z. B. ",
      "detectionLogic": "Diese Regel wird für relevante technische Assets ausgelöst, die als Windows-Clients identifiziert wurden (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit der Datenübertragung ist ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Telemetrie durch andere Mittel kontrolliert wird, die nicht im Modell dargestellt sind (z. B. ein netzwerkbasierter Proxy, der alle Telemetrie-Endpunkte blockiert), oder wenn die verwendete spezifische Windows-Edition (z. B. Enterprise LTSC) andere, sicherere Standardeinstellungen hat."
    },
    "impaired-forensics-due-to-vsm": {
      "title": "Beeinträchtigte Forensik durch Virtual Secure Mode (VSM)",
      "description": "Die Verwendung des Virtual Secure Mode (VSM) schränkt forensische Untersuchungen ein oder erschwert sie, zum Beispiel bei der Reaktion auf Sicherheitsvorfälle. Prozesse, die durch den Secure Kernel oder den Isolated User Mode (IUM) geschützt sind, werden unzugänglich. Beispielsweise können Speicherabbilder dieser Prozesse aufgrund kryptografischer Maßnahmen nicht analysiert werden, was die Fähigkeit zur Untersuchung von Sicherheitsvorfällen auf dem Asset behindert.",
      "impact": "Dies behindert erheblich die Fähigkeit, eine effektive Reaktion auf Sicherheitsvorfälle und forensische Analysen durchzuführen. Es kann unmöglich sein, die Ursache eines Vorfalls, das Ausmaß einer Kompromittierung oder die von einem Angreifer ergriffenen Maßnahmen zu ermitteln. Dies kann zu längeren Systemausfallzeiten, unvollständiger Behebung und der Unfähigkeit führen, rechtliche oder Compliance-Anforderungen für die Meldung und Analyse von Vorfällen zu erfüllen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz CON.8 (Vorfallmanagement und -reaktion). Die Unfähigkeit, Forensik durchzuführen, wirkt sich direkt auf die Analyse- und Bearbeitungsphase eines Vorfalls aus.",
      "action": "Forensische Auswirkungen von VSM bewerten und dokumentieren",
      "mitigation": "Führen Sie vor der Aktivierung von VSM oder ähnlichen hardwarebasierten Isolationstechnologien eine Risikobewertung durch. Die Vorteile der Prozessisolation müssen gegen die operativen Kosten beeinträchtigter forensischer Fähigkeiten abgewogen werden. Stellen Sie sicher, dass alternative Überwachungs-, Protokollierungs- und Erkennungsmechanismen vorhanden sind, um den Verlust des direkten Speicherzugriffs zu kompensieren (z. B. Verbesserung der Protokollierung auf Anwendungsebene, Netzwerverkehrsanalyse oder VSM-fähige EDR-Lösungen). Dokumentieren Sie das akzeptierte Risiko und die kompensatorischen Kontrollen.",
      "check": "Wird VSM oder eine ähnliche Technologie auf dem Asset verwendet? Wenn ja, gibt es eine dokumentierte Risikobewertung, die die Auswirkungen auf die Forensik anerkennt? Gibt es erweiterte, alternative Protokollierungs- und Überwachungskontrollen für die geschützten Komponenten?",
      "detectionLogic": "Erkennt technische Assets, die explizit als mit Virtual Secure Mode (VSM) aktiviert getaggt sind. Das Vorhandensein dieser Technologie erschwert oder blockiert inhärent Standard-Forensikverfahren wie die Speicheranalyse.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Beeinträchtigung der Forensik wird als ",
      "falsePositives": "Dieses Risiko kann als Fehlalarm betrachtet werden, wenn die Organisation über spezifische, VSM-fähige forensische Werkzeuge und dokumentierte Verfahren verfügt, die eine gleichwertige Einsicht in geschützte Prozesse ermöglichen und das Risiko effektiv mindern."
    },
    "unauthorized-software-on-unix-systems": {
      "title": "Unbefugte Softwareinstallation auf Unix-ähnlichen Systemen",
      "description": "Auf Unix-ähnlichen IT-Systemen könnten Benutzer Quellcode selbst herunterladen und kompilieren oder vorkompilierte Pakete aus nicht verifizierten Drittanbieterquellen installieren und dabei offizielle Distributions-Repositories umgehen. ",
      "impact": "Die Installation von nicht vertrauenswürdiger Software kann Malware einführen, was zu einer vollständigen Kompromittierung des Systems führt",
      "asvs": "V14.2.5: Überprüfen Sie, dass Komponenten von Drittanbietern aus einer vertrauenswürdigen Quelle stammen, sicher transportiert wurden und nicht modifiziert wurden.",
      "action": "Strikte Richtlinien für Softwareinstallation und -beschaffung durchsetzen",
      "mitigation": "Beschränken Sie die Berechtigungen zur Softwareinstallation ausschließlich auf autorisierte Administratoren. Konfigurieren Sie Paketmanager so, dass sie nur vertrauenswürdige, offizielle Repositories verwenden und Paketsignaturen überprüfen. ",
      "check": "Sind die Benutzerberechtigungen so konfiguriert, dass eine unbefugte Softwareinstallation verhindert wird? Sind die Repositories des Paketmanagers auf offizielle, signierte Quellen beschränkt? ",
      "detectionLogic": "Dieses Risiko gilt für technische Assets, die als Unix-ähnliche Systeme identifiziert wurden, welche oft Ziele für diese Art von Kompromittierung sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn nicht-administrative Benutzer Shell-Zugriff und Schreibberechtigungen in ihren Home-Verzeichnissen auf einem Mehrbenutzersystem haben. ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn das Modell keine starken kompensierenden Kontrollen erfasst. "
    },
    "misuse-of-scripting-languages-on-unix-like-systems": {
      "title": "Missbrauch von Skriptsprachen auf Unix-ähnlichen Systemen",
      "description": "Auf Unix-ähnlichen Betriebssystemen sind Skriptsprachen (bash, sh, Python, Perl, Ruby, etc.) leistungsstark und tief integriert. ",
      "impact": "Wenn ein Angreifer nicht autorisierte Skripte ausführen kann, kann er die Vertraulichkeit, Integrität und Verfügbarkeit des gesamten Clients und der umgebenden Infrastruktur gefährden. ",
      "asvs": "OWASP ASVS V14.2.1 (Command Injection) / BSI SYS.2.3 §2.2",
      "action": "Skript-Interpreter und Ausführungspfade sperren",
      "mitigation": "Wenden Sie das Prinzip der geringsten Rechte durchgängig an. Entfernen oder deaktivieren Sie Interpreter, die nicht unbedingt erforderlich sind. ",
      "check": "Sind unnötige Interpreter entfernt? Erzwingen SELinux/AppArmor-Profile die Ausführung von Skripten und listen diese auf einer Zulassungsliste? ",
      "detectionLogic": "Ausgelöst für relevante technische Assets, die mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher für Systeme mit Internetzugang und für nicht verwaltete Endpunkte. Die Auswirkung leitet sich von der Kritikalität des Assets und der Sensibilität der verarbeiteten/gespeicherten Daten ab. ",
      "falsePositives": "Kann ein Fehlalarm sein, wenn nachweislich starke Kontrollen durchgesetzt werden (z. B. SELinux/AppArmor im Enforcing-Modus mit minimaler Richtlinie, "
    },
    "conflicting-configurations-on-complex-systems": {
      "title": "Widersprüchliche Konfigurationen auf Unix-ähnlichen Clients (BSI-basiert)",
      "description": "Auf Unix-ähnlichen Client-Systemen sind zahlreiche Anwendungen installiert, jede mit ihren eigenen Konfigurationsdateien. ",
      "impact": "Widersprüchliche Konfigurationen können unbeabsichtigtes Verhalten verursachen, was zu Sicherheitslücken und Betriebsproblemen führt. ",
      "asvs": "Inspiriert vom BSI IT-Grundschutz. Bezogen auf OWASP ASVS v4.0.3: 14.1 Konfiguration.",
      "action": "Zentrales Konfigurationsmanagement und regelmäßige Audits implementieren",
      "mitigation": "Nutzen Sie Konfigurationsmanagement- und Infrastructure-as-Code-Tools (z. B. Ansible, Puppet, Chef, Terraform), um einen konsistenten, konfliktfreien und versionierten Konfigurationszustand durchzusetzen. ",
      "check": "Wird ein zentrales Konfigurationsmanagementsystem verwendet? Gibt es eine dokumentierte, sichere Basiskonfiguration für den Client? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die komplexe Systeme darstellen, die wahrscheinlich vielschichtige Konfigurationen aufweisen (z. B. Anwendungsserver, Datenbanken, Container-Plattformen). ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Systemen mit einer großen Anzahl von Anwendungen oder komplexen Integrationsmustern (viele Kommunikationsverbindungen) höher. ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn das System trotz seiner Komplexität von einem robusten, vollautomatisierten Konfigurationsmanagementsystem verwaltet wird, das darauf ausgelegt ist, solche Konflikte zu verhindern oder sofort zu erkennen. Eine manuelle Überprüfung der betrieblichen Praktiken ist erforderlich."
    },
    "inadequate-nac-planning-net-3-1": {
      "title": "Unzureichende NAC-Planung und -Implementierung (BSI NET.3.1)",
      "description": "Wenn die Planung für eine Network Access Control (NAC)-Lösung unzureichend ist, zum Beispiel aufgrund eines unvollständigen IT-Asset-Inventars oder unzureichender Anforderungsanalyse, können erhebliche Sicherheitslücken entstehen. ",
      "impact": "Eine schlecht implementierte NAC-Lösung kann zu einer Privilegienerweiterung führen, die unbefugten Zugriff auf sensible Netzwerksegmente und Daten ermöglicht. Sie kann auch zu einem Denial-of-Service für legitime Benutzer und Systeme führen. ",
      "asvs": "V14.2.3: Zugriffskontrollen auf Netzwerkebene",
      "action": "Eine umfassende Network Access Control (NAC)-Lösung implementieren und validieren",
      "mitigation": "Stellen Sie sicher, dass ein vollständiges und aktuelles IT-Asset-Inventar gepflegt wird. Führen Sie eine gründliche Anforderungsanalyse für die NAC-Lösung durch und berücksichtigen Sie dabei alle relevanten Systeme, Protokolle und Benutzerrollen. ",
      "check": "Gibt es ein vollständiges Inventar aller Assets, die Netzwerkzugriff benötigen? Werden starke, standardisierte Authentifizierungs- und Autorisierungsmethoden für alle Verbindungen durchgesetzt, die Vertrauensgrenzen überschreiten? ",
      "detectionLogic": "Dieses Risiko wird durch die Analyse von Kommunikationsverbindungen identifiziert, die Netzwerkvertrauensgrenzen überschreiten. Das Risiko wird ausgelöst, wenn eine solche Verbindung eine schwache oder keine Authentifizierung oder Autorisierung verwendet, ein starker Indikator für eine unzureichende oder falsch konfigurierte NAC. ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist hoch, wenn die Authentifizierung auf einer grenzüberschreitenden Verbindung vollständig fehlt. Die Auswirkung wird durch die Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertung (CIA) des Ziel-Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. ",
      "falsePositives": "Ein Risiko könnte für eine Verbindung gemeldet werden, die durch eine zwischengeschaltete Sicherheitskomponente (wie eine WAF oder ein IPS) geschützt ist, die nicht explizit in Threagile modelliert ist. "
    },
    "inadequate-endpoint-orchestration-for-nac": {
      "title": "Unzureichende Endpunkt-Orchestrierung für NAC (BSI NET.3.2)",
      "description": "Ein Mangel an – oder unzureichend implementierte – Endpunkt-Orchestrierungstools, Sicherheitsrichtlinien und Ressourcen kann zu einer schlechten Integration von Geräten in eine Network Access Control (NAC)-Lösung führen. ",
      "impact": "Wenn nicht verwaltete oder schlecht konfigurierte Endpunkte sich mit dem Netzwerk verbinden, können sie Sicherheitskontrollen umgehen. Dies kann zu unbefugtem Zugriff auf sensible Netzwerksegmente, der Verwendung schwacher Authentifizierungsdaten und potenziellen Datenlecks führen. Es erhöht auch das Risiko, dass kompromittierte Geräte einen Fuß in das interne Netzwerk bekommen, was potenziell zu Privilegienerweiterung, Informationspreisgabe und Denial-of-Service führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.3.2 (Network Access Control)",
      "action": "Zentrales Endpunktmanagement und NAC-Integrationsrichtlinien implementieren",
      "mitigation": "Verwenden Sie ein zentrales Orchestrierungstool (wie UEM oder MDM), um alle Endpunkte zu verwalten. Definieren und erzwingen Sie Sicherheitsrichtlinien für verschiedene Endpunktgruppen (z. B. Unternehmens-, BYOD-, IoT-Geräte). ",
      "check": "Wird ein zentrales Endpunkt-Orchestrierungstool (UEM/MDM) verwendet? Sind Sicherheitsrichtlinien für verschiedene Endpunkttypen definiert? Gibt es einen standardisierten Onboarding-Prozess für neue Geräte, der die NAC-Registrierung einschließt? Erzwingt die NAC eine Netzwerksegmentierung basierend auf der Endpunktidentität und dem Compliance-Status? Ist eine starke Authentifizierung für den Zugriff auf kritische Ressourcen erforderlich?",
      "detectionLogic": "Dieses Risiko wird für client-artige technische Assets ausgelöst (z. B. Desktop, MobileApp, IoTDevice), die nicht explizit als verwaltet gekennzeichnet sind (z. B. über ein `@EndpointManaged`-Tag). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn sich zahlreiche nicht verwaltete Client-Geräte mit dem Netzwerk verbinden können. Die Auswirkung wird durch die Sensibilität (CIA-Bewertungen) der Assets bestimmt, auf die sie zugreifen können. Der Zugriff auf geschäftskritische Systeme oder streng vertrauliche Daten von einem nicht verwalteten Gerät stellt eine sehr hohe Auswirkung dar.",
      "falsePositives": "Das Modell enthält möglicherweise das Endpunktmanagement- oder Orchestrierungssystem nicht als technisches Asset. Eine Organisation könnte eine robuste Endpunktmanagementlösung im Einsatz haben, die im Diagramm nicht widergespiegelt wird, was dieses Risiko zu einem Fehlalarm macht. Eine Überprüfung der betrieblichen Prozesse und Tools ist erforderlich."
    },
    "insecure-wlan-or-nac-authentication": {
      "title": "Unsichere WLAN- oder Network Access Control (NAC)-Authentifizierung",
      "description": "Wenn sichere Authentifizierungsmethoden für den Netzwerkzugriff (wie EAP-TLS in einer 802.1X-Umgebung) nicht unterstützt oder erzwungen werden, ",
      "impact": "Ein Angreifer könnte sich als legitimes Client-Gerät ausgeben und einen ersten Halt in einem internen Netzwerksegment erlangen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein NET.3.2 (WLAN-Nutzung) und NET.1.1 (Netzwerkarchitektur).",
      "action": "Starke Netzwerkauthentifizierungsprotokolle durchsetzen",
      "mitigation": "Für 802.1X-basierten Netzwerkzugriff (kabelgebunden oder drahtlos) erzwingen Sie starke EAP-Typen wie EAP-TLS, die sowohl Client- als auch Serverzertifikate erfordern. ",
      "check": "Wird 802.1X für den Netzwerkzugriff eingesetzt? Wenn ja, welche EAP-Typen sind in der Konfiguration des RADIUS-Servers zulässig? ",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen ausgelöst, die von clientartigen Assets (z. B. mobilen Apps, Desktops, IoT-Geräten) ausgehen und eine Netzwerk-Vertrauensgrenze überschreiten ",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit ist hoch, wenn ein schwaches Authentifizierungsprotokoll für den Netzwerkzugriff verwendet wird, da Werkzeuge für solche Angriffe weit verbreitet sind. ",
      "falsePositives": "Ein Modell könnte einfach spezifizieren "
    },
    "misconfigured-nac-ruleset": {
      "title": "Fehlkonfiguriertes NAC-Regelwerk",
      "description": "Aufgrund menschlicher Fehler, unzureichender Prozesse oder unzureichender personeller Ausstattung, die zu Zeitdruck führt, ",
      "impact": "Eine falsch konfigurierte NAC-Lösung kann zu zwei Hauptergebnissen führen. Erstens kann sie einen Denial-of-Service verursachen, bei dem legitime Endpunkte ",
      "asvs": "BSI IT-Grundschutz: NET.3.2 RADIUS",
      "action": "Vier-Augen-Prinzip und Auditing für NAC-Konfigurationsänderungen implementieren",
      "mitigation": "Alle Änderungen am NAC-Regelwerk (auf RADIUS-Servern, Access-Switches usw.) müssen einem dokumentierten Änderungsmanagementprozess folgen, ",
      "check": "Gibt es einen dokumentierten Prozess für die Verwaltung von Änderungen an NAC-Konfigurationen? Unterliegen alle Änderungen einer Peer-Review? Werden NAC-Konfigurationen und Zugriffsprotokolle regelmäßig überprüft?",
      "detectionLogic": "Identifiziert technische Assets, die zentrale Komponenten eines Network Access Control-Systems sind, wie z. B. RADIUS-Server oder durchsetzende Access-Switches. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird für jedes Asset gemeldet, das als Kernkomponente der NAC gekennzeichnet ist. Es kann als Fehlalarm betrachtet werden, wenn die Organisation außergewöhnlich robuste, "
    },
    "insufficient-network-access-control-bsi-net-3-2": {
      "title": "Ungenügende Netzwerkzugangskontrolle (BSI NET.3.2)",
      "description": "Wenn die Netzwerkzugangskontrolle (NAC) – vorübergehend oder dauerhaft – deaktiviert oder an Netzwerkgrenzen (z. B. Switch-Ports) nicht implementiert ist, ist der Netzwerkzugang unzureichend geschützt. ",
      "impact": "Unbefugter Netzwerkzugriff kann die Vertraulichkeit, Integrität und Verfügbarkeit von Informationswerten gefährden. ",
      "asvs": "BSI IT-Grundschutz NET.3.2 Netzwerkzugangskontrolle, insbesondere Anforderung NET.3.2.A2 (Einsatz eines NAC-Systems). Bezieht sich auch auf NET.1.1.A5 (Steuerung des Zugangs zu einem LAN).",
      "action": "Starke Netzwerkzugangskontrolle implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Netzwerkzugangspunkte – insbesondere solche, die Vertrauensgrenzen überschreiten – durch eine robuste NAC-Lösung geschützt sind, die jedes Gerät oder jeden Benutzer authentifiziert und autorisiert, das bzw. der eine Verbindung herstellen möchte. ",
      "check": "Überqueren Kommunikationsverbindungen im Modell eine Netzwerk-Vertrauensgrenze ohne Authentifizierung? Werden VPNs oder IP-Filterung als kompensierende Kontrollen verwendet?",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung von Kommunikationsverbindungen erkannt, die eine Netzwerk-Vertrauensgrenze ohne jegliche Authentifizierung (`authentication: none`) überqueren. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein ungeschützter Eintrittspunkt in ein sensibles Netzwerk existiert. ",
      "falsePositives": "Ein Fehlalarm kann auftreten, wenn eine kompensierende Kontrolle existiert, aber nicht modelliert ist (z. B. eine physische zustandsbehaftete Firewall zwischen den Assets). "
    },
    "nac-component-failure": {
      "title": "Ausfall von Network Access Control (NAC)-Komponenten",
      "description": "Eine unzureichend entworfene oder implementierte NAC-Architektur, fehlerhafte NAC-Komponenten, Netzwerkstörungen oder Denial-of-Service (DoS)-Angriffe können zum Ausfall oder zur Nichtverfügbarkeit zentraler NAC-Komponenten führen. Dies wirkt sich direkt auf die Kommunikationsfähigkeit der Endpunkte aus und kann zu zwei kritischen Ausfallmodi führen, je nachdem, wie die Netzwerk-Durchsetzungspunkte (z. B. Switches, drahtlose Zugangspunkte) konfiguriert sind.",
      "impact": "Wenn ein Durchsetzungspunkt so konfiguriert ist, dass er ",
      "asvs": "V14.2.1: Überprüfen Sie, dass alle vernetzten Komponenten – einschließlich Server, Arbeitsstationen und Netzwerkgeräte – sicher konfiguriert sind.",
      "action": "Eine widerstandsfähige NAC-Architektur implementieren und Ausfallmodi definieren",
      "mitigation": "Stellen Sie eine hohe Verfügbarkeit für alle zentralen NAC-Komponenten (z. B. RADIUS-Server) durch Redundanz (z. B. geclusterte Server) sicher. Definieren und implementieren Sie explizit den gewünschten Ausfallmodus (Fail-Open vs. Fail-Closed) an allen NAC-Durchsetzungspunkten basierend auf einer gründlichen Risikobewertung für jedes Netzwerksegment. Härten Sie NAC-Komponenten gegen DoS-Angriffe. Überwachen Sie kontinuierlich den Zustand und die Verfügbarkeit aller NAC-Komponenten und der zugrunde liegenden Netzwerkinfrastruktur.",
      "check": "Sind zentrale NAC-Komponenten in einer hochverfügbaren, redundanten Konfiguration entworfen und bereitgestellt? Ist der Ausfallmodus (Fail-Open/Fail-Closed) auf allen Netzwerk-Durchsetzungsgeräten explizit konfiguriert? Wird der Zustand aller NAC-Komponenten aktiv mit Alarmierung überwacht?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die mit `@NAC-Component:true` getaggt und nicht redundant sind. Sie prüft dann auf direkte Kommunikationsverbindungen zu Netzwerkgeräten, die mit `@NAC-Enforcement-Point:fail-open` oder `@NAC-Enforcement-Point:fail-closed` getaggt sind. Basierend auf dem Durchsetzungspunkt",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn eine kritische NAC-Komponente nicht redundant konfiguriert ist. Die Auswirkung wird durch den Ausfallmodus bestimmt. Für ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn Redundanz durch Mechanismen erreicht wird, die nicht im Modell dargestellt sind (z. B. cloud-native Lastausgleich, DNS-Failover), oder wenn die getaggte Komponente tatsächlich nicht kritisch für den Netzwerkzugriff ist."
    },
    "inadequate-protection-of-log-data": {
      "title": "Ungenügender Schutz von personenbezogenen Protokolldaten",
      "description": "Ein unzureichendes administratives Konzept, eine schlechte Umsetzung, übermäßig lange Datenaufbewahrungsfristen oder eine unzureichende Abstimmung mit dem Betriebsrat und dem Datenschutzbeauftragten können zu einem unzureichenden Schutz personenbezogener Protokolldaten führen. Diese Bedingungen erhöhen das Risiko des Datenmissbrauchs.",
      "impact": "Wenn personenbezogene Protokolldaten nicht ausreichend geschützt oder ohne klare Richtlinie zu lange gespeichert werden, könnten sie zur Erstellung detaillierter Benutzerprofile missbraucht werden. Dies ermöglicht die Verfolgung von Mitarbeiteraktivitäten und -verhalten über die Zeit, was zu erheblichen Datenschutzverletzungen führt. Solche Vorfälle können zu rechtlichen und finanziellen Strafen (z. B. nach der DSGVO), Reputationsschäden und dem Verlust des Vertrauens von Mitarbeitern und Kunden führen.",
      "asvs": "V8.3.4: Alle sensiblen Daten im Ruhezustand sind verschlüsselt, unter Verwendung eines empfohlenen und bewährten Algorithmus und eines starken Verschlüsselungsschlüssels.",
      "action": "Datenminimierungs- und Aufbewahrungsrichtlinien für Protokolldaten implementieren",
      "mitigation": "Definieren und erzwingen Sie strenge Datenaufbewahrungsrichtlinien für alle Protokolldaten, insbesondere wenn personenbezogene Informationen beteiligt sind. Stellen Sie sicher, dass Protokolle nach Ablauf der definierten Aufbewahrungsfrist automatisch gelöscht oder anonymisiert werden. Der Zugriff auf Rohprotokolldaten muss streng kontrolliert und auf autorisiertes Personal mit einem legitimen Bedarf beschränkt werden. Konsultieren Sie den Datenschutzbeauftragten und, wo zutreffend, den Betriebsrat, um die Einhaltung gesetzlicher Anforderungen wie der DSGVO sicherzustellen. Verwenden Sie das Tag `@RetentionPolicy:Defined` auf technischen Assets, um anzuzeigen, dass eine solche Richtlinie existiert und für die dort gespeicherten Daten durchgesetzt wird.",
      "check": "Sind die Datenaufbewahrungsrichtlinien für Protokolle klar definiert und dokumentiert? Gibt es einen automatisierten Prozess zum Löschen oder Anonymisieren alter Protokolle? Ist der Zugriff auf Protokollmanagementsysteme ordnungsgemäß gesichert und auditiert? Hat der Datenschutzbeauftragte (und, wo zutreffend, der Betriebsrat) die Protokollierungs- und Aufbewahrungsstrategie genehmigt?",
      "detectionLogic": "Diese Regel wird für technische Assets ausgelöst, die wahrscheinlich Protokolldaten speichern oder verarbeiten (z. B. Datenbanken, Überwachungssysteme, Data Lakes) und die Datenassets verarbeiten, die als sensible, personenbezogene Protokolle identifiziert wurden. Ein Risiko wird generiert, wenn ein solches technisches Asset nicht explizit mit `@RetentionPolicy:Defined` getaggt ist, was auf einen potenziellen Mangel an erforderlichem Datenlebenszyklusmanagement hinweist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko kann auch dann gemeldet werden, wenn eine Aufbewahrungsrichtlinie existiert, aber außerhalb des im Bedrohungsmodell dokumentierten Systems verwaltet wird. In solchen Fällen aktualisieren Sie das Modell, indem Sie das Tag `@RetentionPolicy:Defined` auf das relevante technische Asset anwenden, um diesen Befund zu unterdrücken."
    },
    "file-server-availability-failure": {
      "title": "Verfügbarkeitsausfall eines Dateiservers (BSI-basiert)",
      "description": "Wenn ein Dateiserver ausfällt, kann das gesamte Informationssystem – einschließlich wichtiger Geschäftsprozesse und institutioneller Aufgaben – betroffen sein. Nicht nur Benutzer, sondern auch Anwendungen können von Daten auf dem Dateiserver abhängen, um korrekt zu funktionieren. Das BSI warnt, dass solche Ausfälle zu ernsthaften Betriebsstörungen führen können.",
      "impact": "Wenn die Verfügbarkeit von Daten und Diensten auf dem Dateiserver nicht gewährleistet ist, können Fristen verpasst und wesentliche Geschäftsprozesse unterbrochen werden. Ohne einen Notfallmanagementplan können sich die Wiederanlaufzeiten weiter verlängern. In vielen Fällen führt dies zu finanziellen Verlusten, und der Ausfall kann auch andere Institutionen betreffen.",
      "asvs": "V6.1: Überprüfen Sie, dass alle Anwendungskomponenten über eine ausreichende Verfügbarkeit verfügen, um die Anwendungsbelastung zu bewältigen, und Ausfälle in integrierten Systemen ordnungsgemäß behandeln können.",
      "action": "Redundanz, Sicherung und Wiederherstellung sowie Notfallwiederherstellungspläne implementieren",
      "mitigation": "Dateiserver, insbesondere solche, die kritische Daten speichern, sollten für Hochverfügbarkeit ausgelegt sein. Dies kann durch redundante Hardware, Clustering oder Lastausgleich erreicht werden. Eine robuste Sicherungs- und Wiederherstellungsstrategie muss vorhanden sein und regelmäßig getestet werden. Für geschäftskritische Systeme sollte ein umfassender Notfallwiederherstellungsplan erstellt werden, um die Geschäftskontinuität zu gewährleisten. Das `redundant`-Flag am technischen Asset sollte auf `true` gesetzt werden, um eine solche Einrichtung widerzuspiegeln.",
      "check": "Ist das Dateiserver-Asset als ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Fehlalarm sein, wenn die Redundanz von einer zugrunde liegenden Plattform (z. B. Cloud-Speicher-Backend, SAN mit Failover) gehandhabt wird, die nicht explizit modelliert ist, aber die Dateiserver-Komponente effektiv hochverfügbar macht. In solchen Fällen sollte das `redundant: true`-Flag am Asset gesetzt werden."
    },
    "insufficient-fileserver-resources-con1-a15": {
      "title": "Ungenügende Dateiserver-Ressourcen (BSI CON.1.A15)",
      "description": "Wenn die Netzwerkverbindung oder die Speicherkapazität des Dateiservers unzureichend ist, können sich die Zugriffszeiten verlängern oder es können Speicherengpässe auftreten. ",
      "impact": "Unzureichende Ressourcen für einen Dateiserver können die Verfügbarkeit direkt beeinträchtigen und zu Integritätsproblemen führen, wenn Anwendungen ausfallen. ",
      "asvs": "BSI IT-Grundschutz CON.1.A15 (Ausreichende Dimensionierung des Dateiservers)",
      "action": "Kapazitäts- und Leistungsmanagement für Dateiserver implementieren",
      "mitigation": "Überwachen Sie den Dateiserver regelmäßig",
      "check": "Werden Leistungs- und Kapazitätsmetriken für den Dateiserver aktiv überwacht? Gibt es einen dokumentierten Prozess für die Kapazitätsplanung? ",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets des ",
      "riskAssessment": "Die Wahrscheinlichkeit wird durch Faktoren bestimmt, die auf eine hohe Last hindeuten, wie die Anzahl der eingehenden Verbindungen und das Volumen der gespeicherten Daten. ",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn der Dateiserver, selbst unter hoher Last, angemessen dimensioniert, ordnungsgemäß überwacht und durch einen gut verwalteten Kapazitätsplan unterstützt wird. "
    },
    "malware-on-fileserver": {
      "title": "Ungeschützter Dateiserver verbreitet Malware",
      "description": "Wenn ein Dateiserver unzureichend in die Organisation integriert ist",
      "impact": "Eine weit verbreitete Malware-Infektion kann die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) von Daten über zahlreiche Systeme hinweg gefährden. ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.4 Schutz vor Schadprogrammen",
      "action": "Den Dateiserver in die Malware-Schutzstrategie integrieren",
      "mitigation": "Stellen Sie sicher, dass der Dateiserver von der zentralen Malware-Schutzstrategie abgedeckt ist. Dies beinhaltet die Installation und regelmäßige Aktualisierung von Anti-Malware-Software auf dem Dateiserver selbst, ",
      "check": "Ist das Dateiserver-Asset im Bedrohungsmodell mit `@Protected:Anti-Malware` gekennzeichnet? Spiegelt dies die Realität wider, d.h. ist der Server mit einer effektiven, aktuellen Anti-Malware-Lösung ausgestattet, die Dateifreigaben scannt?",
      "detectionLogic": "Dieses Risiko wird für jedes relevante technische Asset vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als höher angesehen, wenn der Dateiserver dem Internet ausgesetzt ist. Die Auswirkung wird durch die höchste CIA-Bewertung des Dateiservers selbst oder der von ihm gespeicherten Daten bestimmt. ",
      "falsePositives": "Ein Dateiserver könnte einen Malwareschutz haben, der aber nicht im Modell mit dem Tag `@Protected:Anti-Malware` dokumentiert ist. "
    },
    "improper-access-control-orp4": {
      "title": "Unsachgemäße Zugriffskontrolle (BSI ORP.4)",
      "description": "Wenn Zugriffsrechte und Berechtigungen nicht ordnungsgemäß entworfen, zugewiesen und durchgesetzt werden, können unbefugte Parteien Zugriff auf Daten erhalten. Dies könnte ihnen ermöglichen, sensible Informationen zu lesen, zu ändern oder zu löschen, was die Vertraulichkeit, Integrität und Verfügbarkeit gefährdet.",
      "impact": "Das Versäumnis, eine ordnungsgemäße Zugriffskontrolle durchzusetzen, kann zu Datenlecks, unbefugter Manipulation oder Löschung von Daten und Angriffen zur Privilegienerweiterung führen. Die Folgen können finanzielle Verluste, Reputationsschäden, Betriebsstörungen und die Nichteinhaltung gesetzlicher oder vertraglicher Verpflichtungen sein.",
      "asvs": "BSI IT-Grundschutz ORP.4 Identitäts- und Berechtigungsmanagement, insbesondere ORP.4.A6 (Definition von Berechtigungen) und ORP.4.A7 (Einrichten von Benutzern und Berechtigungen).",
      "action": "Starke Zugriffskontrolle implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, insbesondere solche, die auf Datenspeicher zugreifen oder sensible Informationen verarbeiten, starke Authentifizierungs- und Autorisierungsmechanismen durchsetzen (z. B. unter Verwendung von Token, Client-Zertifikaten oder Identitätsweitergabe anstelle von ",
      "check": "Gibt es Kommunikationsverbindungen im Modell, bei denen `authentication` oder `authorization` auf `none` gesetzt ist? Übertragen oder empfangen diese Verbindungen Datenassets? Wie hoch ist die Sensibilität der Daten und des Ziel-Assets?",
      "detectionLogic": "Diese Regel wird ausgelöst, wenn eine Kommunikationsverbindung ihre Eigenschaft `authentication` oder `authorization` auf `none` gesetzt hat. Das Risiko wird gegen das Ziel-Asset dieser Verbindung ausgelöst, da es die Komponente ist, die die Zugriffskontrolle nicht durchsetzt, insbesondere wenn sie sensible Daten verarbeitet oder anderweitig kritisch ist.",
      "riskAssessment": "Die Ausnutzungswahrscheinlichkeit wird als sehr hoch angesehen, wenn auf einem Kommunikationskanal keine Zugriffskontrollen vorhanden sind. Die Auswirkung wird auf der Grundlage der höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen sowohl der über die Verbindung übertragenen Datenassets als auch des Ziel-Assets selbst berechnet. Höhere CIA-Bewertungen führen zu einer höheren Auswirkung.",
      "falsePositives": "Dieses Risiko könnte ein Fehlalarm sein, wenn die übertragenen Daten explizit für den öffentlichen, nicht authentifizierten Zugriff bestimmt sind und ihre Integrität keine Rolle spielt (z. B. eine öffentliche Statusseite ohne Benutzerdaten). Es ist wahrscheinlicher, dass es sich um einen Modellierungsfehler handelt, bei dem Zugriffskontrollen existieren, aber nicht im Bedrohungsmodell dokumentiert wurden."
    },
    "disorganized-data-storage-con1": {
      "title": "Unstrukturierte Datenspeicherung (BSI CON.1)",
      "description": "Wenn keine Speicherstruktur vorgegeben ist oder Mitarbeiter sich nicht daran halten, ",
      "impact": "Unstrukturierte Datenspeicherung kann die Vertraulichkeit, Integrität und Verfügbarkeit von Informationen gefährden. ",
      "asvs": "BSI IT-Grundschutz CON.1.A1: Definition einer Verzeichnisstruktur",
      "action": "Datenspeicherstrukturen und -richtlinien definieren und durchsetzen",
      "mitigation": "Etablieren und dokumentieren Sie eine klare, gut strukturierte und verbindliche Verzeichnis- und Dateistruktur für alle relevanten Datenspeicher. ",
      "check": "Gibt es eine dokumentierte und durchgesetzte Richtlinie für Datei- und Verzeichnisstrukturen? Werden die Zugriffsberechtigungen regelmäßig überprüft? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für mandantenfähige Assets oder solche mit einer großen Anzahl von Benutzern als höher angesehen, da dies das Potenzial für Unordnung erhöht. ",
      "falsePositives": "Dieses Risiko wird basierend auf dem Typ der verwendeten Technologie generiert. Ein Modell kann die Existenz oder Durchsetzung von starken "
    },
    "data-loss-on-fileserver": {
      "title": "Datenverlust auf dem Dateiserver aufgrund fehlender Redundanz oder Sicherung",
      "description": "Wenn ein Dateiserver vollständig ausfällt oder einzelne Komponenten versagen, können wichtige Informationen ohne Dateisynchronisierung oder eine funktionierende Sicherung verloren gehen. Dasselbe gilt, wenn Mitarbeiter versehentlich Dateien löschen. Wenn keine ausreichende Redundanz (z.B. ein geeignetes Redundant Array of Independent Disks (RAID)) eingesetzt wird, können weitere Probleme entstehen. Der Ausfall eines einzelnen Speichergeräts kann den Betrieb direkt stören, da die Dateien nicht mehr verfügbar sind.",
      "impact": "Ein Ausfall ohne angemessene Redundanz oder Sicherung führt zu Datenverlust, was die Integrität (Daten gehen verloren oder sind unvollständig) und Verfügbarkeit (Daten sind nicht zugänglich) beeinträchtigt. Dies kann den Betrieb erheblich stören, zum dauerhaften Verlust wertvoller Informationen führen und erhebliche betriebliche und finanzielle Schäden verursachen.",
      "asvs": "BSI IT-Grundschutz: APP.3.3 Fileserver (Abschnitt 2.6 – Datenverlust); siehe auch CON.3 Datensicherungskonzept und SYS.1.8 Speicherlösungen",
      "action": "Redundanz- und Sicherungsmaßnahmen implementieren",
      "mitigation": "Stellen Sie sicher, dass das Dateiserver-Asset mit Hardware-Redundanz (z. B. einem RAID-System) konfiguriert ist. Dies kann durch Setzen des ",
      "check": "Ist der ",
      "detectionLogic": "Wird für alle relevanten technischen Assets des ",
      "riskAssessment": "Die Auswirkung des Datenverlusts wird durch den Dateiserver bestimmt",
      "falsePositives": "Das Modell enthält möglicherweise keine separate, netzwerkbasierte Sicherungslösung. Wenn eine solche Lösung existiert und den Dateiserver schützt, behandeln Sie dies als Fehlalarm oder markieren Sie es als gemindert, indem Sie das "
    },
    "ransomware-infection-via-lateral-movement": {
      "title": "Ransomware-Infektion durch seitliche Bewegung",
      "description": "Ransomware ist Schadsoftware, die Daten auf infizierten Systemen verschlüsselt, sie unzugänglich macht, und Angreifer fordern ein Lösegeld für die Entschlüsselungsschlüssel. ",
      "impact": "Wenn sich Ransomware von einem weniger kritischen Asset (z. B. einer Benutzer-Workstation) auf einen zentralen Datenspeicher ausbreitet, kann sie große Mengen an gemeinsam genutzten Daten verschlüsseln. ",
      "asvs": "Ausgerichtet am BSI IT-Grundschutz, insbesondere den Bedrohungsszenarien für APP.3.3 Fileserver, die Malware/Ransomware betreffen, und der Notwendigkeit von Kontrollen wie CON.3 (Schutz vor Schadprogrammen), CON.4 (Datensicherung) und OPS.1.1.4 (Netzwerksegmentierung und -filterung).",
      "action": "Netzwerksegmentierung, das Prinzip der geringsten Rechte und robuste Sicherungs- und Wiederherstellungsstrategien implementieren",
      "mitigation": "Um dieses Risiko zu mindern, wenden Sie eine tiefgreifende Verteidigungsstrategie an: ",
      "check": "Sind die Schreibberechtigungen für gemeinsam genutzte Datenspeicher streng nach geschäftlichem Bedarf begrenzt? Sind Client-Netzwerke von Server-/Speichernetzwerken segmentiert? Gibt es regelmäßige, getestete, offline/unveränderliche Sicherungen für alle kritischen Daten?",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein weniger geschütztes technisches Asset (z. B. ein Client oder eine Webanwendung) eine nicht schreibgeschützte Kommunikationsverbindung zu einem hochwertigen Datenspeicher (wie einem Dateiserver) hat. Dies schafft einen potenziellen Pfad für die Ausbreitung von Ransomware von einem häufigen Infektionspunkt zu kritischem Datenspeicher, wobei Schutzmaßnahmen auf dem Datenspeicher selbst umgangen werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird durch die Exposition des ursprünglichen Assets bestimmt (Clients und internetfähige Systeme werden eher kompromittiert). Die Auswirkung hängt von den Verfügbarkeits- und Integritätsanforderungen der Daten auf dem Zieldatenspeicher ab. Ein erfolgreicher Angriff auf einen Datenspeicher mit geschäftskritischen Daten hat eine sehr hohe Auswirkung.",
      "falsePositives": "Ein Risiko könnte als Fehlalarm gemeldet werden, wenn kompensierende Kontrollen existieren, die nicht modelliert sind, wie z. B. eine fortschrittliche EDR/XDR-Lösung, die Ransomware effektiv blockiert"
    }
  }
}
