{
  "meta": {
    "part": 7,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 7 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "data-obsolescence-in-archives": {
      "title": "Datenobsoleszenz in Langzeitarchiven (BSI CON.8.G1)",
      "description": "Daten, die für die Langzeitspeicherung vorgesehen sind, können im Laufe der Zeit unbrauchbar werden. Dies ist auf die physische oder technische Alterung der zugrunde liegenden Systemkomponenten, Speichermedien und Datenformate zurückzuführen. ",
      "impact": "Wenn dieses Risiko eintritt, können archivierte Informationen unlesbar werden (Verlust der Verfügbarkeit) oder durch Zersetzung verändert werden (Verlust der Integrität). ",
      "asvs": "BSI IT-Grundschutz CON.8.A3 Auswahl geeigneter Speichermedien und Datenformate; CON.8.A4 Regelmäßige Prüfung der Lesbarkeit von Informationen",
      "action": "Implementierung einer Datenlebenszyklus- und Archivierungsstrategie",
      "mitigation": "Etablieren Sie eine robuste Strategie für die Langzeitarchivierung. Diese sollte die Auswahl langlebiger, offener und gut dokumentierter Datenformate umfassen. ",
      "check": "Gibt es eine definierte Strategie zur langfristigen Datenaufbewahrung? Werden Datenformate und Speichermedien regelmäßig auf Obsoleszenz und Integrität geprüft? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Falsch-Positiv kann auftreten, wenn eine effektive Archivierungs- und Migrationsstrategie existiert, aber nicht im Modell über das "
    },
    "insufficient-archive-classification-criteria-bsi-con-8-a22": {
      "title": "Unzureichende Klassifizierungskriterien für Archive (BSI CON.8.A22)",
      "description": "Elektronische Archive können sehr große Datenmengen enthalten. Datensätze werden auf der Grundlage von Klassifizierungskriterien (Indexierung) gespeichert, die aus Indexdaten von Geschäftsanwendungen und aus dem Archivsystem selbst abgeleitet werden. ",
      "impact": "Aufgrund ungeeigneter oder begrenzter Klassifizierungskriterien können Archivierungsziele verfehlt werden, wie z. B. die Fähigkeit, Dritten gegenüber Nachweise zu erbringen. ",
      "asvs": "BSI IT-Grundschutz CON.8 Archivierung – CON.8.A22 Auswahl geeigneter Klassifizierungskriterien für elektronische Archive.",
      "action": "Definition und Implementierung robuster Archivierungs- und Indexierungsrichtlinien",
      "mitigation": "Definieren und dokumentieren Sie geeignete und ausreichende Klassifizierungskriterien für alle elektronischen Archive basierend auf geschäftlichen, betrieblichen und rechtlichen Anforderungen. ",
      "check": "Gibt es dokumentierte Klassifizierungs- und Indexierungskriterien für alle elektronischen Archive? Erfüllen diese Kriterien alle relevanten rechtlichen und geschäftlichen Anforderungen an die Datenwiederauffindung und Nachweisbarkeit? ",
      "detectionLogic": "Dieses Risiko wird für jeden Datenspeicher (`type: datastore`) ausgelöst, der explizit als Archiv über das Tag `classification:archive` identifiziert wird. ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Dies kann ein Falsch-Positiv sein, wenn eine umfassende und geeignete Archivierungs- und Klassifizierungsstrategie für das Asset definiert und implementiert ist, aber nicht modelliert wurde (z. B. extern dokumentiert)."
    },
    "insufficient-logging-of-archive-access": {
      "title": "Unzureichende Protokollierung von Archivzugriffen (basierend auf BSI)",
      "description": "Unbefugter Zugriff auf Archive wird typischerweise anhand von Protokolldateien erkannt. Wenn die Protokollierung jedoch nicht ausreichend umfassend ist, ",
      "impact": "Wenn die Protokollierung unzureichend ist, kann ein unbefugter Zugriff auf archivierte Daten unentdeckt bleiben. Dies kann zu einer stillen Verletzung der Vertraulichkeit (Datendiebstahl) führen. ",
      "asvs": "BSI IT-Grundschutz CON.8 (Erkennung sicherheitsrelevanter Ereignisse), OWASP ASVS V7 (Logging and Monitoring)",
      "action": "Implementierung einer umfassenden und manipulationssicheren Protokollierung für Archivzugriffe",
      "mitigation": "Stellen Sie sicher, dass alle Zugriffsversuche (sowohl erfolgreiche als auch fehlgeschlagene) auf technische Assets, die Archivdaten enthalten, detailliert protokolliert werden. ",
      "check": "Werden alle Lese- und Schreibzugriffsereignisse auf das Archiv-Asset protokolliert? Sind die Protokolle vor Manipulation und unbefugtem Zugriff geschützt? Gibt es einen Prozess zur regelmäßigen Überprüfung dieser Protokolle?",
      "detectionLogic": "Diese Regel identifiziert technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird auf Basis des Architekturmodells generiert und kann die tatsächliche Protokollierungsimplementierung nicht überprüfen. "
    },
    "falsification-or-loss-during-scanning-con1": {
      "title": "Verfälschung oder Verlust von Informationen beim Scannen von Dokumenten (BSI CON.1)",
      "description": "Wenn Dokumente gescannt oder digitalisiert werden, können ihr Erscheinungsbild oder die Semantik der erfassten Daten verfälscht werden. Dokumente oder Teile davon können bei diesem Prozess auch verloren gehen. ",
      "impact": "Dies beeinträchtigt die Integrität und Verfügbarkeit der Daten. Falsche Geschäftsentscheidungen können auf der Grundlage fehlerhafter Daten getroffen werden, Geschäftsprozesse können gestört werden und regulatorische oder vertragliche Verpflichtungen können verletzt werden, wenn die ursprünglichen Dokumenteninformationen nicht korrekt erhalten bleiben.",
      "asvs": "BSI IT-Grundschutz Baustein CON.1 (Datenerfassung und -aufbereitung), insbesondere CON.1.A19 (Fehlerbehandlung bei der Datenerfassung). Bezieht sich auch auf OWASP ASVS V5.2 (Data Validation Requirements).",
      "action": "Implementierung robuster Scan- und Datenvalidierungsprozesse",
      "mitigation": "Implementieren Sie technische und organisatorische Kontrollen für den Scan-/Digitalisierungsprozess. Dazu gehört die Verwendung hochwertiger Software mit Fehlererkennungs- und Korrekturfunktionen (z. B. OCR-Konfidenzwerte, Bildqualitätsprüfungen). Implementieren Sie Prüfsummen oder andere Integritätsprüfungen für Dateiübertragungen. Für kritische Prozesse integrieren Sie einen manuellen oder halbautomatischen Validierungsschritt, bei dem ein Mensch die digitalisierte Ausgabe mit dem Originaldokument vergleicht, insbesondere bei wichtigen Datenfeldern. Führen Sie detaillierte Protokolle aller Vorgänge, um verlorene oder falsch verarbeitete Dokumente nachverfolgen zu können.",
      "check": "Verfügt der Digitalisierungsprozess über eingebaute Qualitäts- und Vollständigkeitsprüfungen? Gibt es Verfahren zur Validierung der Integrität der erfassten Daten gegenüber der Quelle? Werden Protokolle für alle Digitalisierungsaktivitäten geführt, um die Nachverfolgbarkeit zu gewährleisten?",
      "detectionLogic": "Das Risiko wird für technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher, wenn die Komponente, die die Dateien verarbeitet, eine Eigenentwicklung ist. Die Auswirkung steht in direktem Zusammenhang mit den Integritäts- und Verfügbarkeitsanforderungen der verarbeiteten Daten. Wenn unternehmenskritische Daten gescannt werden, ist die Auswirkung sehr hoch.",
      "falsePositives": "Das Asset könnte Dateien für einen anderen Zweck als die Digitalisierung annehmen (z. B. eine einfache Dateifreigabe ohne Verarbeitung). Das Risiko kann als Falsch-Positiv betrachtet werden, wenn der Prozess über starke, bewährte Validierungs- und Abgleichmechanismen verfügt, die nicht im Modell erfasst sind."
    },
    "insufficient-archive-review": {
      "title": "Unzureichende Überprüfung des Archivierungsprozesses (BSI-CON.1-Stil)",
      "description": "Wenn der Archivierungsprozess zu selten oder ungenau überprüft wird, werden Fehlfunktionen möglicherweise nicht erkannt. ",
      "impact": "Eine nicht regelmäßige und genaue Überprüfung des Archivierungsprozesses kann zu unentdeckter Datenkorruption oder -manipulation führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Archivierung), Anforderung CON.1.A5 (Prüfung des Archivs).",
      "action": "Implementierung regelmäßiger Audits und Integritätsprüfungen für Archivierungssysteme",
      "mitigation": "Etablieren Sie einen formalen Prozess zur regelmäßigen Überprüfung und Auditierung des Archivierungssystems und seiner Prozesse. ",
      "check": "Gibt es ein dokumentiertes Verfahren zur Überprüfung des Archivierungsprozesses? Werden Integritätsprüfungen für archivierte Daten durchgeführt? ",
      "detectionLogic": "Dieses Risiko wird für jedes Datenspeicher-Asset ausgelöst, das Daten mit hohen oder unternehmenskritischen Integritätsanforderungen speichert. ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Integritätsanforderung des kritischsten Daten-Assets ab, das im Archiv gespeichert ist. ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn bereits ein robuster, regelmäßiger und effektiver Überprüfungs- und Auditprozess für das Archivierungssystem vorhanden ist, "
    },
    "non-compliance-with-legal-archiving-requirements": {
      "title": "Nichteinhaltung gesetzlicher Archivierungsanforderungen",
      "description": "Bei der Archivierung elektronischer Dokumente und Daten müssen verschiedene rechtliche und regulatorische Rahmenbedingungen beachtet werden. ",
      "impact": "Die Nichteinhaltung gesetzlicher Archivierungs- und Datenaufbewahrungsanforderungen kann zu schweren rechtlichen Strafen, Bußgeldern und Reputationsschäden führen. ",
      "asvs": "Dieses Risiko bezieht sich auf rechtliche und regulatorische Anforderungen, die ein übergeordnetes Anliegen für Anwendungen sind. Es entspricht dem Geist von ASVS V14 (Konfiguration), da die ordnungsgemäße Datenaufbewahrung ein kritischer Konfigurationsaspekt ist.",
      "action": "Definition und Implementierung von Richtlinien zur Datenaufbewahrung und Archivierung",
      "mitigation": "Etablieren und dokumentieren Sie klare Richtlinien zur Datenaufbewahrung, die auf allen anwendbaren rechtlichen und geschäftlichen Anforderungen basieren. ",
      "check": "Gibt es dokumentierte Richtlinien zur Datenaufbewahrung für alle relevanten Datentypen? Setzt die Archivierungslösung diese Richtlinien technisch durch? Gibt es einen Prozess für Legal Holds und die eventuelle sichere Löschung?",
      "detectionLogic": "Diese Regel löst Risiken für jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit der Nichteinhaltung wird als hoch angesehen, wenn für ein zur Archivierung vorgesehenes System keine Richtlinie definiert ist. ",
      "falsePositives": "Eine Richtlinie könnte organisatorisch existieren, aber nicht über das angegebene Tag im Bedrohungsmodell erfasst sein. Dieses Risiko sollte mit dem Systemverantwortlichen überprüft werden, um zu bestätigen, ob tatsächlich eine konforme Aufbewahrungsrichtlinie fehlt."
    },
    "insufficient-telework-regulations-ops1.2.4": {
      "title": "Unzureichende Regelungen für Telearbeit (BSI OPS.1.2.4)",
      "description": "Die Nutzung eines Telearbeitsplatzes erfordert ergänzende organisatorische Vereinbarungen und klare Anweisungen für die Mitarbeiter, insbesondere zum Umgang mit Sicherheitsvorfällen. Ohne kommunizierte Richtlinien für Ereignisse wie Geräteverlust oder Kompromittierung an einem entfernten Standort werden Vorfälle möglicherweise nicht korrekt gemeldet oder behandelt, was das Schadensrisiko erheblich erhöht.",
      "impact": "Wenn Sicherheitsvorfälle am Telearbeitsplatz (z. B. Verlust oder Diebstahl eines Geräts, unbefugte Beobachtung durch Dritte, Malware-Infektion) nicht nach einem definierten Prozess behandelt werden, können vertrauliche Informationen kompromittiert werden. Dies kann zu schweren Schäden führen, einschließlich Datenschutzverletzungen, Reputationsschäden und finanziellen Verlusten für die Organisation.",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.2.4 (Telearbeit), Abschnitt 2.1 (Unzureichende oder fehlende Regelungen für Telearbeit)",
      "action": "Etablierung und Kommunikation klarer Sicherheitsrichtlinien und Vorfallsreaktionsverfahren für die Telearbeit",
      "mitigation": "Definieren, dokumentieren und kommunizieren Sie klare, umsetzbare Sicherheitsrichtlinien und -verfahren speziell für die Telearbeit. Diese Richtlinien müssen den sicheren Umgang mit Geräten (sowohl firmeneigene als auch BYOD), die akzeptable Netzwerknutzung, Anforderungen an Datenspeicherung und -verschlüsselung sowie klare, verbindliche Verfahren zur sofortigen Meldung von vermuteten Sicherheitsvorfällen abdecken. Stellen Sie sicher, dass alle Mitarbeiter, die Telearbeit leisten, in diesen Verfahren geschult sind und wissen, wen sie wie kontaktieren müssen. Überprüfen und aktualisieren Sie diese Richtlinien regelmäßig.",
      "check": "Gibt es dokumentierte und kommunizierte Sicherheitsrichtlinien speziell für die Telearbeit? Kennen die Mitarbeiter das genaue Verfahren zur Meldung eines Sicherheitsvorfalls von ihrem entfernten Standort aus? Wird dieser Prozess regelmäßig getestet oder in Sensibilisierungskampagnen einbezogen?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das einen Telearbeits-Endpunkt darstellt. Dies schließt Client-Technologien (wie Browser, mobile Apps, Desktops) ein, die sich aus dem öffentlichen Internet verbinden oder explizit als von einem menschlichen Client genutzt gekennzeichnet sind und die Daten mit einer Sensitivitätsbewertung von ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Das Bedrohungsmodell kann nur die technische Präsenz von Telearbeits-Assets identifizieren; es kann nicht die Existenz oder Wirksamkeit organisatorischer Richtlinien überprüfen. Dieses Risiko muss manuell durch Überprüfung der Organisation "
    },
    "unauthorized-private-use-of-telework-client-bsi-ops-1-2-4": {
      "title": "Unbefugte private Nutzung des firmeneigenen Telearbeits-Clients (BSI OPS.1.2.4)",
      "description": "In einer häuslichen Umgebung können Benutzer leichter ungeprüfte oder nicht genehmigte Hardware oder Software auf einem vom Unternehmen bereitgestellten Telearbeits-Client installieren. ",
      "impact": "Wenn der Telearbeits-Client infiziert ist, können vertrauliche Informationen offengelegt, verändert oder exfiltriert werden. ",
      "asvs": "BSI IT-Grundschutz OPS.1.2.4: Telearbeit (z. B. 2.2 unbefugte private Nutzung; A2/A7 Richtlinien und technische Schutzmaßnahmen).",
      "action": "Durchsetzung von Endpunktsicherheit, klaren Nutzungsregeln und dem Prinzip der geringsten Rechte.",
      "mitigation": "Führen Sie eine strenge Richtlinie ein und setzen Sie diese durch, die die private Nutzung von firmeneigenen Telearbeits-Clients verbietet. ",
      "check": "Gibt es eine klar kommunizierte Richtlinie zur privaten Nutzung von Firmengeräten? Sind die Benutzerkonten auf Telearbeits-Clients ohne administrative Berechtigungen konfiguriert? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Client-Gerät (z. B. Desktop, Client-System) identifiziert und explizit über das Tag `telework-client` als Telearbeits-Client gekennzeichnet ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine spezifischen Endpunktsicherheitskontrollen oder Richtlinien für Telearbeits-Clients existieren. ",
      "falsePositives": "Dies kann ein Falsch-Positiv sein, wenn robuste, nicht umgehbare technische Kontrollen die unbefugte Softwareinstallation und private Nutzung effektiv verhindern, auch wenn dies nicht explizit modelliert ist."
    },
    "workflow-delay-due-to-uncoordinated-telework": {
      "title": "Workflow-Verzögerung durch unkoordinierte Telearbeit (BSI OPS.1.2.4)",
      "description": "Wenn Mitarbeiter keine festen Arbeitszeiten am Telearbeitsplatz haben und keine festen Zeiten vereinbart sind, zu denen sie erreichbar sein müssen, kann sich der Arbeitsablauf dadurch verzögern. ",
      "impact": "Verzögerte Arbeitsabläufe aufgrund von Personalunverfügbarkeit beeinträchtigen direkt die Verfügbarkeit von Geschäftsfunktionen und -prozessen. Dies kann zu verpassten Fristen, reduzierter Produktivität und der Nichteinhaltung von Service-Level-Zielen führen.",
      "asvs": "Nicht direkt anwendbar. Dies ist ein organisatorisches Prozessrisiko im Zusammenhang mit der Verfügbarkeit von Personal, keine technische Anwendungssicherheitslücke. Es steht im Einklang mit allgemeinen Prinzipien des Geschäftskontinuitätsmanagements.",
      "action": "Festlegung und Durchsetzung von Kernverfügbarkeitszeiten für die Telearbeit",
      "mitigation": "Definieren und kommunizieren Sie eine klare Richtlinie für die Telearbeit, einschließlich Kernarbeitszeiten, in denen von den Mitarbeitern erwartet wird, dass sie für Zusammenarbeit und Kommunikation verfügbar sind. ",
      "check": "Gibt es eine dokumentierte Richtlinie für die Telearbeit, die Kernverfügbarkeitszeiten festlegt? Kennen und halten sich die Teammitglieder an diese Zeiten? ",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes technische Asset ausgelöst, das mit ",
      "riskAssessment": "Die Wahrscheinlichkeit des Eintretens dieses Risikos wird als ",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn eine Organisation effektive, wenn auch informelle, Kommunikations- und Koordinationspraktiken für ihre Remote-Mitarbeiter hat. "
    },
    "delayed-information-for-remote-workers": {
      "title": "Verzögerte Informationsweitergabe an Remote-Mitarbeiter (BSI OPS.1.2.4)",
      "description": "Da Mitarbeiter nicht immer physisch in der Organisation anwesend sind, haben sie weniger Möglichkeiten, an ad-hoc, informellen Austauschen mit Vorgesetzten und Kollegen teilzunehmen. ",
      "impact": "Wenn aktualisierte Verfahren oder andere wichtige Informationen nicht rechtzeitig zur Kenntnis genommen werden, kann dies Geschäftsprozesse stören und die Erledigung von Aufgaben behindern, was die Verfügbarkeit (und in einigen Fällen die Integrität) des Betriebs beeinträchtigt. ",
      "asvs": "Nicht direkt von OWASP ASVS abgedeckt (organisatorisches/prozessuales Risiko); bezieht sich auf ISO/IEC 27001 Anhang A (z. B. A.6.2.1 Richtlinie für mobile Geräte; A.11.2.6 Sicherheit von Geräten und Assets außerhalb des Betriebsgeländes) und BSI OPS.1.2.4.A8.",
      "action": "Etablierung formaler und redundanter Kommunikationskanäle für Remote-Mitarbeiter",
      "mitigation": "Stellen Sie sicher, dass alle kritischen betrieblichen Informationen dokumentiert und über formale, asynchrone Kanäle (z. B. Wikis, Ticketsysteme, offizielle Chat-Kanäle, E-Mail-Zusammenfassungen) kommuniziert werden, die für alle Teammitglieder unabhängig von ihrem physischen Standort zugänglich sind. ",
      "check": "Gibt es verbindliche, dokumentierte Verfahren zur Verbreitung wichtiger Informationen an Remote-Mitarbeiter? Werden kritische Informationen zentral archiviert und sind sie leicht zugänglich? ",
      "detectionLogic": "Dieses organisatorische Risiko ist mit Assets verbunden, die Telearbeits-Endpunkte darstellen. In diesem Modell kennzeichnet es Assets, die von Menschen bediente Clients (`used_as_client_by_human`) sind, dem Internet ausgesetzt sind (`internet`), ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Kann ein Falsch-Positiv sein, wenn robuste, formale, asynchrone Kommunikationsprozesse existieren (z. B. verbindliche schriftliche Entscheidungen, zentral dokumentierte Updates, inklusive Meeting-Praktiken), die alle Remote-Mitarbeiter zuverlässig erreichen. "
    },
    "insecure-telework-environment-con3": {
      "title": "Unsichere Telearbeitsumgebung (BSI OPS.1.2.4)",
      "description": "Am Telearbeitsplatz (z. B. Homeoffice) kann ein Mangel an organisatorischer Kontrolle und Überwachung dazu führen, dass Mitarbeiter empfohlene oder vorgeschriebene Sicherheitsmaßnahmen nicht vollständig umsetzen. Dies kann auf unsichere private Netzwerke, die Nutzung von Geräten durch unbefugte Dritte (z. B. Familienmitglieder) oder Shoulder-Surfing zurückzuführen sein. Infolgedessen können sensible Informationen, die auf diesen Remote-Geräten verarbeitet werden, kompromittiert werden und in die Hände unbefugter Personen gelangen.",
      "impact": "Wenn Sicherheitsmaßnahmen auf Remote-Clients nicht durchgesetzt werden, können vertrauliche Informationen, auf die von ihnen zugegriffen oder die von ihnen verarbeitet werden, offengelegt werden. Dies kann zu Datenschutzverletzungen, Compliance-Verstößen und Reputationsschäden führen. Die Integrität des Systems kann ebenfalls beeinträchtigt werden, wenn der unsichere Client als Einfallstor für weitere Angriffe genutzt wird.",
      "asvs": "BSI IT-Grundschutz CON.3.A13: Schutz von Informationen bei der Telearbeit",
      "action": "Implementierung und Durchsetzung sicherer Telearbeitsrichtlinien und technischer Kontrollen",
      "mitigation": "Setzen Sie eine umfassende Sicherheitsrichtlinie für alle Remote-Arbeiten durch. Dies umfasst die Härtung von Client-Geräten (Laptops, Mobiltelefone) mit vollständiger Festplattenverschlüsselung (FDE), Endpoint Detection and Response (EDR)-Lösungen und Mobile Device Management (MDM). Schreiben Sie die Verwendung eines sicheren VPN für den gesamten Zugriff auf interne Unternehmensressourcen vor. Bieten Sie regelmäßige Schulungen zum Sicherheitsbewusstsein an, die sich auf die spezifischen Risiken der Telearbeit konzentrieren. Implementieren Sie eine starke Multi-Faktor-Authentifizierung für den gesamten Fernzugriff.",
      "check": "Gibt es eine definierte und durchgesetzte Richtlinie für sichere Telearbeit? Werden Client-Geräte zentral verwaltet und gehärtet? Ist ein VPN für den Zugriff erforderlich? Erhalten Mitarbeiter Schulungen zur Sicherheit bei der Remote-Arbeit?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die von Menschen als Clients (z. B. Browser, Desktop-Apps) verwendet werden und mit dem Internet verbunden sind, was darauf hindeutet, dass sie in einer unkontrollierten Umgebung wie einem Homeoffice betrieben werden. Ein Risiko wird ausgelöst, wenn diese Clients auf Daten mit einer Vertraulichkeitsstufe von ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Vorfalls wird für nicht verwaltete Clients in nicht vertrauenswürdigen Umgebungen als hoch angesehen. Die Auswirkung ist direkt proportional zur Vertraulichkeit der Daten, auf die zugegriffen wird. Ein ",
      "falsePositives": "Ein Risiko könnte für ein Asset gekennzeichnet werden, das in Wirklichkeit durch Endpunktsicherheitsmaßnahmen (EDR, MDM) gut geschützt ist, die im Bedrohungsmodell nicht dokumentiert sind. In solchen Fällen kann das Asset mit "
    },
    "insecure-remote-maintenance-configuration": {
      "title": "Unsichere Konfiguration der Fernwartung (BSI CON.3.A4)",
      "description": "Administratoren, die Fernwartung einrichten und nutzen, stützen sich auf Richtlinien, die deren Verwendung definieren. Es ist beispielsweise notwendig festzulegen, wie Fernwartungsanwendungen konfiguriert werden müssen. Andernfalls kann die Fernwartung zusätzliche Risiken für das interne Netzwerk mit sich bringen. Wenn die Regelungen für die Fernwartung nicht an die beteiligten Parteien kommuniziert werden, entstehen Risiken für den IT-Betrieb. Beispielsweise könnte eine Fernwartungsschnittstelle so konfiguriert werden, dass sie eine Authentifizierungsmethode mit einem unsicheren Passwort anstelle eines sicheren, zertifikatbasierten Verfahrens zulässt.",
      "impact": "Wenn die Fernwartung aufgrund fehlender klarer Regeln nicht sicher konfiguriert ist, kann sie einen wichtigen Einfallspunkt für Angreifer in ein ansonsten geschütztes internes Netzwerk schaffen. Dies kann zu unbefugtem Zugriff, Privilegienerweiterung, Datenschutzverletzungen (Verlust der Vertraulichkeit), System- und Datenmanipulation (Verlust der Integrität) und Dienstunterbrechungen (Verlust der Verfügbarkeit) führen.",
      "asvs": "BSI IT-Grundschutz CON.3 Fernzugriff, Anforderung CON.3.A4 Regelung der Fernwartung",
      "action": "Definition und Durchsetzung sicherer Richtlinien für die Fernwartung",
      "mitigation": "Etablieren und erzwingen Sie klare, dokumentierte Richtlinien für alle Fernwartungszugriffe. Diese Richtlinien müssen verbindliche Sicherheitskonfigurationen festlegen, einschließlich der Verwendung starker, multi-faktor- oder zertifikatbasierter Authentifizierung. Die Verwendung einfacher passwortbasierter Anmeldeinformationen für den Fernzugriff über Netzwerkgrenzen hinweg sollte ausdrücklich verboten werden. Stellen Sie sicher, dass alle Administratoren diese Richtlinien kennen und darin geschult sind. Überprüfen Sie die Konfigurationen für den Fernzugriff regelmäßig auf Einhaltung.",
      "check": "Gibt es eine dokumentierte Richtlinie für die Fernwartung? Schreibt sie eine starke Authentifizierung (MFA, Zertifikate) vor? Gibt es einen Prozess, um sicherzustellen, dass Administratoren diese Richtlinie befolgen? Verwenden Fernzugriffsverbindungen schwache Authentifizierungsmethoden wie einfache Anmeldeinformationen?",
      "detectionLogic": "Diese Regel wird bei Kommunikationsverbindungen ausgelöst, die typische Fernwartungsprotokolle (wie SSH) verwenden, um eine Netzwerk-Vertrauensgrenze zu überschreiten, aber mit schwachen Authentifizierungsmethoden (wie ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein Fernwartungsprotokoll über eine Netzwerkgrenze hinweg mit schwacher Authentifizierung (",
      "falsePositives": "Das Modell könnte eine Verbindung als "
    },
    "insecure-remote-administration": {
      "title": "Unsichere Fernadministration (BSI-abgeleitet)",
      "description": "Server wie Windows Server bieten eine Vielzahl von Fernadministrationsfunktionen, die missbraucht werden können. ",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, die administrative Kontrolle über den Server zu erlangen, was zu einem vollständigen Verlust von Vertraulichkeit, Integrität und Verfügbarkeit für das Asset und seine Daten führt. ",
      "asvs": "V14.2.1 (Sichere Konfiguration), V14.4.4 (Eingeschränkter Fernzugriff)",
      "action": "Härtung der Fernadministrationsschnittstellen",
      "mitigation": "Sichern Sie alle Fernadministrationskanäle, indem Sie die Verwendung verschlüsselter Protokolle (z. B. RDP mit TLS, SSH, HTTPS-basiertes Management) erzwingen. ",
      "check": "Sind Fernadministrationsprotokolle (wie RDP, WinRM oder SSH) unvertrauenswürdigen Netzwerken ausgesetzt? Wird eine starke Authentifizierung (z. B. MFA oder Client-Zertifikate) an allen administrativen Zugriffspunkten erzwungen? ",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das mit ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein administrativer Port dem Internet ausgesetzt ist, insbesondere mit schwacher passwortbasierter Authentifizierung. Die Auswirkung wird durch die Geschäftskritikalität (CIA) des Server-Assets selbst bestimmt. Eine Kompromittierung eines unternehmenskritischen Servers hat eine sehr hohe Auswirkung.",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn außerhalb des Modells kompensierende Kontrollen existieren, wie z. B. eine separate, nicht modellierte Web Application Firewall (WAF), ein Intrusion Prevention System (IPS) oder ein Out-of-Band-Management-Netzwerk, das eine starke Trennung bietet, die im Diagramm nicht widergespiegelt wird."
    },
    "weak-authentication-for-remote-maintenance": {
      "title": "Schwache Authentifizierung für Fernwartung",
      "description": "Für die Fernwartung können verschiedene Authentifizierungsmechanismen verwendet werden. Wenn ein unsicheres Authentifizierungsverfahren verwendet wird, ",
      "impact": "Eine erfolgreiche Ausnutzung kann zu einer vollständigen Kompromittierung des Zielsystems führen, einschließlich unbefugtem Zugriff, Änderung oder ",
      "asvs": "OWASP ASVS V4.0.3 - 2.1.1 (Authentifizierung), 2.2.1 (Stärke der Anmeldeinformationen)",
      "action": "Starke Authentifizierung für alle Fernwartungsverbindungen erzwingen",
      "mitigation": "Verwenden Sie Multi-Faktor-Authentifizierung (MFA / ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen mit einer Nutzung von ",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen, die wahrscheinlich für die Fernwartung verwendet werden. Diese werden durch das ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist am höchsten für Verbindungen, die direkt dem Internet ausgesetzt sind und keine Authentifizierung verwenden. ",
      "falsePositives": "Ein Risiko, das für "
    },
    "inadequate-remote-maintenance-ops115": {
      "title": "Unzureichende Fernwartung (BSI OPS.1.2.5)",
      "description": "Um die Sicherheit und Funktionalität von IT-Systemen und Anwendungen, auf die remote zugegriffen wird, zu gewährleisten, ",
      "impact": "Eine unsachgemäße oder unsichere Fernwartung kann zu einem Verlust der Verfügbarkeit, Verletzungen der Systemintegrität, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.2.5 (Fernwartung).",
      "action": "Etablierung und Durchsetzung sicherer Fernwartungsverfahren",
      "mitigation": "Definieren und erzwingen Sie klare, sichere Verfahren für alle Fernwartungsaktivitäten. ",
      "check": "Sind alle Fernadministrationsverbindungen gezwungen, verschlüsselte Protokolle und starke Authentifizierung zu verwenden? ",
      "detectionLogic": "Dieses Risiko wird durch die Analyse eingehender Kommunikationsverbindungen zu serverseitigen technischen Assets erkannt. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn unverschlüsselte Protokolle oder keine Authentifizierung für den Fernzugriff über Netzwerkgrenzen hinweg verwendet werden. ",
      "falsePositives": "Eine Verbindung könnte fälschlicherweise als "
    },
    "insecure-communication-protocol": {
      "title": "Unsicheres Kommunikationsprotokoll (basierend auf BSI-Empfehlung)",
      "description": "Die Kommunikation über öffentliche oder interne Netzwerke mit unsicheren Protokollen stellt eine erhebliche Bedrohung dar. ",
      "impact": "Die Verwendung unsicherer Protokolle kann zur Kompromittierung der Vertraulichkeit durch Abhören (Informationspreisgabe) und zur Kompromittierung der Integrität durch Datenänderung (Manipulation) führen. ",
      "asvs": "V4.3.1",
      "action": "Durchsetzung sicherer Kommunikationsprotokolle",
      "mitigation": "Alle Kommunikationsverbindungen, die sensible Daten über Vertrauensgrenzen hinweg übertragen, müssen starke, hochmoderne Verschlüsselungsprotokolle verwenden (z. B. HTTPS, WSS, FTPS, SFTP, SMTPS). ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen in der Architektur. Gibt es Protokolle, die Daten im Klartext über Vertrauensgrenzen hinweg übertragen? Werden für alle verschlüsselten Protokolle aktuelle und sicher konfigurierte Versionen und Chiffren verwendet?",
      "detectionLogic": "Diese Regel erkennt automatisch alle Kommunikationsverbindungen, die ein Protokoll verwenden, das nicht als verschlüsselt gilt (z. B. HTTP, FTP, Telnet). ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist höher für Verbindungen, die dem Internet ausgesetzt sind oder Netzwerkgrenzen überschreiten. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität (Vertraulichkeit und Integrität) der Daten-Assets, die über die unsichere Verbindung übertragen werden. Die Übertragung von ",
      "falsePositives": "Ein Risiko könnte für eine Verbindung gekennzeichnet werden, die durch eine separate, nicht modellierte kompensierende Kontrolle geschützt ist, wie z. B. einen Site-to-Site-VPN-Tunnel. "
    },
    "unregulated-remote-maintenance-by-third-party": {
      "title": "Ungeregelte Fernwartung durch Dritte (BSI OPS.1.2.5)",
      "description": "Wenn IT-Systeme von Dritten ohne vertragliche Grundlage ferngewartet werden, sind die Verantwortlichkeiten für die Fernwartung möglicherweise nicht klar geregelt. ",
      "impact": "Dieser Mangel an Regelungen kann zu unbefugtem Zugriff, Datenmanipulation (Integrität), Informationspreisgabe (Vertraulichkeit) oder Dienstunterbrechung (Verfügbarkeit) führen. ",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.2.5 (Fernwartung), insbesondere zur Bedrohung G 0.35 (Unzureichende Regelungen für die Fernwartung).",
      "action": "Formale Vereinbarungen und technische Kontrollen für die Fernwartung etablieren",
      "mitigation": "Stellen Sie sicher, dass alle von Dritten durchgeführten Fernwartungsaktivitäten durch einen formalen, rechtsverbindlichen Vertrag geregelt sind. ",
      "check": "Gibt es für jeden Dritten, der eine Fernwartung durchführt, einen Vertrag? Legt der Vertrag Sicherheitsanforderungen für die Fernzugriffsverbindung fest? Werden Fernzugriffsprotokolle erstellt und überprüft? Wird der Zugriff aktiv verwaltet und widerrufen, wenn er nicht mehr benötigt wird?",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung von einem `third-party` technischen Asset (Typ `external-entity`) zu einem im Geltungsbereich befindlichen Asset ausgelöst, die ein gängiges Fernwartungsprotokoll (wie SSH, SCP, SFTP) verwendet. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein ungeregelter Fernzugriffspfad von einem Dritten existiert. Die Auswirkung wird durch die CIA-Anforderungen des Ziel-Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. ",
      "falsePositives": "Ein Risiko könnte gekennzeichnet werden, wenn der Modellierer das `@Service:RemoteMaintenance`-Tag weggelassen hat, obwohl ein gültiger Vertrag existiert. Die Existenz einer formalen Vereinbarung muss außerhalb des Bedrohungsmodells überprüft werden."
    },
    "remote-maintenance-via-online-service-ops1.2.5": {
      "title": "Fernwartung über einen nicht vertrauenswürdigen Online-Dienst (BSI OPS.1.2.5)",
      "description": "Wenn die Fernwartung über einen vermittelnden Online-Dienst durchgeführt wird, wird eine Datenverbindung vom zu administrierenden System zum Dienst hergestellt",
      "impact": "Ein bösartiger oder kompromittierter Online-Dienstanbieter könnte Zugriff auf sensible administrative Befehle und Daten erlangen. Dies könnte zu unbefugter Administration von Systemen, Datenmanipulation (Tampering) oder dem Diebstahl von Anmeldeinformationen und sensiblen Informationen führen und so die Vertraulichkeit und Integrität der verwalteten Systeme gefährden. Wenn sich das IT-System beim Start automatisch mit dem Dienst verbindet, kann es möglich sein, ohne Wissen des Systems darauf zuzugreifen.",
      "asvs": "BSI IT-Grundschutz OPS.1.2.5 Fernwartung (Remote Maintenance)",
      "action": "Implementierung einer Ende-zu-Ende verschlüsselten Fernwartung",
      "mitigation": "Bevorzugen Sie direkte Fernwartungskanäle, die durch VPN (`vpn: true` auf der Kommunikationsverbindung) gesichert sind. Wenn ein vermittelnder Online-Dienst verwendet werden muss, stellen Sie sicher, dass die Kommunikation wirklich Ende-zu-Ende verschlüsselt ist, d. h. der Dienstanbieter kann nicht auf den Klartext der administrativen Sitzung zugreifen. Dies kann durch Protokolle erreicht werden, die einen sicheren Tunnel durch den Vermittler aufbauen. Alle Verbindungen müssen eine starke, hochmoderne Transportverschlüsselung (z. B. HTTPS, SSH) verwenden. Der Online-Dienst selbst sollte gründlich als vertrauenswürdiger Anbieter überprüft werden. Überwachen Sie alle Fernwartungsverbindungen.",
      "check": "Läuft jeglicher Fernwartungsverkehr (`devops`-Nutzung) über eine dem Internet ausgesetzte vermittelnde Komponente? Ist diese Kommunikation durch mehr als nur Standard-HTTPS auf jeder Teilstrecke geschützt? Gibt es einen Mechanismus (wie ein VPN oder einen Ende-zu-Ende verschlüsselten Tunnel), der den Vermittler daran hindert, den Verkehr zu lesen?",
      "detectionLogic": "Dieses Risiko wird für jedes dem Internet ausgesetzte technische Asset (vom Typ Prozess oder External-Entity) ausgelöst, das als Vermittler für `devops`-Verkehr fungiert. Ein Vermittler wird als ein Asset identifiziert, das mindestens eine eingehende Kommunikationsverbindung und mindestens eine ausgehende Kommunikationsverbindung mit dem Nutzungstyp `devops` hat.",
      "riskAssessment": "Die Auswirkung wird auf der Grundlage der höchsten Vertraulichkeit, Integrität und Verfügbarkeit aller Ziel-Assets berechnet, die über den Vermittler administriert werden. Die Wahrscheinlichkeit ist ",
      "falsePositives": "Ein Falsch-Positiv kann auftreten, wenn das Modell spezifische Ende-zu-Ende-Verschlüsselungskontrollen nicht erfasst, die den Vermittler am Zugriff auf den Klartext hindern (z. B. ein eigens entwickeltes sicheres Tunneling-Protokoll). Das Risiko kann akzeptabel sein, wenn der Vermittler eine vollständig vertrauenswürdige, gehärtete und überwachte Komponente ist, obwohl die architektonische Schwäche weiterhin besteht."
    },
    "vulnerability-in-integrated-remote-maintenance-component": {
      "title": "Schwachstelle in integrierter Fernwartungskomponente",
      "description": "Viele IT-Systeme enthalten Komponenten, die integrierte Fernwartungsfunktionen anbieten (z. B. IPMI, iLO, iDRAC, Intel AMT). ",
      "impact": "Wenn ein Angreifer die Kontrolle über eine integrierte Fernwartungskomponente erlangt, kann er in der Regel das gesamte IT-System mit weitreichenden Privilegien übernehmen. ",
      "asvs": "BSI IT-Grundschutz SYS.1.1.A15 (Sicherer Fernzugriff)",
      "action": "Härtung und Isolierung von Fernwartungsschnittstellen",
      "mitigation": "Nicht genutzte Fernwartungskomponenten sollten deaktiviert werden (z. B. über BIOS/UEFI-Einstellungen). ",
      "check": "Gibt es ein vollständiges Inventar aller Hardware-Assets und ihrer Fernwartungsfähigkeiten? Sind ungenutzte Fernwartungsfunktionen nachweislich deaktiviert? ",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets des Maschinentyps ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus den Vertraulichkeits- und Integritätsanforderungen des Assets selbst ab, da eine Kompromittierung der Management-Ebene die volle Kontrolle gewährt. Die Wahrscheinlichkeit wird als höher angesehen, wenn das Asset direkt dem Internet ausgesetzt ist. ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet werden, wenn das technische Asset keine hardwarebasierte Fernwartungsfunktionalität besitzt (z. B. bestimmte einfache virtuelle Maschinen ohne emulierte Managementkarten oder einfache IoT-Geräte) oder wenn die Funktionalität nachweislich und dauerhaft deaktiviert wurde."
    },
    "inadequate-time-sync-planning": {
      "title": "Unzureichende Planung der Zeitsynchronisation (BSI INF.11.A1)",
      "description": "Eine unzureichende Planung kann dazu führen, dass IT-Systeme keine ausreichend genaue Systemzeit erhalten. ",
      "impact": "Wenn die Zeitsynchronisation nicht ordnungsgemäß geplant und implementiert wird, kann dies zu inkonsistenten oder falschen Zeitstempeln über Systeme hinweg führen. ",
      "asvs": "BSI IT-Grundschutz INF.11 Zeitdienst, Anforderung INF.11.A1 Planung der Zeitversorgung",
      "action": "Planung und Implementierung einer robusten Zeitsynchronisationsarchitektur",
      "mitigation": "Etablieren Sie eine klare Zeitsynchronisationsstrategie. Bestimmen Sie primäre, vertrauenswürdige Zeitquellen (z. B. dedizierte interne NTP-Server, die mit einer zuverlässigen externen Quelle synchronisiert sind). ",
      "check": "Gibt es eine definierte Zeitsynchronisationsstrategie? Sind alle Systeme so konfiguriert, dass sie einen vertrauenswürdigen NTP-Server verwenden? Ist die Netzwerkverbindung zwischen NTP-Clients und -Servern über alle Netzwerkgrenzen hinweg sichergestellt? ",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die aufgrund ihres Technologietyps typischerweise zeitsensitiv sind (z. B. Datenbanken, Anwendungsserver, Scheduler, Identitätsanbieter). ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn ein robuster Zeitsynchronisationsmechanismus existiert (z. B. bereitgestellt durch die zugrunde liegende Cloud-Plattform oder den Virtualisierungs-Host), aber nicht explizit mit einem `@TimeSource`-Tag modelliert ist. "
    },
    "ntp-failure-or-misinformation": {
      "title": "Ausfall oder Fehlinformation des NTP-Servers (BSI SYS.1.6)",
      "description": "NTP-Server können ausfallen, unerreichbar werden oder falsche Zeitinformationen übertragen. Wenn ein IT-System seine Uhr nicht korrekt synchronisieren kann, kann seine interne Zeit ungenau werden. Dies kann zu falschen Zeitstempeln in Anwendungen und Protokolldaten führen. Darüber hinaus können falsche Zeitinformationen dazu führen, dass zertifikatbasierte Dienste oder Dienste, die Einmalpasswörter (TOTP) verwenden, ausfallen und Benutzer sich nicht authentifizieren können.",
      "impact": "Eine ungenaue Systemzeit kann zum Ausfall kritischer Sicherheitsdienste wie Authentifizierung und verschlüsselte Kommunikation (TLS) führen, was einen Denial-of-Service verursacht. Sie beeinträchtigt auch die Integrität von Protokolldaten, was forensische Analysen behindert und die Abstreitbarkeit von Handlungen ermöglicht. Dies kann zu Betriebsstörungen, Sicherheitsverletzungen und Nichteinhaltung von Prüfungsanforderungen führen.",
      "asvs": "BSI IT-Grundschutz: SYS.1.6 Zeitdienst, Anforderung A5 (Synchronisation der Systemzeit)",
      "action": "Sicherstellung einer redundanten und sicheren Zeitsynchronisation",
      "mitigation": "Konfigurieren Sie Systeme so, dass sie mehrere, unabhängige und vertrauenswürdige NTP-Quellen zur Redundanz verwenden. Verwenden Sie nach Möglichkeit authentifiziertes NTP (z. B. NTS), um das Spoofing von Zeitinformationen zu verhindern. Überwachen Sie die Verfügbarkeit und Genauigkeit des Zeitdienstes. Wenn sich der NTP-Server innerhalb der Organisation befindet",
      "check": "Sind Systeme mit mindestens zwei unabhängigen NTP-Quellen konfiguriert? Wird der Zeitdienst überwacht? Wird authentifiziertes NTP verwendet, wo unterstützt und anwendbar? Sind die konfigurierten NTP-Server als zuverlässig bekannt?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset identifiziert, das eine Kommunikationsverbindung zu einem anderen Asset hat, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Vorfalls ist höher für Systeme, die sich auf eine einzige NTP-Quelle verlassen (",
      "falsePositives": "Das Modell spiegelt nicht die inhärente Zuverlässigkeit der konfigurierten NTP-Quellen wider. Ein System könnte eine einzige, aber hochzuverlässige geclusterte NTP-Quelle verwenden, die von einem einfachen einzelnen Server nicht zu unterscheiden ist. Außerdem könnte die Zeitsynchronisation von der zugrunde liegenden Infrastruktur (z. B. Hypervisor) gehandhabt und nicht explizit modelliert werden."
    },
    "conflicting-ntp-servers-net.3.2": {
      "title": "Widersprüchliche Zeitinformationen von mehreren NTP-Quellen (BSI NET.3.2)",
      "description": "Wenn ein IT-System mehrere NTP-Server zur Anpassung seiner Systemuhr verwendet, können die Zeitinformationen von verschiedenen NTP-Servern variieren. ",
      "impact": "Eine falsche Systemzeit kann Authentifizierungsprotokolle (z. B. Kerberos) beeinträchtigen, Zertifikatsprüfungen ungültig machen und Protokolle sowie Transaktionsaufzeichnungen mit falschen Zeitstempeln verfälschen. ",
      "asvs": "V14.4.1: Überprüfen Sie, ob alle Komponenten eine gemeinsame Zeitquelle haben und alle Protokolle synchronisierte Zeitstempel aufweisen.",
      "action": "Etablierung einer hierarchischen und zuverlässigen Zeitsynchronisationsstrategie",
      "mitigation": "Konfigurieren Sie eine hierarchische Zeitsynchronisation mit einem begrenzten Satz vertrauenswürdiger, primärer NTP-Quellen. Andere Systeme sollten sich mit diesen internen primären Quellen synchronisieren. ",
      "check": "Überprüfen Sie die NTP-Konfiguration des technischen Assets. Ist es so konfiguriert, dass mehrere, potenziell widersprüchliche, externe NTP-Quellen verwendet werden? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die manuell mit `@ntp-sources: >1` gekennzeichnet sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das System könnte einen ausgeklügelten Algorithmus zur Auswahl der besten Zeitquelle haben, der im Modell nicht widergespiegelt wird und somit potenzielle Konflikte elegant handhabt. "
    },
    "manipulation-of-time-information-ntp": {
      "title": "Manipulation von Zeitinformationen (BSI-Gefährdung)",
      "description": "Das Network Time Protocol (NTP) ist anfällig für verschiedene Angriffe. Ein Angreifer könnte Zeitinformationen während der Übertragung manipulieren oder NTP-Anfragen auf einen bösartigen Server umleiten. Dies könnte einem Angreifer ermöglichen, die Systemzeit von NTP-Clients zu manipulieren.",
      "impact": "Eine erfolgreiche Manipulation der Systemzeit kann zeitbasierte Sicherheitskontrollen untergraben. Zum Beispiel könnte ein Angreifer abgelaufene, zeitlich begrenzte Zugriffsrechte missbrauchen, die Gültigkeitsprüfung von Zertifikaten umgehen oder Protokolleinträge fälschen, was forensische Analysen erschwert. Dies kann die Vertraulichkeit, Integrität und Verfügbarkeit des Systems und seiner Daten gefährden.",
      "asvs": "V14.2.3: Überprüfen Sie, ob alle Komponenten so konfiguriert sind, dass sie eine gemeinsame, vertrauenswürdige und zuverlässige Zeitquelle verwenden.",
      "action": "Implementierung einer sicheren Zeitsynchronisation",
      "mitigation": "Konfigurieren Sie alle Systeme so, dass sie einen sicheren Zeitsynchronisationsmechanismus verwenden. Dies kann durch die Verwendung von authentifiziertem NTP (z. B. mit symmetrischen Schlüsseln) oder einem sichereren Protokoll wie Network Time Security (NTS) erreicht werden. Stellen Sie sicher, dass die konfigurierten Zeitquellen vertrauenswürdig sind. Für Assets, bei denen dies überprüft wurde, wenden Sie das Tag `@SecureTimeSync` an, um zu verhindern, dass dieses Risiko ausgelöst wird.",
      "check": "Sind alle Systeme so konfiguriert, dass sie authentifiziertes NTP oder NTS verwenden? Sind die Zeitquellen vertrauenswürdig? Ist der Zeitsynchronisationsverkehr vor Manipulation geschützt, insbesondere beim Überschreiten von Netzwerkgrenzen?",
      "detectionLogic": "Dieses Risiko wird für sensible serverseitige technische Assets ausgelöst, die nicht explizit als mit einem sicheren Zeitsynchronisationsmechanismus (`@SecureTimeSync`) gekennzeichnet sind. Die Annahme ist, dass diese Assets auf eine Zeitquelle (wie NTP) angewiesen und anfällig sind, wenn das Protokoll nicht gesichert ist, insbesondere bei der Verarbeitung oder Speicherung sensibler Informationen, bei denen die Zeitgenauigkeit für Sicherheitskontrollen entscheidend ist.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung steigt, wenn das Asset dem Internet ausgesetzt ist oder über nicht vertrauenswürdige Netzwerkgrenzen kommuniziert. Die Auswirkung wird durch die CIA-Anforderungen des Assets und der von ihm verarbeiteten Daten bestimmt. Die Manipulation der Zeit auf einem System, das ",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn die Zeitsynchronisation durch andere, im Modell nicht sichtbare Mittel (z. B. IPsec auf Netzwerkebene) gesichert ist oder wenn das Asset in einer stark isolierten Umgebung betrieben wird, in der eine Manipulation des NTP-Verkehrs nicht durchführbar ist."
    },
    "lacking-cloud-strategy-ops.2.2.a1": {
      "title": "Fehlende oder unzureichende Strategie zur Cloud-Nutzung (BSI OPS.2.2.A1)",
      "description": "Die Nutzung von Cloud-Diensten ist eine strategische Entscheidung für eine Institution. Ohne eine klare und umfassende Strategie besteht das Risiko, ungeeignete Cloud-Dienste oder -Anbieter auszuwählen. Die gewählten Dienste könnten inkompatibel mit der bestehenden IT-Umgebung, internen Geschäftsprozessen oder dem erforderlichen Schutzniveau für die betreffenden Daten sein.",
      "impact": "Eine unzureichende Cloud-Strategie kann zu organisatorischen, technischen und finanziellen Konsequenzen führen. Sie kann Geschäftsprozesse behindern, das Erreichen strategischer Ziele verhindern und die Gesamtsicherheit erheblich reduzieren, was potenziell zu Compliance-Verstößen, Datenschutzverletzungen und Dienstunterbrechungen führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.2.2 Cloud-Nutzung, Anforderung OPS.2.2.A1 (Erstellung einer Strategie für die Cloud-Nutzung).",
      "action": "Entwicklung und Dokumentation einer umfassenden Cloud-Strategie",
      "mitigation": "Definieren Sie eine formale Strategie für die Cloud-Nutzung, bevor Sie Cloud-Dienste einführen. Diese Strategie sollte Kriterien für die Anbieterauswahl, Data Governance, Sicherheitsanforderungen (basierend auf dem Schutzbedarf), Integration in bestehende Systeme, Exit-Strategien und Compliance-Verpflichtungen behandeln. Stellen Sie sicher, dass die Strategie allen relevanten Stakeholdern, einschließlich Architektur-, Entwicklungs- und Betriebsteams, kommuniziert und von ihnen verstanden wird. Die Existenz einer solchen Strategie kann im Modell durch das Taggen der entsprechenden Vertrauensgrenze mit `@CloudStrategy:Defined` dokumentiert werden.",
      "check": "Gibt es eine dokumentierte Strategie für die Cloud-Nutzung? Deckt sie Sicherheit, Compliance, Datenklassifizierung und Anbieterüberprüfung ab? Sind die genutzten Cloud-Dienste mit dieser Strategie abgestimmt?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jede Cloud-basierte Vertrauensgrenze der obersten Ebene ausgelöst, die im Modell gefunden wird (zum Beispiel Typen wie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein Risiko könnte auch dann gekennzeichnet werden, wenn eine robuste Cloud-Strategie existiert, die aber nicht im Modell dargestellt ist. Dieses Risiko kann als Falsch-Positiv betrachtet oder gemindert werden, indem das Tag `@CloudStrategy:Defined` auf die Cloud-Vertrauensgrenze angewendet wird, um anzuzeigen, dass eine strategische Überprüfung durchgeführt wurde."
    },
    "cloud-provider-dependency-ops-2-2": {
      "title": "Abhängigkeit von externem Cloud-Anbieter (BSI OPS.2.2)",
      "description": "Wenn eine Institution externe Cloud-Dienste nutzt, wird sie vom Cloud-Dienstanbieter abhängig. ",
      "impact": "Ein Ausfall oder eine böswillige Handlung des Cloud-Anbieters kann die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der Institution direkt beeinträchtigen.",
      "asvs": "BSI IT-Grundschutz Baustein OPS.2.2 (Cloud-Nutzung)",
      "action": "Abhängigkeit vom Cloud-Anbieter verwalten und ausreichende Aufsicht sicherstellen",
      "mitigation": "Implementieren Sie ein robustes Governance-Framework für die Cloud-Nutzung. Dies umfasst eine gründliche Überprüfung der Anbieter (z. B. Prüfung von Zertifizierungen wie ISO 27001, C5), ",
      "check": "Gibt es einen formalen Überprüfungsprozess für Cloud-Anbieter? Sind starke SLAs für Sicherheit und Verfügbarkeit vertraglich festgelegt? ",
      "detectionLogic": "Erkennt technische Assets, die innerhalb einer Cloud-basierten Vertrauensgrenze betrieben werden (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit, abhängig zu sein, ist konstant, sobald ein Cloud-Dienst genutzt wird; daher wird sie als ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv oder erheblich reduziert sein, wenn das Asset in der Cloud unkritisch ist und die Organisation "
    },
    "lacking-requirements-management-for-cloud-usage-ops115": {
      "title": "Fehlendes Anforderungsmanagement für die Cloud-Nutzung (BSI OPS.2.2)",
      "description": "Wenn eine Institution sich für die Nutzung eines Cloud-Dienstes entscheidet, sind damit in der Regel viele Erwartungen verbunden. Zum Beispiel hoffen Mitarbeiter auf höhere Leistung oder ein breiteres Funktionsspektrum der ausgelagerten Dienste, während das Management niedrigere Kosten erwartet. Ein fehlendes Anforderungsmanagement vor der Cloud-Nutzung kann jedoch dazu führen, dass diese Erwartungen nicht erfüllt werden und der Dienst den gewünschten Mehrwert nicht liefert, zum Beispiel in Bezug auf Verfügbarkeit, Sicherheit oder Compliance.",
      "impact": "Wenn der ausgewählte Cloud-Dienst die tatsächlichen geschäftlichen, technischen und sicherheitstechnischen Anforderungen nicht erfüllt, kann dies zu Betriebsstörungen, dem Nichterreichen von Geschäftszielen, unerwarteten Kosten und einer negativen Auswirkung auf die Verfügbarkeit, Leistung oder Sicherheit abhängiger Systeme führen. Dieses Risiko manifestiert sich als Nichterfüllung erwarteter Vorteile und kann potenzielle finanzielle Verluste oder Compliance-Verstöße verursachen.",
      "asvs": "V1.1.4: Stellen Sie sicher, dass Sicherheitsanforderungen für alle Anwendungskomponenten definiert und implementiert sind, einschließlich derjenigen, die sich auf Cloud-Dienste beziehen.",
      "action": "Etablierung eines formalen Prozesses für die Cloud-Einführung und das Anforderungsmanagement",
      "mitigation": "Definieren und dokumentieren Sie klare geschäftliche, technische, sicherheitstechnische und Compliance-Anforderungen, bevor Sie einen Cloud-Dienst auswählen und integrieren. Bewerten Sie potenzielle Cloud-Anbieter und -Dienste anhand dieser definierten Anforderungen. Der Prozess sollte eine Kosten-Nutzen-Analyse, eine Risikobewertung des Anbieters und eine Überprüfung des Anbieters umfassen.",
      "check": "Gibt es einen dokumentierten Prozess zur Bewertung von Cloud-Diensten? Wurden vor der Einführung spezifische Verfügbarkeits-, Leistungs- und Sicherheitsanforderungen definiert? Wurde eine Kosten-Nutzen-Analyse durchgeführt und überprüft? Sind die SLAs des Cloud-Anbieters verstanden und akzeptiert?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes technische Asset ausgelöst, das als Teil einer Cloud-Umgebung identifiziert wird (d. h. sich innerhalb einer Cloud-Anbieter-Vertrauensgrenze befindet oder vom Maschinentyp serverless ist). Das Risiko kann pro Asset gemindert werden, indem das ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeitsanforderung des technischen Assets ab, das den Cloud-Dienst nutzt. Ein Dienst mit ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn ein gründlicher, wenn auch undokumentierter oder nicht getaggter, Anforderungsmanagementprozess tatsächlich befolgt wurde. Das Risiko dient als Anstoß, diesen Prozess zu überprüfen und zu dokumentieren."
    },
    "unclear-legal-framework-for-cloud": {
      "title": "Unklarer Rechtsrahmen für internationale Cloud-Anbieter (BSI-Stil)",
      "description": "Viele Anbieter bieten ihre Cloud-Dienste in einem internationalen Umfeld an, wodurch sie verschiedenen nationalen Rechtssystemen unterliegen. ",
      "impact": "Die Nutzung internationaler Cloud-Dienste ohne ein klares Verständnis des rechtlichen Rahmens kann zu einer Nichteinhaltung von Datenschutzgesetzen (wie @DataType:PII), ",
      "asvs": "BSI IT-Grundschutz OPS.2.2 Cloud-Nutzung (Cloud Usage), insbesondere Anforderung OPS.2.2.A1 (Strategie für die Cloud-Nutzung) und OPS.2.2.A9 (Vertragsgestaltung mit Cloud-Anbietern).",
      "action": "Durchführung einer rechtlichen und vertraglichen Due-Diligence-Prüfung für Cloud-Dienste",
      "mitigation": "Überprüfen Sie die für den Cloud-Anbieter geltenden rechtlichen und datenschutzrechtlichen Rahmenbedingungen gründlich. ",
      "check": "Hat der Cloud-Anbieter",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das sich innerhalb einer Cloud-basierten Vertrauensgrenze befindet (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn das modellierte "
    },
    "insufficient-tenant-isolation-in-cloud-environment": {
      "title": "Unzureichende Mandantentrennung in Cloud-Umgebung",
      "description": "Im Cloud-Computing teilen sich oft mehrere Mandanten eine gemeinsame Infrastruktur, einschließlich IT-Systemen, Netzwerken und Anwendungen. ",
      "impact": "Ein Bruch der Mandantentrennung kann zu schweren Datenschutzverletzungen führen und die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des betroffenen Mandanten gefährden.",
      "asvs": "V14.2.5: Überprüfen Sie, ob Cloud- oder Containerisierungslösungen so konfiguriert sind, dass eine starke Trennung zwischen Mandanten oder Containern gewährleistet ist, um Datenlecks oder unbefugten Zugriff zu verhindern.",
      "action": "Sicherstellung einer starken Mandantentrennung und -segmentierung",
      "mitigation": "Implementieren und überprüfen Sie starke logische und physische Isolationskontrollen zwischen den Mandanten. Verwenden Sie dedizierte Ressourcen (z. B. VPCs, dedizierte Hosts) für hochsensible Workloads. ",
      "check": "Ist das technische Asset für Multi-Tenancy konfiguriert? Sind die von der Cloud-Plattform oder dem Anwendungsframework bereitgestellten Isolationsmechanismen gemäß den bewährten Sicherheitspraktiken konfiguriert? ",
      "detectionLogic": "Das Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das als `multi-tenant: true` markiert ist. Die Schwere des Risikos wird auf der Grundlage der Sensibilität (CIA-Bewertungen) des Assets selbst und der von ihm verarbeiteten oder gespeicherten Daten-Assets berechnet.",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei eigens entwickelten Multi-Tenant-Plattformen höher als bei ausgereiften PaaS/SaaS-Angeboten von großen Cloud-Anbietern. Die Auswirkung ist direkt proportional zu den höchsten Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit der Daten, die von dem Multi-Tenant-Asset verarbeitet oder gespeichert werden. Eine Multi-Tenant-Datenbank, die ",
      "falsePositives": "Dieses Risiko könnte als Falsch-Positiv oder von geringerer Schwere betrachtet werden, wenn es sich bei dem Asset um ein gut etabliertes und gehärtetes SaaS/PaaS-Angebot eines seriösen Anbieters handelt, bei dem die Mandantentrennung ein zentrales, geprüftes Merkmal ist. Selbst in diesen Fällen kann eine Fehlkonfiguration durch den Nutzer des Dienstes die Trennung schwächen, sodass das Risiko oft relevant bleibt."
    },
    "inadequate-cloud-provider-contracts-con2": {
      "title": "Unzureichende vertragliche Vereinbarungen mit Cloud-Dienstanbietern (BSI OPS.2.2)",
      "description": "Unzureichende vertragliche Vereinbarungen mit Cloud-Dienstanbietern können zu erheblichen und schwerwiegenden Sicherheitsproblemen führen. ",
      "impact": "Dies kann zu nicht implementierten oder schwachen Sicherheitskontrollen, ungeklärten Verantwortlichkeiten bei Vorfällen und Risiken durch nicht offengelegte Unterauftragsverarbeiter führen, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.2.2 (Cloud-Nutzung)",
      "action": "Überprüfung und Verbesserung von Verträgen mit Cloud-Dienstanbietern",
      "mitigation": "Stellen Sie sicher, dass Verträge mit Cloud-Dienstanbietern alle Sicherheitsanforderungen, Verantwortlichkeiten (auch für Unterauftragsverarbeiter), ",
      "check": "Gibt es formale, rechtlich geprüfte Verträge für alle Cloud-Dienste? Legen diese Verträge explizit die Sicherheitsverantwortlichkeiten fest, ",
      "detectionLogic": "Dieses organisatorische Risiko wird für alle technischen Assets ausgelöst, die als Teil eines externen oder Cloud-basierten Dienstleistungsangebots identifiziert werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei Diensten, die kritische Daten verarbeiten oder dem Internet ausgesetzt sind, als höher angesehen, da die Komplexität der vertraglichen Anforderungen zunimmt. ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet werden, wenn die Organisation robuste, gut definierte Verträge und Lieferantenmanagementprozesse für den identifizierten Cloud-Dienst etabliert hat. "
    },
    "insufficient-logging-of-web-components": {
      "title": "Unzureichende Protokollierung von Web-Komponenten (BSI APP.3.1)",
      "description": "Wenn sicherheitsrelevante Ereignisse einer Webanwendung oder eines Webdienstes unzureichend protokolliert werden, ",
      "impact": "Ohne angemessene Protokolle können Organisationen Sicherheitsvorfälle nicht effektiv erkennen, untersuchen oder darauf reagieren. ",
      "asvs": "BSI IT-Grundschutz APP.3.1 Webanwendungen und Webservices",
      "action": "Implementierung einer umfassenden Protokollierung für Web-Komponenten",
      "mitigation": "Stellen Sie sicher, dass alle sicherheitsrelevanten Ereignisse für Webanwendungen und Webdienste protokolliert werden. Dies umfasst unter anderem: ",
      "check": "Werden Sicherheitsereignisse wie Anmeldungen, Konfigurationsänderungen und Fehler protokolliert? Sind die Protokolle vor unbefugtem Zugriff oder Änderung geschützt? ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als Webanwendungen, Webserver oder Webdienste identifiziert werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit dieser Schwachstelle wird bei eigens entwickelten Teilen als hoch angesehen, da die Sicherheitsprotokollierung häufig unvollständig ist. ",
      "falsePositives": "Ein technisches Asset führt möglicherweise selbst keine Protokollierung durch, könnte aber alle relevanten Informationen an eine zentrale Protokollierungskomponente oder ein SIEM weiterleiten. "
    },
    "information-leakage-about-backend-systems": {
      "title": "Informationslecks über Backend-Systeme durch HTTP-Header oder Fehlermeldungen",
      "description": "Websites und Daten, die von einer Webanwendung oder einem Webdienst generiert und bereitgestellt werden, können Informationen über die zugrunde liegenden Backend-Systeme enthalten, wie z. B. Details zu Datenbanken, Servertypen oder Framework-Versionsnummern (z. B. in `Server`- oder `X-Powered-By`-HTTP-Headern oder in ausführlichen Fehlermeldungen). Diese Informationen erleichtern es Angreifern erheblich, gezielte Angriffe zu starten, indem sie nach bekannten Schwachstellen für die identifizierten Technologien suchen.",
      "impact": "Die Offenlegung technischer Details über die Backend-Infrastruktur (wie Servertypen, Framework-Versionen oder interne Fehlerdetails) bietet Angreifern einen klaren Fahrplan, um bekannte Schwachstellen zu finden und ihre Exploits anzupassen. Dies senkt den für einen erfolgreichen Angriff erforderlichen Aufwand erheblich und erhöht die Wahrscheinlichkeit einer Kompromittierung.",
      "asvs": "V14.1.2: Überprüfen Sie, ob die Anwendung keine sensiblen Informationen in HTTP-Antwortheadern preisgibt, wie z. B. detaillierte Versionsinformationen des Web- oder Anwendungsservers oder der verwendeten Frameworks.",
      "action": "Härtung der Webserver- und Anwendungskonfiguration, um Banner und Fehler zu unterdrücken",
      "mitigation": "Konfigurieren Sie Webserver, Anwendungsserver und Frameworks so, dass detaillierte Versionsbanner und andere sensible technische Informationen in HTTP-Antwortheadern (z. B. `Server`, `X-Powered-By`, `X-AspNet-Version`) unterdrückt werden. Implementieren Sie benutzerdefinierte, generische Fehlerseiten, die keine internen Stack-Traces, Datenbankfehler oder andere Implementierungsdetails preisgeben. Scannen Sie die Anwendung regelmäßig, um Informationslecks zu erkennen.",
      "check": "Werden HTTP-Antwortheader und Fehlerseiten überprüft, um sicherzustellen, dass sie keine Details zur Backend-Technologie preisgeben? Sind die Serverkonfigurationen so eingestellt, dass Versionsbanner und andere Fingerabdrücke verborgen werden? Werden für alle Arten von serverseitigen Ausnahmen benutzerdefinierte Fehlerseiten verwendet?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als Webserver, Webanwendung, Anwendungsserver oder Webdienst (typischerweise REST-basiert) identifiziert werden. Diese Arten von Assets sind anfällig für Informationslecks durch HTTP-Header oder Fehlerseiten, wenn sie nicht ordnungsgemäß gehärtet sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Risiko kann als Falsch-Positiv betrachtet werden, wenn das Asset bereits ordnungsgemäß gehärtet wurde, um alle unnötigen technischen Informationen sowohl in HTTP-Headern als auch in Fehlermeldungen zu unterdrücken. Dies erfordert eine manuelle Überprüfung des Assets."
    },
    "automated-threats-bsi-app3.1": {
      "title": "Automatisierte Bedrohungen (z. B. Brute-Force, Enumeration, DoS)",
      "description": "Wenn Funktionen einer Webanwendung oder eines Webdienstes automatisiert werden, können zahlreiche Operationen in kurzer Zeit ausgeführt werden. ",
      "impact": "Ein unzureichender Schutz vor automatisierten Angriffen kann zur Kompromittierung von Anmeldeinformationen durch Brute-Forcing, zur Offenlegung sensibler Informationen durch Konto-Enumeration und zur Beeinträchtigung oder zum vollständigen Verlust der Dienstverfügbarkeit (DoS) führen. Dies kann zu unbefugtem Zugriff, Datenschutzverletzungen und Störungen des Geschäftsbetriebs führen.",
      "asvs": "BSI IT-Grundschutz APP.3.1.A7 (Schutz vor unberechtigter automatisierter Nutzung), OWASP Top 10 2021: A07 – Identification and Authentication Failures, OWASP Automated Threat Handbook (OAT-007 Credential Cracking, OAT-012 Account Enumeration, OAT-018 Denial of Service)",
      "action": "Implementierung von Schutzmaßnahmen gegen unberechtigte automatisierte Nutzung",
      "mitigation": "Implementieren Sie robuste Schutzmechanismen gegen automatisierte, hochfrequente Anfragen. Zu den wichtigsten Kontrollen gehören: ",
      "check": "Sind sensible Endpunkte wie Login und Registrierung durch Ratenbegrenzung geschützt? Gibt es eine Richtlinie zur Kontosperrung bei fehlgeschlagenen Authentifizierungsversuchen? Sind CAPTCHAs oder ähnliche Bot-Erkennungsmechanismen vorhanden? Gibt es eine Überwachung auf ungewöhnliche Anfragevolumina?",
      "detectionLogic": "Dieses Risiko wird für dem Internet ausgesetzte oder kritische interne Webanwendungen, Webdienste und Identitätsanbieter ausgelöst, die nicht explizit als gegen automatisierte Angriffe geschützt gekennzeichnet sind (z. B. über das ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Assets, die dem Internet ausgesetzt sind, insbesondere bei Identitätsanbietern, deutlich erhöht. Die Auswirkung wird durch die Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des Assets und der von ihm verarbeiteten Daten bestimmt. Ein Angriff auf einen Identitätsanbieter oder ein System, das streng vertrauliche Daten verarbeitet, hat eine sehr hohe Auswirkung.",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn Schutzmechanismen vorhanden sind, die aber nicht im Modell über das angegebene Tag dokumentiert sind. Eine Überprüfung erfordert die Prüfung der Anwendung."
    },
    "weak-authentication": {
      "title": "Schwache oder fehlende Authentifizierung für Webanwendung / Webdienst",
      "description": "Oft sollten spezielle Funktionen einer Webanwendung oder eines Webdienstes bestimmten Benutzergruppen vorbehalten sein. ",
      "impact": "Die Umgehung der Authentifizierung kann zu unbefugtem Zugriff auf Daten und Funktionen führen, was zu Datenschutzverletzungen, finanziellen Verlusten und Reputationsschäden führt. ",
      "asvs": "V2 Authentifizierungs-Verifizierungsanforderungen, V3 Identifizierungs- und Authentifizierungsfehler",
      "action": "Implementierung starker Authentifizierung und Sitzungsverwaltung",
      "mitigation": "Erzwingen Sie eine starke Authentifizierung für alle sensiblen Endpunkte von Webanwendungen und Webdiensten. ",
      "check": "Wird die Authentifizierung auf allen Kommunikationsverbindungen zu Webanwendungen und Webdiensten erzwungen, die nicht explizit öffentlich sind? ",
      "detectionLogic": "Diese Regel sucht nach Webanwendungen und Webdiensten, die eingehende Kommunikationsverbindungen mit schwacher oder keiner Authentifizierung haben. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn auf einer dem Internet ausgesetzten oder grenzüberschreitenden Verbindung keine Authentifizierung vorhanden ist. ",
      "falsePositives": "Endpunkte, die öffentlich sein sollen (z. B. eine Anmeldeseite selbst, öffentliche Datenfeeds), könnten fälschlicherweise gekennzeichnet werden. "
    },
    "inadequate-outsourcing-security-strategy-con6": {
      "title": "Unzureichende Outsourcing-Sicherheitsstrategie (BSI OPS.2.3)",
      "description": "Eine unzureichende Strategie führt dazu, dass die Informationssicherheit bei Outsourcing-Projekten nicht richtig berücksichtigt wird. ",
      "impact": "Dies kann Geschäftsprozesse beeinträchtigen oder zum Scheitern bringen und dazu führen, dass sensible Informationen an unbefugte Dritte gelangen, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.2.3 (Nutzung von Outsourcing)",
      "action": "Entwicklung und Durchsetzung einer umfassenden Outsourcing-Sicherheitsstrategie",
      "mitigation": "Etablieren und erzwingen Sie eine umfassende Sicherheitsstrategie für alle Outsourcing-Engagements. Diese Strategie sollte Folgendes beinhalten: ",
      "check": "Gibt es eine dokumentierte Strategie für das Sicherheitsmanagement beim Outsourcing? Sind Sicherheitsanforderungen Teil der Verträge mit Anbietern? Wird der Anbieter ",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung von einem im Geltungsbereich befindlichen Asset zu einem technischen Asset des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht die Existenz eines robusten, realen Outsourcing-Governance-Prozesses. Wenn für einen bestimmten ausgelagerten Dienst eine ordnungsgemäße Strategie vorhanden ist, kann dieses Risiko für diesen Kontext als Falsch-Positiv betrachtet werden."
    },
    "improper-outsourcing-termination-process": {
      "title": "Unsachgemäßer Prozess zur Beendigung des Outsourcings (BSI DER.1.A15)",
      "description": "Unzureichende oder fehlende Regelungen zur Beendigung eines Outsourcing-Verhältnisses können dazu führen, dass Hardware, Daten und Zugriffsrechte nicht ordnungsgemäß an den Auftraggeber zurückübertragen werden. Dies kann zu Datenverlust, fortgesetztem unbefugtem Zugriff durch den ehemaligen Outsourcing-Partner und Störungen des Geschäftsbetriebs führen.",
      "impact": "Ein Versäumnis bei der ordnungsgemäßen Verwaltung des Beendigungsprozesses kann die Vertraulichkeit (wenn der Outsourcer Daten/Zugriff behält), die Integrität (wenn Daten unvollständig oder beschädigt zurückgegeben werden) und die Verfügbarkeit (wenn das Unternehmen den Zugriff auf kritische Daten oder Dienste verliert, die für seinen Betrieb erforderlich sind) erheblich beeinträchtigen.",
      "asvs": "BSI IT-Grundschutz DER.1.A15 (Regelungen zur Vertragsbeendigung)",
      "action": "Definition und Implementierung eines formalen Offboarding-Prozesses für Outsourcing-Partner",
      "mitigation": "Etablieren Sie klare, vertragliche Regelungen für die Beendigung des Outsourcing-Verhältnisses. Diese müssen Verfahren für die sichere, zertifizierte Löschung von Daten beim Outsourcer umfassen.",
      "check": "Gibt es einen dokumentierten und vertraglich vereinbarten Offboarding-Plan für jedes Outsourcing-Verhältnis? Deckt der Plan die Rückgabe von Daten, die Löschung von Daten, den Entzug von Zugriffen und die Übertragung von Hardware ab? Gibt es Verfahren zur Überprüfung des Abschlusses des Offboarding-Prozesses?",
      "detectionLogic": "Dieses Risiko wird für jeden ",
      "riskAssessment": "Die Auswirkung hängt direkt von den höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen aller mit dem Outsourcing-Partner ausgetauschten Daten-Assets ab. Wenn unternehmenskritische Systeme oder streng vertrauliche Daten beteiligt sind, wird die Auswirkung als sehr hoch angesehen. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird basierend auf dem Modell "
    },
    "inadequate-emergency-management-for-outsourcing": {
      "title": "Unzureichendes Notfallmanagement für ausgelagerte Dienste (BSI CON.1)",
      "description": "Im Falle einer Störung, eines Notfalls oder einer Krise kann ein unzureichendes Notfallmanagement für ausgelagerte Dienste zum Ausfall des Dienstes führen. ",
      "impact": "Die unzureichende Planung für die Nichtverfügbarkeit eines kritischen ausgelagerten Dienstes kann zu einem erheblichen Denial-of-Service für die abhängigen Systeme führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Notfallmanagement)",
      "action": "Etablierung und Überprüfung von Geschäftskontinuitätsplänen für kritische externe Abhängigkeiten",
      "mitigation": "Identifizieren Sie alle kritischen Geschäftsprozesse und die technischen Assets, von denen sie abhängen, insbesondere diejenigen, die externe Dienstleister involvieren. ",
      "check": "Sind kritische externe Abhängigkeiten identifiziert? Gibt es SLAs, die Verfügbarkeit und Wiederherstellung abdecken? Gibt es einen dokumentierten und getesteten Geschäftskontinuitätsplan für den Ausfall dieser Abhängigkeit?",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets mit ",
      "riskAssessment": "Die Auswirkung dieses Risikos leitet sich direkt aus der Verfügbarkeitsanforderung des technischen Assets ab, das vom ausgelagerten Dienst abhängt. ",
      "falsePositives": "Ein Geschäftskontinuitätsplan könnte auf organisatorischer Ebene existieren, ist aber nicht im Bedrohungsmodell über das Tag `@BCP:Confirmed` dokumentiert. Dieses Risiko sollte mit dem Systemarchitekten oder dem Betriebsteam bestätigt werden."
    },
    "uncontrolled-outsourcing-of-critical-processes": {
      "title": "Unkontrolliertes Outsourcing kritischer Prozesse (BSI CON.1)",
      "description": "Prozesse, die aufgrund ihrer Kritikalität oder Schutzanforderungen innerhalb der Institution verbleiben sollten, werden ausgelagert. ",
      "impact": "Ein Ausfall oder eine Störung eines kritischen ausgelagerten Prozesses kann die Geschäftskontinuität erheblich beeinträchtigen und zu finanziellen Verlusten und Reputationsschäden führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Outsourcing), Anforderung CON.1.A5 (Auswahl geeigneter Dienstleister) und CON.1.A6 (Erstellung von Outsourcing-Verträgen).",
      "action": "Etablierung eines formalen Outsourcing-Governance-Prozesses",
      "mitigation": "Implementieren Sie einen robusten Prozess zur Bewertung, Auswahl und Verwaltung von Outsourcing-Anbietern. ",
      "check": "Gibt es eine formale Richtlinie, die das Outsourcing von Dienstleistungen regelt? Werden Risikobewertungen durchgeführt, bevor kritische Prozesse ausgelagert werden? ",
      "detectionLogic": "Dieses Risiko wird ausgelöst, wenn ein technisches Asset, das explizit als kritisch für den internen Betrieb gekennzeichnet ist (`@Should-Not-Be-Outsourced`-Tag), eine Kommunikationsverbindung zu einer `External-Entity` hat. ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeits- und Integritätsbewertung des internen ausgelagerten Prozesses ab. ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn die `External-Entity` kein typischer Outsourcing-Anbieter ist, sondern beispielsweise eine staatliche Regulierungsbehörde, an die der Prozess gesetzlich berichten muss. "
    },
    "dependency-on-outsourcing-provider": {
      "title": "Abhängigkeit vom Outsourcing-Anbieter",
      "description": "Wenn sich eine Organisation für Outsourcing entscheidet, wird sie vom Outsourcing-Anbieter abhängig. Diese Abhängigkeit kann zu einem Verlust von internem Wissen und einem Verlust der vollen Kontrolle über die ausgelagerten Prozesse führen. ",
      "impact": "Eine starke Abhängigkeit von einem Outsourcing-Anbieter, gepaart mit einem Verlust an Kontrolle und Einblick, kann dazu führen, dass Sicherheitslücken unentdeckt und unbehandelt bleiben. ",
      "asvs": "BSI IT-Grundschutz-Kompendium: OPS.2.3 Nutzung von Outsourcing",
      "action": "Etablierung klarer Outsourcing-Verträge, Überwachung und Exit-Strategien",
      "mitigation": "Definieren Sie klare, rechtsverbindliche Verträge mit Outsourcing-Anbietern, die spezifische Sicherheitsanforderungen (SLAs), Prüfungsrechte und Datenschutzklauseln enthalten. ",
      "check": "Gibt es klare Verträge, die die Sicherheitsverantwortlichkeiten definieren? Werden die Anbieter",
      "detectionLogic": "Dieses Risiko wird durch die Identifizierung interner technischer Assets ausgelöst, die Kommunikationsverbindungen zu Assets vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die Kritikalität (Integrität und Verfügbarkeit) des abhängigen internen Assets und die Vertraulichkeit der an den externen Anbieter gesendeten Daten bestimmt. ",
      "falsePositives": "Diese Regel könnte geringfügige Abhängigkeiten von unkritischen externen Diensten (z. B. eine öffentliche, nicht wesentliche API) als Risiko kennzeichnen. "
    },
    "insufficient-outsourcing-security-standard-der.1": {
      "title": "Unzureichender Informationssicherheitsstandard beim Outsourcing (BSI DER.1)",
      "description": "Ein unzureichendes Niveau an Informationssicherheit beim Outsourcing-Kunden",
      "impact": "Wenn ein Outsourcing-Anbieter keine angemessene Sicherheit aufrechterhält, kann dies zu Datenschutzverletzungen, Systemkompromittierungen und Dienstausfällen führen. ",
      "asvs": "BSI IT-Grundschutz DER.1: Lieferanten- und Dienstleistermanagement; insbesondere DER.1.A5 (Überwachung der Informationssicherheit bei Lieferanten und Dienstleistern)",
      "action": "Etablierung, Durchsetzung und Überprüfung von Sicherheitsanforderungen für Outsourcing-Anbieter",
      "mitigation": "Definieren Sie klare und robuste Informationssicherheitsanforderungen für alle Outsourcing-Anbieter. Diese Anforderungen müssen in rechtsverbindliche Verträge aufgenommen werden. ",
      "check": "Sind Informationssicherheitsanforderungen in Verträgen mit Outsourcing-Anbietern enthalten? Gibt es einen formalen Prozess zur Bewertung der Sicherheitsposition neuer Anbieter? ",
      "detectionLogic": "Dieses Risiko gilt für alle ",
      "riskAssessment": "Die Auswirkung hängt direkt von den maximalen Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der vom externen Anbieter verarbeiteten Daten ab. Die Wahrscheinlichkeit ist ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn ein umfassender Prozess für das Lieferantensicherheitsmanagement vorhanden ist, einschließlich vertraglicher Anforderungen und regelmäßiger Audits, "
    },
    "inadequate-outsourcing-management": {
      "title": "Unzureichendes Outsourcing-Management (basierend auf BSI OPS.2.3)",
      "description": "Wenn das Outsourcing-Management nicht vorhanden oder nur teilweise implementiert ist, werden die laufenden ausgelagerten Prozesse unzureichend verwaltet. ",
      "impact": "Die Unfähigkeit, die Sicherheitspraktiken eines Outsourcing-Anbieters zu kontrollieren und zu überprüfen, kann zu Kompromittierungen der Vertraulichkeit, Integrität und Verfügbarkeit (CIA) für alle Daten-Assets führen, die an den Anbieter gesendet oder von ihm empfangen werden. ",
      "asvs": "BSI IT-Grundschutz OPS.2.3 (Nutzung von Outsourcing)",
      "action": "Etablierung und Aufrechterhaltung des Outsourcing-Managements und der Überwachung",
      "mitigation": "Implementieren Sie einen umfassenden Outsourcing-Managementprozess. Dies umfasst die Definition klarer Sicherheitsanforderungen in Verträgen (SLAs), die Einrichtung regelmäßiger Überwachungs- und Prüfverfahren für den Anbieter und die Aufrechterhaltung klarer Kommunikationswege. ",
      "check": "Gibt es Kommunikationsverbindungen zu externen Entitäten, bei denen der Nachweis einer verwalteten Beziehung fehlt (z. B. fehlendes `@Outsourcing:Managed`-Tag)? Werden Verträge mit diesen Anbietern auf Sicherheitsklauseln überprüft? Werden regelmäßig Audits oder Überprüfungen des Anbieters durchgeführt?",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung ausgelöst, die auf eine `External-Entity` abzielt und nicht explizit über das `@Outsourcing:Managed`-Tag als verwaltet gekennzeichnet ist. ",
      "riskAssessment": "Die Auswirkung ist direkt proportional zu den höchsten CIA-Anforderungen der Daten-Assets, die mit dem externen Anbieter ausgetauscht werden. Eine nicht verwaltete Verbindung zu einem Anbieter, der `Strictly-Confidential` Daten verarbeitet, stellt eine `sehr hohe` Auswirkung dar. ",
      "falsePositives": "Ein Falsch-Positiv kann auftreten, wenn in der Realität ein Outsourcing-Managementprozess existiert, die entsprechende Kommunikationsverbindung im Modell aber nicht mit `@Outsourcing:Managed` getaggt wurde. Das Modell spiegelt den Mangel an dokumentierter Zusicherung korrekt wider."
    },
    "inadequate-contractual-agreements-bsi-con-1-g2": {
      "title": "Unzureichende vertragliche Vereinbarungen mit Outsourcing-Anbietern (BSI CON.1.G2)",
      "description": "Unzureichende vertragliche Vereinbarungen mit Outsourcing-Anbietern können während des gesamten Outsourcing-Lebenszyklus zu Schwachstellen in der Informationssicherheit führen. Verträge definieren den Gesamtprozess und bilden die Grundlage für Ansprüche von Nutzern gegenüber Anbietern. Wenn Aufgaben, Leistungsparameter oder Aufwände unzureichend oder mehrdeutig beschrieben sind, werden Sicherheitsmaßnahmen möglicherweise aus Mangel an Wissen oder Ressourcen nicht umgesetzt.",
      "impact": "Das Versäumnis, Sicherheitsanforderungen in Outsourcing-Verträgen zu definieren, kann zur Nichterfüllung regulatorischer Anforderungen, zur Nichteinhaltung von Offenlegungspflichten und Gesetzen sowie zu einem unzureichenden Schutz des Nutzers führen.",
      "asvs": "BSI IT-Grundschutz CON.1.A5 (Anforderungen an Outsourcing-Verträge)",
      "action": "Etablierung klarer, umfassender und sicherer Outsourcing-Verträge",
      "mitigation": "Stellen Sie sicher, dass alle Outsourcing-Verträge explizit Anforderungen an die Informationssicherheit detaillieren, einschließlich Datenschutzstandards, Sicherheitsmaßnahmen, Protokollen zur Vorfallsreaktion, Prüfungsrechten und klaren Haftungsklauseln. Alle relevanten rechtlichen und regulatorischen Anforderungen müssen berücksichtigt werden. Verwenden Sie ein Tag wie `contract:reviewed` am relevanten technischen Asset im Modell, um zu kennzeichnen, dass dies geschehen ist.",
      "check": "Gibt es einen formalen Prozess zur Überprüfung von Outsourcing-Verträgen auf Sicherheitsanforderungen? Enthalten Verträge mit externen Anbietern spezifische Klauseln für den Umgang mit Daten, Sicherheitskontrollen, die Meldung von Vorfällen und das Recht auf Audit? Sind die Assets, die diese ausgelagerten Dienste repräsentieren, entsprechend getaggt (z. B. `provider:external` oder `out_of_scope`)?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes technische Asset ausgelöst, das als `out_of_scope` markiert oder mit `provider:external` getaggt ist, da diese typischerweise von Dritten verwaltete Dienste repräsentieren. Das Risiko geht davon aus, dass ohne explizite Bestätigung die vertragliche Grundlage für die Sicherheit unzureichend sein kann.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist ein Warnhinweis. Ein robuster Vertrag könnte vorhanden sein, auch wenn er nicht im Modell widergespiegelt wird. Das Risiko kann als Falsch-Positiv markiert oder gemindert werden, indem das `contract:reviewed`-Tag auf das Asset angewendet wird, nachdem die vertragliche Angemessenheit bestätigt wurde."
    },
    "inappropriate-rights-for-outsourced-personnel-con1": {
      "title": "Unangemessene Zugriffsrechte für ausgelagertes Personal (BSI CON.1)",
      "description": "Beim Outsourcing ist es oft notwendig, dass der Anbieter",
      "impact": "Eine unsachgemäße Verwaltung der Zugriffsrechte für externes Personal kann zu schweren Sicherheitsvorfällen führen, einschließlich Datenschutzverletzungen (Vertraulichkeit), unbefugter Datenänderung (Integrität) und Dienstunterbrechung (Verfügbarkeit). Dies kann zu erheblichen finanziellen Verlusten, Reputationsschäden und der Verletzung rechtlicher oder vertraglicher Verpflichtungen führen.",
      "asvs": "BSI IT-Grundschutz-Kompendium: CON.1 Outsourcing (insbesondere Anforderung CON.1.A15: Steuerung der Zugriffsmöglichkeiten und -rechte)",
      "action": "Implementierung und Durchsetzung des Prinzips der geringsten Rechte für ausgelagerte Zugriffe",
      "mitigation": "Setzen Sie das Prinzip der geringsten Rechte für alle Zugriffe durch, die externem Personal gewährt werden. Verwenden Sie starke, individuelle Authentifizierungsmethoden (z. B. Client-Zertifikate, Multi-Faktor-Authentifizierung) anstelle von gemeinsam genutzten Anmeldeinformationen. ",
      "check": "Sind alle Zugriffsrechte für externes Personal dokumentiert? Gibt es einen regelmäßigen Prozess zur Überprüfung und Rezertifizierung von Zugriffen? Wird das Prinzip der geringsten Rechte technisch durchgesetzt? Wird eine starke, nicht geteilte Authentifizierung für alle externen Zugriffe verwendet?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, die von technischen Assets ausgehen, die einen Outsourcing-Anbieter repräsentieren (gekennzeichnet mit `@Role:ExternalServiceProvider`), und die sich mit im Geltungsbereich befindlichen Assets verbinden. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, wenn die Authentifizierung oder Autorisierung fehlt. Die Auswirkung wird durch die Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit des Ziel-Assets bestimmt. ",
      "falsePositives": "Ein Risiko könnte für ein legitimes, stark kontrolliertes administratives Zugriffsszenario gekennzeichnet werden, bei dem kompensierende Kontrollen (z. B. vertragliche Vereinbarungen, kontinuierliche Überwachung, Sitzungsaufzeichnung) im Modell nicht sichtbar sind."
    },
    "lack-of-control-over-subcontractors": {
      "title": "Mangelnde Kontrolle über Subunternehmer (BSI DER.1.A8)",
      "description": "Outsourcing-Anbieter können Teile ihrer Dienstleistungen an Subunternehmer delegieren. Dies erhöht die Komplexität des Outsourcing-Prozesses und verringert die Transparenz für den Kunden. ",
      "impact": "Wenn Sicherheitsanforderungen nicht an Subunternehmer weitergegeben und durchgesetzt werden, kann dies zu nicht geminderten Schwachstellen in der Dienstleistungskette führen. ",
      "asvs": "BSI IT-Grundschutz DER.1: Allgemeines Dienstleistermanagement (Anforderung DER.1.A8: Steuerung von Subunternehmern)",
      "action": "Etablierung und Durchsetzung von Sicherheitsanforderungen für Subunternehmer",
      "mitigation": "Verlangen Sie vertraglich vom Outsourcing-Anbieter, die Nutzung von Subunternehmern offenzulegen. ",
      "check": "Enthalten Verträge mit Dienstleistern Klauseln zur Steuerung von Subunternehmern? Sind uns alle Subunternehmer bekannt, die unsere Daten verarbeiten? ",
      "detectionLogic": "Dieses Risiko wird für jeden ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Ein Anbieter könnte ein ausgezeichnetes und transparentes Subunternehmer-Management haben. Dies kann nicht allein aus dem Bedrohungsmodell bestimmt werden und erfordert die Überprüfung von Verträgen und Prüfberichten."
    },
    "insufficient-outsourcing-control-der1.a6": {
      "title": "Unzureichende Kontrolle und Überwachung von Outsourcing-Anbietern (BSI DER.1.A6)",
      "description": "Wenn einer Institution angemessene Instrumente wie Leistungskennzahlen (KPIs) und Prüfungsrechte fehlen, um ihre Outsourcing-Anbieter zu überwachen und zu kontrollieren, kann sie nicht effektiv überprüfen, ob die ausgelagerten Prozesse korrekt und sicher umgesetzt werden. Dieser Mangel an Kontroll- und Steuerungsmechanismen hindert die Institution daran, sicherzustellen, dass die vertraglich vereinbarten Sicherheitsanforderungen vom Anbieter erfüllt werden.",
      "impact": "Die Unfähigkeit, schlechte Leistung oder Sicherheitsmängel bei einem Outsourcing-Anbieter zu erkennen und darauf zu reagieren, kann zu einer allmählichen Verschlechterung der Sicherheit führen. Dies kann zu Vertraulichkeitsverletzungen, Integritätsverlusten oder Verfügbarkeitsproblemen für die vom Anbieter gehandhabten Dienste und Daten führen, oft ohne dass die Institution ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein DER.1 (Lieferanten- und Dienstleistermanagement), insbesondere Anforderung DER.1.A6 (Überprüfung der Dienstleistungen von Lieferanten und Dienstleistern).",
      "action": "Etablierung und Implementierung eines Überprüfungs- und Auditprozesses für Lieferanten",
      "mitigation": "Definieren und vereinbaren Sie vertraglich klare, messbare Leistungskennzahlen (KPIs) und Service Level Agreements (SLAs) für die Sicherheit. Implementieren Sie einen regelmäßigen Überprüfungsprozess, der Prüfungsrechte, Leistungsberichte und regelmäßige Treffen mit dem Anbieter umfasst. Stellen Sie sicher, dass Prüfungsrechte und der Zugang zu notwendigen Informationen zur Überprüfung Teil des Vertrags sind. Die Ergebnisse dieser Überprüfungen müssen dokumentiert und alle festgestellten Mängel müssen bis zur Behebung nachverfolgt werden.",
      "check": "Gibt es formale, vertraglich definierte KPIs und SLAs für die Sicherheit mit dem Outsourcing-Anbieter? Existiert ein regelmäßiger Überprüfungs- und Auditprozess? Werden die Ergebnisse dieser Überprüfungen dokumentiert? Gibt es definierte Verfahren zur Eskalation und Behebung von Nichterfüllung?",
      "detectionLogic": "Dieses Risiko gilt für technische Assets des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell kann nur das Vorhandensein einer ausgelagerten Beziehung über den Asset-Typ und Tags identifizieren. Es kann keine vertraglichen Details oder die realen Überprüfungsprozesse kennen. Ein Risiko wird basierend auf dem Modell gekennzeichnet, ist aber ein Falsch-Positiv, wenn ein robuster, realer Lieferantenmanagement- und Überprüfungsprozess vorhanden ist, auch wenn er nicht mit spezifischen Tags modelliert wurde."
    },
    "deficient-ism-at-outsourcer-bsi-orp2-a5": {
      "title": "Mangelhaftes Informationssicherheitsmanagement beim Outsourcing-Anbieter (BSI ORP.2.A5)",
      "description": "Ein mangelhaftes Informationssicherheits-Managementsystem (ISMS) bei einem Outsourcing-Anbieter kann zur unzureichenden Erfüllung von Informationssicherheitszielen (Vertraulichkeit, Integrität, Verfügbarkeit) führen. ",
      "impact": "Das Nichterfüllen vertraglich vereinbarter Sicherheitsziele kann zu Datenschutzverletzungen, Dienstunterbrechungen, finanziellen Verlusten, Reputationsschäden und Nichteinhaltung gesetzlicher oder regulatorischer Anforderungen (z. B. personenbezogene Daten (PII)) führen.",
      "asvs": "BSI IT-Grundschutz ORP.2: Lieferanten- und Dienstleistermanagement, insbesondere Anforderung ORP.2.A5: Überwachung der Informationssicherheit bei Lieferanten und Dienstleistern.",
      "action": "Implementierung und Durchsetzung des Lieferantensicherheitsmanagements",
      "mitigation": "Etablieren Sie einen robusten Prozess für das Lieferantensicherheitsmanagement. Dies umfasst eine gründliche Due-Diligence-Prüfung vor dem Onboarding, klare vertragliche Sicherheitsanforderungen (SLAs), ",
      "check": "Gibt es formale Verträge mit Sicherheits-SLAs für alle Outsourcing-Anbieter? Wird eine Due-Diligence-Prüfung durchgeführt? Werden die Sicherheitskontrollen des Anbieters regelmäßig überprüft oder auditiert? Sind Datenverarbeitungsvereinbarungen vorhanden?",
      "detectionLogic": "Dieses Risiko wird automatisch für jeden ",
      "riskAssessment": "Die Auswirkung ist direkt proportional zur Sensibilität (CIA-Bewertungen) der mit dem Anbieter ausgetauschten Daten-Assets. ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet oder herabgestuft werden, wenn für den spezifischen Anbieter ein sehr starker, gut dokumentierter und geprüfter Lieferantenmanagementprozess vorhanden ist, auch wenn dieser nicht explizit modelliert wurde. "
    },
    "inadequate-outsourcer-contingency-planning": {
      "title": "Unzureichende Notfallplanung des Outsourcing-Anbieters (BSI CON.1, CON.8)",
      "description": "Wenn bei einem Outsourcing-Anbieter Störungen oder Notfälle auftreten, kann dies zu Betriebsausfällen führen, die auch die ausgelagerten Prozesse des Kunden betreffen und dessen regulären Geschäftsbetrieb beeinträchtigen. ",
      "impact": "Ein Mangel an effektiver Notfallvorsorge beim Anbieter kann Störungen und Krisen für die Kundeninstitution unkontrollierbar machen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium Baustein CON.1 (Outsourcing) und CON.8 (Notfallmanagement).",
      "action": "Überprüfung und Sicherstellung des Lieferanten",
      "mitigation": "Etablieren Sie starke vertragliche Anforderungen für den Outsourcing-Anbieter.",
      "check": "Gibt es vertragliche Vereinbarungen bezüglich des Anbieters?",
      "detectionLogic": "Dieses Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das eine Kommunikationsverbindung zu einem Asset des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Ausfalls mit Auswirkungen ist bei Abhängigkeiten von einzelnen, nicht redundanten externen Anbietern höher. Die Auswirkung ist direkt proportional zum ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn der Outsourcing-Anbieter nachweislich robuste und geprüfte Notfallpläne hat, die die Anforderungen des Kunden erfüllen oder übertreffen."
    },
    "inadequate-outsourcing-contracts-der1.a5": {
      "title": "Unzureichende Outsourcing-Verträge (BSI DER.1.A5)",
      "description": "Mängel in der vertraglichen Gestaltung für ausgelagerte Dienstleistungen können zu unzureichender Informationssicherheit für die ausgelagerten Prozesse führen. ",
      "impact": "Wenn Sicherheitsanforderungen nicht vertraglich definiert und mit einem externen Dienstleister durchgesetzt werden, kann dies zur Kompromittierung von Vertraulichkeit, Integrität oder Verfügbarkeit führen. ",
      "asvs": "BSI IT-Grundschutz Baustein DER.1: Outsourcing an externe Dienstleister, Anforderung DER.1.A5: Definition und Überprüfung von Sicherheitsanforderungen in Verträgen.",
      "action": "Definition, Durchsetzung und Überprüfung von Sicherheitsanforderungen in allen Outsourcing-Verträgen",
      "mitigation": "Stellen Sie sicher, dass alle Verträge mit externen Dienstleistern klare, umfassende und durchsetzbare Informationssicherheitsanforderungen enthalten. ",
      "check": "Werden alle Verträge mit externen Dienstleistern auf Sicherheitsanforderungen überprüft? Enthalten sie Klauseln zum Datenschutz, zur Vorfallsbehandlung und zu Prüfungsrechten? ",
      "detectionLogic": "Dieses Risiko wird automatisch für jedes technische Asset des Typs `external-entity` ausgelöst, das sich im Geltungsbereich befindet und nicht das Tag `contract:security-clauses-verified` hat. ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die höchsten Anforderungen an Vertraulichkeit, Integrität und Verfügbarkeit der mit dem externen Dienstleister ausgetauschten Daten-Assets bestimmt. ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet werden, wenn ein sicherer Vertrag vorhanden ist, das entsprechende Asset im Modell aber noch nicht mit `contract:security-clauses-verified` getaggt wurde. "
    },
    "weak-outsourcing-interface": {
      "title": "Schwäche an der Outsourcing-Schnittstelle (Technische/Organisatorische Schwachstellen an der Outsourcing-Schnittstelle)",
      "description": "Die technische Verbindung zwischen Outsourcing-Nutzern und -Anbietern kann technische und organisatorische Schwachstellen an den Schnittstellen mit sich bringen. ",
      "impact": "Wenn technische oder organisatorische Schwachstellen an einer Outsourcing-Schnittstelle ausgenutzt werden, kann dies zu Datenschutzverletzungen (Vertraulichkeit), unbefugter Datenänderung (Integrität) oder Dienstunterbrechungen (Verfügbarkeit) führen. ",
      "asvs": "OWASP Application Security Verification Standard (ASVS) V13 (Kommunikationssicherheit)",
      "action": "Stärkung und Formalisierung der Outsourcing-Schnittstelle",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen zu Outsourcing-Anbietern technisch mit starker Verschlüsselung (z. B. VPN, TLS/HTTPS, SFTP) und robuster Authentifizierung (z. B. mTLS, OAuth 2.0) gesichert sind. ",
      "check": "Ist die Kommunikation mit dem Outsourcing-Anbieter verschlüsselt? Wird eine starke Authentifizierung erzwungen? Ist die Verbindung durch ein VPN oder IP-Filterung geschützt? ",
      "detectionLogic": "Diese Regel prüft auf Kommunikationsverbindungen zu externen Entitäten, die als Outsourcing-Anbieter ausgewiesen sind. ",
      "riskAssessment": "Die Auswirkung wird durch die Sensibilität (CIA-Bewertungen) der über die Kommunikationsverbindung übertragenen Daten-Assets bestimmt. Eine Verbindung, die ",
      "falsePositives": "Dieses Risiko könnte gekennzeichnet werden, wenn das Modell nicht alle kompensierenden Kontrollen vollständig erfasst (z. B. Verschlüsselung auf Anwendungsebene innerhalb eines technisch unverschlüsselten Kanals). "
    },
    "critical-dependency-on-outsourcer-subcontractor": {
      "title": "Kritische Abhängigkeit vom Outsourcer",
      "description": "Wenn ein Outsourcing-Anbieter Aktivitäten an Subunternehmer delegiert, besteht das Risiko, dass diese Subunternehmer ihre Position ausnutzen, um Forderungen zu stellen oder vertragliche Verpflichtungen zu missachten. Dies schafft eine kritische Abhängigkeit von einem Dritten, um die Dienstleistungen des Kunden zu erbringen. Wenn der Outsourcing-Anbieter eine Störung oder einen Ausfall eines Subunternehmers nicht kompensieren kann, wird die Abhängigkeit zu einer harten Abhängigkeit, die den Subunternehmer in eine vorteilhafte Position bringt. Der Subunternehmer könnte dann die vertraglich vereinbarte Qualität und das Niveau der Informationssicherheit nicht aufrechterhalten.",
      "impact": "Diese Abhängigkeit kann die Outsourcing-Beziehung untergraben. Für den direkten Kunden (das modellierte System) kann dies zu einer Verschlechterung oder einem Ausfall der Dienstleistung führen. Für den Outsourcing-Anbieter kann dies zu rechtlichen und finanziellen Konsequenzen sowie zu Reputationsschäden führen, was die Dienststabilität weiter beeinträchtigt.",
      "asvs": "BSI IT-Grundschutz: OPS.3.2 Anbieten von Outsourcing. Dies bezieht sich auch auf allgemeine Prinzipien der Lieferkettensicherheit, wie sie in NIST SP 800-161 (Supply Chain Risk Management) und OWASP Top 10 A06:2021 – Vulnerable and Outdated Components behandelt werden.",
      "action": "Risiken von Subunternehmern in Outsourcing-Vereinbarungen verwalten und mindern",
      "mitigation": "Stellen Sie sicher, dass Outsourcing-Verträge die Nutzung von Subunternehmern explizit regeln. Die Vereinbarung sollte das Recht einräumen, Subunternehmer zu auditieren oder zu bewerten, oder den Hauptanbieter verpflichten, gleichwertige Sicherheitsstandards bei ihnen durchzusetzen. Der Hauptanbieter muss einen dokumentierten und getesteten Geschäftskontinuitätsplan haben, um Ausfälle von Subunternehmern zu bewältigen. Bei kritischen Dienstleistungen sollten vertragliche Anforderungen für den Anbieter in Betracht gezogen werden, redundante Subunternehmer oder eine interne Ausweichlösung zu haben. Im Modell, wenn eine redundante Einrichtung existiert, markieren Sie das entsprechende technische Asset als `redundant: true`.",
      "check": "Deckt die Outsourcing-Vereinbarung die Nutzung von Subunternehmern ab? Gibt es definierte Sicherheitsanforderungen für Subunternehmer? Hat der Anbieter einen Notfallplan für den Ausfall von Subunternehmern? Ist die bereitgestellte Dienstleistung redundant ausgelegt?",
      "detectionLogic": "Diese Regel wird für technische Assets des Typs ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als ",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn robuste vertragliche Kontrollen, anbieterseitige Notfallpläne und Überprüfungsprozesse für Subunternehmer vorhanden sind, die das Risiko eines Single Point of Failure angemessen mindern, auch wenn der Dienst technisch redundant ist."
    },
    "improper-directory-service-config-for-outsourcing": {
      "title": "Unsachgemäße Konfiguration des Verzeichnisdienstes für externe Partner (BSI-Stil)",
      "description": "Ein unsachgemäß oder unzureichend konfigurierter zentraler Verzeichnisdienst – insbesondere in Szenarien mit externen Partnern (z. B. Outsourcing-Kunden) – kann dazu führen, dass Benutzer übermäßige Berechtigungen erhalten. Dies kann unbefugten Zugriff auf sensible oder personenbezogene Daten des Dienstleisters oder anderer Kunden ermöglichen und verstößt gegen die Prinzipien der geringsten Rechte und der Mandantentrennung.",
      "impact": "Wenn übermäßige Berechtigungen gewährt oder ausgenutzt werden, sind die Integrität und Vertraulichkeit von Daten gefährdet. Dies kann zu Datenschutzverletzungen, Vertragsstrafen, Reputationsschäden für den Anbieter und seine Kunden sowie zur Nichteinhaltung von Compliance-Anforderungen führen.",
      "asvs": "ASVS V4: Zugriffskontrolle",
      "action": "Härtung der Verzeichnisdienstkonfiguration und Überprüfung der Zugriffsrechte",
      "mitigation": "Implementieren Sie ein robustes Zugriffskontrollmodell, das auf dem Prinzip der geringsten Rechte basiert. Der Zugriff externer Partner sollte strikt getrennt sein, idealerweise in einer separaten Verzeichnisinstanz, Domäne oder Organisationseinheit (OU). Überprüfen und auditieren Sie regelmäßig alle Benutzerberechtigungen, insbesondere für externe Konten. Erzwingen Sie eine starke Authentifizierung (z. B. Client-Zertifikate, MFA) für alle administrativen und Fernzugriffe auf den Verzeichnisdienst. Protokollieren und überwachen Sie alle Zugriffsversuche und Berechtigungsänderungen.",
      "check": "Sind die Konten externer Partner von internen und anderen Kundenkonten isoliert? Sind die Berechtigungen für externe Benutzer strikt auf das Notwendige beschränkt? Gibt es einen regelmäßigen Prozess zur Überprüfung der Zugriffsrechte? Ist der Zugriff auf den Verzeichnisdienst selbst ordnungsgemäß gesichert und überwacht?",
      "detectionLogic": "Dieses Risiko wird für zentrale Verzeichnisdienste (wie LDAP-Server oder Identitätsanbieter) ausgelöst, die für Multi-Tenancy konfiguriert oder explizit für den Zugriff externer Partner gekennzeichnet sind. Das Risiko wird identifiziert, wenn ein solcher Dienst Kommunikation von einer externen Quelle (über eine Netzwerk-Vertrauensgrenze) empfängt, was darauf hindeutet, dass er wie vom BSI beschrieben verwendet wird.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein Verzeichnisdienst mandantenfähig ist und von externen Parteien zugegriffen wird, da Fehlkonfigurationen in solch komplexen Setups häufig und folgenschwer sind. Die Auswirkung steht in direktem Zusammenhang mit der Sensibilität der Daten-Assets, die vom oder über den Verzeichnisdienst verwaltet werden. Ein Bruch eines Verzeichnisdienstes, der ",
      "falsePositives": "Das Modell könnte einen korrekt konfigurierten und gehärteten mandantenfähigen Verzeichnisdienst kennzeichnen. Betrachten Sie dies nur dann als Falsch-Positiv, wenn eine gründliche Überprüfung bestätigt, dass eine starke Mandantentrennung, Zugriffskontrollen nach dem Prinzip der geringsten Rechte und regelmäßige Audits effektiv vorhanden sind."
    },
    "insufficient-tenant-separation-in-outsourcing": {
      "title": "Unzureichende Mandantentrennung in Outsourcing-Umgebungen (BSI APP.6.A9)",
      "description": "Outsourcing-Anbieter bedienen typischerweise mehrere Kunden (Mandanten) unter Verwendung derselben gemeinsam genutzten Ressourcen wie IT-Systeme, Netzwerke oder Personal. ",
      "impact": "Dies stellt eine direkte Verletzung der Vertraulichkeit für den betroffenen Mandanten dar.",
      "asvs": "BSI IT-Grundschutz APP.6.A9 (Mandantentrennung)",
      "action": "Implementierung und Durchsetzung einer strengen Mandantentrennung",
      "mitigation": "Stellen Sie eine strikte logische und/oder physische Trennung von Mandantendaten und -prozessen auf allen gemeinsam genutzten Ressourcen sicher. ",
      "check": "Sind mandantenfähige Assets explizit mit Blick auf die Mandantentrennung konzipiert? Gibt es dedizierte Sicherheitskontrollen, um den Zugriff zwischen Mandanten zu verhindern? Wurden Penetrationstests durchgeführt, um die Mandantentrennung zu validieren? Wie wird der administrative Zugriff des Anbieters auf Mandantendaten kontrolliert und auditiert?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als `multi-tenant` markiert ist und nicht explizit als `tenant-isolation-verified` getaggt wurde. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jedes mandantenfähige System, das sensible Daten ohne explizit definierte und validierte Isolationskontrollen verarbeitet, als hoch angesehen, insbesondere wenn es sich um eigens entwickelte Teile handelt. ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle spezifischen implementierten Isolationskontrollen (z. B. feingranulare Logik auf Anwendungsebene). "
    },
    "inadequate-control-of-subcontractors-bsi-der.1": {
      "title": "Unzureichende Kontrolle von Subunternehmern (BSI DER.1)",
      "description": "Outsourcing-Anbieter können Teile oder die gesamten ausgelagerten Dienstleistungen an andere Unterdienstleister vergeben. ",
      "impact": "Wenn ein Subunternehmer die Sicherheitsstandards nicht erfüllt, kann dies zur Kompromittierung der Vertraulichkeit, Integrität oder Verfügbarkeit der ausgelagerten Prozesse und Daten führen. ",
      "asvs": "BSI IT-Grundschutz DER.1.A5 (Überprüfung der Informationssicherheit des Outsourcing-Dienstleisters) und DER.1.A6 (Überwachung und Überprüfung des Outsourcing-Dienstleisters",
      "action": "Verbesserung der Due-Diligence-Prüfung von Anbietern und der vertraglichen Verpflichtungen für die Untervergabe",
      "mitigation": "Stellen Sie sicher, dass Verträge mit Outsourcing-Anbietern die Untervergabe explizit regeln. Der Vertrag sollte den Anbieter verpflichten: ",
      "check": "Deckt der Vertrag mit dem externen Anbieter die Untervergabe explizit ab? Werden Sicherheitsanforderungen vertraglich an alle Subunternehmer weitergegeben? ",
      "detectionLogic": "Dieses Risiko wird für jeden ",
      "riskAssessment": "Die Wahrscheinlichkeit des Eintretens dieses Risikos ist bei Dienstleistungen höher, bei denen mehrstufige Untervergaben üblich sind (z. B. große Cloud-Plattformen, spezialisierte Verarbeitungsdienste). ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet oder gemindert werden, wenn der Vertrag mit dem Anbieter die Untervergabe explizit verbietet oder wenn ein gründliches, erfolgreiches und aktuelles Audit des Subunternehmers"
    },
    "inadequate-outsourcing-termination-plan": {
      "title": "Unzureichender Plan zur Beendigung/Offboarding des Outsourcings",
      "description": "Unzureichende Regelungen für das Ende eines Outsourcing-Verhältnisses können dazu führen, dass Hardware und Daten nicht ordnungsgemäß zurückgegeben, übertragen oder gelöscht werden. ",
      "impact": "Wenn es keinen sicheren und umfassenden Offboarding-Plan gibt, können sensible Daten verloren gehen, gestohlen oder offengelegt werden. ",
      "asvs": "BSI IT-Grundschutz CON.8.A23 (Planung der Beendigung der Dienstleistung)",
      "action": "Etablierung eines formalen Offboarding- und Beendigungsplans",
      "mitigation": "Definieren und vereinbaren Sie vertraglich einen detaillierten Offboarding- und Beendigungsplan mit dem Outsourcing-Anbieter. ",
      "check": "Gibt es für jedes Outsourcing-Verhältnis eine schriftliche, vertraglich bindende Kündigungsklausel? Detailliert diese Klausel die Verfahren für die Rückgabe, Übertragung und Löschung von Daten? ",
      "detectionLogic": "Dieses Risiko wird für jeden ",
      "riskAssessment": "Die Auswirkung wird basierend auf der höchsten Vertraulichkeit der von der externen Entität gespeicherten oder verarbeiteten Daten sowie den höchsten Integritäts- und Verfügbarkeitsanforderungen bewertet. ",
      "falsePositives": "Ein Plan könnte organisatorisch existieren, aber das entsprechende technische Asset im Modell wurde nicht entsprechend getaggt. "
    },
    "inadequate-or-missing-security-regulations": {
      "title": "Unzureichende oder fehlende Sicherheitsvorschriften (basierend auf BSI)",
      "description": "Fehlende, veraltete, unpraktische oder unverständliche organisatorische Vorschriften können zu erheblichen Sicherheitslücken führen. ",
      "impact": "Das Fehlen wirksamer Vorschriften für kritische Assets oder sensible Daten kann zu Sicherheitsvorfällen führen, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.2 (ISMS). Die Etablierung eines Informationssicherheits-Managementsystems ist der primäre Weg, um sicherzustellen, dass Vorschriften erstellt, aufrechterhalten und wirksam sind.",
      "action": "Etablierung und Aufrechterhaltung eines Informationssicherheits-Managementsystems (ISMS)",
      "mitigation": "Definieren, dokumentieren und überprüfen Sie regelmäßig klare, praktische und verständliche Sicherheitsvorschriften für alle kritischen Bereiche der Informationsverarbeitung. ",
      "check": "Gibt es ein dokumentiertes ISMS? Sind wichtige Sicherheitsvorschriften (z. B. für die Reaktion auf Vorfälle, den Umgang mit Daten) definiert, aktuell und zugänglich? Werden diese Vorschriften regelmäßig auf Praktikabilität und Wirksamkeit überprüft?",
      "detectionLogic": "Dieses organisatorische Risiko ist schwer automatisch zu erkennen. Diese Regel schärft das Bewusstsein, indem sie im Geltungsbereich befindliche technische Assets mit hohen oder kritischen Schutzanforderungen kennzeichnet. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist allein aus dem Modell schwer zu bestimmen, kann aber als ",
      "falsePositives": "Dieses Risiko wird basierend auf der Kritikalität des Assets ausgelöst, nicht auf direkten Beweisen für fehlende Vorschriften. Seine Existenz muss durch Überprüfung der Organisation "
    },
    "non-compliance-with-regulations-bsi-orp1": {
      "title": "Nichteinhaltung organisatorischer Vorschriften (BSI ORP.1)",
      "description": "Die Erfahrung zeigt, dass die alleinige Definition von Sicherheitsregeln nicht ausreicht. Eine klare Kommunikation an die Mitarbeiter ist unerlässlich, damit alle Betroffenen die Anforderungen im Arbeitsalltag anwenden können. ",
      "impact": "Die Nichteinhaltung organisatorischer Vorschriften kann zu schwerwiegenden Vorfällen führen, einschließlich der Kompromittierung vertraulicher Informationen, des Verlusts der Datenintegrität und der unbefugten Offenlegung. Dies kann zu Reputationsschäden, finanziellen Verlusten und rechtlichen oder regulatorischen Strafen führen.",
      "asvs": "BSI IT-Grundschutz ORP.1: Informationssicherheitsorganisation; verwandte Punkte in ORP.2: Informationssicherheitsrichtlinien und -vorschriften.",
      "action": "Implementierung, Kommunikation und Durchsetzung von Sicherheitsrichtlinien",
      "mitigation": "Stellen Sie sicher, dass alle Sicherheitsvorschriften klar dokumentiert, leicht zugänglich und effektiv an alle Mitarbeiter kommuniziert werden. ",
      "check": "Gibt es ein Programm zur Sensibilisierung für Sicherheit? Sind die Richtlinien für alle Mitarbeiter leicht zugänglich? Gibt es technische Kontrollen, um kritische Regeln durchzusetzen? ",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes technische Asset ausgelöst, das Daten mit hohen Vertraulichkeits- oder Integritätsanforderungen verarbeitet oder speichert, oder für Webanwendungen, die Informationen veröffentlichen könnten. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird auf ",
      "falsePositives": "Dies kann in einer Organisation mit einer sehr starken und reifen Sicherheitskultur, in der Richtlinien tief verwurzelt und konsequent durchgesetzt werden, ein Falsch-Positiv sein. "
    },
    "insufficient-operational-resources": {
      "title": "Unzureichende betriebliche Ressourcen für Verfügbarkeit und Integrität (BSI CON.3)",
      "description": "Wenn erforderliche betriebliche Ressourcen in unzureichender Menge verfügbar sind, nicht rechtzeitig bereitgestellt oder nicht ordnungsgemäß gewartet werden, können Störungen auftreten. ",
      "impact": "Das Versäumnis, angemessene und redundante Ressourcen bereitzustellen, kann die Integrität und Verfügbarkeit von Daten und Systemen erheblich gefährden. ",
      "asvs": "BSI IT-Grundschutz CON.3 (Datensicherungskonzept) & INF.5 (Serverraum)",
      "action": "Sicherstellung der Redundanz und Implementierung einer robusten Sicherungs- und Wiederherstellungsstrategie",
      "mitigation": "Kritische technische Assets sollten in einer redundanten Konfiguration entworfen und bereitgestellt werden (z. B. geclustert, über Verfügbarkeitszonen hinweg lastverteilt), um einzelne Fehlerquellen zu vermeiden. ",
      "check": "Überprüfen Sie technische Assets mit hohen Verfügbarkeits- oder Integritätsanforderungen. Sind sie als ",
      "detectionLogic": "Diese Regel wird automatisch für jedes im Geltungsbereich befindliche, nicht redundante technische Asset ausgelöst, das ",
      "riskAssessment": "Die Auswirkung dieses Risikos leitet sich direkt vom Asset ",
      "falsePositives": "Ein Asset könnte Redundanz- oder Sicherungsmechanismen haben, die nicht im Bedrohungsmodell erfasst sind (z. B. RAID auf Hardwareebene für einen Server oder einen Cloud-Anbieter)."
    },
    "physical-access-by-external-personnel": {
      "title": "Unbefugter physischer Zugang durch externes Personal (BSI INF.6)",
      "description": "Externe Personen (z. B. Besucher, Reinigungspersonal oder Wartungsarbeiter) sind möglicherweise nicht mit der Institution vertraut.",
      "impact": "Die erfolgreiche Ausnutzung eines unbeaufsichtigten physischen Zugangs kann die Vertraulichkeit (Spionage, Diebstahl), Integrität (Beschädigung, unbefugte Änderung), ",
      "asvs": "BSI IT-Grundschutz INF.6: Schutz vor unbefugtem physischem Zugang. Dies bezieht sich auch auf klassische BSI-Gefährdungen wie G 0.14 (Fremdpersonal) und G 0.15 (Besucher und Externe).",
      "action": "Implementierung von physischen Zugangskontrollen und Aufsichtsrichtlinien",
      "mitigation": "Erzwingen Sie eine strenge Richtlinie für externes Personal, einschließlich Registrierung, Identifizierung (Ausweise) und Begleitungspflicht in sensiblen Bereichen. ",
      "check": "Gibt es formale Verfahren für den Umgang mit Besuchern und externem Personal? Befinden sich sensible Assets in physisch gesicherten Zonen? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die sich in physisch weniger sicheren Bereichen befinden, identifiziert durch ",
      "riskAssessment": "Die Wahrscheinlichkeit wird durch das Niveau des physischen Zugangs bestimmt (z. B. ist eine öffentliche Lobby riskanter als ein allgemeines Büro). ",
      "falsePositives": "Ein Modell könnte ein Asset in einem "
    },
    "personnel-unavailability-orp-4-a17": {
      "title": "Personalunverfügbarkeit (BSI ORP.4.A17)",
      "description": "Die Abwesenheit von Schlüsselpersonal (z. B. aufgrund von Krankheit, Urlaub oder Ausscheiden) kann wesentliche Betriebs-, Wartungs- oder Sicherheitsaufgaben verzögern. ",
      "impact": "Das Ausbleiben notwendiger Aufgaben aufgrund von Personalunverfügbarkeit bedroht direkt die Verfügbarkeit abhängiger Dienste und Systeme. ",
      "asvs": "BSI IT-Grundschutz Kompendium 2023, Baustein ORP.4: Personal, Anforderung A17: Regelung für die Vertretung bei Ausfall von Mitarbeitern.",
      "action": "Etablierung und Pflege von Vertretungsregelungen für Schlüsselrollen",
      "mitigation": "Definieren, dokumentieren und kommunizieren Sie klare Vertretungsregelungen für alle Schlüsselpersonen. ",
      "check": "Gibt es dokumentierte Vertretungspläne für alle Schlüsselrollen, die mit kritischen Assets verbunden sind? Werden diese Pläne regelmäßig getestet? ",
      "detectionLogic": "Dieses Risiko wird für nicht redundante technische Assets mit hohen Verfügbarkeits- oder Integritätsanforderungen ausgelöst, die mit spezifischen Personalrollen (über `role:*`-Tags) verbunden sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als wahrscheinlich angesehen, da die Vertretungsplanung eine häufige organisatorische Herausforderung ist. ",
      "falsePositives": "Das Modell kann die Existenz oder Wirksamkeit einer Organisation nicht überprüfen."
    },
    "incomplete-asset-inventory-inf1.a1": {
      "title": "Unvollständiges oder veraltetes IT-Asset-Inventar (BSI INF.1.A1)",
      "description": "Ohne ein vollständiges, korrektes und aktuelles Inventar aller Hardware- und Softwarekomponenten ist es unmöglich, diese sicher zu verwalten. Unverwaltete oder ",
      "impact": "Unverwaltete Assets können von Angreifern ausgenutzt werden, um einen dauerhaften Halt im Netzwerk zu erlangen, Sicherheitskontrollen zu umgehen und auf sensible Daten zuzugreifen. Dies kann zu Datenschutzverletzungen, Malware-Verbreitung und Störungen kritischer Geschäftsdienste führen. Ein unvollständiges Inventar untergräbt die Wirksamkeit fast aller anderen technischen und organisatorischen Sicherheitsmaßnahmen, einschließlich Schwachstellenmanagement, Überwachung und Vorfallsreaktion.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Kompendium 2023, Baustein INF.1: Allgemeine Infrastruktur-Komponenten, Anforderung INF.1.A1 ",
      "action": "Aufbau und Pflege eines umfassenden Asset-Inventarisierungsprogramms",
      "mitigation": "Implementieren Sie ein robustes Asset-Management-Programm, das automatisierte Erkennungswerkzeuge zur kontinuierlichen Überprüfung von Netzwerken auf neue oder geänderte Geräte und Software umfasst. Etablieren und erzwingen Sie klare Prozesse für die Beschaffung, Bereitstellung und Stilllegung aller IT-Assets. Das Inventar sollte zentralisiert, regelmäßig mit der physischen und Netzwerkrealität abgeglichen und mit anderen Sicherheitssystemen wie Schwachstellenscannern, Konfigurationsmanagement-Datenbanken (CMDBs) und Security Information and Event Management (SIEM)-Systemen integriert werden. Unterdrücken Sie diese Warnung, indem Sie ein zentrales Asset oder eine Vertrauensgrenze mit ",
      "check": "Gibt es ein zentralisiertes, aktuelles Asset-Inventar? Deckt es alle Umgebungen (On-Premises, Cloud, OT, Entwicklung, Produktion) ab? Sind automatisierte Erkennungswerkzeuge im Einsatz? Gibt es formale Prozesse zur Handhabung des Lebenszyklus aller Assets?",
      "detectionLogic": "Dies ist ein grundlegendes organisatorisches Risiko, das die Vollständigkeit des Bedrohungsmodells selbst betrifft. Es ist für ein automatisiertes Werkzeug unmöglich, Assets zu erkennen, die nicht im Modell definiert sind. Daher wird dieses Risiko einmal für das gesamte System ausgelöst, verankert am kritischsten Asset, um daran zu erinnern, dass ",
      "riskAssessment": "Die Wahrscheinlichkeit wird in jeder Organisation ohne ein ausgereiftes, automatisiertes Asset-Management-Programm standardmäßig als hoch angesehen. Die Auswirkung wird durch die höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen der Assets im Modell bestimmt, da ein unbekanntes Asset einen Weg zur Kompromittierung jedes von ihnen bieten könnte.",
      "falsePositives": "Dieses Risiko beschreibt eine potenzielle Lücke im Modellierungsprozess selbst und ist daher ohne externe Überprüfung schwer als Falsch-Positiv zu klassifizieren. Der Befund ist gültig, wenn die Organisation keine Nachweise für ein umfassendes und ausgereiftes Asset-Management-Programm erbringen kann, das sicherstellt, dass das Bedrohungsmodell die Realität genau widerspiegelt."
    },
    "careless-handling-of-credentials": {
      "title": "Fahrlässiger Umgang mit Anmeldeinformationen / Umgehung von Sicherheitsmaßnahmen",
      "description": "Es wird oft beobachtet, dass Institutionen zwar viele organisatorische und technische Sicherheitsverfahren haben, diese aber durch fahrlässiges Verhalten der Mitarbeiter untergraben werden. Ein typisches Beispiel ist ein Haftnotizzettel am Monitor mit aufgeschriebenen Zugangspasswörtern. Solches Verhalten schwächt etablierte Sicherheitskontrollen und schafft einen direkten Weg für unbefugten Zugriff.",
      "impact": "Wenn Anmeldeinformationen fahrlässig behandelt werden (z. B. aufgeschrieben und offen liegen gelassen oder mit anderen geteilt), können Konten kompromittiert werden. Ein Angreifer, der diese Anmeldeinformationen erlangt, könnte sich als der Benutzer ausgeben, auf sensible Daten zugreifen, kritische Informationen ändern oder seine Privilegien im System erweitern. Dies bedroht direkt die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) der zugehörigen Assets und kann zu erheblichen Datenschutzverletzungen und Betriebsstörungen führen.",
      "asvs": "Basierend auf dem BSI IT-Grundschutz Baustein ORP.2 (Personal), insbesondere Abschnitt 2.3: Unachtsamer Umgang mit Informationen (z. B. Passwörter auf Haftnotizen).",
      "action": "Durchsetzung sicherer Richtlinien zum Umgang mit Anmeldeinformationen und Schulungen zum Nutzerbewusstsein",
      "mitigation": "Implementieren und erzwingen Sie klare Richtlinien, die das Aufschreiben oder Teilen von Passwörtern verbieten. Bieten Sie sichere Alternativen an, wie z. B. zugelassene Passwort-Manager. Führen Sie regelmäßige, obligatorische Schulungen zum Sicherheitsbewusstsein durch, die die Risiken des fahrlässigen Umgangs mit Anmeldeinformationen und Social-Engineering-Angriffen abdecken. Verwenden Sie technische Kontrollen, um die Passwortkomplexität und die Multi-Faktor-Authentifizierung gegebenenfalls durchzusetzen.",
      "check": "Gibt es eine schriftliche Richtlinie für das Management von Anmeldeinformationen? Werden die Benutzer darin geschult? Stehen Passwort-Manager zur Verfügung und wird ihre Nutzung gefördert oder vorgeschrieben? Sind technische Kontrollen (z. B. MFA, Passwortkomplexität) für kritische Systeme vorhanden?",
      "detectionLogic": "Dieses organisatorische Risiko gilt für jedes technische Asset, das eine Benutzerauthentifizierung erfordert. Die Regel wird bei Assets ausgelöst, die explizit als von einem Menschen genutzt gekennzeichnet sind (`used_as_client_by_human: true`), bei Client-Technologien oder bei Assets, die über `role:*`-Tags einer bestimmten Benutzerrolle zugeordnet sind. Die Annahme ist, dass, wenn ein Mensch mit dem Asset interagiert, das Risiko eines fahrlässigen Umgangs mit Anmeldeinformationen besteht.",
      "riskAssessment": "Die Wahrscheinlichkeit ist in Umgebungen ohne starke Richtlinien für Anmeldeinformationen, Schulungen und technische Durchsetzung (wie MFA) hoch. Die Auswirkung ist proportional zur CIA-Bewertung des technischen Assets und der von ihm verarbeiteten oder gespeicherten Daten. Die Kompromittierung der Anmeldeinformationen für einen unternehmenskritischen Datenbankadministrator ist ein Ereignis mit sehr hoher Auswirkung.",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und beruht auf Annahmen über das Benutzerverhalten. Ein Modell kann die tatsächlichen Praktiken im Umgang mit Anmeldeinformationen nicht überprüfen. Behandeln Sie dieses Risiko als Anstoß, um zu überprüfen, ob angemessene Richtlinien, Schulungen und technische Kontrollen vorhanden sind."
    },
    "insufficiently-qualified-personnel-bsi": {
      "title": "Unzureichend qualifiziertes oder geschultes Personal (BSI-basiert)",
      "description": "Im täglichen IT-Betrieb können viele Störungen und Fehler auftreten. Wenn das verantwortliche Personal nicht ausreichend qualifiziert, sensibilisiert und geschult ist, ",
      "impact": "Fehler von unzureichend qualifiziertem Personal bei der Konfiguration, dem Betrieb oder der Entwicklung von Systemen können direkt zu Schwachstellen führen. ",
      "asvs": "Basierend auf dem BSI IT-Grundschutz Baustein ORP.2 (Personal), insbesondere ORP.2.A15 (Qualifikation des Personals) und verwandten organisatorischen Maßnahmen wie ORP.2.A1/A2 (Onboarding/Offboarding) und ORP.2.A4 (Regeln für externes Personal), soweit zutreffend.",
      "action": "Etablierung und Aufrechterhaltung von Qualifikations- und Schulungsstandards für Personal",
      "mitigation": "Definieren Sie klare Qualifikations- und Erfahrungsanforderungen für alle Rollen, die für den Betrieb, die Verwaltung und die Entwicklung von IT-Systemen verantwortlich sind. ",
      "check": "Gibt es formal definierte Qualifikationsanforderungen für IT-Rollen? Gibt es einen fortlaufenden Schulungsplan? ",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das sich auf technischer Ebene manifestiert. Das Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das mit einer menschlichen Rolle (über `role:*`-Tags) verbunden ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei komplexen, eigens entwickelten Systemen als höher angesehen, da diese spezielleres Wissen erfordern. ",
      "falsePositives": "Dieses Risiko ist eine Abstraktion eines organisatorischen Problems. Das Modell kann die tatsächlichen Qualifikationen des Personals nicht kennen. "
    },
    "insufficient-knowledge-of-regulations": {
      "title": "Unzureichende Kenntnis der Informationssicherheitsvorschriften",
      "description": "Die bloße Definition von Informationssicherheitsvorschriften stellt nicht sicher, dass sie auch befolgt werden. ",
      "impact": "Die Nichtbeachtung von Sicherheitsvorschriften aufgrund unzureichender Kenntnisse kann zur Schaffung oder Ausnutzung von Sicherheitslücken führen, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.1 (Informationssicherheitsorganisation), Anforderung ORP.1.A6 (Sensibilisierungsschulung zur Informationssicherheit).",
      "action": "Implementierung und Aufrechterhaltung von Programmen zur Sensibilisierung und Schulung im Bereich Sicherheit",
      "mitigation": "Implementieren Sie ein umfassendes, fortlaufendes Programm zur Sensibilisierung und Schulung im Bereich Sicherheit, das auf Rollen und Verantwortlichkeiten zugeschnitten ist. ",
      "check": "Gibt es ein etabliertes, fortlaufendes Programm zur Sensibilisierung und Schulung im Bereich Sicherheit? Sind die Sicherheitsvorschriften leicht zugänglich und werden sie effektiv kommuniziert? ",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das das Bewusstsein des Personals betrifft. Es gilt konzeptionell für das gesamte System, in dem Personalinteraktion stattfindet. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist inhärent organisatorisch und allein aus einem technischen Modell schwer zu überprüfen. "
    },
    "insufficient-security-awareness": {
      "title": "Unzureichendes Sicherheitsbewusstsein",
      "description": "Die Erfahrung zeigt, dass es nicht ausreicht, Sicherheitsmaßnahmen einfach nur vorzuschreiben. Mitarbeiter müssen den Sinn und Zweck dieser Maßnahmen verstehen, sonst ignorieren sie sie möglicherweise im Arbeitsalltag. Wenn Mitarbeiter nicht ausreichend für Themen der Informationssicherheit sensibilisiert werden, wird die Institution",
      "impact": "Wenn Mitarbeiter Sicherheitsmaßnahmen aus Mangel an Bewusstsein ignorieren, kann dies zur Einführung neuer Schwachstellen oder zum Versagen bestehender Kontrollen führen. Dies kann die Vertraulichkeit, Integrität oder Verfügbarkeit von Geschäftsprozessen und Informationen direkt gefährden und potenziell zu Sicherheitsvorfällen, Datenschutzverletzungen und Nichteinhaltung von Vorschriften führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, ORP.3 Sensibilisierung und Schulung zur Informationssicherheit (Awareness and training on information security).",
      "action": "Etablierung und Aufrechterhaltung eines kontinuierlichen Programms zur Sensibilisierung und Schulung im Bereich Sicherheit",
      "mitigation": "Implementieren Sie ein umfassendes, rollenbasiertes Programm zur Sensibilisierung und Schulung im Bereich Sicherheit, das kontinuierlich verstärkt wird. Stellen Sie sicher, dass alle Mitarbeiter den Zweck und die Bedeutung der für ihre Aufgaben relevanten Sicherheitsmaßnahmen verstehen. Das Programm sollte vom Management unterstützt und in die Unternehmenskultur integriert werden. Kommunizieren Sie regelmäßig Sicherheitsthemen und überprüfen Sie das Verständnis.",
      "check": "Gibt es ein etabliertes, fortlaufendes Programm zur Sensibilisierung und Schulung im Bereich Sicherheit? Können Mitarbeiter die Bedeutung wichtiger Sicherheitsmaßnahmen für ihre Rollen erklären? Gibt es eine sichtbare Unterstützung des Managements für eine sicherheitsbewusste Kultur?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das für alle Teile des Systems gilt, in denen menschliche Interaktion stattfindet. Diese Regel wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die nicht ausschließlich Backend-Systeme sind, da dies die Komponenten sind, mit denen Mitarbeiter am wahrscheinlichsten direkt oder indirekt interagieren. Ein Mangel an Bewusstsein bei diesen Interaktionen kann dazu führen, dass Sicherheitskontrollen umgangen werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und kann nicht allein durch ein technisches Modell vollständig bestätigt oder widerlegt werden. Eine Organisation könnte ein wirksames Programm zur Sensibilisierung und Schulung im Bereich Sicherheit etabliert haben. Behandeln Sie dieses Risiko als Anstoß, den Status und die Wirksamkeit von Sensibilisierungsaktivitäten und der Sicherheitskultur zu überprüfen."
    },
    "ineffective-security-awareness-program": {
      "title": "Unwirksames Programm zur Sensibilisierung für Sicherheit (in Anlehnung an BSI ORP.3)",
      "description": "Sensibilisierungs- und Schulungsmaßnahmen im Bereich Sicherheit sind nicht immer so erfolgreich wie erforderlich. ",
      "impact": "Wenn eine Institution unzureichende Sensibilisierungs- und Schulungsmaßnahmen für ihre Mitarbeiter durchführt, können Aspekte der Informationssicherheit gefährdet werden, was die Erfüllung von Aufgaben direkt einschränkt. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.3 (Sensibilisierung und Schulung zur Informationssicherheit), insbesondere den Anforderungen ORP.3.A4, ORP.3.A6 und ORP.3.A8. Dieses Risiko stellt das Versäumnis dar, diese Kontrollen wirksam umzusetzen.",
      "action": "Wirksamkeit von Programmen zur Sensibilisierung und Schulung im Bereich Sicherheit sicherstellen",
      "mitigation": "Sorgen Sie für eine starke Unterstützung des Managements für Initiativen zur Sensibilisierung für Sicherheit. Definieren Sie klare, messbare Ziele für Schulungsprogramme. Planen Sie Aktivitäten sorgfältig und weisen Sie ausreichende Ressourcen (finanziell und personell) zu. ",
      "check": "Gibt es klare Beweise für die Unterstützung des Managements für das Programm zur Sensibilisierung für Sicherheit? Sind die Programme",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das die Wirksamkeit von Schulungsprogrammen betrifft. Es gilt konzeptionell für das gesamte System, in dem Personalinteraktion stattfindet. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als HOCH angesehen, wenn keine Erfolgsüberwachung für Sensibilisierungsprogramme vorhanden ist oder wenn bekannt ist, dass sie unwirksam ist. Die Wahrscheinlichkeit ist MITTEL, wenn die Erfolgsüberwachung sporadisch ist oder an Tiefe mangelt. ",
      "falsePositives": "Dieses Risiko ist inhärent organisatorisch. Ein Modell kann die tatsächliche Qualität oder Wirksamkeit eines Schulungsprogramms nicht bestimmen. "
    },
    "insufficient-training-on-new-software": {
      "title": "Unzureichende Schulung zu neuer Software und Sicherheitsfunktionen",
      "description": "Mitarbeiter verwenden oft neu eingeführte Sicherheitsprogramme und -funktionen nicht, weil sie nicht wissen, wie man sie bedient, oder es für zu zeitaufwändig halten, es zu lernen. ",
      "impact": "Fehlbedienung oder falsche Konfiguration von Software aufgrund unzureichender Schulung kann die beabsichtigten Sicherheitsvorteile zunichtemachen. Dies kann zu ungepatchten Schwachstellen, umgangenen Sicherheitskontrollen und der Offenlegung sensibler Daten führen. ",
      "asvs": "Abgeleitet von BSI IT-Grundschutz-Konzepten. Diese Bedrohung steht im Einklang mit ORP.3 (Sensibilisierung und Schulung) und unterstützt die Prinzipien in ORP.1 (Informationssicherheitsorganisation) und ORP.2 (Personal), die Kompetenz und Bewusstsein betonen.",
      "action": "Etablierung rollenbasierter Schulungen für neue Software und Sicherheitsfunktionen",
      "mitigation": "Entwickeln und erzwingen Sie ein obligatorisches Schulungsprogramm für alle neue Software, insbesondere für sicherheitsrelevante Tools und kritische Geschäftsanwendungen. ",
      "check": "Gibt es einen formalen Prozess zur Schulung von Mitarbeitern an neuer Software und Systemen, bevor der Zugriff gewährt wird? ",
      "detectionLogic": "Dieses organisatorische Risiko wird für technische Assets ausgelöst, die entweder eigens entwickelt wurden, als Sicherheitskontrollen fungieren oder hochkritische Daten verarbeiten. ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos ist bei eigens entwickelten Teilen und dedizierten Sicherheitskomponenten aufgrund ihrer Komplexität und ihres nicht standardmäßigen Charakters höher. ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn die Organisation ein robustes und wirksames Schulungsprogramm für alle neuen Software-Implementierungen hat, auch wenn dies nicht im Bedrohungsmodell erfasst ist. "
    },
    "failure-to-recognize-and-report-incidents": {
      "title": "Nicht-Erkennen und -Melden von Sicherheitsvorfällen (BSI ORP.3)",
      "description": "Im täglichen Betrieb können viele Störungen und Fehler bei IT- und ICS-Komponenten auftreten. Sicherheitsvorfälle werden vom Personal möglicherweise nicht als solche identifiziert, und Cyber-Angriffe oder Angriffsversuche könnten unbemerkt bleiben. ",
      "impact": "Das rechtzeitige Nicht-Erkennen und -Melden von Sicherheitsvorfällen kann dazu führen, dass kleine Sicherheitslücken zu kritischen Bedrohungen anwachsen und die Vertraulichkeit, Integrität und Verfügbarkeit von Informationen gefährden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.3 (Sensibilisierung und Schulung zur Informationssicherheit), insb. 2.5 (Nicht erkannte Sicherheitsvorfälle) und Anforderungen ORP.3.A1, ORP.3.A3, ORP.3.A6, ORP.3.A8, ORP.3.A9.",
      "action": "Etablierung und Aufrechterhaltung eines Sensibilisierungs- und Schulungsprogramms zur Erkennung, Meldung und Eskalation von vermuteten Sicherheitsvorfällen für alle Rollen.",
      "mitigation": "Erstellen Sie klare, zugängliche Meldeverfahren und schulen Sie das gesamte Personal (Benutzer, Administratoren, Führungskräfte), um potenzielle Anzeichen eines Sicherheitsvorfalls (z. B. ungewöhnliches Systemverhalten, unerwartete Fehler, Leistungseinbußen, verdächtige Nachrichten) zu erkennen. ",
      "check": "Sind Sensibilisierungs- und Schulungsmaßnahmen (ORP.3) definiert, aktuell und rollenspezifisch? Kennen die Mitarbeiter Indikatoren für Vorfälle und wie sie diese umgehend melden können? Gibt es einen benannten Ansprechpartner und einen geübten Meldeweg?",
      "detectionLogic": "Organisatorisches Risiko mit Fokus auf Sensibilisierung und Prozessen. Es gilt konzeptionell überall dort, wo menschliche Interaktion entscheidend ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist erhöht, wenn Sensibilisierungsprogramme und Meldeverfahren fehlen oder unwirksam sind. Die Auswirkung skaliert mit den CIA-Anforderungen des Assets und der Sensibilität der verarbeiteten oder gespeicherten Daten. ",
      "falsePositives": "Dies ist weitgehend organisatorischer Natur und kann nicht allein durch das technische Modell nachgewiesen werden. Eine Institution könnte bereits ein wirksames Programm durchführen. "
    },
    "negligence-and-human-error": {
      "title": "Fahrlässigkeit oder menschliches Versagen, das zur Preisgabe von Informationen führt (BSI G 0.14)",
      "description": "Verschiedene Faktoren wie Unachtsamkeit oder Eile können zu Situationen führen, in denen beispielsweise vertrauliche Dokumente offen an Arbeitsplätzen sichtbar sind oder E-Mails ohne Verschlüsselung versendet werden. ",
      "impact": "Wenn sensible Informationen unachtsam behandelt werden, kann dies zu unbefugter Offenlegung, Änderung oder zum Verlust von Daten führen. Dies beeinträchtigt die Vertraulichkeit und Integrität und kann zu finanziellen Verlusten, Reputationsschäden und rechtlichen oder regulatorischen Strafen führen.",
      "asvs": "Abgeleitet aus den BSI IT-Grundschutz-Katalogen, ",
      "action": "Implementierung technischer Schutzmaßnahmen und Verbesserung des Sicherheitsbewusstseins",
      "mitigation": "Kombinieren Sie technische Kontrollen mit organisatorischen Maßnahmen. Implementieren Sie ein ",
      "check": "Gibt es durchgesetzte Richtlinien für ein ",
      "detectionLogic": "Dieses Risiko wird bei im Geltungsbereich befindlichen technischen Assets identifiziert, die von Menschen genutzt werden (z. B. Workstations, mobile Geräte). Es wird unter zwei Bedingungen ausgelöst: ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet werden, wenn technische Kontrollen vorhanden sind, die das identifizierte Szenario vollständig verhindern (z. B. eine DLP-Lösung, die unverschlüsselte E-Mails mit sensiblen Anhängen blockiert, oder eine obligatorische vollständige Festplattenverschlüsselung). Solche Kontrollen müssen dokumentiert und überprüft werden."
    },
    "careless-handling-of-information": {
      "title": "Unachtsamer Umgang mit Informationen durch Mitarbeiter",
      "description": "Viele Organisationen definieren zahlreiche organisatorische und technische Sicherheitsmaßnahmen, die jedoch durch unachtsames Verhalten der Mitarbeiter untergraben werden können. ",
      "impact": "Unachtsamer Umgang mit Informationen kann Sicherheitsmaßnahmen wirkungslos machen und es unbefugten Personen ermöglichen, auf sensible Daten zuzugreifen. ",
      "asvs": "BSI IT-Grundschutz CON.1.A8 Clean Desk and Clear Screen",
      "action": "Durchsetzung sicherer Richtlinien zum Umgang mit Informationen und Sensibilisierung",
      "mitigation": "Implementieren und erzwingen Sie klare Richtlinien für den sicheren Umgang mit Informationen, wie z. B. eine ",
      "check": "Gibt es etablierte Richtlinien für Clean Desk/Screen und den sicheren Umgang mit Dokumenten? Werden die Mitarbeiter regelmäßig in diesen Richtlinien geschult? Werden auf mobilen Geräten Blickschutzfolien eingesetzt? Gibt es einen sicheren Prozess zur Entsorgung sensibler physischer Medien?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die entweder direkt von Menschen genutzt werden (wo Bildschirme ausgespäht oder Anmeldeinformationen sichtbar gelassen werden könnten) oder als physisch präsent gekennzeichnet sind, wo Informationen falsch gehandhabt werden könnten (wie Drucker oder Papierarchive).",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird im Allgemeinen als ",
      "falsePositives": "Dieses Risiko wird aufgrund des Potenzials für unachtsames Verhalten ausgelöst. Eine Organisation könnte eine starke Sicherheitskultur und wirksame Schulungsprogramme haben, die dieses Risiko in der Praxis mindern, was nicht allein aus dem technischen Modell bestimmt werden kann."
    },
    "disregard-of-security-regulations-ism2.2": {
      "title": "Missachtung von Sicherheitsvorschriften (BSI ISM.2.2)",
      "description": "Mitarbeiter halten sich aus verschiedenen Gründen möglicherweise nicht an die Anforderungen der Informationssicherheit, wie z. B. eine schwache Sicherheitskultur, ",
      "impact": "Die Missachtung von Sicherheitsvorschriften kann zur Umgehung von Sicherheitskontrollen führen und die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) von Assets gefährden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.1 (Informationssicherheitsorganisation), Anforderung ORP.1.A1 (Managementaufgaben zur Informationssicherheit), der die Bedeutung des Engagements des Managements und der Förderung einer Sicherheitskultur betont.",
      "action": "Förderung einer starken Sicherheitskultur und Überprüfung der Sicherheitsrichtlinien auf Praktikabilität",
      "mitigation": "Das Management muss aktiv eine positive Sicherheitskultur fördern und mit gutem Beispiel vorangehen. Sicherheitsrichtlinien sollten praktisch, gut begründet und nicht übermäßig belastend sein, um eine Ablehnung durch die Mitarbeiter zu vermeiden. ",
      "check": "Gibt es Anzeichen für eine starke, von oben nach unten gelebte Sicherheitskultur? Werden die Sicherheitsrichtlinien auf ihre Praktikabilität hin überprüft? Gibt es einen Feedback-Mechanismus für Mitarbeiter bezüglich der Sicherheitskontrollen? Werden Berechtigungen auf der Grundlage des Need-to-Know-Prinzips und geschäftlicher Rechtfertigung vergeben?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko im Zusammenhang mit dem Verhalten der Mitarbeiter und der Sicherheitskultur. Es gilt konzeptionell für das gesamte System. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dies ist ein organisatorisches Risiko. Seine Existenz kann nicht allein aus dem technischen Modell bestätigt werden. "
    },
    "social-engineering": {
      "title": "Social Engineering",
      "description": "Social Engineering ist eine Methode, um unbefugten Zugang zu Informationen oder IT-Systemen durch die Manipulation von Mitarbeitern zu erlangen. Angreifer nehmen oft direkten Kontakt per Telefon, E-Mail oder über soziale Netzwerke auf, manchmal in mehrstufigen Kampagnen. Indem sie Insiderwissen vortäuschen (z. B. sich als Kollege, Vorgesetzter oder IT-Support ausgeben) und an das Opfer appellieren",
      "impact": "Wenn Mitarbeiter nicht ausreichend für diese Art von Angriffen sensibilisiert sind, können sie dazu manipuliert werden, interne Informationen preiszugeben, ihre IT-Systeme mit Malware zu infizieren oder sogar Geld auf betrügerische Konten zu überweisen (z. B. ",
      "asvs": "ASVS V1.10.1: Security Awareness Training",
      "action": "Durchführung regelmäßiger, gezielter Schulungen zum Sicherheitsbewusstsein und Implementierung technischer Kontrollen",
      "mitigation": "Implementieren Sie ein robustes Programm zur Sensibilisierung für Sicherheit, das speziell auf Social-Engineering-Taktiken (Phishing, Pretexting, CEO-Betrug usw.) eingeht. Verwenden Sie simulierte Phishing-Kampagnen, um Mitarbeiter zu schulen und zu testen. Erzwingen Sie technische Kontrollen, die die Auswirkungen eines kompromittierten Benutzerkontos begrenzen, wie z. B. das Prinzip der geringsten Rechte, Multi-Faktor-Authentifizierung (MFA) und eine strikte, außerbandmäßige Validierung für sensible Aktionen wie Finanztransfers oder Passwort-Resets. Etablieren Sie klare, bekannte Kanäle, über die Mitarbeiter vermutete Social-Engineering-Versuche ohne Angst vor Repressalien melden können.",
      "check": "Werden die Mitarbeiter regelmäßig geschult, um Social-Engineering-Angriffe zu erkennen? Werden technische Kontrollen wie MFA für alle Benutzer durchgesetzt? Gibt es einen formalen, außerbandmäßigen Verifizierungsprozess für ungewöhnliche oder dringende Anfragen? Gibt es einen klaren Prozess zur Meldung verdächtiger Aktivitäten?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset generiert, das direkt von einem Menschen genutzt wird (`used_as_client_by_human: true`), eine Client-Technologie ist (`browser`, `desktop` usw.) oder mit einem `role:*`-Tag versehen ist. Die Annahme ist, dass der menschliche Benutzer dieses Assets das Hauptziel von Social Engineering ist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der Verbreitung von Social-Engineering-Angriffen als mindestens `Wahrscheinlich` angesehen. Sie wird für Assets, die mit hochprivilegierten Rollen (z. B. `role:administrator`) verbunden sind oder hochsensible Daten verarbeiten, auf `Sehr wahrscheinlich` erhöht. Die Auswirkung leitet sich aus den CIA-Bewertungen des technischen Assets und der von ihm verarbeiteten Daten ab. Ein erfolgreicher Angriff auf einen Benutzer mit Zugriff auf ",
      "falsePositives": "Das Modell identifiziert korrekt menschliche Interaktionspunkte als anfällig. Das tatsächliche Risikoniveau hängt jedoch von der Wirksamkeit der Organisation ab."
    },
    "inadequate-iam-processes": {
      "title": "Unzureichende Identity & Access Management (IAM)-Prozesse",
      "description": "Wenn Identity & Access Management (IAM)-Prozesse schlecht definiert oder inkonsistent implementiert sind, ",
      "impact": "Schwache IAM-Lebenszykluskontrollen ermöglichen unbefugten Zugriff, vergrößern den Explosionsradius nach Kompromittierungen und führen zu regulatorischer Nichteinhaltung. ",
      "asvs": "ASVS V4: Zugriffskontrolle (Berührungspunkte mit Identitäts- und Sitzungsmanagement)",
      "action": "Institutionalisierung von IAM: Definition, Automatisierung und Prüfung von Joiner-Mover-Leaver (JML)-Prozessen; Durchsetzung des Prinzips der geringsten Rechte; und regelmäßige Rezertifizierung von Zugriffen.",
      "mitigation": "Etablieren Sie einen formalen IAM-Lebenszyklus mit klarer Zuständigkeit (Joiner, Mover, Leaver). ",
      "check": "Gibt es einen dokumentierten, gemessenen JML-Prozess? Werden Admin- und Dienstkonten inventarisiert und überprüft? ",
      "detectionLogic": "Die Erkennung kennzeichnet technische Assets, bei denen ein robustes IAM am kritischsten ist, unter Verwendung von drei Signalen: ",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der Häufigkeit von Prozesslücken bei JML und Rezertifizierung auf 'Wahrscheinlich' gesetzt. ",
      "falsePositives": "Alleinige Evidenz aus dem Modell kann keine Prozessschwäche beweisen. Organisationen mit ausgereiftem IAM/JML können dennoch eine Auslösung bewirken. "
    },
    "lack-of-centralized-account-management": {
      "title": "Fehlendes zentrales Kontenmanagement",
      "description": "In vielen Organisationen haben Mitarbeiter Konten auf verschiedenen IT-Systemen (z. B. Produktions-, Test- und Qualitätssicherungssysteme) ",
      "impact": "Das Versäumnis, Benutzerkonten zentral zu verwalten und zu deprovisionieren, kann zu unbefugtem Zugriff über verwaiste Konten führen. ",
      "asvs": "V4.3.2: Überprüfen Sie, ob es einen Prozess gibt, um den Zugriff auf alle zugehörigen Konten, Ressourcen und Anmeldeinformationen rechtzeitig zu widerrufen, wenn ein Benutzer",
      "action": "Implementierung eines zentralen Identity and Access Management (IAM)",
      "mitigation": "Etablieren Sie einen zentralen Identitätsanbieter (IdP) (z. B. Active Directory, LDAP oder einen Cloud-basierten IdP) als einzige Wahrheitsquelle für Benutzeridentitäten. ",
      "check": "Gibt es einen zentralen Identitätsanbieter im Modell? Verwenden Anwendungen, die eine Benutzerauthentifizierung erfordern, eine externalisierte Authentifizierung und sind sie mit dem zentralen IdP verbunden? ",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn mehrere technische Assets, die typischerweise eine Benutzerauthentifizierung erfordern (wie Webanwendungen oder Datenbanken), ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn mehrere dezentrale Benutzer-Speicher existieren, da dies es sehr wahrscheinlich macht, dass die Deprovisionierung von Konten unvollständig sein wird. ",
      "falsePositives": "Ein System könnte "
    },
    "poorly-regulated-access-rights-orp4": {
      "title": "Schlecht geregelte Vergabe von Zugriffsrechten (BSI ORP.4)",
      "description": "Wenn die Vergabe von Zugriffsrechten schlecht geregelt ist, kann dies zu schwerwiegenden Sicherheitslücken führen, zum Beispiel durch eine Ausweitung der Berechtigungen. ",
      "impact": "Übermäßige oder unkontrollierte Berechtigungen können es unbefugten Benutzern oder Angreifern, die ein Konto kompromittiert haben, ermöglichen, auf sensible Informationen zuzugreifen, diese zu ändern oder zu löschen, ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein ORP.4 Identity and Access Management; insbesondere die Anforderungen ORP.4.A5 (Vergabe von Berechtigungen), ORP.4.A6 (Verwaltung von Berechtigungen) und ORP.4.A15 (Regelmäßige Überprüfung von Zugriffsrechten).",
      "action": "Implementierung eines formalen und prüfbaren Autorisierungsprozesses",
      "mitigation": "Etablieren und erzwingen Sie einen formalen Prozess zur Verwaltung von Zugriffsrechten, der auf dem Prinzip der geringsten Rechte basiert. ",
      "check": "Gibt es eine dokumentierte Richtlinie für die Zugriffskontrolle? Sind Rollen und Verantwortlichkeiten für die Vergabe von Zugriffen klar definiert? ",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn eine Kommunikationsverbindung zwischen zwei im Geltungsbereich befindlichen technischen Assets keinen definierten Autorisierungsmechanismus aufweist (`authorization: none`). ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit und Integrität der über die Verbindung übertragenen Daten-Assets und des Ziel-Assets selbst bestimmt. Eine Verbindung zu einer Datenbank, die ",
      "falsePositives": "Ein Risiko könnte ein Falsch-Positiv sein, wenn die Autorisierung durch eine Komponente außerhalb des Geltungsbereichs, die nicht im Modell vorhanden ist, oder durch einen impliziten Mechanismus, der nicht durch das `authorization`-Attribut erfasst wird (z. B. eine Netzwerk-Firewall-Regel, die den gesamten Verkehr aus einer vertrauenswürdigen Zone auf eine Whitelist setzt), gehandhabt wird. "
    },
    "violation-of-legal-and-contractual-requirements": {
      "title": "Verletzung gesetzlicher und vertraglicher Anforderungen (BSI ORP.5; siehe auch ORP.2 / ORP.3)",
      "description": "Wenn Informationssicherheit falsch oder unzureichend umgesetzt wird, können Organisationen gegen gesetzliche Vorschriften oder vertragliche Vereinbarungen verstoßen. Dies ist besonders relevant bei der Nutzung externer Dienste, wie z. B. Cloud-Anbieter, die in internationalen Umgebungen mit komplexen und unterschiedlichen rechtlichen Rahmenbedingungen agieren (z. B. für Datenschutz, Haftung oder staatlichen Zugriff). Ein Versäumnis, eine angemessene Due-Diligence-Prüfung durchzuführen, manchmal getrieben von einem Fokus auf niedrige Kosten, kann zu unbeabsichtigten, aber schwerwiegenden Compliance-Verstößen führen.",
      "impact": "Die Verletzung gesetzlicher oder vertraglicher Anforderungen kann zu erheblichen Geldstrafen, Reputationsschäden und dem Verlust des Kundenvertrauens führen. Sie kann auch zur erzwungenen Aussetzung von Geschäftsprozessen oder zur Gefährdung der Vertraulichkeit, Integrität und Verfügbarkeit von Daten-Assets führen, die bei nicht konformen Anbietern gehostet werden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.5 (Compliance Management – Anforderungsmanagement); siehe auch ORP.2 (Compliance) und ORP.3 (Informationssicherheit in Lieferantenbeziehungen).",
      "action": "Implementierung eines Due-Diligence- und Compliance-Management-Prozesses für alle externen Dienste",
      "mitigation": "Etablieren und erzwingen Sie einen formalen Prozess zur Bewertung und Genehmigung aller externen Dienste, insbesondere von Cloud-Anbietern. Dieser Prozess muss eine gründliche Bewertung aller anwendbaren rechtlichen, regulatorischen und vertraglichen Anforderungen umfassen. Beziehen Sie Rechts-, Datenschutz- und Informationssicherheitsbeauftragte in die Überprüfung ein. Stellen Sie sicher, dass Verträge klare Klauseln bezüglich Datenhandhabung, Sicherheitsmaßnahmen, Haftung, Gerichtsstand und Prüfungsrechten enthalten. Führen Sie ein Inventar aller externen Dienste und der für sie geltenden rechtlichen Rahmenbedingungen.",
      "check": "Gibt es einen dokumentierten Prozess zur Überprüfung externer Lieferanten auf rechtliche und sicherheitstechnische Konformität? Sind Rechts- und Datenschutzexperten Teil des Genehmigungsworkflows? Werden Cloud-Dienstleistungsverträge vor der Unterzeichnung auf spezifische Compliance- und Sicherheitsklauseln überprüft? Gibt es ein aktuelles Inventar der anwendbaren Gesetze und Vorschriften?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das sich innerhalb einer Vertrauensgrenze vom Typ ",
      "riskAssessment": "Die Auswirkung wird durch die Sensibilität (CIA-Bewertungen) der vom Cloud-basierten Asset verarbeiteten oder gespeicherten Daten bestimmt. Die Wahrscheinlichkeit steigt für Assets, die sensible Daten verarbeiten, da die Komplexität und das Potenzial für Versäumnisse bei der rechtlichen Due-Diligence-Prüfung höher sind. Ein reiner Kostenfokus ohne angemessene Compliance-Prüfungen, wie im Quellkontext beschrieben, wird als plausibles Szenario angesehen.",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn die Organisation bereits eine gründliche rechtliche und Compliance-Bewertung für den spezifischen Cloud-Dienst durchgeführt und dokumentiert hat, dass alle Anforderungen erfüllt sind. Das Risiko dient als Anstoß, zu bestätigen, dass die Due-Diligence-Prüfung abgeschlossen wurde."
    },
    "improper-handling-of-information-by-employees": {
      "title": "Unsachgemäßer Umgang mit Informationen durch Mitarbeiter (BSI ORP.5)",
      "description": "Durch unsachgemäßes Verhalten von Mitarbeitern können sensible Informationen unbefugt preisgegeben werden. ",
      "impact": "Dies kann zu schwerwiegenden Verletzungen der Vertraulichkeit führen und sensible Geschäftsdaten, personenbezogene Informationen (potenzielle DSGVO-Verstöße) oder Geschäftsgeheimnisse gefährden. ",
      "asvs": "In Anlehnung an BSI IT-Grundschutz, Modul ORP.5 Compliance Management (Anforderungsmanagement), z. B. ORP.5.A1 (Identifikation der Rahmenbedingungen), ORP.5.A2 (Einhaltung der Rahmenbedingungen) und ORP.5.A8 (Regelmäßige Überprüfungen des Compliance-Management-Systems).",
      "action": "Etablierung klarer Richtlinien und Durchsetzung der Funktionstrennung / des Vier-Augen-Prinzips",
      "mitigation": "Definieren und erzwingen Sie klare, praktische Richtlinien für den Umgang mit sensiblen Informationen in allen Formen (digital, mündlich, schriftlich). Implementieren Sie die ",
      "check": "Gibt es klare, zugängliche Richtlinien für den Umgang mit sensiblen Informationen? Gibt es einen formalen, durchgesetzten Prozess für die Gewährung des Zugriffs auf sensible Benutzerdaten (wie E-Mails)? Wird das Vier-Augen-Prinzip bei kritischen administrativen Aufgaben angewendet?",
      "detectionLogic": "Dieses Risiko wird ausgelöst, wenn ein technisches Asset, das eine privilegierte Rolle darstellt (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das Modell identifiziert die technische Fähigkeit zum Missbrauch basierend auf Zugriffspfaden. Es kann nicht die Existenz oder Wirksamkeit externer prozeduraler Kontrollen wie eines obligatorischen Ticketsystems oder eines formalen "
    },
    "social-engineering-pretexting-bsi-con1": {
      "title": "Social Engineering mittels Pretexting (BSI CON.1)",
      "description": "In persönlichen Gesprächen, am Telefon oder per E-Mail sind viele Mitarbeiter bereit, weitaus mehr Informationen preiszugeben, als sie es schriftlich oder in einer größeren Gruppe tun würden. Zudem wird die Identität von Kommunikationspartnern oft nicht in Frage gestellt, da dies als unhöflich empfunden wird. Ebenso werden Berechtigungen häufig nicht ausreichend überprüft, sondern implizit aus der behaupteten Rolle abgeleitet. Beispielsweise erhält ein Mitarbeiter eine E-Mail von einem angeblichen Bekannten seines Vorgesetzten mit der Bitte, schnell einen ausstehenden Betrag zu überweisen. Oder ein Fremder in Arbeitskleidung mit Werkzeugkasten erhält Zugang zum Rechenzentrum, nachdem er etwas über ",
      "impact": "Ein Angreifer könnte einen Mitarbeiter dazu verleiten, unbefugte Handlungen durchzuführen, wie z. B. betrügerische Finanztransfers zu tätigen, sensible Informationen (Anmeldeinformationen, Kundendaten) preiszugeben oder unbefugten physischen oder logischen Zugang zu gewähren. Dies kann zu erheblichen finanziellen Verlusten, Datenschutzverletzungen, Systemkompromittierungen und Reputationsschäden führen.",
      "asvs": "BSI IT-Grundschutz CON.1: Social Engineering und Phishing",
      "action": "Etablierung strenger Verifizierungsverfahren und Schulungen zum Sicherheitsbewusstsein",
      "mitigation": "Implementieren und erzwingen Sie strenge, nicht umgehbare Verifizierungsverfahren für alle sensiblen Anfragen (z. B. Finanztransfers, Passwort-Resets, Zugriffsgewährungen), die eine Bestätigung außerhalb des normalen Kanals (z. B. einen Anruf an eine bekannte Nummer) erfordern. Bieten Sie regelmäßige, obligatorische Schulungen zum Sicherheitsbewusstsein für alle Mitarbeiter an, die sich auf das Erkennen von Social-Engineering-Taktiken wie Pretexting, Phishing und CEO-Betrug konzentrieren. Fördern Sie eine Sicherheitskultur, in der das Hinterfragen ungewöhnlicher oder dringender Anfragen gefördert und belohnt wird, nicht als unhöflich oder hinderlich angesehen wird.",
      "check": "Gibt es formale, mehrkanalige Verifizierungsprozesse für sensible Anfragen? Behandeln Schulungen zum Sicherheitsbewusstsein Pretexting, Phishing und CEO-Betrug? Kennen und befolgen die Mitarbeiter diese Verfahren? Sind technische Kontrollen vorhanden, um verdächtige externe E-Mails zu kennzeichnen (z. B. Banner)?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes im Geltungsbereich befindliche technische Asset ausgelöst, das ein hochwertiges Ziel darstellt, da menschliche Bediener der primäre Angriffsvektor sind. Das Risiko wird für Assets mit hoher Vertraulichkeit (>= ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Das technische Modell kann nur anzeigen, wo ein Social-Engineering-Angriff schädlich wäre; es kann nicht die Wirksamkeit einer Organisation bewerten."
    },
    "configuration-drift-due-to-inadequate-knowledge": {
      "title": "Konfigurationsdrift durch unzureichende Kenntnis von Betriebssystemänderungen (BSI SYS.1.1)",
      "description": "Neue Versionen von Server-Betriebssystemen führen regelmäßig neue Funktionen ein und ändern bestehende, einschließlich Parametern und Standardeinstellungen. ",
      "impact": "Konfigurationsdrift kann zu undokumentierten und ungetesteten Sicherheitsschwächen, inkonsistenter Anwendung von Sicherheitsrichtlinien und einer allgemeinen Verschlechterung der Sicherheitsposition führen. Dies kann zu unbefugtem Zugriff, Privilegienerweiterung oder Dienstunterbrechung führen und die Vertraulichkeit, Integrität und Verfügbarkeit der betroffenen Server und der von ihnen verarbeiteten Daten gefährden.",
      "asvs": "BSI IT-Grundschutz SYS.1.1 Allgemeiner Server — insbesondere A11 (Sicherheitsrichtlinie für Server), A16 (Sichere Installation und Basiskonfiguration), A23 (Systemüberwachung) und A39 (Zentrale Verwaltung von Sicherheitsrichtlinien).",
      "action": "Implementierung eines zentralisierten Konfigurationsmanagements und kontinuierlicher Schulungen",
      "mitigation": "Etablieren und erzwingen Sie Sicherheits-Baselines für alle Server-Betriebssysteme unter Verwendung eines zentralisierten Konfigurationsmanagementsystems (z. B. Ansible, Puppet, Chef, SaltStack oder GPOs). ",
      "check": "Wird ein zentralisiertes Konfigurationsmanagement-Tool verwendet? Sind Sicherheits-Baselines für Server-Betriebssysteme definiert, dokumentiert und durchgesetzt? Werden regelmäßige Audits durchgeführt, um Konfigurationsdrift zu erkennen? Erhalten Administratoren regelmäßige Schulungen zu den eingesetzten Betriebssystemversionen?",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die als serverähnliche Technologien identifiziert werden (z. B. Webserver, Anwendungsserver, Datenbanken, Backend-Dienste). Das Risiko ist inhärent in manuell oder inkonsistent verwalteten Umgebungen.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein Falsch-Positiv sein, wenn ein ausgereiftes, automatisiertes Konfigurationsmanagementsystem und ein robustes Schulungsprogramm vorhanden sind, auch wenn dies nicht explizit modelliert ist. Das Risiko dient als dringende Empfehlung, diese betrieblichen Prozesse zu überprüfen."
    },
    "regular-work-with-admin-privileges-bsi-ops115-a6": {
      "title": "Regelmäßiges Arbeiten mit administrativen Berechtigungen (BSI OPS.1.1.5 A6)",
      "description": "Die Durchführung regulärer Benutzeraufgaben (z. B. E-Mail, Webbrowsing) mit administrativen Berechtigungen – insbesondere auf Serversystemen – stellt ein erhebliches Sicherheitsrisiko dar, da es gegen das Prinzip der geringsten Rechte verstößt. Wenn ein Benutzer mit erhöhten Rechten angemeldet ist, wird jeder bösartige Code, auf den er trifft (über Phishing, bösartige Websites usw.), ebenfalls mit denselben erhöhten Rechten ausgeführt. Diese Vorgehensweise erhöht die Angriffsfläche für die Kompromittierung des Assets und des gesamten Netzwerks dramatisch.",
      "impact": "Wenn ein für tägliche Aufgaben verwendetes Administratorkonto kompromittiert wird, erlangt ein Angreifer weitreichende Berechtigungen auf dem Server und potenziell anderen verbundenen Systemen. Dies kann zur vollständigen Systemübernahme, zum Diebstahl oder zur Zerstörung von Daten und zur lateralen Bewegung im Netzwerk mithilfe von Techniken wie Pass-the-Hash führen. Der Missbrauch dieser weitreichenden Privilegien durch legitime Administratoren, die böswillig handeln, ist ebenfalls ein erhebliches Bedrohungsszenario.",
      "asvs": "BSI IT-Grundschutz / BSI 200-2, Baustein OPS.1.1.5 Identity and Access Management, Anforderung A6: Restriktive Vergabe von Berechtigungen (Least-Privilege-Prinzip).",
      "action": "Strikte Trennung von Benutzer- und Administratorkonten durchsetzen",
      "mitigation": "Setzen Sie das Prinzip der geringsten Rechte strikt durch. Administratoren müssen für alle regulären Aufgaben ein standardmäßiges, nicht privilegiertes Benutzerkonto verwenden. Ein separates, dediziertes Administratorkonto darf nur zur Durchführung administrativer Aufgaben verwendet werden. Dieser administrative Zugriff sollte zusätzlich durch Multi-Faktor-Authentifizierung und Sitzungsüberwachung (z. B. über eine Privileged Access Management (PAM)-Lösung) geschützt werden. Serversysteme sollten gehärtet werden, um standardmäßige Benutzeraktivitäten wie das Surfen im Internet zu verhindern.",
      "check": "Sind administrative und Standard-Benutzerkonten strikt getrennt? Gibt es eine Richtlinie, die die Verwendung von Administratorkonten für nicht-administrative Aufgaben verhindert? Ist das Flag `usedAsClientByHuman` im Modell bei serverähnlichen technischen Assets auf `true` gesetzt? Dieses Flag weist auf einen potenziellen Verstoß hin.",
      "detectionLogic": "Dieses Risiko wird für jedes nicht-Client technische Asset (z. B. Server, Backends, Datenbanken) erkannt, bei dem die Eigenschaft `usedAsClientByHuman` auf `true` gesetzt ist. Diese Eigenschaft zeigt an, dass ein Mensch eine serverähnliche Komponente für interaktive Aufgaben verwendet, was stark auf dieses Antipattern hindeutet.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn die Bedingung erfüllt ist, da dies einen direkten und bekannten Angriffsvektor darstellt. Die Auswirkung leitet sich aus der CIA-Bewertung des betroffenen technischen Assets ab. Eine Kompromittierung einer administrativen Sitzung auf einem unternehmenskritischen Asset hat eine sehr hohe Auswirkung.",
      "falsePositives": "Ein Falsch-Positiv könnte auftreten, wenn ein System legitim ein Server ist, aber auch eine dedizierte, sandboxed Client-Schnittstelle für einen spezifischen, gerechtfertigten Zweck hat. In solchen Fällen sollte das Risiko mit Begründung akzeptiert oder das Modell aktualisiert werden, um die Architektur besser widerzuspiegeln (z. B. durch Aufteilung des Assets in eine Server- und eine Client-Komponente)."
    },
    "data-loss-on-servers": {
      "title": "Datenverlust auf Servern (BSI SYS.1.1)",
      "description": "Der Verlust von Daten auf Servern kann erhebliche Konsequenzen für Geschäftsprozesse und die gesamte Organisation haben. ",
      "impact": "Wenn institutionell relevante Informationen zerstört oder verfälscht werden, können Geschäftsprozesse verzögert oder vollständig zum Erliegen kommen. ",
      "asvs": "BSI IT-Grundschutz SYS.1.1 Allgemeiner Server; siehe Verfügbarkeits- und Redundanzmaßnahmen (z. B. SYS.1.1.A28).",
      "action": "Implementierung einer robusten Datensicherungs- und Wiederherstellungsstrategie und/oder einer Hochverfügbarkeitsarchitektur",
      "mitigation": "Um das Risiko von Datenverlust zu mindern, implementieren Sie einen umfassenden Plan zur Datensicherung und -wiederherstellung. Dieser sollte regelmäßige, automatisierte Sicherungen aller kritischen Daten umfassen. ",
      "check": "Werden regelmäßige Datensicherungen für alle kritischen Serversysteme durchgeführt? Ist der Datenwiederherstellungsprozess dokumentiert und wird er regelmäßig getestet? ",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets vom Typ `datastore` (oder Technologien, die typischerweise Daten speichern) ausgelöst, die nicht als `redundant: true` markiert sind. ",
      "riskAssessment": "Die Auswirkung von Datenverlust ist direkt proportional zu den Bewertungen für `Verfügbarkeit` und `Integrität` des technischen Assets. Ein `unternehmenskritisches` Asset führt zu einer sehr hohen Auswirkung. ",
      "falsePositives": "Ein Risiko könnte für ein Asset gekennzeichnet werden, das eine Out-of-Band-Sicherungslösung hat, die nicht im Modell erfasst ist. "
    },
    "denial-of-service-on-resources": {
      "title": "Denial-of-Service gegen Daten- und Systemressourcen (BSI)",
      "description": "Ein Denial-of-Service (DoS)-Angriff zielt auf die Verfügbarkeit von Daten-Assets, Systemen oder Funktionen ab, um eine autorisierte Nutzung zu verhindern. ",
      "impact": "Ein erfolgreicher DoS-Angriff kann Dienste oder Ressourcen vollständig unbrauchbar machen und den Geschäftsbetrieb stören. Aufgrund der starken gegenseitigen Abhängigkeit moderner IT-Systeme kann ein Ressourcenengpass auf einem Server schnell zu kaskadierenden Ausfällen führen, die abhängige Systeme und Dienste beeinträchtigen.",
      "asvs": "ASVS V1.4.4 (Business Logic DoS), V12.5.1 (Ressourcenauslastung)",
      "action": "Implementierung eines mehrschichtigen DoS-Schutzes und Ressourcenmanagements",
      "mitigation": "Setzen Sie eine Kombination von Abwehrmaßnahmen ein: ",
      "check": "Sind DoS-Schutzdienste (WAF, CDN-Schutz) für dem Internet ausgesetzte Assets vorhanden? Sind kritische Dienste redundant? Wird die Ressourcenauslastung aktiv mit Alarmierung überwacht? Ist Ratenbegrenzung auf öffentlich zugänglichen APIs implementiert?",
      "detectionLogic": "Dieses Risiko wird für im Geltungsbereich befindliche technische Assets generiert, die potenziellen DoS-Angriffen ausgesetzt sind. Hauptkandidaten sind dem Internet ausgesetzte Assets, insbesondere solche, die Webanwendungen oder -dienste bereitstellen. Nicht redundante Assets mit hohen Verfügbarkeitsanforderungen sind besonders anfällig, da ihr Ausfall erhebliche Auswirkungen hat.",
      "riskAssessment": "Die Wahrscheinlichkeit eines DoS-Angriffs ist für jeden dem Internet ausgesetzten Dienst sehr hoch. Die Auswirkung korreliert mit der Verfügbarkeitsanforderung des Assets und den von ihm verarbeiteten Daten. Ein nicht redundantes, unternehmenskritisches Asset stellt ein Risiko mit sehr hoher Auswirkung dar. Die Auswirkung erhöht sich weiter, wenn viele andere Assets vom Ziel abhängen (kaskadierender Ausfall).",
      "falsePositives": "Dieses Risiko kann durch externe Dienste (z. B. Cloudflare, Akamai, AWS Shield) teilweise gemindert werden, die nicht explizit modelliert sind. Die Regel löst das Risiko aus, um sicherzustellen, dass solche Schutzmaßnahmen berücksichtigt und überprüft werden."
    },
    "unnecessary-services-on-server-sys1-1-a12": {
      "title": "Unnötige Anwendungen und Dienste auf Servern (BSI SYS.1.1.A12)",
      "description": "Während der Betriebssysteminstallation oder im späteren Betrieb werden oft Anwendungen und Dienste installiert, die für den Zweck des Assets nicht wirklich erforderlich sind. ",
      "impact": "Die Ausnutzung von Schwachstellen in ungepatchten, unnötigen Diensten kann zur Kompromittierung des Systems führen, wodurch Angreifer Daten manipulieren, sensible Informationen offenlegen oder den Server als Dreh- und Angelpunkt für weitere Angriffe nutzen können. Dies gefährdet die Vertraulichkeit, Integrität und Verfügbarkeit des Servers und der von ihm verarbeiteten Daten.",
      "asvs": "BSI IT-Grundschutz-Kompendium: SYS.1.1 Allgemeiner Server, Anforderung SYS.1.1.A12 (Deaktivierung nicht benötigter Dienste). Dies steht auch in engem Zusammenhang mit OWASP Top 10 A06:2021 - Vulnerable and Outdated Components.",
      "action": "Implementierung von Systemhärtung und Konfigurationsmanagement",
      "mitigation": "Etablieren Sie eine Härtungs-Baseline für alle Server, die das Prinzip der geringsten Funktionalität anwendet. Deaktivieren oder deinstallieren Sie alle Dienste, Anwendungen und Funktionen, die nicht explizit für den Geschäftszweck des Servers erforderlich sind. Überprüfen Sie Server regelmäßig anhand dieser Baseline, um unnötige Software zu identifizieren und zu entfernen. Integrieren Sie diese Prüfung in den Server-Provisionierungsprozess. Im Bedrohungsmodell kennzeichnen Sie das Asset mit `Hardening:Standard` oder `Hardening:Minimal`, um dies anzuzeigen.",
      "check": "Basieren Serverkonfigurationen auf einem dokumentierten Härtungsstandard? Gibt es einen Prozess zur Überprüfung und Genehmigung aller installierten Software? Werden Server regelmäßig auf offene Ports und laufende Dienste gescannt, um Abweichungen von der Baseline zu identifizieren?",
      "detectionLogic": "Dies ist ein operatives Hygienerisiko. Das Werkzeug kann nicht definitiv bestimmen, welche Dienste „unnötig“ sind. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist für jedes Server-Asset ohne einen dokumentierten Härtungsprozess hoch. Die Auswirkung steht in direktem Zusammenhang mit den CIA-Anforderungen des Servers und der von ihm verarbeiteten Daten. Ein kompromittierter Server, der ",
      "falsePositives": "Dieses Risiko kann als Falsch-Positiv betrachtet werden, wenn ein starker, automatisierter Konfigurationsmanagement- und Härtungsprozess vorhanden ist, dieser aber nicht durch das Anwenden des entsprechenden `Hardening`-Tags auf das Asset im Bedrohungsmodell dokumentiert wurde."
    },
    "server-overload-due-to-insufficient-capacity": {
      "title": "Serverüberlastung aufgrund unzureichender Kapazität (BSI CON.8)",
      "description": "Wenn Server nicht richtig dimensioniert sind, können sie die Anforderungen der Organisation möglicherweise nicht erfüllen.",
      "impact": "Nicht redundante Server, die aufgrund von Überlastung ausfallen, gefährden direkt die Verfügbarkeit. Wenn der Ausfall zu Datenbeschädigung oder -verlust führt, ist auch die Integrität betroffen. Dies kann Geschäftsprozesse stören, finanzielle Verluste verursachen und die Organisation schädigen.",
      "asvs": "N/A (abgeleitet vom BSI)",
      "action": "Implementierung von Kapazitätsmanagement und -überwachung",
      "mitigation": "Überwachen Sie kontinuierlich wichtige Leistungsindikatoren (KPIs) für Server und Dienste, einschließlich CPU-, Speicher-, Speicherplatz- und Netzwerkauslastung. Implementieren Sie automatisierte Warnungen, um Administratoren zu benachrichtigen, wenn vordefinierte Schwellenwerte überschritten werden. Entwerfen Sie kritische Systeme für hohe Verfügbarkeit und Skalierbarkeit unter Verwendung von Redundanz, wie z. B. Lastverteilern, Failover-Clustern oder Cloud-basierten Auto-Scaling-Gruppen. Führen Sie regelmäßige Kapazitätsplanungen auf der Grundlage historischer Trends und des erwarteten Geschäftswachstums durch, um Ressourcen proaktiv bereitzustellen.",
      "check": "Werden Leistungs- und Kapazitätsmetriken für kritische Systeme überwacht? Sind Alarmierungsmechanismen für Hochlast-Szenarien vorhanden? Sind kritische Systeme mit Redundanz oder Skalierbarkeit konzipiert? Gibt es einen dokumentierten Kapazitätsmanagementprozess?",
      "detectionLogic": "Dieses Risiko wird für technische Assets identifiziert, die für den Geschäftsbetrieb kritisch sind, aber keine Redundanz aufweisen. Das Risiko wird für nicht redundante Assets mit hohen oder unternehmenskritischen Verfügbarkeitsanforderungen ausgelöst. Die Wahrscheinlichkeit steigt, wenn das Asset eine zentrale Komponente mit vielen eingehenden Datenflüssen ist, was auf eine hohe potenzielle Last und eine erhebliche Auswirkung auf abhängige Systeme hindeutet.",
      "riskAssessment": "Die Auswirkung dieses Risikos korreliert mit den Verfügbarkeits- und Integritätsanforderungen des betroffenen Assets und der von ihm verarbeiteten Daten. Eine nicht redundante, unternehmenskritische Datenbank stellt ein sehr hohes Risiko dar. Die Wahrscheinlichkeit ist für solche Systeme höher, insbesondere wenn sie als Knotenpunkt für viele andere Komponenten dienen, was durch eine hohe Anzahl eingehender Kommunikationsverbindungen angezeigt wird.",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn Redundanz durch Mechanismen erreicht wird, die nicht in Threagile modelliert sind, wie z. B. Hochverfügbarkeitsfunktionen (HA) von Virtualisierungsplattformen oder zugrunde liegender Hardware, die nicht explizit im Modell detailliert sind."
    },
    "uncontrolled-use-of-integrated-cloud-services": {
      "title": "Unkontrollierte Nutzung integrierter Cloud-Dienste",
      "description": "Moderne Client-Betriebssysteme wie Windows enthalten oft tief integrierte Cloud-Dienste (z. B. über ein Microsoft-Konto) zur Datenspeicherung und -synchronisation. ",
      "impact": "Die unkontrollierte Nutzung integrierter Cloud-Dienste kann zu einer Verletzung der Vertraulichkeit und zur Nichteinhaltung von Datenschutzbestimmungen (wie der DSGVO) führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.6 (Mobile Geräte) und CON.3 (Clients unter Windows 10/11), die eine restriktive Konfiguration von Cloud-Diensten empfehlen.",
      "action": "Einschränkung oder Kontrolle integrierter Cloud-Dienste durch zentrale Verwaltung",
      "mitigation": "Verwenden Sie zentrale Verwaltungstools wie Gruppenrichtlinien (GPO) oder eine Mobile Device Management (MDM)-Lösung, um die Nutzung integrierter Cloud-Dienste zu deaktivieren oder streng zu kontrollieren. ",
      "check": "Gibt es GPO- oder MDM-Richtlinien zur Kontrolle der Nutzung integrierter Cloud-Dienste? Werden Benutzer daran gehindert, persönliche Cloud-Konten auf Unternehmenssystemen zu verwenden? Ist die Sicherung sensibler Informationen wie BitLocker-Schlüssel in nicht verwaltete Cloud-Konten deaktiviert?",
      "detectionLogic": "Dieses Risiko ist vielen modernen Client-Betriebssystemen inhärent. Es wird automatisch für jeden ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jedes nicht verwaltete Client-System als hoch angesehen, da diese Cloud-Integrationen oft Standardeinstellungen sind. ",
      "falsePositives": "Ein Risiko könnte für ein Client-System gekennzeichnet werden, bei dem die Organisation diese Cloud-Dienste absichtlich unter einem verwalteten Unternehmens-Mandanten mit angemessenen Sicherheitskontrollen nutzt. "
    },
    "insecure-windows-server-2012-configuration": {
      "title": "Unsichere oder inkonsistente Konfiguration von Windows Server 2012/R2",
      "description": "Windows Server 2012 und 2012 R2 haben neue Sicherheitsfunktionen eingeführt und bestehende modifiziert. ",
      "impact": "Fehlkonfigurationen können ausnutzbare Schwachstellen schaffen und die Vertraulichkeit, Integrität und Verfügbarkeit des Servers und der von ihm verarbeiteten Daten gefährden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz. Bezogen auf ASVS V14.2.1 (Komponenten-Härtung).",
      "action": "Implementierung von Härtung und zentralisiertem Konfigurationsmanagement für Windows Server 2012/R2",
      "mitigation": "Etablieren und erzwingen Sie eine verbindliche Härtungs-Baseline für alle Windows Server 2012/R2-Instanzen, basierend auf bewährten Sicherheitspraktiken (z. B. von CIS Benchmarks oder Microsoft). ",
      "check": "Werden Konfigurationen für Windows Server 2012/R2-Instanzen zentral verwaltet und dokumentiert? ",
      "detectionLogic": "Dieses Risiko wird für alle im Geltungsbereich befindlichen technischen Assets ausgelöst, die über Tags als Windows Server 2012 oder Windows Server 2012 R2 identifiziert werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist erhöht, wenn der Server dem Internet ausgesetzt ist oder veraltete Protokolle wie unverschlüsseltes SMB oder LDAP verwendet. ",
      "falsePositives": "Dieses Risiko könnte ein Falsch-Positiv sein, wenn der identifizierte Server trotz seines Betriebssystems nachweislich vollständig gehärtet, konsistent über ein zentrales Tool verwaltet und regelmäßig auditiert wird. Eine manuelle Überprüfung der betrieblichen Sicherheitspraktiken ist erforderlich, um die Minderung zu bestätigen."
    }
  }
}
