{
  "meta": {
    "part": 3,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 3 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "insecure-data-deletion-con6": {
      "title": "Unsicheres Löschen von Daten (BSI CON.6)",
      "description": "Die meisten Anwendungen und Betriebssysteme löschen Dateien standardmäßig nicht sicher und unumkehrbar.",
      "impact": "Wenn Daten nicht sicher gelöscht werden, können Unbefugte auf sensible Informationen wie Passwörter, kryptografische Schlüssel und vertrauliche Daten zugreifen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.6 (Löschen und Vernichten), speziell Anforderung CON.6.A1 (Regeln zum sicheren Löschen und Vernichten).",
      "action": "Implementierung und Durchsetzung von Richtlinien und Werkzeugen zum sicheren Löschen",
      "mitigation": "Verwenden Sie spezialisierte Werkzeuge, um Daten von Datenträgern vor der Entsorgung oder Wiederverwendung sicher zu löschen.",
      "check": "Werden sichere Löschmethoden (z. B. Daten-Shredder-Software) für alle Datenträger vor der Entsorgung oder Weitergabe verwendet? Ist die Festplattenverschlüsselung auf Assets, die sensible Daten speichern, aktiviert? Sind temporäre Dateien und Swap-Partitionen so konfiguriert, dass sie beim Herunterfahren gelöscht werden?",
      "detectionLogic": "Diese Regel wird für alle in-scope technischen Assets ausgelöst, die Daten speichern (z. B. Datenspeicher, Dateisysteme, Clients) oder für die Speicherung von Daten modelliert sind.",
      "riskAssessment": "Die Wahrscheinlichkeit, dass diese Schwachstelle vorhanden ist, ist auf den meisten Standardsystemen standardmäßig hoch. Die Wahrscheinlichkeit der Ausnutzung hängt vom Asset ab.",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn das sichere Löschen durch detailliert modellierte Kontrollen auf Plattformebene gehandhabt wird (z. B. durch einen Cloud-Anbieter)."
    },
    "improper-media-sanitization-by-supplier": {
      "title": "Unsachgemäße Datenträgerbereinigung durch externen Dienstleister (BSI CON.8, DER.1)",
      "description": "Wenn Datenträger (z. B. Datenspeicher, Festplatten) von externen Dienstleistern gelöscht oder vernichtet werden, können die darauf enthaltenen Informationen offengelegt werden, wenn der Prozess zur Einbindung des Dienstleisters nicht ausreichend geregelt und gesichert ist.",
      "impact": "Eine unsachgemäße Bereinigung von Datenträgern vor der Entsorgung oder Weitergabe an einen externen Dienstleister kann zur Offenlegung aller darauf gespeicherten Daten führen. Dies kann zu einer schwerwiegenden Verletzung der Vertraulichkeit führen, die Reputationsschäden, finanzielle Verluste und rechtliche oder regulatorische Strafen nach sich zieht, insbesondere wenn sensible persönliche oder geschäftliche Daten betroffen sind.",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz Bausteinen CON.8 (Löschen und Vernichten) und DER.1 (Allgemeiner Dienstleister).",
      "action": "Etablierung und Durchsetzung sicherer Verfahren zur Datenträgerbereinigung mit Dritten",
      "mitigation": "Implementieren Sie einen robusten, vertraglich durchgesetzten Prozess zur Datenträgerbereinigung und -vernichtung mit externen Dienstleistern. Dieser muss klare Verantwortlichkeiten, sicheren Transport und Lagerung der Datenträger, definierte Bereinigungsmethoden (z. B. konform mit NIST SP 800-88) und die Anforderung an den Dienstleister umfassen, für jeden Gegenstand ein verifizierbares Vernichtungszertifikat auszustellen. Der Prozess sollte regelmäßig auditiert werden.",
      "check": "Gibt es formelle Verträge mit externen Dienstleistern, die die Anforderungen an die sichere Datenträgerbereinigung und -vernichtung explizit detaillieren? Gibt es einen dokumentierten Prozess für die Handhabung, den Transport und die Überprüfung der Vernichtung von Datenträgern? Werden Vernichtungszertifikate gesammelt und archiviert?",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Das Schadenausmaß wird durch die höchste Vertraulichkeit und Integrität der auf dem Asset gespeicherten Daten bestimmt. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Kommunikationsverbindung für Zwecke genutzt wird, die völlig unabhängig vom System- oder Datenlebenszyklus-Management sind (z. B. nur die Nutzung einer öffentlichen API der externen Entität). Es ist auch ein False Positive, wenn ein robuster, auditierter und vertraglich verpflichtender Löschprozess existiert, der im Bedrohungsmodell nicht vollständig abgebildet werden kann."
    },
    "improper-media-disposal-or-repair": {
      "title": "Unsachgemäße Entsorgung oder Handhabung defekter Datenträger",
      "description": "Wenn defekte Datenträger oder IT-Geräte entsorgt oder zur Reparatur eingeschickt werden, ohne dass die darauf befindlichen Daten sicher gelöscht oder vernichtet wurden, könnten die Daten während des Entsorgungs- oder Reparaturprozesses offengelegt werden.",
      "impact": "Die unbefugte Offenlegung sensibler Informationen, die auf dem Datenträger gespeichert sind. Dies stellt eine Verletzung der Vertraulichkeit dar und kann zur Nichteinhaltung gesetzlicher oder vertraglicher Anforderungen führen,",
      "asvs": "V14.3.1 (Stellen Sie sicher, dass alle sensiblen Daten sicher gelöscht werden, wenn sie nicht mehr benötigt werden.)",
      "action": "Etablierung und Durchsetzung einer Richtlinie zur sicheren Datenträgerbereinigung und -entsorgung",
      "mitigation": "Implementieren Sie eine formelle Richtlinie für den Umgang mit defekten oder ausgedienten Datenträgern, die sensible Informationen enthalten.",
      "check": "Gibt es eine dokumentierte und durchgesetzte Richtlinie für den Umgang mit defekten oder ausgedienten Datenträgern? Sind die Mitarbeiter in dieser Richtlinie geschult?",
      "detectionLogic": "Diese Regel wird für Datenspeicher auf physischen oder virtuellen Maschinen ausgelöst, die sensible Daten verarbeiten. Das Risiko gilt als mitigiert, wenn das Asset mit dem Tag ",
      "riskAssessment": "Das Schadenausmaß wird durch die höchste Vertraulichkeit und Integrität der auf dem Asset gespeicherten Daten bestimmt.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn ein robuster, durchgesetzter Entsorgungsprozess existiert, dieser aber im Bedrohungsmodell über das Mitigation-Tag dokumentiert ist."
    },
    "espionage-during-foreign-travel": {
      "title": "Spionage während Auslandsreisen (BSI-Gefährdung)",
      "description": "Spionage bezeichnet Angriffe, die darauf abzielen, Informationen über Institutionen, Personen oder Produkte zu sammeln, auszuwerten und zu verarbeiten.",
      "impact": "Erfolgreiche Spionage während Auslandsreisen führt zu einer Verletzung der Vertraulichkeit und Integrität sensibler Daten.",
      "asvs": "Dieses Bedrohungsszenario wird vom BSI IT-Grundschutz-Kompendium beschrieben, lässt sich aber keinem einzelnen Baustein zuordnen. Es",
      "action": "Implementierung sicherer Reiserichtlinien und Härtung von Geräten",
      "mitigation": "Etablieren Sie eine klare Informationssicherheitsrichtlinie für Auslandsreisen. Verwenden Sie dedizierte, gehärtete ",
      "check": "Gibt es eine Sicherheitsrichtlinie für Auslandsreisen? Werden Mitarbeiter über diese Risiken geschult? Sind tragbare Geräte, die für Reisen verwendet werden, gehärtet und verschlüsselt?",
      "detectionLogic": "Dieses Risiko wird für tragbare technische Assets (z. B. Laptops, Mobiltelefone) ausgelöst, die als für Auslandsreisen verwendet gekennzeichnet sind.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Spionageversuchs wird bei jeder internationalen Reise als wahrscheinlich angesehen, insbesondere wenn hochwertige Daten betroffen sind.",
      "falsePositives": "Das Risiko könnte als False Positive betrachtet werden, wenn die Reise in ein nachweislich risikoarmes Land führt und sich keine sensiblen Daten auf dem Gerät befinden."
    },
    "unsafe-handling-of-information-during-travel": {
      "title": "Unsicherer Umgang mit Informationen während Geschäftsreisen (BSI CON.1-Szenario)",
      "description": "Während Geschäftsreisen besteht ein erhöhtes Risiko der unbeabsichtigten Offenlegung oder Kompromittierung sensibler Informationen.",
      "impact": "Eine Kompromittierung während einer Reise kann zum Diebstahl, zur Manipulation oder zur Zerstörung von auf dem Gerät gespeicherten Daten führen und somit dessen Vertraulichkeit und Integrität verletzen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Mobile Endgeräte), insbesondere Anforderung CON.1.A5 (Nutzung mobiler Endgeräte in der Öffentlichkeit).",
      "action": "Implementierung sicherer Reiserichtlinien und technischer Kontrollen",
      "mitigation": "Etablieren Sie eine klare Sicherheitsrichtlinie für Geschäftsreisen. Schreiben Sie die Verwendung technischer Kontrollen wie Festplattenverschlüsselung (FDE) für alle Reisegeräte vor.",
      "check": "Sind alle Reisegeräte mit FDE ausgestattet? Wird für Fernverbindungen ein unternehmenseigenes VPN erzwungen?",
      "detectionLogic": "Dieses Risiko wird für jedes in-scope technische Asset vom Typ Client (z. B. Laptop, mobiles Gerät) ausgelöst.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Vorfalls ist hoch, wenn einem Reisegerät grundlegende Kontrollen wie Verschlüsselung fehlen. Das Schadenausmaß steht in direktem Zusammenhang mit dem ",
      "falsePositives": "Ein Modell kann das tatsächliche Benutzerverhalten nicht bestätigen. Eine Organisation kann starke, durchgesetzte Reisesicherheitsrichtlinien haben, die dieses Risiko in der Praxis mindern,"
    },
    "spoofing-in-untrusted-environments-con3": {
      "title": "Spoofing und Identitätsdiebstahl bei der Kommunikation in nicht vertrauenswürdigen Umgebungen (BSI CON.3)",
      "description": "Bei der Kommunikation in nicht vertrauenswürdigen Umgebungen (z. B. auf Reisen, in fremden Einrichtungen) besteht ein erhöhtes Risiko von Identitätsdiebstahl und Spoofing-Angriffen.",
      "impact": "Erfolgreiche Spoofing- oder Identitätsdiebstahl-Angriffe können zur unbefugten Offenlegung sensibler Informationen und zur Kompromittierung der Datenintegrität führen.",
      "asvs": "V4.1: Communication Security Requirements",
      "action": "Implementierung starker Authentifizierung und verschlüsselter Kommunikationskanäle",
      "mitigation": "Die gesamte Kommunikation, insbesondere über Vertrauensgrenzen hinweg oder von nicht vertrauenswürdigen Standorten aus, muss durch eine starke Ende-zu-Ende-Verschlüsselung (z. B. TLS 1.2+) geschützt werden.",
      "check": "Verwenden alle Kommunikationsverbindungen, insbesondere solche, die Vertrauensgrenzen überschreiten, verschlüsselte Protokolle (z. B. HTTPS, SFTP, WSS)? Wird eine starke, Multi-Faktor- oder zertifikatsbasierte Authentifizierung verwendet? Werden Assets, die an risikoreichen Standorten eingesetzt werden, explizit mit erhöhten Sicherheitskontrollen verwaltet?",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen. Sie kennzeichnet Verbindungen, die eine Vertrauensgrenze ohne Verschlüsselung und starke Authentifizierung überschreiten.",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist bei unverschlüsselter oder nicht authentisierter Kommunikation über Vertrauensgrenzen hinweg hoch. Das Schadenausmaß wird durch die Sensibilität (Vertraulichkeit und Integrität) der über die Verbindung übertragenen Daten bestimmt. Eine Verbindung, die ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn außerhalb des Modells kompensierende Kontrollen existieren, wie z. B. ein obligatorisches, immer aktives Unternehmens-VPN, das den gesamten Verkehr von einem Reiselaptop schützt, auch wenn die direkte Verbindung als HTTP modelliert ist."
    },
    "risk-of-data-leakage-during-international-travel-con3": {
      "title": "Risiko von Datenlecks bei internationalen Reisen (BSI CON.3)",
      "description": "Bei Reisen ins Ausland müssen Mitarbeiter die unterschiedlichen Gesetze und Vorschriften am Zielort berücksichtigen, die erheblich von den nationalen Gesetzen abweichen können.",
      "impact": "Die Nichteinhaltung ausländischer gesetzlicher Anforderungen oder die unzureichende Sicherung von IT-Assets bei internationalen Reisen kann zu unbefugtem Zugriff, Datendiebstahl oder erzwungener Offenlegung sensibler Informationen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.3 (Mobiler Arbeitsplatz), der den Schutz von IT-Systemen und Daten außerhalb der Organisation behandelt.",
      "action": "Implementierung von Richtlinien und technischen Kontrollen für internationale Reisen",
      "mitigation": "Etablieren Sie eine klare Sicherheitsrichtlinie für internationale Reisen. Technische Assets, die für Reisen verwendet werden, müssen über eine Festplattenverschlüsselung (FDE) verfügen.",
      "check": "Gibt es eine spezielle Richtlinie für internationale Reisen? Sind mobile Geräte, die für Reisen verwendet werden, mit FDE und obligatorischem VPN ausgestattet?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets identifiziert, die mobile oder Client-Systeme darstellen (z. B. Laptops, Mobiltelefone) und als für internationale Reisen verwendet gekennzeichnet sind.",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung wird aufgrund erhöhter Bedrohungen wie ungesicherten Netzwerken, physischem Diebstahl oder rechtlichem Zwang an Grenzen als hoch angesehen.",
      "falsePositives": "Ein Risiko könnte als False Positive betrachtet werden, wenn die Organisation robuste, durchgesetzte technische Kontrollen und obligatorische, zielortspezifische Schulungen für alle internationalen Reisen nachweisen kann,"
    },
    "coercion-during-foreign-travel-con4": {
      "title": "Nötigung, Bestechung oder Erpressung während Auslandsreisen (BSI CON.4)",
      "description": "Bei Reisen ins Ausland können Mitarbeiter aufgrund unterschiedlicher politischer und sozialer Umstände erhöhten Sicherheitsrisiken ausgesetzt sein.",
      "impact": "Eine erfolgreiche Nötigung oder Bestechung eines Mitarbeiters kann zur Umgehung etablierter Informationssicherheitskontrollen führen.",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz Bausteinen CON.4 (Dienstreisen und mobile Endgeräte) und ORP.4 (Personal).",
      "action": "Entwicklung und Durchsetzung einer sicheren Reiserichtlinie und Bereitstellung von Sicherheitsbriefings vor der Reise.",
      "mitigation": "Etablieren Sie eine umfassende Sicherheitsrichtlinie für internationale Reisen. Diese Richtlinie sollte Sicherheitsbriefings vor der Reise enthalten, die auf das Ziel zugeschnitten sind.",
      "check": "Gibt es eine formelle Sicherheitsrichtlinie für internationale Reisen? Erhalten Mitarbeiter, insbesondere solche in hochriskanten Positionen oder die in hochriskante Gebiete reisen, Sicherheitsbriefings?",
      "detectionLogic": "Dieses organisatorische und physische Risiko wird durch die Identifizierung technischer Assets erkannt, die wahrscheinlich bei internationalen Reisen verwendet werden und mit Personal in sensiblen Rollen in Verbindung stehen.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als HOCH angesehen, wenn eine sensible Rolle international reist, da sie ein Hauptziel darstellt. Das Potenzial für Nötigung ist erheblich.",
      "falsePositives": "Das Risiko könnte geringer sein, wenn die Reise in ein risikoarmes Land führt oder wenn die Organisation über starke, nicht nachverfolgte kompensierende Kontrollen verfügt (z. B. strenge, reale Reisesicherheitsprotokolle)."
    },
    "disinformation-during-business-travel-con-6-a22": {
      "title": "Desinformation während Geschäftsreisen (BSI CON.6.A22)",
      "description": "Während Geschäftsreisen im Ausland können Mitarbeitern absichtlich falsche oder irreführende Informationen zugespielt werden, um sie zu täuschen.",
      "impact": "Wenn die Täuschung erfolgreich ist, können falsche Aussagen in geschäftskritische Berichte und Systeme einfließen.",
      "asvs": "BSI IT-Grundschutz Kompendium: CON.6 Auslandseinsatz, Anforderung A22",
      "action": "Implementierung von Verfahren zur Überprüfung und Bestätigung von im Ausland gesammelten Informationen",
      "mitigation": "Personal, das ins Ausland reist, muss über die Risiken der Desinformation geschult werden. Etablieren Sie klare Verfahren zur Überprüfung und Bestätigung kritischer Informationen, die während der Reise von externen oder nicht vertrauenswürdigen Quellen gesammelt wurden.",
      "check": "Sind sich Reisende der Desinformationsrisiken bewusst? Gibt es definierte Prozesse zur Validierung von Informationen aus nicht vertrauenswürdigen Quellen im Ausland? Gibt es einen Genehmigungs- oder Überprüfungsschritt für kritische Daten, die während der Reise gesammelt wurden?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Daten mit hoher Integrität verarbeiten oder speichern und als im Kontext von Geschäftsreisen verwendet gekennzeichnet sind (z. B. über ein `@Context:BusinessTravel`-Tag).",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn das Asset, obwohl es im Ausland verwendet wird, nur vorab geprüfte Informationen aus vertrauenswürdigen internen Quellen konsumiert und keine Eingabe neuer, unverifizierter Informationen zulässt."
    },
    "loss-or-theft-of-mobile-devices-con1": {
      "title": "Verlust oder Diebstahl von mobilen Geräten (BSI CON.1)",
      "description": "Mobile Geräte, insbesondere wenn sie außerhalb gesicherter Firmenräume oder auf Reisen verwendet werden, sind sehr anfällig für Verlust oder Diebstahl. Je kleiner und begehrter das Gerät, desto höher das Risiko.",
      "impact": "Der Verlust eines mobilen Geräts kann zu einer Verletzung der Vertraulichkeit führen, wenn sensible Daten nicht ausreichend geschützt sind. Dies kann zu finanziellen Verlusten, Reputationsschäden für die Institution und Verstößen gegen gesetzliche oder vertragliche Verpflichtungen (z. B. @DataType:PII) führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Mobiles Endgerät). Bezieht sich speziell auf die Gefährdung G 0.14 (Verlust von mobilen IT-Systemen).",
      "action": "Implementierung und Durchsetzung von Sicherheitsrichtlinien für mobile Geräte",
      "mitigation": "Auf allen mobilen Geräten muss die Verschlüsselung von Daten im Ruhezustand (Data-at-Rest) aktiviert sein (z. B. Festplattenverschlüsselung).",
      "check": "Werden alle mobilen Geräte, die Unternehmensdaten verarbeiten, von einem MDM verwaltet? Ist die Verschlüsselung von Daten im Ruhezustand erzwungen?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets der Technologie ",
      "riskAssessment": "Das Schadenausmaß wird durch die höchste Sensibilität (Vertraulichkeit, Integrität und Verfügbarkeit) der Daten-Assets bestimmt, die vom mobilen Gerät verarbeitet oder gespeichert werden.",
      "falsePositives": "Ein Gerät könnte als mobil klassifiziert sein, aber an einem festen, physisch sicheren Ort verwendet werden (z. B. ein Tablet in einem Kiosk). In solchen Fällen könnte das Risiko von Verlust oder Diebstahl erheblich geringer sein und als False Positive betrachtet oder mit Begründung akzeptiert werden."
    },
    "unsuitable-development-environment": {
      "title": "Ungeeignete oder individuelle Entwicklungsumgebung",
      "description": "Wenn eine ungeeignete Entwicklungsumgebung verwendet wird oder wenn Mitarbeiter ihre eigenen Umgebungen individuell auswählen,",
      "impact": "Die Verwendung von nicht standardisierten oder ungeeigneten Entwicklungswerkzeugen kann Schwachstellen oder Mängel in das Endprodukt der Software einbringen,",
      "asvs": "V14.3.1",
      "action": "Standardisierung und Überprüfung der Entwicklungswerkzeugkette",
      "mitigation": "Definieren Sie eine standardisierte, obligatorische Entwicklungs- und Build-Umgebung (Toolchain) für alle eigenentwickelten Komponenten.",
      "check": "Gibt es eine definierte, obligatorische Entwicklungswerkzeugkette für alle Entwickler? Werden die Werkzeuge in dieser Toolchain auf Sicherheit geprüft und auf dem neuesten Stand gehalten?",
      "detectionLogic": "Dieses Risiko wird für in-scope technische Assets ausgelöst, die als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn der Entwicklungsprozess modelliert ist oder wenn eine Komponente anscheinend außerhalb des modellierten Prozesses erstellt wurde.",
      "falsePositives": "Die Organisation könnte einen gut definierten und sicheren Entwicklungsprozess haben, der einfach nicht vollständig im Bedrohungsmodell dargestellt ist."
    },
    "insufficient-software-development-qa": {
      "title": "Ungenügende Qualitätssicherung in der Softwareentwicklung",
      "description": "Aufgrund eines fehlenden oder unzureichenden Qualitätssicherungsprozesses (QS) während der Softwareentwicklung können Schwachstellen in die ausgelieferte Software eingeführt werden. Wenn die Sicherheits-QS nicht fest im Entwicklungsprozess verankert ist, werden Fehler, Schwachstellen und Manipulationen im Design oder in der Implementierung möglicherweise nicht erkannt. Dieses Risiko gilt sowohl für eigenentwickelten Code als auch für die Verwendung von Drittanbieter- oder Open-Source-Komponenten, die bekannte Schwachstellen enthalten können.",
      "impact": "Ungeprüfte Schwachstellen in Software können von Angreifern ausgenutzt werden, was zu einer Kompromittierung der Vertraulichkeit (Datenlecks), Integrität (unbefugte Datenänderung) und Verfügbarkeit (Denial of Service) führt. Dies kann zu erheblichen finanziellen Verlusten, Reputationsschäden und der Nichteinhaltung von Compliance-Anforderungen führen.",
      "asvs": "ASVS V4.0.3 - 14.2 Software Component Verification Requirements",
      "action": "Integration einer sicherheitsorientierten Qualitätssicherung in den Entwicklungslebenszyklus",
      "mitigation": "Etablieren Sie einen robusten Qualitätssicherungsprozess innerhalb des Secure SDLC. Dies umfasst die Verwendung von Werkzeugen für statische (SAST) und dynamische (DAST) Anwendungssicherheitstests sowie Software Composition Analysis (SCA) zur Identifizierung von Schwachstellen in Bibliotheken von Drittanbietern. Integrieren Sie diese Prüfungen in die CI/CD-Pipeline (z. B. durch Verknüpfung eines ",
      "check": "Gibt es ein ",
      "detectionLogic": "Diese Regel wird für jedes in-scope, eigenentwickelte technische Asset ausgelöst, das mit einem relevanten QS-Mitigation-Tag versehen ist (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch für internetzugängliche oder andere exponierte Assets, die mit weniger geschützten Technologien (wie Webanwendungen) erstellt wurden. Das Schadenausmaß wird durch die maximalen CIA-Anforderungen des Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Ein Asset, das ",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn der QS-Prozess existiert, aber nicht modelliert ist (z. B. wenn die QS von einem Dritten durchgeführt wird und nicht durch ein Asset oder Tag im Modell dargestellt ist)."
    },
    "insufficient-software-documentation": {
      "title": "Ungenügende Software-Dokumentation (BSI APP.4.4)",
      "description": "Wenn Software während der Konzeptions- oder Entwicklungsphase nicht ordnungsgemäß oder unzureichend dokumentiert wird, kann dies zu einer verzögerten oder unmöglichen Diagnose und Behebung potenzieller Fehler führen.",
      "impact": "Eine fehlerhafte Bedienung oder Administration aufgrund mangelhafter Dokumentation kann IT-Dienste stören, zu fehlerhaften Arbeitsergebnissen führen, Arbeitsabläufe verzögern und zu Sicherheitsschwachstellen führen (z. B. durch Fehlkonfiguration).",
      "asvs": "ASVS V1.1.2 (Architektur) - Überprüfen Sie, dass für jede Komponente oder jeden Dienst in einem System eine sicherheitsrelevante Dokumentation erstellt wird, einschließlich sicherer Konfiguration und API-Sicherheit.",
      "action": "Erstellung und Pflege umfassender Software-Dokumentation",
      "mitigation": "Stellen Sie sicher, dass während des gesamten Software-Lebenszyklus eine umfassende Dokumentation erstellt und gepflegt wird. Dies beinhaltet:",
      "check": "Gibt es eine aktuelle Dokumentation für Entwickler, Administratoren und Benutzer? Ist die Dokumentation umfassend und klar genug, um einen sicheren Betrieb, Wartung und zukünftige Entwicklung zu ermöglichen? Sind sichere Konfigurationsoptionen klar dokumentiert?",
      "detectionLogic": "Dieses Risiko gilt für alle in-scope technischen Assets, die als eigenentwickelt (`custom_developed_parts: true`) gekennzeichnet sind.",
      "riskAssessment": "Das Schadenausmaß wird durch die Kritikalität (Vertraulichkeit, Integrität und Verfügbarkeit) des eigenentwickelten Assets bestimmt. Ein Asset mit schlechter Dokumentation, das unternehmenskritische Daten verarbeitet, stellt ein viel höheres Risiko dar.",
      "falsePositives": "Dies ist ein prozessbezogenes Risiko. Ein Asset kann als eigenentwickelt gekennzeichnet sein, aber das Projekt kann eine ausgezeichnete und gründliche Dokumentation haben."
    },
    "insecure-development-environment": {
      "title": "Unsichere Entwicklungsumgebung (BSI CON.1)",
      "description": "Wenn die Entwicklungsumgebung unzureichend gesichert ist, kann die zu erstellende Software manipuliert werden.",
      "impact": "Die Manipulation der Software-Lieferkette kann zu Hintertüren oder Schwachstellen in Produktionssystemen führen, was die Vertraulichkeit, Integrität und Verfügbarkeit aller von ihnen verarbeiteten Daten gefährdet.",
      "asvs": "BSI IT-Grundschutz CON.1: Softwareentwicklung",
      "action": "Sicherung des Entwicklungslebenszyklus und der Umgebung",
      "mitigation": "Implementieren Sie starke Zugriffskontrollen für alle Entwicklungssysteme (Quellcode-Repositories, Build-Pipelines, Artefakt-Register).",
      "check": "Sind alle entwicklungsbezogenen Assets (Repositories, Pipelines) identifiziert? Ist der Zugriff auf sie beschränkt und protokolliert?",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die für die Softwareentwicklung relevant sind (z. B. ",
      "riskAssessment": "Das Schadenausmaß wird durch die Kritikalität der Assets bestimmt, die von der Entwicklungsumgebung erstellt oder bereitgestellt werden. Die Manipulation einer Pipeline, die einen unternehmenskritischen Dienst bereitstellt, hat ein ",
      "falsePositives": "Das Risiko könnte als "
    },
    "conceptual-software-flaws": {
      "title": "Konzeptionelle Softwarefehler (historisch gewachsen, schwer zu warten)",
      "description": "Wenn Software an Funktionalität gewinnt, wird ihr Code oft komplexer. Wenn der Code nicht ordnungsgemäß auf einer soliden Softwarearchitektur basiert, kann er sehr schwer zu warten sein.",
      "impact": "Die primäre Auswirkung ist eine erhöhte Wahrscheinlichkeit von ungepatchten oder nicht patchbaren Schwachstellen, die ausgenutzt werden können, um die Vertraulichkeit, Integrität oder Verfügbarkeit des Systems und seiner Daten zu gefährden.",
      "asvs": "V1 Architektur-, Design- und Bedrohungsmodellierungsanforderungen",
      "action": "Refactoring oder Austausch komplexer/veralteter Komponenten",
      "mitigation": "Für neue Entwicklungen, etablieren und erzwingen Sie eine klare Softwarearchitektur, die Modularität, Trennung der Belange und Wartbarkeit betont.",
      "check": "Ist die Softwarearchitektur für eigenentwickelte Komponenten klar dokumentiert? Ist der Code modular und testbar?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope, eigenentwickelten technischen Assets ausgelöst.",
      "riskAssessment": "Das Schadenausmaß wird durch die Vertraulichkeit und Kritikalität des Assets und der von ihm verarbeiteten oder gespeicherten Daten bestimmt. Ein nicht wartbares System, das unternehmenskritische Daten verarbeitet, stellt ein sehr hohes Risiko dar.",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn ein "
    },
    "insufficient-software-testing-and-release-procedures": {
      "title": "Ungenügende Softwaretests und Freigabeverfahren (in Anlehnung an BSI CON.1/CON.3)",
      "description": "Wenn neue Software nicht ausreichend getestet und formell freigegeben wird, können kritische Fehler und Sicherheitsschwachstellen unentdeckt bleiben.",
      "impact": "Eine unzureichende Prüfung von Software kann zur Offenlegung, Manipulation oder Zerstörung sensibler Informationen führen.",
      "asvs": "Abgeleitet von den BSI IT-Grundschutz Bausteinen CON.1 (Allgemeine Softwareentwicklung) und CON.3 (Softwaretests).",
      "action": "Implementierung und Durchsetzung eines sicheren Softwareentwicklungslebenszyklus (SSDLC)",
      "mitigation": "Etablieren Sie einen formellen Prozess zum Testen und Freigeben aller eigenentwickelten Softwarekomponenten. Dieser Prozess sollte obligatorische Sicherheitstests umfassen, wie z. B. Static Application Security Testing (SAST),",
      "check": "Gibt es eine dokumentierte Teststrategie für eigenentwickelte Software? Sind Sicherheitstestwerkzeuge in die CI/CD-Pipeline integriert?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope, eigenentwickelten technischen Assets ausgelöst, die typischerweise komplexe Geschäftslogik enthalten (z. B. Webanwendungen, Webdienste, Anwendungsserver).",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung steht in direktem Zusammenhang mit der Komplexität des benutzerdefinierten Codes und dem Fehlen eines strukturierten Testprozesses.",
      "falsePositives": "Ein Risiko kann für eine Komponente gemeldet werden, die durch einen umfassenden, organisationsweiten Testprozess abgedeckt ist, der explizit modelliert ist."
    },
    "testing-with-production-data": {
      "title": "Testen mit Produktionsdaten (BSI CON.1.A15)",
      "description": "Wenn neue Software mit Produktionsdaten getestet wird, können unbefugte Personen (z. B. Entwickler, Tester) Zugriff auf vertrauliche Informationen, wie z. B. sensible personenbezogene Daten, erhalten.",
      "impact": "Wenn dieses Risiko eintritt, kann es zu schweren Datenlecks (Vertraulichkeit), Datenkorruption (Integrität) und Dienstausfällen (Verfügbarkeit) führen.",
      "asvs": "BSI IT-Grundschutz CON.1.A15 (Trennung von Test- und Produktionsdaten)",
      "action": "Verwendung anonymisierter, pseudonymisierter oder synthetischer Daten für Tests",
      "mitigation": "Trennen Sie Test- und Produktionsumgebungen strikt. Etablieren und erzwingen Sie eine Richtlinie, die die Verwendung von echten Produktionsdaten in Testumgebungen verbietet.",
      "check": "Gibt es eine dokumentierte Richtlinie für das Testdatenmanagement? Sind Test- und Produktionsumgebungen logisch und physisch getrennt? Welche Prozesse gibt es zur Erzeugung sicherer Testdaten (Anonymisierung, Synthese)? Wie wird der Zugriff auf Testumgebungen kontrolliert und überwacht?",
      "detectionLogic": "Dieses Risiko wird identifiziert, wenn ein technisches Asset, das sich in einem Test- oder Entwicklungskontext zu befinden scheint, sensible Produktionsdaten verarbeitet oder speichert.",
      "riskAssessment": "Das Schadenausmaß steht in direktem Zusammenhang mit der Vertraulichkeits- und Integritätsbewertung des verwendeten Produktionsdaten-Assets. Ein hohes Schadenausmaß wird angenommen, wenn ",
      "falsePositives": "Ein "
    },
    "interruption-of-data-transmission-con1": {
      "title": "Unterbrechung der Datenübertragung (BSI CON.1)",
      "description": "Der Informationsaustausch kann durch technische Ausfälle oder Leistungsengpässe in Kommunikationsverbindungen oder deren angeschlossenen Komponenten gestört, verzögert oder vollständig unterbrochen werden.",
      "impact": "Wenn Informationen nicht rechtzeitig, unvollständig oder gar nicht zugestellt werden, können Geschäftsprozesse, die von diesen Daten abhängen, erheblich beeinträchtigt werden oder vollständig ausfallen.",
      "asvs": "Bezieht sich auf OWASP ASVS V1 Architekturanforderungen, insbesondere V1.11 für Verfügbarkeits- und Resilienzdesign.",
      "action": "Implementierung resilienter und performanter Kommunikationskanäle",
      "mitigation": "Stellen Sie sicher, dass Daten mit hohen Verfügbarkeitsanforderungen über resiliente Kommunikationskanäle übertragen werden.",
      "check": "Sind Kommunikationsverbindungen für kritische Systeme auf hohe Verfügbarkeit ausgelegt? Sind die an der Datenübertragung beteiligten technischen Assets (Quelle und Ziel) als redundant gekennzeichnet? Gibt es eine aktive Überwachung der Verbindungsleistung und Fehlerraten?",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen ausgelöst, die für die Verfügbarkeit kritisch sind, aber Anzeichen eines Single Point of Failure aufweisen.",
      "riskAssessment": "Das Schadenausmaß wird durch die höchste Verfügbarkeitsanforderung der übertragenen Daten oder der beteiligten Assets bestimmt. Die Wahrscheinlichkeit basiert auf der fehlenden Redundanz der beteiligten Assets. Eine nicht redundante Komponente, die unternehmenskritische Daten verarbeitet, stellt ein erhebliches Verfügbarkeitsrisiko dar.",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle Formen der physischen oder netzwerkbasierten Redundanz (z. B. BGP, verschiedene Glasfaserwege), die nicht explizit als separate Komponenten modelliert sind."
    },
    "missing-confidentiality-agreement-con7": {
      "title": "Risiko des Datenmissbrauchs aufgrund fehlender oder unzureichender Vertraulichkeitsvereinbarung (in Anlehnung an BSI CON.7)",
      "description": "Sensible Informationen können in die Hände Unbefugter gelangen, wenn vor einem Informationsaustausch mit einem externen Partner keine Vertraulichkeitsvereinbarung (z. B. eine NDA) geschlossen oder diese mangelhaft formuliert wurde. Das Fehlen einer formellen Vereinbarung erhöht das Risiko des Datenmissbrauchs, da es keine verbindlichen Regeln gibt, wie der externe Partner mit den erhaltenen Informationen umgehen darf.",
      "impact": "Ohne eine klare und verbindliche Vertraulichkeitsvereinbarung können sensible Daten, die mit externen Parteien ausgetauscht werden, missbraucht, offengelegt oder unsachgemäß behandelt werden. Dies kann zu einer Verletzung der Vertraulichkeit, Reputationsschäden, Wettbewerbsnachteilen und potenziellen rechtlichen oder finanziellen Strafen führen, insbesondere wenn personenbezogene oder unternehmenskritische Daten betroffen sind.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.7 (Informationsaustausch). Die Anforderung CON.7.A3 (Vereinbarungen zum Informationsaustausch) verlangt die Festlegung formeller Richtlinien, Verfahren und Kontrollen für den Austausch.",
      "action": "Abschluss und Durchsetzung von Vertraulichkeitsvereinbarungen für den externen Datenaustausch",
      "mitigation": "Für jede Kommunikationsverbindung mit einer externen Entität, die die Übertragung sensibler Daten beinhaltet (bewertet als ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen zu/von Assets des Typs ",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen, die zu einem technischen Asset vom Typ `external-entity` führen. Wenn eine solche Verbindung Daten mit einer Vertraulichkeitsbewertung von ",
      "riskAssessment": "Das Schadenausmaß dieses Risikos ist direkt proportional zum Vertraulichkeitslevel der ausgetauschten Daten. Die Wahrscheinlichkeit wird als hoch angesehen, wenn keine Vereinbarung besteht, da es keine formale Hürde für Missbrauch gibt. Das höchste Vertraulichkeitslevel der über die Kommunikationsverbindung übertragenen Daten-Assets bestimmt das Schadenausmaß.",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn eine Vertraulichkeitsvereinbarung existiert, aber nicht im Modell mit dem Tag `@nda-signed` dokumentiert wurde. Es kann auch ein False Positive sein, wenn der Datenaustausch durch ein umfassenderes Rahmenabkommen (Master Service Agreement, MSA) abgedeckt ist, das spezifisch für diese einzelne Verbindung gilt."
    },
    "accidental-data-leakage": {
      "title": "Unbeabsichtigter Datenabfluss (basierend auf BSI-Gefährdungsbeschreibung)",
      "description": "Sensible Informationen können aufgrund menschlicher Fehler, unzureichender Schulung oder fehlender klarer Verfahren versehentlich an unbefugte Empfänger gesendet werden. Beispiele sind das Senden von Daten an die falsche E-Mail-Adresse oder die Übermittlung von Dokumenten, die versteckte Restinformationen enthalten (wie interne Kommentare oder unzureichend gelöschte Daten).",
      "impact": "Dies kann zu einer Verletzung der Vertraulichkeit sensibler Daten führen, was zu einer Nichteinhaltung gesetzlicher oder vertraglicher Anforderungen (wie @DataType:PII), Reputationsschäden und finanziellen Verlusten führen kann.",
      "asvs": "Bezieht sich auf Konzepte in BSI IT-Grundschutz CON.1 (Allgemeiner Datenschutz) und DER.1 (Erkennung sicherheitsrelevanter Ereignisse).",
      "action": "Implementierung von Kontrollen für Daten während der Übertragung",
      "mitigation": "Verwenden Sie Data Loss Prevention (DLP)-Tools, um die unbefugte Übertragung sensibler Informationen zu überwachen und zu blockieren. Erzwingen Sie eine starke Autorisierung auf Kommunikationskanälen, insbesondere für extern ausgerichtete Protokolle wie E-Mail. Implementieren Sie Datenbereinigung, um Metadaten und Kommentare aus Dateien zu entfernen, bevor sie gesendet werden. Bieten Sie allen Mitarbeitern regelmäßige, gezielte Schulungen zu sicheren Datenhandhabungsverfahren und zur Identifizierung und zum Schutz sensibler Informationen an.",
      "check": "Sind Kontrollen für Daten während der Übertragung (wie DLP) für sensible Datenflüsse vorhanden? Sind Filesharing- und E-Mail-Protokolle ordnungsgemäß gesichert und zugriffsgesteuert? Bietet die Organisation obligatorische, regelmäßige Schulungen zur Datenhandhabung und -klassifizierung an?",
      "detectionLogic": "Dieses Risiko wird durch die Analyse von Kommunikationsverbindungen identifiziert, die sensible Daten übertragen (Vertraulichkeit von ",
      "riskAssessment": "Das Schadenausmaß wird direkt auf der Grundlage der Vertraulichkeit der übertragenen Daten bewertet (z. B. ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn es außerhalb des Bandes kompensierende Kontrollen gibt, wie z. B. ein separates, obligatorisches DLP-Gateway, das alle ausgehenden E-Mails scannt, oder wenn der spezifische Datenfluss hochgradig prozeduralisiert und automatisiert ist, was die Wahrscheinlichkeit menschlicher Fehler verringert."
    },
    "unprotected-data-in-transit-or-at-rest-bsi": {
      "title": "Ungeschützte Daten bei der Übertragung oder im Ruhezustand (BSI CON.1, SYS.1.6)",
      "description": "Informationen und Daten können unbemerkt abgefangen (Informations-Offenlegung) oder verändert (Manipulation) werden, wenn sie nicht ausreichend geschützt sind.",
      "impact": "Eine erfolgreiche Ausnutzung führt zum Verlust der Vertraulichkeit und/oder Integrität der betroffenen Daten. Angreifer können sensible Informationen (z. B. Anmeldeinformationen, personenbezogene Daten, Geschäftsgeheimnisse) stehlen, schädliche Inhalte einschleusen (wie Malware in Dateiübertragungen) oder kritische Daten manipulieren. Dies kann zu Datenlecks, finanziellen Verlusten, Reputationsschäden und rechtlichen Konsequenzen führen.",
      "asvs": "BSI IT-Grundschutz: CON.1 (Allgemeine Datenübertragung), SYS.1.6 (Server unter Windows und Linux). Entspricht OWASP ASVS V5: V9.1 (Kommunikation) und V7.2 (Kryptografische Speicherung).",
      "action": "Durchsetzung der Verschlüsselung für Daten bei der Übertragung und im Ruhezustand",
      "mitigation": "Alle Kommunikationsverbindungen, die Daten über Vertrauensgrenzen hinweg übertragen, MÜSSEN ein starkes, verschlüsseltes Protokoll verwenden (z. B. TLS 1.3+, HTTPS, SFTP, WSS, verschlüsselte Datenbankprotokolle).",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen in der Architektur. Verwenden sie ein verschlüsseltes Protokoll, insbesondere wenn sie Vertrauensgrenzen überschreiten oder sensible Daten übertragen?",
      "detectionLogic": "Diese Regel identifiziert Risiken in zwei Szenarien:",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist höher für Daten während der Übertragung über nicht vertrauenswürdige Netzwerke (wie das Internet). Das Schadenausmaß ist direkt proportional zur Sensibilität (CIA-Bewertung) der übertragenen oder gespeicherten Daten. Die Übertragung von ",
      "falsePositives": "Eine Kommunikationsverbindung könnte Teil eines physisch gesicherten, isolierten Netzwerks sein, in dem das Risiko des Abfangens als akzeptabel angesehen wird."
    },
    "unencrypted-transmission": {
      "title": "Unverschlüsselte Übertragung sensibler Daten",
      "description": "Der Schutz von Informationen während der Übertragung durch kryptografische Methoden kann durch Angriffe untergraben werden. Wenn kryptografische Methoden nicht korrekt angewendet werden, kann ein Angreifer die übertragenen Daten abfangen und darauf zugreifen. Dies gilt insbesondere, wenn sensible Daten über einen unverschlüsselten Kommunikationskanal über eine Vertrauensgrenze hinweg gesendet werden. Das BSI warnt davor, dass eine unzureichend geschützte Kommunikation zum Abfangen und Manipulieren von Daten führen kann.",
      "impact": "Wenn sensible Daten unverschlüsselt übertragen werden, können sie von einem Angreifer mit Zugriff auf den Kommunikationsweg abgefangen und gelesen (Verlust der Vertraulichkeit) oder geändert (Verlust der Integrität) werden. Dies kann zu Datenlecks, unbefugtem Zugriff auf Systeme, finanziellen Verlusten und Reputationsschäden führen.",
      "asvs": "V9.1: Überprüfen Sie, dass alle Kommunikationen zwischen Komponenten während der Übertragung verschlüsselt sind.",
      "action": "Erzwingung verschlüsselter Kommunikation",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, die sensible Daten über Vertrauensgrenzen hinweg übertragen, starke, verschlüsselte Protokolle verwenden (z. B. HTTPS, TLS, SFTP, JDBC-verschlüsselt). Deaktivieren Sie schwache Chiffrensuiten. Verwenden Sie ein VPN als kompensierende Kontrolle, wenn das native Protokoll nicht verschlüsselt werden kann. Stellen Sie sicher, dass Schlüssel sicher und getrennt von den Daten, die sie schützen, verwaltet werden.",
      "check": "Verwenden alle Kommunikationsverbindungen zwischen verschiedenen Vertrauensgrenzen ein verschlüsseltes Protokoll? Wird ein VPN für unverschlüsselte Protokolle verwendet? Gibt es Verbindungen, die vertrauliche oder kritische Daten unverschlüsselt übertragen?",
      "detectionLogic": "Diese Regel sucht nach Kommunikationsverbindungen, die Vertrauensgrenzen überschreiten, nicht verschlüsselt sind (d. h. kein Protokoll wie HTTPS, TLS usw. verwenden) und nicht durch ein VPN geschützt sind. Das Risiko wird ausgelöst, wenn diese Verbindungen Daten mit einem höheren Vertraulichkeitsgrad als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird durch die Netzwerkexposition (z. B. Internet vs. intern) und kompensierende Kontrollen wie IP-Filterung beeinflusst. Das Schadenausmaß wird durch die höchste Vertraulichkeit und Integrität der über die Verbindung übertragenen Daten bestimmt.",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn andere, nicht modellierte kompensierende Kontrollen vorhanden sind (z. B. ein hardwarebasierter Netzwerkverschlüsseler). Es kann auch als False Positive für bestimmte Überwachungs- oder Sicherheitsprotokolle angesehen werden, die absichtlich mit unverschlüsseltem Verkehr in einer kontrollierten Umgebung arbeiten."
    },
    "malicious-code-execution-in-browser": {
      "title": "Ausführung von Schadcode im Webbrowser",
      "description": "Webbrowser laden regelmäßig Daten aus nicht vertrauenswürdigen Quellen. Solche Daten können ausführbaren Schadcode enthalten, der Schwachstellen ausnutzt und den Benutzer infiziert.",
      "impact": "Wenn Schadcode über den Browser ausgeführt wird, kann ein Angreifer das Client-System kompromittieren. Dies kann zum Diebstahl sensibler Daten (Informations-Offenlegung), zur Manipulation von Daten oder Systemdateien (Manipulation) oder zur Installation von Ransomware (Denial of Service) führen.",
      "asvs": "BSI IT-Grundschutz SYS.3.2.1 Webbrowser",
      "action": "Implementierung und Durchsetzung der Härtung von Browser- und Endpunktsicherheit",
      "mitigation": "Stellen Sie sicher, dass Browser durch einen verwalteten Prozess auf dem neuesten Stand mit den neuesten Sicherheitspatches gehalten werden. Deaktivieren oder beschränken Sie unnötige oder riskante Plugins und Erweiterungen.",
      "check": "Werden alle Client-Webbrowser zentral verwaltet und automatisch aktualisiert? Gibt es eine Richtlinie für erlaubte/nicht erlaubte Browser-Erweiterungen? Werden Sicherheitskonfigurationen für Browser durchgesetzt? Ist eine Endpunktschutzlösung mit Browser-Sicherheitsfunktionen aktiv?",
      "detectionLogic": "Dieses Risiko wird für jedes in-scope technische Asset ausgelöst, das mit dem ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist grundlegend für die Verwendung eines Webbrowsers für den allgemeinen Internetzugang. Es kann nur in seltenen Fällen als False Positive angesehen werden, in denen der Browser in einer extrem eingeschränkten "
    },
    "exploitation-of-client-side-vulnerabilities": {
      "title": "Ausnutzung clientseitiger Schwachstellen",
      "description": "Schwachstellenlisten und Exploit-Kits vereinfachen die Entwicklung von benutzerdefinierter Malware erheblich.",
      "impact": "Wenn clientseitige Schwachstellen erfolgreich ausgenutzt werden, können Angreifer Malware (wie Ransomware, Spyware oder Keylogger) auf dem Client-System installieren.",
      "asvs": "BSI IT-Grundschutz: SYS.2.1 Webbrowser, SYS.1.2.2 Client unter Windows, SYS.1.3 Client unter macOS",
      "action": "Implementierung von Client-Härtung, Patch-Management und Endpunktschutz",
      "mitigation": "Halten Sie Client-Betriebssysteme, Browser und alle Erweiterungen/Plugins mit den neuesten Sicherheitspatches auf dem neuesten Stand.",
      "check": "Werden Client-Systeme und Browser zentral verwaltet und mit Sicherheitspatches auf dem neuesten Stand gehalten? Ist eine moderne EDR/Antivirus-Lösung auf allen Clients bereitgestellt und aktiv?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets ausgelöst, die als Client-Systeme identifiziert wurden (z. B. Technologietypen: Browser, Desktop, Mobile App usw.).",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist bei nicht verwalteten Client-Systemen, die mit dem Internet verbunden sind, sehr hoch, da sie automatisiertem Scannen und Drive-by-Angriffen ausgesetzt sind.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn robuste, zentral verwaltete kompensierende Kontrollen (wie eine umfassende EDR, strenges Application Whitelisting oder eine nicht-persistente VDI-Umgebung) vorhanden sind, aber n@SystemType:OT modelliert wurden."
    },
    "insecure-communication-over-internet": {
      "title": "Unsichere Kommunikation über das Internet",
      "description": "Die grundlegende Sicherheit der Kommunikation über das Internet hängt maßgeblich von den verwendeten Authentifizierungsmethoden und der Verschlüsselung der Daten während der Übertragung ab.",
      "impact": "Wenn die Kommunikation nicht wirksam gesichert ist, können sensible Informationen abgefangen (Verletzung der Vertraulichkeit) oder während der Übertragung verändert (Verletzung der Integrität) werden.",
      "asvs": "V4: Kommunikationssicherheit",
      "action": "Durchsetzung starker Authentifizierung und Verschlüsselung für die Kommunikation",
      "mitigation": "Alle Kommunikationsverbindungen, insbesondere solche, die Vertrauensgrenzen überschreiten oder sensible Daten übertragen, müssen starke, hochmoderne verschlüsselte Protokolle verwenden (z. B. mit TLS 1.2/1.3, SSH).",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen im Modell. Stellen Sie sicher, dass jede Verbindung, die sensible Daten überträgt oder eine Vertrauensgrenze überschreitet, ein verschlüsseltes Protokoll verwendet (z. B. HTTPS, FTPS, WSS, LDAPS usw.).",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen im Modell. Sie löst ein Risiko aus, wenn eine Verbindung ein unverschlüsseltes Protokoll verwendet, insbesondere wenn sie eine Vertrauensgrenze überschreitet, ein internetzugängliches Asset betrifft oder nicht durch ein VPN geschützt ist.",
      "riskAssessment": "Das Schadenausmaß wird durch die höchsten Vertraulichkeits- und Integritätsanforderungen der über die Verbindung übertragenen Daten bestimmt.",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn die Kommunikation über ein vollständig isoliertes und physisch gesichertes Netzwerksegment stattfindet, in dem ein Abfangen als unmöglich angesehen wird."
    },
    "malicious-browser-components-from-untrusted-sources": {
      "title": "Schädliche Browser-Komponenten aus nicht vertrauenswürdigen Quellen (BSI SYS.1.2.1)",
      "description": "Wenn Webbrowser, Plug-ins oder Erweiterungen aus nicht vertrauenswürdigen Quellen bezogen werden, können schädliche Funktionen unbeabsichtigt und unbemerkt ausgeführt werden.",
      "impact": "Die Kompromittierung von Client-Systemen durch schädliche Browser-Komponenten kann zu Phishing, unbefugtem Datenzugriff und -exfiltration (Verletzung der Vertraulichkeit),",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein SYS.1.2.1 (Allgemeiner Client). Die beschriebene Gefährdung entspricht den grundlegenden Prinzipien der sicheren Konfiguration.",
      "action": "Durchsetzung sicherer Software-Beschaffung und Client-Härtung",
      "mitigation": "Beziehen Sie Browser, Plugins und Erweiterungen nur aus vertrauenswürdigen, offiziellen Quellen (z. B. offizielle Anbieter-Websites, unternehmenseigene Software-Portale).",
      "check": "Gibt es wirksame technische Kontrollen und Richtlinien, die Benutzer daran hindern, Software aus nicht vertrauenswürdigen Quellen zu installieren? Gibt es ein zentrales, geprüftes Software-Repository für Benutzer? Werden Client-Systeme regelmäßig auf nicht autorisierte Software gescannt?",
      "detectionLogic": "Dieses Risiko gilt für jedes clientseitige technische Asset, das von einem Menschen zur Interaktion mit dem Internet oder anderen Systemen verwendet wird. Die Regel identifiziert Assets, die als von Menschen bediente Clients konfiguriert sind (z. B. Browser, Desktops), die ohne entsprechende Kontrollen anfällig für diese Bedrohung sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird in Umgebungen ohne strenge Kontrollen der Softwareinstallation als hoch angesehen. Das Schadenausmaß steht in direktem Zusammenhang mit der Sensibilität der Daten, auf die der Benutzer über den kompromittierten Client zugreift oder die er verarbeitet. Der Zugriff auf unternehmenskritische Systeme mit einem kompromittierten Browser führt zu einem sehr hohen Schadenausmaß.",
      "falsePositives": "Dieses Risiko könnte in Umgebungen ein False Positive sein, in denen trotz der technischen Möglichkeit starke organisatorische Richtlinien und Benutzerschulungen die Installation nicht vertrauenswürdiger Software wirksam verhindern. Die Überprüfung der Wirksamkeit solcher nicht-technischen Kontrollen ist erforderlich, um das Risiko auszuschließen."
    },
    "insecure-browser-configuration": {
      "title": "Unsichere Konfiguration des Webbrowsers (BSI APP.3.2)",
      "description": "Wenn Webbrowser unsicher konfiguriert sind, können vertrauliche Daten versehentlich oder böswillig an unbefugte Dritte weitergegeben werden. Passwörter können ebenfalls unbeabsichtigt geteilt werden. Wenn Cookies, Passwörter, Verlauf, Formulardaten und Suchanfragen gespeichert oder unnötige Erweiterungen aktiviert sind, können Daten leichter von Dritten oder Malware ausgelesen und missbraucht werden.",
      "impact": "Dies kann zum Diebstahl von Anmeldeinformationen, Session-Hijacking, zur Offenlegung sensibler persönlicher oder geschäftlicher Daten und zum unbefugten Zugriff auf andere Systeme führen, was die Vertraulichkeit und Integrität von Informationen gefährdet.",
      "asvs": "BSI IT-Grundschutz Baustein APP.3.2 Web-Browser",
      "action": "Sichere Browserkonfiguration und -verwaltung",
      "mitigation": "Erzwingen Sie eine sichere Basiskonfiguration für alle Browser, die zum Zugriff auf Unternehmensressourcen verwendet werden. Dies umfasst das Deaktivieren des Speicherns von Passwörtern, das Löschen des Verlaufs/der Cookies beim Beenden, das Einschränken oder Überprüfen von Browser-Erweiterungen und die Verwendung von datenschutzfreundlichen Funktionen. Verwenden Sie Mobile Device Management (MDM) oder Gruppenrichtlinien (GPO), um diese Einstellungen durchzusetzen. Schulen Sie Benutzer über die Risiken unsicherer Browsereinstellungen und -erweiterungen.",
      "check": "Gibt es zentral verwaltete, durchgesetzte Sicherheitsrichtlinien für Webbrowser? Ist das Speichern von Passwörtern im Browser deaktiviert? Ist die Installation nicht genehmigter Erweiterungen blockiert oder wird sie überwacht? Werden Benutzer in der sicheren Nutzung von Browsern geschult?",
      "detectionLogic": "Wird für alle clientseitigen technischen Assets (z. B. Browser, Desktop, Mobile App) ausgelöst, die mit anderen Assets kommunizieren, die sensible Daten verarbeiten (bewertet als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird für Clients als höher angesehen, die extern sind oder direkt dem Internet ausgesetzt sind, da sie weniger wahrscheinlich unter strenger Unternehmenskontrolle stehen. Das Schadenausmaß wird durch die maximalen Vertraulichkeits- und Integritätsbewertungen der Assets bestimmt, mit denen der Client eine Verbindung herstellt. Der Zugriff auf ein ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn Endpunktsicherheitsmaßnahmen (wie Browser-Isolierung/-Virtualisierung) vorhanden sind, aber n@SystemType:OT modelliert wurden, oder wenn das Client-Asset in einem Kontext verwendet wird (z. B. öffentlicher Kiosk), in dem es niemals auf sensible Systeme oder Daten zugreift."
    },
    "unintentional-data-leakage-on-mobile-device-app4.4": {
      "title": "Unbeabsichtigter Datenabfluss auf mobilen Endgeräten (BSI APP.4.4)",
      "description": "Daten werden über verschiedene Kanäle, die vom mobilen Betriebssystem bereitgestellt werden, zu und von einer mobilen Anwendung übertragen.",
      "impact": "Wenn sensible Daten auf dem mobilen Gerät nicht ordnungsgemäß geschützt sind, können sie von anderen bösartigen Anwendungen exfiltriert werden,",
      "asvs": "BSI IT-Grundschutz APP.4.4.A5 (Schutz lokaler Daten). Bezieht sich auch auf OWASP MASVS V2 (Anforderungen an Datenspeicherung und Datenschutz).",
      "action": "Implementierung sicherer Datenhandhabung und -speicherung auf mobilen Geräten",
      "mitigation": "Sensible Daten sollten nicht auf dem mobilen Gerät gespeichert werden, es sei denn, dies ist absolut notwendig. Wenn eine Speicherung erforderlich ist, verwenden Sie von der Plattform bereitgestellte sichere,",
      "check": "Werden sensible Daten lokal auf dem Gerät gespeichert? Wenn ja, sind sie mit von der Plattform bereitgestellten sicheren Speichermechanismen verschlüsselt?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit und das Schadenausmaß dieses Risikos werden durch das höchste Vertraulichkeitslevel der von der mobilen Anwendung verarbeiteten oder gespeicherten Daten bestimmt.",
      "falsePositives": "Dieses Risiko wird aufgrund des Potenzials für Datenlecks ausgelöst. Ein Modell kann die Implementierungsdetails spezifischer Kontrollen wie deaktivierten Zwischenablagezugriff nicht überprüfen."
    },
    "inadequate-monitoring-of-network-boundaries": {
      "title": "Ungenügende Überwachung von Netzwerkgrenzen (BSI DER.1.A4)",
      "description": "Wenn keine Erkennungssysteme eingesetzt und die in IT-Systemen und Anwendungen verfügbaren Erkennungsfunktionen nicht genutzt werden, können Angreifer leichter in die Institution eindringen.",
      "impact": "Eine erfolgreiche Ausnutzung kann dazu führen, dass unentdeckte Angreifer im Netzwerk verbleiben, auf sensible Daten zugreifen oder diese exfiltrieren und möglicherweise ihre Berechtigungen eskalieren, um weitere Systeme zu kompromittieren. Dies bedroht direkt die Vertraulichkeit und Integrität von Informationen.",
      "asvs": "BSI IT-Grundschutz DER.1.A4 Einsatz von Systemen zur Angriffserkennung (IDS)",
      "action": "Implementierung von Intrusion Detection/Prevention Systems (IDS/IPS)",
      "mitigation": "Setzen Sie IDS/IPS-Lösungen ein, um den Datenverkehr an kritischen Netzwerkgrenzen zu überwachen, insbesondere dort, wo sich die Vertrauensstufen ändern.",
      "check": "Wird die Netzwerkkommunikation, insbesondere diejenige, die Vertrauensgrenzen überschreitet, von einem IDS/IPS überwacht? Werden Alarme von diesen Systemen überprüft und darauf reagiert? Werden Protokolle von relevanten Assets gesammelt und analysiert?",
      "detectionLogic": "Diese Regel wird für alle Kommunikationsverbindungen ausgelöst, die eine Vertrauensgrenze überschreiten.",
      "riskAssessment": "Die Wahrscheinlichkeit eines unentdeckten Eindringens wird bei unüberwachten Netzwerkgrenzübergängen als sehr wahrscheinlich angesehen.",
      "falsePositives": "Kann auftreten, wenn Überwachungslösungen (z. B. host- oder agentenbasierte IDS) nicht im Bedrohungsmodell dargestellt sind."
    },
    "insufficient-personnel-for-log-analysis-orp4": {
      "title": "Ungenügendes Personal für Protokollanalyse und Überwachung (in Anlehnung an BSI ORP.4)",
      "description": "Wenn nicht genügend Personal zur Auswertung von Protokolldaten vorhanden ist, können sicherheitsrelevante Ereignisse nicht vollständig erkannt werden. Dies kann dazu führen, dass Angriffe über längere Zeiträume verborgen bleiben oder erst entdeckt werden, nachdem bereits erheblicher Schaden, wie z. B. Datenexfiltration, entstanden ist.",
      "impact": "Eine nicht rechtzeitige Erkennung von Sicherheitsvorfällen kann die Vertraulichkeit, Integrität und Verfügbarkeit kritischer Systeme und Daten gefährden. Es kann Angreifern einen längeren unbefugten Zugriff ermöglichen, was zu schweren Datenlecks, Systemstörungen und einer verzögerten Reaktion auf Vorfälle führt, was die Gesamtauswirkungen auf das Geschäft vergrößert.",
      "asvs": "BSI IT-Grundschutz ORP.4: Erkennung sicherheitsrelevanter Ereignisse, speziell Anforderung ORP.4.A5 (Personelle Ressourcen für die Erkennung sicherheitsrelevanter Ereignisse).",
      "action": "Sicherstellung ausreichender personeller Besetzung für Sicherheitsüberwachung und -analyse",
      "mitigation": "Stellen Sie ausreichend qualifiziertes Personal für die regelmäßige Analyse von Protokolldaten und die Bewertung sicherheitsrelevanter Ereignisse bereit. Etablieren Sie klare Prozesse und Verantwortlichkeiten für Überwachungsaktivitäten, einschließlich der Überprüfung von Protokollen kritischer Assets. Nutzen Sie Sicherheitsautomatisierung und -werkzeuge (z. B. SIEM), um das Sicherheitsteam zu unterstützen und sicherzustellen, dass Alarme effektiv verwaltet werden. Pflegen Sie außerdem einen Prozess zur Bewertung externer Bedrohungsinformationen, um Schwachstellen proaktiv zu identifizieren.",
      "check": "Gibt es dediziertes Personal oder ein Team (z. B. ein SOC), das für die Sicherheitsüberwachung verantwortlich ist? Gibt es einen definierten und befolgten Prozess für die Protokollüberprüfung? Wird die Arbeitsbelastung für die Sicherheitsanalyse für das derzeitige Personal als beherrschbar angesehen? Sind Werkzeuge zur Aggregation und Analyse von Protokollen kritischer Systeme vorhanden?",
      "detectionLogic": "Dieses organisatorische Risiko wird für kritische, in-scope technische Assets ausgelöst, die keine clientseitigen Technologien sind. Die Annahme ist, dass diese Assets wertvolle Protokolldaten produzieren, die eine Überwachung erfordern. Das Risiko ist bei Assets mit hohen Anforderungen an Vertraulichkeit, Integrität oder Verfügbarkeit erhöht, da die Auswirkungen eines unentdeckten Vorfalls größer wären. Überwachungs- und Sicherheitskontrollplattformen selbst sind ausgeschlossen.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und kann nicht allein durch das technische Modell vollständig überprüft werden. Die Organisation verfügt möglicherweise über ein gut besetztes 24/7-SOC und robuste Überwachungsprozesse, was dieses Risiko zu einem False Positive machen würde. Die Bestätigung erfordert eine Diskussion mit den Betriebs- und Sicherheitsteams über ihre Überwachungsfähigkeiten und -ressourcen."
    },
    "inadequate-incident-handling-con1": {
      "title": "Ungenügende Behandlung von Sicherheitsvorfällen (BSI CON.1)",
      "description": "In der Praxis können Sicherheitsvorfälle auch bei vielen Sicherheitsmaßnahmen nie vollständig ausgeschlossen werden.",
      "impact": "Ohne ein ordnungsgemäßes Verfahren zur Behandlung von Sicherheitsvorfällen können unter Druck falsche Entscheidungen getroffen werden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Sicherheitsvorfall-Management). Bezieht sich speziell auf Anforderungen wie CON.1.A4 (Vorbereitung auf die Behandlung von Sicherheitsvorfällen) und CON.1.A5 (Meldung und Behandlung von Sicherheitsvorfällen).",
      "action": "Etablierung und Pflege eines formellen Incident-Response-Prozesses",
      "mitigation": "Definieren und implementieren Sie einen umfassenden Plan zur Reaktion auf Vorfälle. Dies umfasst klare Verfahren zur Erkennung, Meldung, Analyse, Eindämmung, Beseitigung und Wiederherstellung.",
      "check": "Gibt es einen dokumentierten Plan zur Reaktion auf Vorfälle? Sind die Rollen und Verantwortlichkeiten für die Behandlung von Vorfällen klar definiert?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko. Das Modell identifiziert technische Assets, bei denen eine effektive und rechtzeitige Reaktion auf Vorfälle am kritischsten ist.",
      "riskAssessment": "Die Wahrscheinlichkeit ist HOCH, wenn kein formeller Plan zur Reaktion auf Vorfälle existiert oder getestet wird. Die Wahrscheinlichkeit ist MITTEL, wenn ein Plan existiert, aber nicht gut kommuniziert oder regelmäßig geübt wird.",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur. Das Modell kann nur Assets identifizieren, bei denen die Reaktion auf Vorfälle *kritisch* ist."
    },
    "improper-incident-handling-and-evidence-destruction": {
      "title": "Unsachgemäße Behandlung von Vorfällen und Vernichtung von Beweismitteln (BSI DER.2)",
      "description": "Wenn Personal nach einem Sicherheitsvorfall unsachgemäß reagiert oder etablierte Verfahren nicht befolgt,",
      "impact": "Die primäre Auswirkung ist der Verlust von forensischen Beweismitteln, was eine ordnungsgemäße Untersuchung des Vorfalls verhindert.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein DER.2 (Sicherheitsvorfall-Management).",
      "action": "Etablierung und Schulung formeller Verfahren zur Reaktion auf Vorfälle mit Beweissicherung.",
      "mitigation": "Entwickeln Sie einen formellen, dokumentierten Plan zur Reaktion auf Vorfälle, der klare Verfahren zur Beweissicherung enthält (z. B. Systeme isolieren anstatt sie herunterzufahren, forensische Images von Festplatten und Speicher erstellen, bevor Wiederherstellungsmaßnahmen durchgeführt werden).",
      "check": "Gibt es einen formellen Plan zur Reaktion auf Vorfälle? Enthält er spezifische Schritte zur Beweissicherung? Sind IT- und Sicherheitspersonal in diesem Plan geschult? Sind die Rollen und Verantwortlichkeiten für die Behandlung von Vorfällen klar definiert?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das für kritische Systeme gilt, bei denen ein Vorfall eine formelle Reaktion erfordern würde.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch. Eine Organisation könnte ausgezeichnete Verfahren zur Reaktion auf Vorfälle haben, die im Bedrohungsmodell nicht sichtbar sind."
    },
    "improper-handling-of-@DataType:PII-during-forens@SystemType:ICS": {
      "title": "Unsachgemäßer Umgang mit personenbezogenen Daten bei IT-forensischen Untersuchungen (BSI-Stil)",
      "description": "Bei IT-forensischen Untersuchungen ist es üblich, alle als notwendig erachteten Daten zu kopieren, zu sichern und zu analysieren. Diese Daten enthalten häufig personenbezogene Daten von Mitarbeitern, Partnern oder Kunden. Wenn auf diese Daten ohne gültige Rechtsgrundlage oder ohne Beteiligung des Datenschutzbeauftragten (DSB) zugegriffen wird, kann die Institution gegen gesetzliche Vorschriften verstoßen (z. B. @DataType:PII)",
      "impact": "Die Verletzung von Datenschutzgesetzen und internen Richtlinien kann zu erheblichen gesetzlichen Bußgeldern, Reputationsschäden und Vertrauensverlust führen. Der unsachgemäße Zugriff auf personenbezogene Daten gefährdet deren Vertraulichkeit und kann Geschäftsprozesse stören, wenn forensische Aktivitäten aufgrund von Nichteinhaltung angefochten oder gestoppt werden.",
      "asvs": "Abgeleitet von BSI IT-Grundschutz-Prinzipien in DER.1 (Datenschutz) und CON.8 (Umgang mit Sicherheitsvorfällen). Forensische Prozesse müssen grundlegende Datenschutzprinzipien wie Zweckbindung, Datenminimierung und rechtmäßige Verarbeitung einhalten.",
      "action": "Etablierung und Durchsetzung von Datenhandhabungsverfahren für forensische Untersuchungen",
      "mitigation": "Definieren und dokumentieren Sie klare Verfahren für alle IT-forensischen Untersuchungen. Diese Verfahren müssen:\n",
      "check": "Gibt es dokumentierte, formell genehmigte Verfahren zur Durchführung von IT-forensischen Untersuchungen? Behandeln diese Verfahren explizit den Umgang mit personenbezogenen Daten und schreiben die Einbeziehung des DSB vor? Werden Zugriffskontrollen für forensische Beweismittelspeicher implementiert und auditiert?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die als Teil des forensischen Workflows identifiziert wurden (gekennzeichnet mit `@forens@SystemType:ICS-tool` oder `@forensic-datastore`), die sensible Daten verarbeiten oder speichern (Vertraulichkeit von ",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn robuste, auditierte und durchgesetzte Verfahren für den Umgang mit personenbezogenen Daten während der Forensik bereits vorhanden sind. Das technische Modell allein kann die Existenz oder Wirksamkeit solcher organisatorischen Kontrollen nicht überprüfen."
    },
    "improper-evidence-handling-bsi": {
      "title": "Unsachgemäße Handhabung und Sicherung digitaler Beweismittel (BSI-basiert)",
      "description": "Wenn digitale Beweismittel falsch oder nicht schnell genug gesichert werden, können wichtige Daten verloren gehen, die später nicht wiederhergestellt werden können.",
      "impact": "Der Verlust oder die Beschädigung digitaler Beweismittel beeinträchtigt die Integrität von Untersuchungen nach einem Vorfall.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein DER.4 (Vorfallmanagement), speziell Anforderung DER.4.A19 (Forensische Analyse von IT-Systemen).",
      "action": "Etablierung und regelmäßige Übung von Verfahren zur forensischen Bereitschaft und Beweismittelhandhabung",
      "mitigation": "Entwickeln und dokumentieren Sie klare, schrittweise Verfahren zur Beweismittelsammlung, einschließlich der Sicherung flüchtiger Daten (z. B. Speicher, Netzwerkzustand) und nichtflüchtiger Daten (z. B. Festplatten-Images).",
      "check": "Gibt es dokumentierte Verfahren zur Sammlung digitaler Beweismittel? Sind die Mitarbeiter in diesen Verfahren und der Verwendung forensischer Werkzeuge geschult? Werden Übungen durchgeführt, um die forensische Bereitschaft zu testen?",
      "detectionLogic": "Dieses organisatorische Risiko wird für technische Assets ausgelöst, die für die Sicherheits- und Vorfallanalyse kritisch sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei kritischen Systemen als hoch angesehen, wenn keine expliziten Maßnahmen zur forensischen Bereitschaft vorhanden sind, da Fehler unter dem Druck eines echten Vorfalls häufig sind.",
      "falsePositives": "Dieses Risiko ist prozedural und organisatorisch. Das Modell identifiziert Assets, bei denen diese Schwäche die größten Auswirkungen hätte."
    },
    "apt-firmware-persistence": {
      "title": "APT-Persistenz durch Firmware-/Hardware-Manipulation",
      "description": "Advanced Persistent Threats (APTs) zielen auf eine langfristige Infiltration von Zielnetzwerken ab. Eine hochentwickelte Technik ist die Installation persistenter Hintertüren durch die Manipulation von low-level, hardwarenahen Komponenten wie der System-Firmware (z. B. UEFI/BIOS). Solche Modifikationen sind äußerst schwer zu erkennen und können traditionelle Maßnahmen zur Reaktion auf Vorfälle wie die Neuinstallation des Betriebssystems oder den Austausch von Festplatten überleben. Das BSI warnt davor, dass Angreifer sogar Firmware-Update-Routinen kompromittieren könnten, um sicherzustellen, dass ihr bösartiger Code auch nach einem legitimen Update bestehen bleibt. Dies gewährt dem Angreifer einen dauerhaften, heimlichen Halt in der IT-Infrastruktur.",
      "impact": "Eine erfolgreiche Ausnutzung führt zu einer vollständigen und dauerhaften Kompromittierung des betroffenen Assets.",
      "asvs": "Diese fortgeschrittene Bedrohung übersteigt den Umfang der meisten Standard-ASVS-Prüfungen. Sie steht jedoch im Zusammenhang mit den Prinzipien der Systemintegritätsprüfung, wie in Abschnitt V14. Verwandte NIST-Richtlinien wie SP 800-193 (Platform Firmware Resiliency) sind sehr relevant.",
      "action": "Implementierung der Überprüfung und Kontrolle der Hardware- und Firmware-Integrität",
      "mitigation": "Implementieren Sie für kritische Assets eine tiefengestaffelte Verteidigungsstrategie für die Hardwaresicherheit. Verwenden Sie Plattformen mit einer hardwarebasierten Vertrauensbasis (z. B. TPM). Erzwingen Sie Secure Boot, um sicherzustellen, dass nur signierte und vertrauenswürdige Firmware, Bootloader und Betriebssysteme ausgeführt werden können. Verwenden Sie nach Möglichkeit Remote Attestation, um die Integrität von Plattformen kontinuierlich zu überprüfen, bevor ihnen der Zugriff auf sensible Teile des Netzwerks gewährt wird. Pflegen Sie eine sichere Lieferkette für die Hardwarebeschaffung, um Manipulationen vor der Bereitstellung zu verhindern.",
      "check": "Sind kritische Systeme mit TPMs ausgestattet? Ist Secure Boot aktiviert und wird aktiv durchgesetzt? Gibt es einen Prozess für die Remote Attestation zur Überprüfung der Plattformintegrität? Wird die Hardware-Lieferkette verwaltet und ist sie vertrauenswürdig?",
      "detectionLogic": "Diese Regel wird bei hochwertigen technischen Assets ausgelöst, die attraktive Ziele für APTs sind. Das Risiko wird für Assets ausgelöst, die entweder explizit als hochwertige Ziele gekennzeichnet sind oder internetzugängliche Systeme sind, die sensible Daten verarbeiten oder speichern. Das Risiko wird für physische, virtuelle und containerisierte Maschinen berücksichtigt, da sie alle auf der zugrunde liegenden Host-Firmware basieren.",
      "riskAssessment": "Das Schadenausmaß einer solchen Kompromittierung wird immer als ",
      "falsePositives": "Ein Risiko kann bei einem Asset gemeldet werden, bei dem dieser Angriffsvektor als nicht durchführbar erachtet wird. Dies kann als False Positive angesehen werden, wenn die Organisation robuste und aktiv überwachte Sicherheitskontrollen auf Hardwareebene nachweisen kann (z. B. streng durchgesetztes Secure Boot, Remote Attestation), die diese spezifische Bedrohung wirksam mindern."
    },
    "destruction-of-forensic-evidence-after-apt": {
      "title": "Zerstörung von forensischen Beweismitteln nach einem APT-Vorfall (BSI CON.3)",
      "description": "Nach einem Advanced Persistent Threat (APT)-Vorfall werden IT-Systeme oft neu installiert oder außer Betrieb genommen, um die Bedrohung zu beseitigen.",
      "impact": "Die Zerstörung forensischer Beweismittel verhindert eine gründliche Analyse des Sicherheitsvorfalls. Dies kann es unmöglich machen, den vollen Umfang der Kompromittierung zu bestimmen,",
      "asvs": "BSI IT-Grundschutz CON.3 Sicherheitsvorfall-Management, speziell CON.3.A15 Forensische Untersuchungen.",
      "action": "Etablierung und Einhaltung eines forensikfähigen Incident-Response-Plans",
      "mitigation": "Es muss ein formeller Plan zur Reaktion auf Vorfälle vorhanden sein, der explizit die Erstellung forensischer Images (Festplatte und Speicher) betroffener Systeme *bevor* Wiederherstellungs- oder Neuinstallationsverfahren beginnen, vorschreibt.",
      "check": "Gibt es einen dokumentierten Plan zur Reaktion auf Vorfälle? Schreibt der Plan explizit die Erstellung forensischer Images vor der Systemwiederherstellung vor?",
      "detectionLogic": "Dieses organisatorische Risiko wird für alle in-scope technischen Assets ausgelöst, die Client-Systeme oder externe Entitäten sind.",
      "riskAssessment": "Die Wahrscheinlichkeit, dass dieses Risiko während eines echten Vorfalls eintritt, wird als ",
      "falsePositives": "Dieses Risiko ist prozedural und organisatorisch. Ein Modell kann die Existenz oder Qualität eines Plans zur Reaktion auf Vorfälle nicht überprüfen."
    },
    "apt-premature-cleanup-detection": {
      "title": "Vorzeitige Erkennung der APT-Bereinigung (BSI-OPS.1.2.5)",
      "description": "Während der Reaktion auf einen Advanced Persistent Threat (APT) könnten Angreifer, die noch in der Infrastruktur aktiv sind, die Analyse- und Bereinigungsaktivitäten erkennen.",
      "impact": "Wenn Angreifer die Bereinigungsbemühungen erkennen, können sie aktiv daran arbeiten, diese zu untergraben. Dies kann zu einer fehlgeschlagenen Bereinigung, einer verlängerten Anwesenheit des Angreifers, der Installation tieferer und widerstandsfähigerer Hintertüren, der Zerstörung von Beweismitteln und der absichtlichen Sabotage kritischer Systeme führen. Das Ergebnis ist ein schwerwiegenderer und kostspieligerer Vorfall, der möglicherweise die Integrität, Verfügbarkeit und Vertraulichkeit der gesamten IT-Infrastruktur gefährdet.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein OPS.1.2.5 (Incident Handling). Dieses Risiko beschreibt eine spezifische Bedrohung während der Bereinigungsphase eines APT-Vorfalls, bei der Angreifer die Bereinigungsaktivitäten erkennen.",
      "action": "Einrichtung und Nutzung sicherer Out-of-Band (OOB)-Kanäle für die Reaktion auf Vorfälle",
      "mitigation": "Die gesamte Kommunikation und Koordination zur Reaktion auf kritische Vorfälle wie APTs MUSS über eine separate, vertrauenswürdige Infrastruktur (OOB-Kanal) erfolgen, die vom kompromittierten Netzwerk isoliert ist. Bereinigungsaktivitäten sollten als koordinierte, gleichzeitige Operation geplant werden, um den Angreifer nicht vorzuwarnen. Kennzeichnen Sie Kommunikationsverbindungen, die für diesen Zweck im Modell verwendet werden, mit `@out-of-band-management`, um zu signalisieren, dass sie einen sicheren OOB-Kanal verwenden.",
      "check": "Gibt es einen dokumentierten Plan zur Reaktion auf Vorfälle, der OOB-Kanäle für Vorfälle mit hohem Schadenausmaß vorschreibt? Sind die für diese Kanäle verwendeten technischen Assets modelliert und isoliert? Sind Bereinigungspläne für eine gleichzeitige, koordinierte Ausführung konzipiert?",
      "detectionLogic": "Diese Regel identifiziert administrative oder DevOps-bezogene Kommunikationsverbindungen (`usage: devops`), die explizit als Verwendung eines Out-of-Band-Kanals über das Tag `@out-of-band-management` gekennzeichnet sind. Die Annahme ist, dass die Verwendung des standardmäßigen, potenziell kompromittierten Netzwerks für die Reaktion auf Vorfälle oder die hochprivilegierte Verwaltung kritischer Assets das Risiko einer Entdeckung durch einen residenten APT birgt.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn administrative Aufgaben ausgeführt werden.",
      "falsePositives": "Ein Out-of-Band-Kanal könnte in der Realität existieren, ist aber im Threagile-Modell nicht mit dem Tag `@out-of-band-management` dokumentiert. Dieses Risiko sollte mit den Betriebs- und Sicherheitsteams bestätigt werden."
    },
    "service-disruption-during-apt-cleanup": {
      "title": "Dienstunterbrechung während der Bereinigung eines APT-Vorfalls (BSI-Szenario)",
      "description": "Während der Bereinigung eines Advanced Persistent Threat (APT)-Vorfalls müssen möglicherweise verschiedene IT-Systeme neu installiert und Netzwerke vorübergehend isoliert werden. Diese notwendige Sanierung kann zum Ausfall von IT-Systemen und -Diensten führen, wodurch diese nur eingeschränkt oder gar nicht verfügbar sind.",
      "impact": "Wenn der Bereinigungsprozess sich in die Länge zieht, insbesondere aufgrund fehlender oder unzugänglicher Dokumentation für den Wiederaufbau, kann dies die Institution schwerwiegend beeinträchtigen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.4 (Incident Response), speziell CON.4.A7 (Behandlung von Sicherheitsvorfällen), und OPS.1.1.5 (Standardbetriebsverfahren), der die Notwendigkeit von Wiederherstellungsdokumentation abdeckt.",
      "action": "Entwicklung und Pflege eines umfassenden Plans für Incident Response und Business Continuity",
      "mitigation": "Etablieren Sie einen robusten Plan zur Reaktion auf Vorfälle, der Verfahren zur Isolierung und Sanierung kompromittierter Systeme nach einem APT enthält. Entscheidend ist die Pflege aktueller und zugänglicher Dokumentation für alle kritischen Systeme, um einen schnellen und vorhersagbaren Wiederaufbau zu ermöglichen (z. B. Infrastructure as Code, Konfigurations-Backups, detaillierte Runbooks). Testen Sie die Wiederherstellungsverfahren regelmäßig durch Übungen und Simulationen, um Ausfallzeiten zu minimieren und die Geschäftskontinuität zu gewährleisten. Die Implementierung von Redundanz für kritische Komponenten kann einen Totalausfall des Dienstes während der Sanierung verhindern.",
      "check": "Gibt es einen dokumentierten Plan zur Reaktion auf Vorfälle für große Bedrohungen wie APTs? Ist die Systemdokumentation für die Wiederherstellung vollständig, aktuell und leicht verfügbar? Werden die Wiederherstellungsverfahren regelmäßig getestet? Sind kritische Systeme redundant ausgelegt?",
      "detectionLogic": "Dieses Risiko wird für in-scope technische Assets mit hohen Verfügbarkeitsanforderungen ausgelöst, denen es an Redundanz fehlt. Die Annahme ist, dass solche Assets Single Points of Failure darstellen und ihre Sanierung nach einem APT-Vorfall zu einem erheblichen Dienstausfall führen würde, wie im BSI-Szenario beschrieben.",
      "riskAssessment": "Die Wahrscheinlichkeit basiert auf der Wahrscheinlichkeit eines erfolgreichen APT-Angriffs, der eine größere Bereinigung erfordert, was als ",
      "falsePositives": "Das Modell kann die Qualität einer Organisation nicht überprüfen."
    },
    "apt-lateral-movement-and-persistence": {
      "title": "APT Seitwärtsbewegung und Persistenz (basierend auf BSI-Bedrohungsszenario)",
      "description": "Bei einem Advanced Persistent Threat (APT)-Angriff erlangen Angreifer detaillierte Kenntnisse der Zielumgebung.",
      "impact": "Wenn ein Angreifer auf einem kritischen System Fuß fasst, kann er es nutzen, um andere verbundene Systeme zu kompromittieren. Dies kann zu weitreichender Datenexfiltration, Manipulation kritischer Geschäftsprozesse, dauerhaftem langfristigem Zugriff und erheblichen Störungen führen. Die Fähigkeit, sich seitwärts zu bewegen, vervielfacht den potenziellen Schaden eines einzigen anfänglichen Einbruchs.",
      "asvs": "Abgeleitet von BSI-Bedrohungsbeschreibungen für Advanced Persistent Threats. Verwandte Konzepte umfassen die BSI Bausteine DER.1 (Erkennung) und OPS.1.1.5 (Behandlung von Sicherheitsvorfällen).",
      "action": "Implementierung und Durchsetzung starker Netzwerksegmentierung, Zugriffskontrolle und Bedrohungserkennung",
      "mitigation": "Verwenden Sie eine tiefengestaffelte Verteidigungsstrategie. Nutzen Sie Mikrosegmentierung, um kritische Systeme zu isolieren und den Ost-West-Verkehr einzuschränken. Wenden Sie das Prinzip des geringsten Privilegs auf alle Dienst- und Benutzerkonten an. Erzwingen Sie eine starke, Multi-Faktor-Authentifizierung (MFA) für alle administrativen Zugriffe und kritische Dienst-zu-Dienst-Kommunikation. Implementieren Sie eine robuste Protokollierung und Überwachung in der gesamten Infrastruktur und verwenden Sie Network and Endpoint Detection and Response (NDR/EDR)-Lösungen, um anomales Verhalten zu erkennen, das auf eine Seitwärtsbewegung hindeutet. Verwenden Sie Egress-Filterung, um die Datenexfiltration zu verhindern.",
      "check": "Sind interne Netzwerksegmente und Vertrauensgrenzen ordnungsgemäß isoliert? Wird der Verkehr zwischen kritischen Systemen auf Anomalien überwacht? Basiert der Zugriff auf dem Prinzip des geringsten Privilegs? Ist eine starke Authentifizierung für administrative und Dienst-zu-Dienst-Kommunikation erforderlich?",
      "detectionLogic": "Diese Regel identifiziert hochwertige technische Assets (hohe RAA, kritische CIA-Bewertungen). Anschließend prüft sie auf ausgehende Kommunikationsverbindungen zu anderen hochwertigen Assets, die als Pfade für eine Seitwärtsbewegung dienen könnten. Das Risiko ist erhöht, wenn diese Pfade existieren, insbesondere über Vertrauensgrenzen hinweg oder mit schwacher Authentifizierung, da sie darstellen, wie ein APT seine Kontrolle nach einer anfänglichen Kompromittierung ausweiten könnte.",
      "riskAssessment": "Das Schadenausmaß wird durch die Sensibilität des ursprünglichen Assets und des kritischsten Assets, das es erreichen kann, bestimmt. Ein hochwertiges Asset, das mit vielen anderen kritischen Systemen kommunizieren kann, stellt ein sehr hohes Schadenausmaß dar. Die Wahrscheinlichkeit basiert auf der Anzahl potenzieller Seitwärtsbewegungspfade und der Stärke der Kontrollen auf diesen Pfaden (z. B. Authentifizierung). Eine Umgebung mit vielen uneingeschränkten Pfaden von einem kritischen System zum anderen wird als wahrscheinlicher für eine Seitwärtsbewegung ausgenutzt.",
      "falsePositives": "Das Modell kann legitime und notwendige Kommunikation zwischen kritischen Systemen kennzeichnen. Dieses Risiko erfordert eine qualitative Bewertung, um zu bestätigen, ob die vorhandenen Überwachungs-, Authentifizierungs- und Zugriffskontrollmaßnahmen für diese Verbindungen ausreichen, um die Bedrohung durch Seitwärtsbewegungen zu mindern."
    },
    "un-restarted-temporarily-disabled-security-measures": {
      "title": "Sicherheitsmaßnahmen vorübergehend deaktiviert, aber nicht wieder aktiviert",
      "description": "Das allgemeine Sicherheitsniveau einer Anwendung oder eines Systems hängt davon ab, ob alle Sicherheitsmaßnahmen vollständig und korrekt umgesetzt sind.",
      "impact": "Wenn Sicherheitskontrollen nicht wieder aktiviert werden, arbeitet das System auf einem niedrigeren Sicherheitsniveau als vorgesehen.",
      "asvs": "V14.2 Konfigurationsüberprüfung",
      "action": "Etablierung und Durchsetzung sicherer Konfigurations- und Änderungsmanagementprozesse",
      "mitigation": "Etablieren Sie strenge Änderungsmanagementverfahren, die Checklisten für das Deaktivieren und Wiederaktivieren von Sicherheitsfunktionen enthalten.",
      "check": "Gibt es dokumentierte Verfahren zum vorübergehenden Deaktivieren und Wiederaktivieren von Sicherheitskontrollen? Gibt es ein automatisiertes System zur Überprüfung der Sicherheitskonfigurationsbasis anhand eines Golden Image? Werden Alarme für deaktivierte Sicherheitskontrollen generiert?",
      "detectionLogic": "Dieses Risiko ist bei Systemen verbreitet, die manuell konfiguriert werden oder häufigen manuellen Änderungen während der Bereitstellung oder Wartung unterliegen.",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei Systemen, die manuelle Eingriffe während der Bereitstellung oder bei Updates erfordern, als höher angesehen. Das Schadenausmaß steht in direktem Zusammenhang mit dem ",
      "falsePositives": "Dieses Risiko könnte für Assets gemeldet werden, auch wenn die Organisation sehr ausgereifte, checklistengesteuerte oder automatisierte Betriebsabläufe hat, die dies verhindern."
    },
    "ineffective-or-uneconomical-security-measures": {
      "title": "Unwirksame oder unwirtschaftliche Sicherheitsmaßnahmen",
      "description": "Wenn Sicherheitsmaßnahmen ohne Berücksichtigung praktischer Aspekte ihrer Anwendung implementiert werden, können sie unwirksam oder unwirtschaftlich sein.",
      "impact": "Wenn Sicherheitskontrollen umgangen oder falsch angewendet werden können, sind die zu schützenden Assets Bedrohungen ausgesetzt, was möglicherweise zur Kompromittierung ihrer Vertraulichkeit, Integrität oder Verfügbarkeit führt. Dies kann trotz vorhandener Sicherheitsmaßnahmen zu Datenlecks, Systemübernahmen und anderen Sicherheitsvorfällen führen und ein falsches Sicherheitsgefühl erzeugen.",
      "asvs": "Basiert auf BSI IT-Grundschutz CON.1 (Sicherheitskonzept und -richtlinien), das die Notwendigkeit eines kohärenten und angemessenen Satzes von Sicherheitsmaßnahmen betont.",
      "action": "Überprüfung und Härtung der Zugriffspfade zu kritischen Assets",
      "mitigation": "Stellen Sie sicher, dass alle Zugriffspfade zu einem sensiblen Asset mit einem konsistenten und angemessenen Sicherheitsniveau geschützt sind.",
      "check": "Überprüfen Sie alle eingehenden Kommunikationsverbindungen zu sensiblen Assets. Gibt es Verbindungen, denen es an Authentifizierung oder Verschlüsselung fehlt, insbesondere wenn andere Verbindungen zum selben Asset gut gesichert sind? Ist es für einen Angreifer möglich, eine ",
      "detectionLogic": "Diese Regel sucht nach architektonischen Inkonsistenzen bei der Zugriffskontrolle. Sie identifiziert sensible technische Assets, die mindestens eine stark authentifizierte eingehende Kommunikationsverbindung, aber auch mindestens eine schwache (unauthentifizierte) entfernte Kommunikationsverbindung haben. Diese Konstellation deutet auf eine mögliche Umgehung der beabsichtigten Sicherheitskontrollen hin.",
      "riskAssessment": "Das Schadenausmaß wird durch die CIA-Anforderungen des zu schützenden Assets bestimmt. Ein hochwertigeres Asset führt zu einem höheren Schadenausmaß. Die Wahrscheinlichkeit wird als hoch angesehen, da der schwache Zugriffspfad leicht ausgenutzt werden kann. Das Risiko wird für jeden schwachen ",
      "falsePositives": "Eine schwache oder unauthentifizierte Verbindung könnte absichtlich für eine risikoarme, öffentlich zugängliche Funktion (wie einen Health-Check-Endpunkt, der keine sensiblen Daten preisgibt) vorhanden sein, während authentifizierte Verbindungen für den administrativen Zugriff bestimmt sind. Dies erfordert eine manuelle Überprüfung. Unauthentifizierter Zugriff auf sensible Systeme wird jedoch generell nicht empfohlen."
    },
    "lack-of-independent-isms-review": {
      "title": "Fehlende unabhängige ISMS-Überprüfung",
      "description": "In vielen Institutionen ist der Informationssicherheitsbeauftragte (ISB) für die Überprüfung der Umsetzung von Sicherheitsmaßnahmen verantwortlich.",
      "impact": "Wenn das ISMS nicht unabhängig und effektiv auditiert wird, kann das allgemeine Sicherheitsniveau der Institution erheblich beeinträchtigt werden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium, Baustein ORP.3",
      "action": "Einrichtung und Durchführung eines regelmäßigen, unabhängigen ISMS-Auditprogramms",
      "mitigation": "Implementieren Sie einen formellen Prozess zur regelmäßigen Auditierung des ISMS. Diese Audits müssen von einer vom Informationssicherheitsbeauftragten unabhängigen Partei durchgeführt werden.",
      "check": "Gibt es einen dokumentierten Prozess zur Auditierung des ISMS? Werden Audits von einer vom ISB unabhängigen Partei durchgeführt? Liegt ein aktueller Auditbericht vor? Werden Feststellungen bis zur Lösung nachverfolgt?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko im Zusammenhang mit Governance und Prozesssicherung. In einem technischen Modell wird dieses Risiko aufgedeckt, indem es an Assets angehängt wird, die für das Sicherheitsmanagement von zentraler Bedeutung sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als HOCH angesehen, wenn kein etablierter unabhängiger Auditprozess für das ISMS besteht. Das Schadenausmaß wird durch die höchste Sensibilität der unter dem ISMS verwalteten Assets und Daten bestimmt, da ein Prozessfehler auf dieser Ebene alle geschützten Assets gefährdet. Das Risiko wird auf der Grundlage der CIA-Bewertung des spezifischen technischen Assets berechnet, an das es im Modell angehängt ist.",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch und kann nicht allein aus einem technischen Modell validiert werden. Das Modell deckt das Risiko auf der Grundlage des Vorhandenseins einer Sicherheitsmanagementrolle auf."
    },
    "inadequate-audit-or-review-orp-4-g1": {
      "title": "Unzureichendes Audit oder unzureichende Überprüfung aufgrund unqualifizierter oder unvorbereiteter Auditoren (BSI ORP.4.G1)",
      "description": "Wenn Personal, das ein Audit oder eine Überprüfung durchführt, nicht ausreichend qualifiziert oder unzureichend vorbereitet ist,",
      "impact": "Ein fehlerhaftes Audit kann entweder zu einer Überschätzung der Sicherheit führen, wodurch kritische Schwachstellen unentdeckt bleiben, oder zu einer Unterschätzung,",
      "asvs": "BSI IT-Grundschutz ORP.4 Audit und Revision",
      "action": "Sicherstellung der Qualifikation und Vorbereitung von Auditoren",
      "mitigation": "Stellen Sie sicher, dass interne und externe Auditoren angemessen qualifiziert, unabhängig sind und über ausreichende Ressourcen und Zeit zur Vorbereitung und Durchführung von Audits verfügen.",
      "check": "Gibt es definierte Qualifikationskriterien für Auditoren? Sind Auditpläne und -umfänge dokumentiert? Werden Auditberichte vom Management überprüft und nachverfolgt? Gibt es einen Prozess, um sicherzustellen, dass Korrekturmaßnahmen umgesetzt und wirksam sind?",
      "detectionLogic": "Dieses organisatorische Risiko wird durch technische Assets ausgelöst, die mit dem Tag `role:pruefer` (Auditor/Prüfer) versehen sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird aufgrund des Vorhandenseins einer auditbezogenen Rolle ausgelöst. Die tatsächliche Qualifikation und Vorbereitung der Auditoren kann nicht allein aus dem technischen Modell bestimmt werden und erfordert eine Überprüfung der Organisation."
    },
    "lack-of-central-audit-planning-orp2-a1": {
      "title": "Fehlende zentrale und langfristige Auditplanung (BSI ORP.2.A1)",
      "description": "Wenn Audits und Überprüfungen nicht zentral und langfristig geplant werden, kann dies zu einem unausgewogenen Auditumfang führen.",
      "impact": "Die primäre Auswirkung ist die Unfähigkeit, den Sicherheitsstatus des Informationsverbunds zuverlässig zu bewerten. Verborgene Schwachstellen und Nichteinhaltung in nicht auditierten Bereichen können unentdeckt bleiben.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.2 (Informationssicherheits-Revision), Anforderung ORP.2.A1 (Planung von Informationssicherheits-Revisionen).",
      "action": "Einrichtung eines zentralisierten, risikobasierten und strategischen Auditprogramms",
      "mitigation": "Entwickeln und implementieren Sie einen zentralen, langfristigen Auditplan, der alle relevanten Bereiche des Informationsverbunds risikobasiert abdeckt.",
      "check": "Gibt es einen dokumentierten, langfristigen Auditplan? Basiert der Plan auf einer Risikobewertung? Deckt er alle kritischen Systeme und Prozesse ab?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das nicht direkt aus einem technischen Modell erkannt werden kann.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch. Eine Organisation könnte ein robustes, zentral verwaltetes Auditprogramm haben, das sich nicht im technischen Asset-Modell widerspiegelt."
    },
    "insufficient-audit-planning-orp3-g6": {
      "title": "Ungenügende Auditplanung (BSI ORP.3.G6)",
      "description": "Wenn ein Audit oder eine Sicherheitsprüfung schlecht geplant und nicht ausreichend mit der Institution koordiniert ist, sind möglicherweise erforderliche Mitarbeiter während der Überprüfung nicht verfügbar.",
      "impact": "Die primäre Auswirkung ist, dass bestehende Sicherheitsschwachstellen, Konfigurationsfehler oder die Nichteinhaltung von Sicherheitsrichtlinien unentdeckt bleiben können.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.3 (Sicherheitscheck und Audit), Anforderung ORP.3.A1 (Planung von Sicherheitschecks).",
      "action": "Einrichtung und Befolgung eines formellen Prozesses für Audits und Sicherheitsprüfungen",
      "mitigation": "Definieren und implementieren Sie einen strukturierten Prozess zur Planung und Durchführung von Audits und Sicherheitsprüfen. Dieser Prozess muss klare Kommunikationskanäle umfassen,",
      "check": "Gibt es ein dokumentiertes Verfahren zur Planung von Audits und Sicherheitsprüfen? Werden Auditpläne erstellt, dokumentiert und im Voraus kommuniziert?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko im Zusammenhang mit dem Auditprozess. Es gilt für technische Assets, die Audits unterzogen werden sollten.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist organisatorisch und kann nicht allein durch das technische Modell vollständig überprüft werden. Eine Organisation könnte einen robusten Auditplanungsprozess haben."
    },
    "insufficient-compliance-with-co-determination-law": {
      "title": "Ungenügende Einhaltung des Mitbestimmungsrechts bei Audits",
      "description": "Daten aus Audits und Revisionen können unbeabsichtigt Informationen enthalten, die Rückschlüsse auf die Leistung von Mitarbeitern zulassen.",
      "impact": "Die Verletzung von Mitbestimmungsgesetzen kann zu Rechtsstreitigkeiten, Geldstrafen und einem erheblichen Vertrauensverlust zwischen Mitarbeitern und Management führen.",
      "asvs": "Abgeleitet aus benutzerdefinierten Texten im BSI-Stil. Die Prinzipien stimmen mit dem BSI IT-Grundschutz Baustein DER.1 Datenschutz überein, insbesondere mit Anforderungen wie DER.1.A6",
      "action": "Festlegung klarer Richtlinien für die Nutzung von Auditdaten",
      "mitigation": "Definieren und dokumentieren Sie den Zweck aller Audit- und Protokollierungsaktivitäten klar und schließen Sie die Leistungsbewertung von Mitarbeitern explizit aus.",
      "check": "Gibt es eine schriftliche Richtlinie, die die Verwendung von Audit- und Protokolldaten regelt? Hat die Personalvertretung diese Richtlinie formell genehmigt? Werden Zugriffsprotokolle für Auditdaten überprüft, um Missbrauch zu verhindern?",
      "detectionLogic": "Dieses organisatorische Risiko wird für technische Assets ausgelöst, die typischerweise detaillierte, benutzerspezifische Protokolle sammeln, die für die Leistungsüberwachung zweckentfremdet werden könnten.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann nur durch Überprüfung interner Unternehmensrichtlinien und rechtlicher Vereinbarungen mit der Personalvertretung bestätigt werden. Ein technisches Modell kann die Existenz oder Durchsetzung solcher Richtlinien nicht überprüfen."
    },
    "concealment-of-security-weaknesses-con1-a23": {
      "title": "Verschleierung von Sicherheitsschwachstellen (BSI CON.1.A23)",
      "description": "Mitarbeiter, die befürchten, dass ihre Fehler bei Audits, Überprüfungen oder Tests entdeckt werden, könnten versuchen, bestehende Sicherheitsprobleme oder Schwachstellen zu verbergen. Dies kann zu einer verzerrten und übermäßig optimistischen Sicht auf die tatsächliche Sicherheitslage führen, wodurch kritische Schwachstellen unbehandelt bleiben.",
      "impact": "Das Verschleiern von Schwachstellen bedeutet, dass sie unbehandelt und ungemindert bleiben, was Angreifern ein beständiges Zeitfenster für Angriffe bietet. Das daraus resultierende falsche Sicherheitsgefühl kann zu fehlinformierten Risikomanagemententscheidungen führen. Letztendlich kann dies zu schweren Sicherheitsvorfällen führen, die die Vertraulichkeit, Integrität oder Verfügbarkeit des Systems und der zugehörigen Daten gefährden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.4 (Sicherheitstests und Übungen). Dies ist ein organisatorisches Risiko, das sich auf menschliche Faktoren und die Unternehmenskultur bezieht und die Wirksamkeit aller technischen Überprüfungs- und Testaktivitäten beeinflusst.",
      "action": "Förderung einer fehlerfreundlichen Kultur für Sicherheitsmeldungen",
      "mitigation": "Etablieren Sie einen klaren, nicht-strafenden Prozess zur Meldung von Sicherheitsschwächen und Fehlern. Das Management sollte aktiv eine ",
      "check": "Gibt es eine formelle Richtlinie zur Meldung von Sicherheitsproblemen? Fördert oder behindert die Unternehmenskultur die Meldung von Fehlern? Sind Post-Mortems von Vorfällen auf Lernen und Verbesserung statt auf Schuldzuweisungen ausgerichtet? Gibt es anonyme Meldeoptionen?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das sich auf menschliches Verhalten und die Unternehmenskultur bezieht. Es kann nicht automatisch aus einem technischen Modell erkannt werden. Es wird für Assets ausgelöst, die wahrscheinlich Audits oder Überprüfungen unterzogen werden, insbesondere solche mit eigenentwickelten Teilen oder die hochsensible Daten verarbeiten, da der Druck, Fehler zu verbergen, in diesen Fällen höher ist.",
      "riskAssessment": "Die Wahrscheinlichkeit ist in Umgebungen mit einer bestrafenden oder ",
      "falsePositives": "Dieses Risiko ist immer ein potenzielles False Positive, wenn es aus einem technischen Modell generiert wird, da es vollständig von der Unternehmenskultur abhängt, die nicht modelliert werden kann. Sein Vorhandensein sollte eine Diskussion über das Unternehmen auslösen."
    },
    "failure-to-implement-up-bund-2017": {
      "title": "Nichtumsetzung der Anforderungen des UP Bund 2017",
      "description": "Die ",
      "impact": "Die Nichteinhaltung des UP Bund 2017 kann zu erheblichen rechtlichen, vertraglichen und finanziellen Strafen führen. Sie deutet auf eine grundlegende Lücke in der Sicherheits-Governance hin, was darauf schließen lässt, dass erforderliche Sicherheitskontrollen (gemäß IT-Grundschutz) fehlen, nicht durchgesetzt oder nicht überprüft werden. Dies erhöht das Gesamtrisiko von Sicherheitsvorfällen, die die Vertraulichkeit, Integrität und Verfügbarkeit aller Informationswerte innerhalb des Systems gefährden könnten.",
      "asvs": "Abgeleitet vom deutschen ",
      "action": "Einrichtung und Auditierung eines ISMS auf Basis des BSI IT-Grundschutz",
      "mitigation": "Implementieren Sie ein umfassendes ISMS, das vollständig den Anforderungen des BSI IT-Grundschutz entspricht. Dies umfasst die Definition von Sicherheitsrichtlinien, die Zuweisung von Verantwortlichkeiten, die Implementierung technischer und organisatorischer Kontrollen und die Erstellung von Plänen zur Reaktion auf Vorfälle. Führen Sie insbesondere regelmäßig interne und externe Sicherheitsaudits auf Basis des BSI durch.",
      "check": "Ist die Organisation zur Einhaltung des UP Bund 2017 verpflichtet? Ist ein formelles ISMS auf Basis des IT-Grundschutz etabliert und wird es aktiv gepflegt? Werden regelmäßige IS-Audits, wie im Plan gefordert, durchgeführt und werden deren Ergebnisse umgesetzt? Kann die Einhaltung durch Dokumentation und Auditberichte nachgewiesen werden?",
      "detectionLogic": "Dies ist ein organisatorisches Compliance-Risiko. In einem Threagile-Modell wird es",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird als hoch angesehen, wenn die Organisation dem UP Bund 2017 unterliegt, da die Einhaltung obligatorisch ist, aber für nicht-OT-Systemtypen optional. Das Schadenausmaß ist aufgrund der rechtlichen und verfahrenstechnischen Konsequenzen der Nichteinhaltung ebenfalls von Natur aus hoch. Das Schadenausmaß wird weiter erhöht basierend auf den CIA-Anforderungen der von der Verordnung betroffenen Assets. Eine Nichtumsetzung der geforderten Sicherheitsbasis setzt kritische Assets einer breiten Palette von Bedrohungen aus.",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn tatsächlich ein robustes, konformes und regelmäßig auditiertes ISMS vorhanden ist, das Bedrohungsmodell jedoch nicht aktualisiert wurde, um dies widerzuspiegeln (z. B. durch eine Statusänderung im Risikotracking). Die Überprüfung erfordert die Einsichtnahme in organisatorische Compliance-Dokumentationen, ISMS-Richtlinien und aktuelle Auditberichte."
    },
    "concealment-of-security-deficiencies-during-audits": {
      "title": "Verschleierung von Sicherheitsmängeln bei Audits (BSI-basiert)",
      "description": "Mitarbeiter könnten befürchten, dass ein Informationssicherheits-Audit ihre Fehler aufdeckt. Um Konsequenzen zu vermeiden, könnten sie bestehende Sicherheitsprobleme verschleiern oder herunterspielen und so ein falsches Bild der tatsächlichen Sicherheitslage vermitteln. Dies verhindert die Entdeckung und Behebung von Sicherheitsschwachstellen.",
      "impact": "Wenn Sicherheitsmängel absichtlich verborgen werden, bleiben sie unkorrigiert und können von Angreifern ausgenutzt werden. Darüber hinaus könnte das Management das wahre Risikoniveau eines Systems falsch einschätzen, was zu schlechten Investitionsentscheidungen in die Sicherheit und einem falschen Sicherheitsgefühl führt. Dies untergräbt den gesamten Governance- und Auditprozess.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.2 (Informationssicherheits-Governance), speziell im Widerspruch zum Prinzip der Anforderung ORP.2.A5 (Überprüfung der Informationssicherheit), die transparente und regelmäßige Überprüfungen verlangt.",
      "action": "Förderung einer fehlerfreundlichen Sicherheitskultur und Sicherstellung unabhängiger Audits",
      "mitigation": "Fördern Sie eine Sicherheitskultur, in der die Meldung von Problemen gefördert und nicht bestraft wird. Stellen Sie sicher, dass Sicherheitsaudits von unabhängigen Parteien (intern oder extern) durchgeführt werden, die von den zu auditierenden Teams getrennt sind. Verwenden Sie nach Möglichkeit automatisierte Werkzeuge für objektive Sicherheitsscans. Etablieren Sie klare Verfahren für die Meldung und Behebung von Feststellungen, ohne persönliche Schuld für unbeabsichtigte Fehler zuzuweisen. Das Management muss kommunizieren, dass das Ziel von Audits die Verbesserung und nicht die Bestrafung ist.",
      "check": "Gibt es eine formelle Richtlinie für ",
      "detectionLogic": "Dies ist ein organisatorisches und kulturelles Risiko. Es ist schwer, es automatisch zu erkennen. Diese Regel löst das Risiko für technische Assets aus, bei denen verantwortliches Personal (wie Administratoren oder Entwickler) Druck verspüren könnte, Fehler zu verbergen. Es wird durch Assets ausgelöst, die mit bestimmten Rollen gekennzeichnet sind.",
      "riskAssessment": "Die Wahrscheinlichkeit ist allein aus dem Modell schwer abzuschätzen, wird aber als ",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch und kulturell. Ein Modell kann die Unternehmenskultur nicht überprüfen. Eine Organisation könnte eine sehr gesunde, offene "
    },
    "leakage-of-is-audit-information": {
      "title": "Abfluss von IS-Audit-Informationen (BSI ORP.3.A5)",
      "description": "Während eines Informationssicherheits-Audits werden sensible Daten wie identifizierte Schwachstellen, Sicherheitslücken und potenzielle Angriffsvektoren gesammelt und dokumentiert.",
      "impact": "Wenn diese Audit-Informationen an Unbefugte gelangen, bieten sie einen direkten Fahrplan für einen Angriff auf die Institution.",
      "asvs": "BSI IT-Grundschutz ORP.3.A5 (Umgang mit Auditergebnissen)",
      "action": "Sichere Handhabung und Speicherung von Audit-Informationen",
      "mitigation": "Auditergebnisse und zugehörige Dokumentationen müssen entsprechend ihrer Sensibilität klassifiziert werden (z. B. ",
      "check": "Sind Auditergebnisse und -berichte klassifiziert und zugriffsgesteuert? Sind die Systeme, die diese Daten speichern, gehärtet und überwacht? Wird Verschlüsselung für die Speicherung und Übertragung von Auditdaten verwendet?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die wahrscheinlich sensible IS-Audit-Informationen verarbeiten oder speichern.",
      "riskAssessment": "Das Schadenausmaß eines Lecks wird durch die Sensibilität der Auditdaten bestimmt, die durch die Vertraulichkeitsbewertung des technischen Assets oder der von ihm verarbeiteten Daten dargestellt wird.",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn das identifizierte Asset Teil einer hochsicheren, getrennten Audit-Umgebung mit strengen Zugriffskontrollen ist, auch wenn n@SystemType:OT explizit so modelliert ist."
    },
    "disabled-security-controls-reenabled": {
      "title": "Sicherheitskontrollen wieder aktiviert (BSI-basiert)",
      "description": "Das Sicherheitsniveau einer Institution wird davon beeinflusst, ob Sicherheitsmaßnahmen vollständig und korrekt umgesetzt sind.",
      "impact": "Die Nicht-Wiederaktivierung von Sicherheitskontrollen nach vorübergehender Aussetzung führt zu einem dauerhaften Zustand der Verwundbarkeit.",
      "asvs": "OWASP Top 10 2021: A05-Security Misconfiguration",
      "action": "Implementierung und Durchsetzung strenger Prozesse für Change Management und Validierung nach Änderungen",
      "mitigation": "Etablieren Sie einen formellen, auditierten Prozess für das vorübergehende Deaktivieren und Wiederaktivieren jeglicher Sicherheitskontrolle.",
      "check": "Gibt es einen formellen Change-Management-Prozess zur Änderung von Sicherheitskonfigurationen? Gibt es ein automatisiertes System zur Überprüfung der Sicherheitslage von Assets nach der Bereitstellung oder Wartung?",
      "detectionLogic": "Dieses Risiko wird für technische Assets und Kommunikationsverbindungen ausgelöst, bei denen es",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos ist bei Assets höher, die häufigen Änderungen oder einer aktiven Entwicklung unterliegen.",
      "falsePositives": "Dieses Risiko kann für Assets innerhalb einer gut verwalteten CI/CD-Pipeline gemeldet werden, in der automatisierte Prüfungen nach der Bereitstellung diesen Prozessfehler bereits mindern."
    },
    "impractical-or-ineffective-security-measures-bsi": {
      "title": "Unpraktische oder unwirksame Sicherheitsmaßnahmen (BSI-Stil)",
      "description": "Wenn Sicherheitsmaßnahmen ohne Berücksichtigung praktischer Aspekte umgesetzt werden, können diese Maßnahmen unwirksam sein. Es ist beispielsweise sinnlos, einen Eingangsbereich mit Drehkreuzen zu blockieren, wenn Mitarbeiter das Gebäude stattdessen durch einen offenen Seiteneingang betreten können. Es kann auch vorkommen, dass einzelne Maßnahmen ergriffen werden, die wirtschaftlich nicht sinnvoll sind. Zum Beispiel ist zum Schutz von Informationen mit normalem Schutzbedarf hinsichtlich der Vertraulichkeit ein entsprechend umgesetztes Rechte- und Rollenkonzept sinnvoller und wirtschaftlicher als die Einrichtung einer komplexen, zertifikatsbasierten Verschlüsselung auf dem Dateiserver.",
      "impact": "Unwirksame Maßnahmen schaffen ein falsches Sicherheitsgefühl, während kritische Schwachstellen offen bleiben. Dies kann dazu führen, dass Sicherheitskontrollen umgangen werden, was zu unbefugtem Zugriff, Datenlecks (Verlust der Vertraulichkeit), Datenmanipulation (Verlust der Integrität) oder Dienstunterbrechungen (Verlust der Verfügbarkeit) führt. Überdimensionierte Kontrollen können die Komplexität und die Kosten erhöhen, ohne einen proportionalen Sicherheitsnutzen zu bieten.",
      "asvs": "Abgeleitet von den Prinzipien des BSI IT-Grundschutz. Entspricht OWASP Top 10 2021: A04 - Insecure Design.",
      "action": "Überprüfung und Verfeinerung der Sicherheitsarchitektur und der Auswahl der Kontrollen",
      "mitigation": "Stellen Sie sicher, dass Sicherheitskontrollen angemessen im Datenfluss platziert sind, um wirksam zu sein. Bei internetzugänglichen Systemen sollten sensible Backend-Komponenten nicht direkt exponiert sein. Stattdessen sollte der Datenverkehr über dedizierte Eingangskomponenten wie Reverse Proxies, WAFs oder API Gateways geleitet werden. Überprüfen Sie regelmäßig die Architektur, um Umgehungsrouten zu identifizieren und zu beseitigen. Wählen Sie zum Datenschutz Kontrollen (wie Verschlüsselung), die für die Daten angemessen sind.",
      "check": "Gibt es direkte Kommunikationspfade von nicht vertrauenswürdigen Netzwerken (wie dem Internet) zu sensiblen Backend-Diensten, die beabsichtigte Sicherheitskontrollen (wie WAFs, Proxies) umgehen? Sind die implementierten Sicherheitsmaßnahmen, wie z. B. Verschlüsselungsstufen, proportional zu den Schutzanforderungen der Assets?",
      "detectionLogic": "Diese Regel identifiziert zwei potenzielle architektonische Mängel: 1. Eine ",
      "riskAssessment": "Bei umgangenen Kontrollen ist die Wahrscheinlichkeit hoch, wenn ein direkter, ungefilterter Pfad existiert, und das Schadenausmaß basiert auf den CIA-Anforderungen des Ziel-Assets. Bei überdimensionierten Kontrollen ist das Risiko typischerweise geringer und bezieht sich mehr auf die betriebliche Komplexität und die Kosten, kann aber dennoch auf ein Missverständnis der Sicherheitsanforderungen hindeuten.",
      "falsePositives": "Eine direkte Verbindung könnte absichtlich entworfen und durch andere Mittel gesichert sein (z. B. starke Endpunktsicherheit, spezifische Protokollhärtung). Eine starke Verschlüsselungswahl könnte eine präventive Maßnahme sein oder durch eine pauschale Richtlinie gefordert werden. Eine manuelle Überprüfung ist erforderlich."
    },
    "lack-of-impartial-isms-audit": {
      "title": "Fehlendes unparteiisches ISMS-Audit (BSI ORP.4)",
      "description": "In vielen Organisationen ist der Informationssicherheitsbeauftragte (ISB) für die Überprüfung der Umsetzung von Sicherheitsmaßnahmen verantwortlich.",
      "impact": "Wenn das ISMS nicht von einer unparteiischen Stelle überprüft wird, können erhebliche Schwächen in der Sicherheits-Governance, den Prozessen und Kontrollen unentdeckt bleiben.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein ORP.4 (Interne und externe Revision), speziell Anforderung ORP.4.A6 (Durchführung interner Revisionen), die die Notwendigkeit der Objektivität und Unparteilichkeit des Auditors betont.",
      "action": "Einrichtung einer unabhängigen Auditfunktion für das ISMS",
      "mitigation": "Stellen Sie sicher, dass das ISMS regelmäßig von Personal auditiert wird, das von der ISMS-Managementfunktion (d. h. nicht dem ISB) unabhängig ist.",
      "check": "Gibt es einen dokumentierten Prozess zur Auditierung des ISMS? Ist die Einheit (Person oder Team), die das ISMS-Audit durchführt, nachweislich unabhängig vom ISB und dessen Team?",
      "detectionLogic": "Dieses organisatorische Risiko wird durch die Prüfung auf das Vorhandensein eines Informationssicherheitsbeauftragten (",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein False Positive kann auftreten, wenn die Auditfunktion von einer externen Partei wahrgenommen wird, die nicht im Bedrohungsmodell dokumentiert ist, oder wenn ein internes Asset Audits durchführt, aber nicht mit dem "
    },
    "inadequate-auditor-qualification-and-preparation": {
      "title": "Unzureichende Qualifikation und Vorbereitung von Auditoren (BSI DER.2)",
      "description": "Wenn ein Auditteam (",
      "impact": "Fehlerhafte Audit-Feststellungen können zu einem falschen Sicherheitsgefühl führen, bei dem kritische Schwachstellen unentdeckt bleiben.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium: Baustein DER.2",
      "action": "Etablierung und Durchsetzung eines formellen Prozesses zur Auswahl von Auditoren und zur Auditvorbereitung",
      "mitigation": "Definieren Sie klare, strenge Qualifikationskriterien für interne und externe Auditoren, basierend auf dem Umfang und der Komplexität der zu auditierenden Systeme.",
      "check": "Gibt es eine formelle Richtlinie zur Auswahl von IS-Auditoren? Sind Qualifikationskriterien dokumentiert und werden sie durchgesetzt?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko im Zusammenhang mit dem Auditprozess. Es kann für technische Assets ausgelöst werden, die typischerweise Sicherheitsaudits unterliegen oder daran beteiligt sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist organisatorisch und kann nicht allein durch das technische Modell vollständig bestätigt werden."
    },
    "lack-of-central-audit-planning-rev1.a4": {
      "title": "Fehlende zentrale und langfristige Auditplanung (BSI REV.1.A4)",
      "description": "Wenn Informationssicherheits-Audits/Revisionen nicht zentral und langfristig geplant werden, könnten einige Organisationseinheiten oder Systeme häufig auditiert werden, während andere überhaupt nicht auditiert werden. Auch Änderungen am ISMS (Informationssicherheitsmanagementsystem) könnten bei unregelmäßigen Audits nicht ausreichend geprüft werden. Dies macht es sehr schwierig oder unmöglich, die Sicherheitslage des gesamten Informationsverbunds richtig zu bewerten.",
      "impact": "In nicht auditierten Bereichen können unentdeckte Schwachstellen bestehen, und Sicherheitskontrollen für neue oder geänderte Komponenten werden möglicherweise nicht überprüft. Dies führt zu einem erhöhten Risiko von Sicherheitsvorfällen, Nichteinhaltung von Vorschriften und potenziellen Datenlecks, da der tatsächliche Sicherheitszustand des Systems nicht zuverlässig bestimmt werden kann.",
      "asvs": "BSI IT-Grundschutz Kompendium 2023: Baustein REV.1 Revision, Anforderung REV.1.A4 Planung der IS-Revision.",
      "action": "Einrichtung eines zentralisierten und regelmäßigen Auditprogramms",
      "mitigation": "Entwickeln und implementieren Sie einen formellen, langfristigen Auditplan, der zentral verwaltet wird. Der Plan sollte den Umfang, die Häufigkeit und die Methodik für Audits über alle Organisationseinheiten und Informationssysteme hinweg definieren. Er muss eine regelmäßige Abdeckung aller kritischen Bereiche gewährleisten und Vorkehrungen für Ad-hoc-Audits als Reaktion auf wesentliche Änderungen oder Sicherheitsvorfälle enthalten. Der Auditplan sollte vom Management genehmigt und den relevanten Stakeholdern kommuniziert werden.",
      "check": "Gibt es einen formellen, dokumentierten Informationssicherheits-Auditplan? Wird er zentral verwaltet? Gibt er Umfang und Häufigkeit für alle kritischen Systeme an? Gibt es einen Prozess zur Auditierung wesentlicher Änderungen am System?",
      "detectionLogic": "Dies ist ein grundlegendes organisatorisches Risiko, das für das gesamte modellierte System gilt. Das Risiko wird generiert, wenn das Modell mindestens ein in-scope, hochwertiges technisches Asset enthält, da das Fehlen eines strukturierten Auditprozesses eine erhebliche Bedrohung für solche Assets darstellt. Das Risiko wird einmal für das gesamte System ausgelöst, wobei seine Auswirkungen durch das kritischste gefundene Asset skaliert werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist organisatorischer Natur und kann nicht allein aus einem technischen Modell validiert werden. Die Organisation verfügt möglicherweise über ein robustes Auditprogramm, das nicht im Modell abgebildet ist. Die Überprüfung erfordert die Einsichtnahme in einen offiziellen, vom Management genehmigten Auditplan und -zeitplan."
    },
    "inadequate-is-audit-planning-orp3-a1": {
      "title": "Unzureichende Planung von IS-Audits (BSI ORP.3.A1)",
      "description": "Wenn ein Informationssicherheits- (IS) Audit schlecht geplant und nicht ordnungsgemäß mit dem verantwortlichen Personal koordiniert ist, sind die erforderlichen Fachexperten möglicherweise während der Vor-Ort-Inspektion nicht verfügbar.",
      "impact": "Ein schlecht geplantes oder ausgeführtes Audit vermittelt ein falsches Sicherheitsgefühl. Unentdeckte Schwachstellen oder Compliance-Lücken können später ausgenutzt werden,",
      "asvs": "BSI IT-Grundschutz Baustein ORP.3 IS-Revision, Anforderung ORP.3.A1 Planung der IS-Revision.",
      "action": "Etablierung und Befolgung eines formellen Prozesses zur Planung und Koordination von IS-Audits",
      "mitigation": "Definieren und erzwingen Sie einen formellen Prozess zur Planung und Durchführung von IS-Audits. Dieser Prozess muss eine proaktive Koordination mit allen relevanten Stakeholdern beinhalten, um die Verfügbarkeit von Personal und den Zugang zu notwendigen Systemen, Beweismitteln und Dokumentationen sicherzustellen.",
      "check": "Gibt es einen dokumentierten Prozess zur Planung von IS-Audits? Werden Auditpläne konsequent mit den betroffenen Abteilungen und dem Personal koordiniert?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das für jedes System gilt, das eine Sicherheitsüberprüfung erfordert. In einem technischen Modell wird dieses Risiko für alle in-scope Assets ausgelöst, die hochsensibel sind (und daher eine gründliche Auditierung erfordern).",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist prozedural und organisatorisch; seine Existenz kann nicht allein durch ein technisches Modell bestätigt werden. Die Organisation könnte einen robusten Auditplanungsprozess haben, der sich nicht im Modell widerspiegelt."
    },
    "is-audit-as-performance-monitoring-der3.a1": {
      "title": "IS-Audit als Leistungsüberwachung ohne Beteiligung der Personalvertretung (BSI DER.3.A1)",
      "description": "Bei IS-Audits können Aspekte geprüft werden, die Rückschlüsse auf das Arbeitsverhalten und die Leistungsfähigkeit von Personal zulassen könnten.",
      "impact": "Die Nichtbeteiligung der Personalvertretung, wenn ein Audit als Leistungsüberwachung wahrgenommen werden könnte, kann zur Verzögerung oder Absage entscheidender Sicherheitsaudits führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein DER.3 Revision, Anforderung DER.3.A1 Einbindung der Personalvertretung.",
      "action": "Sicherstellung der Beteiligung der Personalvertretung bei IS-Audits",
      "mitigation": "Etablieren und befolgen Sie einen formellen Prozess zur Planung von IS-Audits, der die rechtzeitige und angemessene Beteiligung der Personalvertretung vorsieht, insbesondere wenn Leistungs- oder Verhaltensdaten von Mitarbeitern erfasst oder analysiert werden könnten.",
      "check": "Gibt es einen dokumentierten Prozess zur Einbindung der Personalvertretung in die IS-Auditplanung? Wird die Personalvertretung regelmäßig konsultiert, bevor Audits durchgeführt werden, die Mitarbeiterdaten betreffen könnten? Gibt es Nachweise (z. B. Sitzungsprotokolle, offizielle Vereinbarungen) für diese Beteiligung?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das für technische Assets gilt, die für Audit- und Überwachungszwecke verwendet werden.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein formeller Prozess zur Einbindung der Personalvertretung fehlt oder nicht befolgt wird.",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch. Ein technisches Modell kann nicht definitiv wissen, ob die Personalvertretung beteiligt war."
    },
    "personnel-failure-knowledge-monopoly": {
      "title": "Personalausfall / Wissensmonopol (BSI ORP.4.A23)",
      "description": "Der Ausfall oder die Abwesenheit von Schlüsselpersonal kann eine Organisation daran hindern, ihre Kernaufgaben und Geschäftsprozesse auszuführen.",
      "impact": "Wenn ein nicht-redundantes, kritisches System aufgrund eines Personalausfalls nicht mehr betrieben werden kann, ist seine Verfügbarkeit direkt beeinträchtigt.",
      "asvs": "BSI IT-Grundschutz ORP.4: Notfallmanagement, Anforderung ORP.4.A23: Regelungen für den Personalausfall.",
      "action": "Implementierung von Redundanz, Wissenstransfer und Notfallplanung",
      "mitigation": "Stellen Sie sicher, dass keine einzelne Person allein in der Lage ist, ein kritisches System zu betreiben oder zu warten.",
      "check": "Ist das technische Asset im Modell als redundant gekennzeichnet? Gibt es einen dokumentierten und getesteten Notfallplan für dieses Asset/diesen Dienst?",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das n@SystemType:OT als ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass eine einzelne Person oder eine einzelne nicht-redundante Komponente irgendwann ausfällt, wird als ",
      "falsePositives": "Ein Risiko könnte für ein Asset gemeldet werden, das organisatorische Redundanz aufweist (z. B. ein Team von Administratoren, die sich eine Rolle teilen)."
    },
    "component-failure-endangering-availability-con1": {
      "title": "Komponentenausfall gefährdet die Verfügbarkeit (BSI CON.1)",
      "description": "Wenn Komponenten eines IT-Systems ausfallen, zum Beispiel aufgrund defekter Hardware oder eines Stromausfalls, kann der gesamte IT-Betrieb gestört werden.",
      "impact": "Ein Ausfall einer kritischen, nicht-redundanten Komponente führt zu einem Denial-of-Service, der die Verfügbarkeit des technischen Assets direkt beeinträchtigt,",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Redundante IT-Systeme) und INF.5 (Stromversorgung).",
      "action": "Implementierung von Redundanz- und Hochverfügbarkeitsmaßnahmen",
      "mitigation": "Stellen Sie sicher, dass kritische Systemkomponenten redundant ausgelegt sind. Der einfachste Weg, diese Minderung zu modellieren, ist, die ",
      "check": "Sind kritische technische Assets für hohe Verfügbarkeit konfiguriert? Ist die ",
      "detectionLogic": "Diese Regel wird für jedes in-scope technische Asset ausgelöst, das als `redundant` gekennzeichnet ist. Das Risiko ist besonders hoch für Assets mit hohen Verfügbarkeitsanforderungen.",
      "riskAssessment": "Das Schadenausmaß leitet sich direkt aus dem ",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn die Redundanz außerhalb der Komponente selbst gehandhabt wird (z. B. auf einer höheren Infrastrukturebene), aber so modelliert ist. Für Komponenten mit geringem Schadenausmaß und geringer Kritikalität könnte die Akzeptanz dieses Risikos eine gültige Geschäftsentscheidung sein."
    },
    "wan-outage": {
      "title": "Ausfall des Weitverkehrsnetzes (WAN) (BSI-Stil)",
      "description": "Die Ursachen für einen Ausfall eines Weitverkehrsnetzes (WAN) können vielfältig sein und einzelne Benutzer, einen Anbieter oder eine ganze Region betreffen.",
      "impact": "Ein WAN-Ausfall beeinträchtigt hauptsächlich die Verfügbarkeit von Diensten und Geschäftsprozessen, die von dieser Konnektivität abhängen. Dies kann zu reduzierter Produktivität führen,",
      "asvs": "BSI IT-Grundschutz: NET.3.2 Weitverkehrsnetz",
      "action": "Sicherstellung von Redundanz und Hochverfügbarkeit für WAN-Verbindungen",
      "mitigation": "Verwenden Sie redundante WAN-Verbindungen, vorzugsweise von verschiedenen Anbietern, um Single Points of Failure zu mindern.",
      "check": "Sind kritische Dienste über redundante WAN-Verbindungen angebunden? Stammen diese Verbindungen von verschiedenen Anbietern? Gibt es einen automatischen Failover-Mechanismus?",
      "detectionLogic": "Diese Regel identifiziert alle Kommunikationsverbindungen, die eine rein netzwerkbasierte Vertrauensgrenze überschreiten (z. B. zwischen On-Premise und Cloud oder zwischen zwei Rechenzentren),",
      "riskAssessment": "Die Wahrscheinlichkeit eines vorübergehenden WAN-Ausfalls wird als ",
      "falsePositives": "Dieses Risiko könnte ein False Positive sein, wenn die Kommunikationsverbindung, obwohl sie ein WAN durchquert, für nicht-kritische Zwecke verwendet wird, die Ausfälle tolerieren können."
    },
    "unavailability-of-premises": {
      "title": "Nichtverfügbarkeit von Räumlichkeiten (BSI INF.5)",
      "description": "Gebäude können unerwartet unbenutzbar werden, zum Beispiel weil sie durch Feuer, Sturm, Überschwemmung, Erdbeben oder eine Explosion teilweise oder vollständig zerstört wurden.",
      "impact": "Wenn ein physischer Standort, der IT-Infrastruktur beherbergt, nicht verfügbar wird, werden alle von dieser Infrastruktur abhängigen geschäftlichen und technischen Prozesse gestört oder vollständig angehalten.",
      "asvs": "BSI IT-Grundschutz INF.5: Gebäude, BSI 200-4: Business Continuity Management",
      "action": "Implementierung von Business Continuity- und Disaster Recovery-Plänen",
      "mitigation": "Um das Risiko der Nichtverfügbarkeit von Räumlichkeiten zu mindern, sollten Organisationen einen robusten Business Continuity Plan (BCP) und Disaster Recovery Plan (DRP) implementieren. Wichtige Maßnahmen umfassen:",
      "check": "Gibt es einen dokumentierten und getesteten Business Continuity Plan? Berücksichtigt er den Totalausfall des primären physischen Standorts? Gibt es redundante Systeme an einem separaten physischen Standort?",
      "detectionLogic": "Dieses Risiko wird automatisch für jede Vertrauensgrenze ausgelöst, die einen physischen On-Premise-Standort darstellt (",
      "riskAssessment": "Die Wahrscheinlichkeit eines katastrophalen Ereignisses wird als ",
      "falsePositives": "Dieses Risiko könnte als False Positive angesehen werden, wenn das Modell eine "
    },
    "dependency-on-external-service-availability": {
      "title": "Abhängigkeit von der Verfügbarkeit externer Dienste (BSI CON.3)",
      "description": "Institutionen sind oft von externen Diensten und Lieferanten abhängig. Ein teilweiser oder vollständiger Ausfall eines solchen Dienstleisters kann schnell zu Unterbrechungen in der Institution führen.",
      "impact": "Wenn ein externer Dienst, von dem ein kritischer Geschäftsprozess abhängt, ausfällt, kann dies zu einer direkten Unterbrechung dieses Prozesses führen. Dies kann dazu führen, dass wichtige Geschäftsfunktionen nicht ausgeführt werden können, was zu finanziellen Verlusten, Reputationsschäden und der Nichteinhaltung von Service-Level-Agreements (SLAs) mit Kunden führt. Die Verfügbarkeit des Systems ist gefährdet.",
      "asvs": "BSI IT-Grundschutz Kompendium: CON.3 Business Continuity Management",
      "action": "Implementierung von Redundanz und Business-Continuity-Planung für externe Abhängigkeiten",
      "mitigation": "Stellen Sie bei kritischen Abhängigkeiten sicher, dass Verträge mit Dienstleistern spezifische SLAs für die Verfügbarkeit enthalten und die Leistung überwacht wird.",
      "check": "Sind kritische externe Dienstabhängigkeiten identifiziert und dokumentiert? Sind Verfügbarkeits-SLAs in Verträgen definiert? Ist das interne System so konzipiert, dass es gegenüber dem Ausfall dieser Abhängigkeit widerstandsfähig ist? Ist dieses Szenario im Business-Continuity-Plan abgedeckt?",
      "detectionLogic": "Diese Regel sucht nach Kommunikationsverbindungen von in-scope technischen Assets mit hohen Verfügbarkeitsanforderungen zu externen Entitäten oder als out-of-scope markierten Assets. Das Risiko ist erhöht, wenn das interne, abhängige Asset für Redundanz konfiguriert ist.",
      "riskAssessment": "Das Schadenausmaß leitet sich direkt aus der Verfügbarkeitsanforderung des internen Assets ab, das vom externen Dienst abhängt. Ein ",
      "falsePositives": "Die Abhängigkeit könnte von einer nicht-kritischen Funktion des externen Dienstes bestehen, die im Modell erfasst ist."
    },
    "harsh-environmental-conditions-for-@SystemType:ICS-components": {
      "title": "Harte Umgebungsbedingungen für physische Komponenten (BSI CON.1.A9)",
      "description": "Komponenten in industriellen, lokalen oder unkontrollierten Umgebungen sind oft widrigen Bedingungen ausgesetzt, die den sicheren Betrieb beeinträchtigen können.",
      "impact": "Die primäre Auswirkung eines Komponentenausfalls aufgrund von Umweltbelastungen ist ein Verlust der Verfügbarkeit (Denial of Service).",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium Baustein CON.1 (Physischer Umgebungsschutz), speziell Anforderung CON.1.A9 (Schutz vor Umweltschäden).",
      "action": "Implementierung von physischen und umweltbezogenen Schutzmaßnahmen",
      "mitigation": "Stellen Sie sicher, dass alle physischen Komponenten (Server, Netzwerkgeräte, @SystemType:ICS/I@SystemType:OT-Hardware) für ihre Betriebsumgebung geeignet sind.",
      "check": "Sind physische Assets in Umgebungen installiert, die sie vor Temperaturextremen, Feuchtigkeit, Staub und Vibrationen schützen?",
      "detectionLogic": "Dieses Risiko wird für technische Assets identifiziert, die explizit als in einer rauen Umgebung befindlich gekennzeichnet sind, über das Tag `@Environment:Harsh`.",
      "riskAssessment": "Die Ausfallwahrscheinlichkeit wird für Assets, die explizit für raue Umgebungen gekennzeichnet sind, als höher angesehen.",
      "falsePositives": "Ein Risiko könnte für ein Asset gemeldet werden, das über angemessene, aber nicht modellierte physische Schutzmaßnahmen verfügt (z. B. ein robustes Servergehäuse oder ein klimatisierter Schrank)."
    },
    "insecure-component-procurement": {
      "title": "Unsichere Komponentenbeschaffung (BSI-basiert)",
      "description": "Aufgrund unzureichender Sicherheitsanforderungen und Kostensenkungsmaßnahmen wird die Informationssicherheit bei der Beschaffung von Komponenten oft vernachlässigt.",
      "impact": "Der Erwerb von Komponenten mit inhärenten Fehlern führt Schwachstellen direkt in die Systemarchitektur ein.",
      "asvs": "V14.2 Lieferkette",
      "action": "Einrichtung und Durchsetzung sicherer Beschaffungsrichtlinien",
      "mitigation": "Definieren und erzwingen Sie eine sichere Beschaffungsrichtlinie, die Sicherheitsbewertungen für alle Drittanbieterkomponenten (Hardware und Software) vor dem Erwerb vorschreibt.",
      "check": "Gibt es eine formelle Sicherheitsrichtlinie für die Beschaffung von Drittanbieter-Assets? Sind Sicherheitsbewertungen Teil des Kaufprozesses?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als eigenentwickelt für n@SystemType:OT (`custom_developed_parts: false`) gekennzeichnet ist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird bei komplexen, sensiblen oder undurchsichtigen Systemen (z. B. Geräte von n@SystemType:OT, ERPs, Mainframes, Sicherheits-Appliances) als höher angesehen.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn eine Organisation einen robusten sicheren Beschaffungsprozess hat, diesen aber im Modell mit dem "
    },
    "insecure-@SystemType:OT-protocol-@SystemType:ICS-t5-21": {
      "title": "Unsichere @SystemType:OT/@SystemType:ICS-Protokollnutzung (BSI @SystemType:ICS.T.5.21)",
      "description": "Komponenten von industriellen Steuerungssystemen (@SystemType:ICS) und Betriebstechnologie (@SystemType:OT) verwenden oft spezialisierte Netzwerkprotokolle, die nicht mit Blick auf die Sicherheit entwickelt wurden.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu einer Kompromittierung der Vertraulichkeit (Mitlesen von Prozessdaten), Integrität (Manipulation von Befehlen oder Daten) und Verfügbarkeit (Störung oder Anhalten von Prozessen) führen.",
      "asvs": "BSI IT-Grundschutz Kompendium: NET.3.2 @SystemType:ICS-Protokolle, @SystemType:ICS.1 Allgemeine @SystemType:ICS-Komponente",
      "action": "Verwendung sicherer Kommunikationsprotokolle und Netzwerksegmentierung",
      "mitigation": "Verwenden Sie nach Möglichkeit Protokolle, die eine Ende-zu-Ende-Verschlüsselung, Integritätsschutz und gegenseitige Authentifizierung bieten (z. B. OPC UA mit einer Sicherheitsrichtlinie, Modbus-Secure).",
      "check": "Verwenden alle Kommunikationsverbindungen zu und von @SystemType:OT/@SystemType:ICS-Komponenten verschlüsselte Protokolle? Wenn nicht, wird der Verkehr über ein VPN getunnelt?",
      "detectionLogic": "Diese Regel wird für jede Kommunikationsverbindung ausgelöst, die ein Asset im @SystemType:OT/@SystemType:ICS-Stil (z. B. Technologie ",
      "riskAssessment": "Das Schadenausmaß wird basierend auf den Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertungen der übertragenen Daten-Assets berechnet.",
      "falsePositives": "Die Regel könnte für Protokolle auslösen, deren Sicherheitsfunktionen auf der Anwendungsebene aktiviert sind, die aber im Modell nicht erfasst werden."
    },
    "insecure-default-configuration-of-@SystemType:ICS-components": {
      "title": "Unsichere Standardkonfiguration von @SystemType:ICS-Komponenten (in Anlehnung an BSI CON.1)",
      "description": "In der Standardkonfiguration von @SystemType:ICS-Komponenten sind Sicherheitsmaßnahmen nicht immer aktiviert. Dies kann es Unbefugten ermöglichen, leicht Zugriff zu erlangen.",
      "impact": "Wenn diese Schwachstelle ausgenutzt wird, könnte ein Angreifer unbefugten Zugriff auf die @SystemType:ICS-Komponente erlangen, was zu Datendiebstahl, Systemmanipulation oder einem vollständigen Denial-of-Service führen kann. Dies kann die Vertraulichkeit, Integrität und Verfügbarkeit des gesteuerten industriellen Prozesses gefährden und potenziell physische Schäden, Produktionsausfälle und Sicherheitsrisiken verursachen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.1 (Allgemeines @SystemType:ICS-System), insbesondere Anforderungen wie CON.1.A10 (Sichere Grundkonfiguration von @SystemType:ICS-Komponenten) und CON.1.A11 (Deaktivierung ungenutzter Schnittstellen und Dienste auf @SystemType:ICS-Komponenten).",
      "action": "Härtung der Konfiguration von @SystemType:ICS-Komponenten",
      "mitigation": "Alle @SystemType:ICS-Komponenten müssen vor dem Einsatz in der Produktion gehärtet werden. Dies umfasst das Ändern aller Standardpasswörter, das Deaktivieren unnötiger Dienste und physischer Schnittstellen (wie USB-Ports), das Aktivieren und korrekte Konfigurieren integrierter Sicherheitsfunktionen und die Sicherstellung, dass verschlüsselte Protokolle (wie SSH) für alle administrativen Zugriffe verwendet werden. Eine standardisierte Härtungs-Checkliste, die spezifisch für den Komponententyp ist, sollte entwickelt und konsequent angewendet werden.",
      "check": "Werden alle @SystemType:ICS-Komponenten vor dem Einsatz gemäß einer Sicherheitshärtungsanleitung konfiguriert? Werden Standardpasswörter geändert? Sind administrative Protokolle verschlüsselt? Sind alle unnötigen Dienste und Schnittstellen deaktiviert?",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die industrielle Steuerungssysteme (@SystemType:ICS) darstellen, die entweder durch das ",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist bei unverschlüsselten oder nicht authentifizierten administrativen Schnittstellen hoch, da diese häufige Ziele sind. Das Schadenausmaß wird durch die Kritikalität (CIA) der @SystemType:ICS-Komponente selbst und der von ihr verarbeiteten oder gespeicherten Daten bestimmt. Eine Kompromittierung einer @SystemType:ICS-Komponente, die einen kritischen Prozess steuert, hat ein sehr hohes Schadenausmaß.",
      "falsePositives": "Das Risiko könnte für ein Protokoll gemeldet werden, das scheinbar unverschlüsselt ist, aber durch einen separaten Mechanismus gesichert wird, der n@SystemType:OT modelliert ist (z. B. ein VPN, das geprüft wird). Eine Verbindung, die "
    },
    "dependency-on-external-systems-@SystemType:OT": {
      "title": "Abhängigkeit von @SystemType:OT-Systemen von externen IT-Infrastrukturen (BSI-@SystemType:OT-Dependence-IT)",
      "description": "Betriebstechnologie (@SystemType:OT) wird zunehmend nicht mehr vollständig autark betrieben. Wenn Abhängigkeiten von anderen Systemen, Netzwerken oder Diensten bestehen, können Ausfälle oder Sicherheitsvorfälle im IT-Netzwerk direkte Auswirkungen auf die @SystemType:OT-Umgebung haben. Insbesondere wenn diese abhängigen Systeme und Netzwerke nicht direkt vom @SystemType:OT-Betreiber kontrolliert werden, kann die Verfügbarkeit von @SystemType:OT-Systemen und den damit verbundenen Prozessen stark beeinträchtigt werden. Darüber hinaus erfordert die Behebung solcher Vorfälle oft externe Unterstützung, was zu Verzögerungen führt.",
      "impact": "Ein Ausfall oder Sicherheitsvorfall in einem abhängigen IT-System (z. B. gemeinsam genutzte Infrastruktur, Cloud-Dienst, Fernzugriffsverbindung) kann @SystemType:OT-Prozesse direkt stören oder anhalten, was zu Produktionsausfällen, Sicherheitsrisiken und finanziellen Verlusten führt. Die Reaktion auf Vorfälle kann sich verzögern, da sie oft von externen Parteien abhängt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz, insbesondere Konzepte in OPS.1.2 (Netzwerk und Verbindungen) und NET.1.1 (Netzwerkarchitektur), angewendet auf einen @SystemType:OT-Kontext. Die Risikobeschreibung basiert auf Beobachtungen des BSI.",
      "action": "Reduzierung und Härtung der Abhängigkeiten von @SystemType:OT-Systemen",
      "mitigation": "Minimieren Sie die Abhängigkeiten von @SystemType:OT-Systemen von externen oder gemeinsam genutzten IT-Diensten, wo immer möglich. Stellen Sie bei unvermeidbaren Abhängigkeiten sicher, dass der Ziel-IT-Dienst auf hohe Verfügbarkeit und Redundanz ausgelegt ist (z. B. geclusterte Dienste, redundante Netzwerkverbindungen). Implementieren Sie strenge Zugriffskontrollen und Überwachung an der IT/@SystemType:OT-Grenze mittels Firewalls oder Datendioden. Verwenden Sie dedizierte, gehärtete Infrastruktur für Dienste, die für @SystemType:OT kritisch sind. Etablieren Sie klare Service Level Agreements (SLAs) und gemeinsame Verfahren zur Reaktion auf Vorfälle mit externen Dienstleistern.",
      "check": "Sind alle Kommunikationsverbindungen von @SystemType:OT-Assets zu Nicht-@SystemType:OT-Assets identifiziert und gerechtfertigt? Sind die Ziel-IT-Systeme auf hohe Verfügbarkeit ausgelegt und betrieben? Gibt es Notfallpläne für den Fall, dass ein abhängiger IT-Dienst ausfällt? Sind SLAs für extern verwaltete Dienste vorhanden?",
      "detectionLogic": "Diese Regel löst Risiken in zwei Szenarien aus: 1. Wenn ein technisches Asset mit dem Tag `@SystemType:OT-Asset` eine Kommunikationsverbindung zu einem Asset hat, das nicht Teil der @SystemType:OT-Umgebung ist (d. h. nicht mit `@SystemType:OT-Asset` getaggt ist). 2. Wenn ein `@SystemType:OT-Asset` auf einer Shared Runtime läuft, die auch Nicht-@SystemType:OT-Assets beherbergt, was eine Abhängigkeit über eine gemeinsame Ausführungsumgebung schafft.",
      "riskAssessment": "Das Schadenausmaß wird durch die Verfügbarkeitsanforderung des @SystemType:OT-Assets bestimmt. Eine Abhängigkeit für ein ",
      "falsePositives": "Das Risiko könnte überbewertet sein, wenn der Ziel-IT-Dienst implizit hochverfügbar ist (z. B. ein großer öffentlicher Cloud-Anbieter)."
    },
    "it-@SystemType:OT-security-policy-conflict": {
      "title": "Konflikt zwischen IT- und @SystemType:OT-Sicherheitsrichtlinien (basierend auf BSI @SystemType:ICS-Empfehlungen)",
      "description": "Unterschiedliche Rahmenwerke, Kenntnisse und Verfahren in der Büro-IT und der Betriebstechnologie (@SystemType:OT) können zu Implementierungsproblemen für übergreifende Sicherheitsanforderungen führen. Sicherheitsvorgaben aus der Büro-IT-Umgebung sind in @SystemType:ICS-Systemen aufgrund technischer oder verfahrenstechnischer Besonderheiten möglicherweise nicht umsetzbar. Umgekehrt sind @SystemType:OT-spezifische Aspekte der Informationssicherheit und der funktionalen Sicherheit den Sicherheitsbeauftragten der Büro-IT möglicherweise nicht bekannt. Dies kann zu Reibungen in der Kommunikation und Implementierung führen, und Risiken könnten nicht identifiziert oder angemessen adressiert werden.",
      "impact": "Eine fehlende Harmonisierung der IT- und @SystemType:OT-Sicherheitsrichtlinien kann zu unsachgemäß konfigurierten Sicherheitskontrollen führen und Schwachstellen schaffen. Dies kann die Integrität und Verfügbarkeit kritischer @SystemType:OT/@SystemType:ICS-Systeme gefährden und potenziell zu Produktionsausfällen, physischen Schäden oder Sicherheitsvorfällen führen. Es öffnet auch Wege für Angreifer, von weniger sicheren IT-Umgebungen in das hochsensible @SystemType:OT-Netzwerk zu wechseln.",
      "asvs": "BSI IT-Grundschutz IND.2.2 Netzwerkarchitektur für @SystemType:ICS",
      "action": "Harmonisierung von IT- und @SystemType:OT-Sicherheitsrichtlinien und -kontrollen",
      "mitigation": "Etablieren Sie ein gemeinsames IT/@SystemType:OT-Sicherheits-Governance-Team. Führen Sie eine einheitliche Risikobewertung durch, die die spezifischen Einschränkungen und Sicherheitsanforderungen der @SystemType:OT-Umgebung berücksichtigt. Passen Sie generische IT-Sicherheitsrichtlinien an, damit sie für @SystemType:ICS-Komponenten anwendbar und wirksam sind. Verwenden Sie Sicherheitsgateways, DMZs oder Datendioden, um streng kontrollierte Kommunikationskanäle zwischen IT- und @SystemType:OT-Netzwerken zu schaffen. Sorgen Sie für funktionsübergreifende Schulungen und Sensibilisierung für IT- und @SystemType:OT-Personal.",
      "check": "Gibt es eine dedizierte, dokumentierte Sicherheitsarchitektur für die IT/@SystemType:OT-Integration? Sind Sicherheitskontrollen auf Kommunikationsverbindungen zwischen IT und @SystemType:OT (z. B. Firewalls, Proxies) mit @SystemType:OT-spezifischen Regelsätzen konfiguriert? Führen IT- und @SystemType:OT-Teams eine gemeinsame Änderungsmanagement- und Incident-Response-Planung durch?",
      "detectionLogic": "Erkennt Kommunikationsverbindungen zwischen technischen Assets, die als Teil der IT-Domäne gekennzeichnet sind (z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn die Verbindung zwischen IT und @SystemType:OT direkt ist und keine spezifischen Sicherheitskontrollen aufweist. Das Schadenausmaß wird durch die Kritikalität des verbundenen @SystemType:OT-Assets bestimmt. Eine Verbindung zu einem unternehmenskritischen @SystemType:OT-Asset führt zu einem sehr hohen Schadenausmaß, da eine Kompromittierung physische Prozesse beeinträchtigen könnte.",
      "falsePositives": "Ein Modell könnte ein False Positive generieren, wenn eine spezialisierte Sicherheits-Appliance (wie eine Datendiode oder eine @SystemType:OT-fähige Firewall), die das Risiko mindert, einfach als generisches Asset modelliert ist oder wenn ihre spezifischen Filterfähigkeiten nicht im Modell erfasst sind."
    },
    "inadequate-@SystemType:OT-change-management": {
      "title": "Ungenügendes Änderungsmanagement in @SystemType:OT-Umgebungen",
      "description": "Obwohl Betriebstechnologie (@SystemType:OT) und IT konvergieren, gibt es einzigartige Merkmale von @SystemType:ICS, die die Übertragung etablierter IT-Betriebsprozesse erschweren.",
      "impact": "Störungen in @SystemType:OT-Systemen, die physische Prozesse überwachen und steuern, können zu Produktionsausfällen, physischen Schäden an Geräten, Personenschäden und Umweltschäden führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz, insbesondere der Überlagerung für industrielle Steuerungssysteme (@SystemType:ICS). Während es sich auf allgemeine Prozesse wie OPS.1.1.5 (Patch- und Änderungsmanagement) bezieht, hebt dieses Risiko die spezifischen Herausforderungen in @SystemType:OT-Umgebungen hervor, die Standard-IT-Prozesse nicht bewältigen.",
      "action": "Etablierung und Durchsetzung von @SystemType:OT-spezifischen Änderungs- und Vorfallmanagementverfahren",
      "mitigation": "Entwickeln, dokumentieren und erzwingen Sie Änderungsmanagementprozesse, die speziell auf @SystemType:OT/@SystemType:ICS-Assets zugeschnitten sind. Diese Prozesse müssen Sicherheits-, Ingenieur- und regulatorische Aspekte integrieren.",
      "check": "Gibt es dokumentierte Änderungs- und Vorfallmanagementprozesse speziell für @SystemType:OT/@SystemType:ICS-Assets? Berücksichtigen diese Prozesse Sicherheits-, regulatorische und Anbieter-Support-Einschränkungen? Werden Änderungen protokolliert und von relevanten Stakeholdern (z. B. Ingenieur-, Sicherheitsteams) genehmigt?",
      "detectionLogic": "Dies ist ein prozessuales Risiko, das @SystemType:OT/@SystemType:ICS-Assets innewohnt. Die Regel wird für jedes technische Asset ausgelöst, das explizit als ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn kein @SystemType:OT-spezifischer Änderungsmanagementprozess existiert. Das Schadenausmaß korreliert direkt mit den Verfügbarkeits- und Integritätsanforderungen des @SystemType:OT-Assets,",
      "falsePositives": "Dieses Risiko wird ausgelöst, um eine Überprüfung der Betriebsprozesse sicherzustellen. Ein False Positive kann geltend gemacht werden, wenn die Organisation ein ausgereiftes, dokumentiertes und durchgesetztes Änderungsmanagementprogramm hat, das speziell für ihre @SystemType:OT-Umgebung entwickelt wurde."
    },
    "insufficient-access-protection-for-ot-systems": {
      "title": "Ungenügender Zugriffsschutz für OT/ICS (BSI-Stil)",
      "description": "Industrielle Steuerungssysteme (ICS/OT) sind zunehmend mit anderen Netzwerken verbunden, wie z. B. der Unternehmens-Büro-IT, Partnern und Dienstleistern, für Datenaustausch, Überwachung und Fernwartung.",
      "impact": "Eine Kompromittierung von OT-Systemen kann zur Manipulation physischer Prozesse, zu Produktionsstillständen, Geräteschäden und Sicherheitsrisiken führen. Dies beeinträchtigt die Verfügbarkeit und Integrität der industriellen Prozesse erheblich.",
      "asvs": "BSI IT-Grundschutz: SYS.2.4 Industrielle Steuerungssystem- (ICS) Komponenten, NET.1.1 Netzwerkarchitektur",
      "action": "Implementierung strenger Netzwerksegmentierung und Zugriffskontrolle für OT-Umgebungen",
      "mitigation": "Segmentieren Sie das OT-Netzwerk strikt vom Büro-IT-Netzwerk, typischerweise unter Verwendung einer Demilitarisierten Zone (DMZ) und Firewalls.",
      "check": "Gibt es eine Firewall oder DMZ zwischen dem IT- und dem OT-Netzwerk? Sind alle IT-zu-OT-Kommunikationsverbindungen explizit auf einer Whitelist, authentifiziert und verschlüsselt?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen, die von einem Nicht-OT-Asset ausgehen und bei einem OT-Asset enden (identifiziert durch das ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein ungesicherter Kommunikationskanal von der IT zur OT existiert, da die IT-Umgebung eine häufige Quelle für Malware ist.",
      "falsePositives": "Das Risiko könnte ein False Positive sein, wenn die verbindende "
    },
    "insecure-software-development-and-modification": {
      "title": "Schwachstellen durch unsichere Softwareentwicklung und -modifikation (BSI-basiert)",
      "description": "Anpassungen und Weiterentwicklungen von IT-Systemen und Anwendungen können kritische Risiken mit sich bringen.",
      "impact": "Wenn Schwachstellen in eigenentwickelte Komponenten eingeführt werden, kann dies zu einer Kompromittierung ihrer Vertraulichkeit, Integrität und Verfügbarkeit führen,",
      "asvs": "V1 Architektur-, Design- und Bedrohungsmodellierungsanforderungen, V14 Konfiguration",
      "action": "Implementierung und Durchsetzung eines sicheren Softwareentwicklungslebenszyklus (SDLC)",
      "mitigation": "Etablieren Sie ein umfassendes Secure-SDLC-Programm, das Bedrohungsmodellierung, sichere Codierungsstandards, obligatorische Code-Reviews (manuell und automatisiert) umfasst,",
      "check": "Ist ein formeller Secure-SDLC-Prozess definiert und wird er befolgt? Sind Entwicklungsumgebungen gesichert und überwacht?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets identifiziert, die als `custom_developed_parts` gekennzeichnet sind.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein technisches Asset könnte gekennzeichnet werden, weil es benutzerdefinierten Code enthält, auch wenn die Organisation einem sehr ausgereiften und sicheren SDLC folgt."
    },
    "insecure-remote-access-to-@SystemType:OT": {
      "title": "Unsicherer Fernzugriff auf @SystemType:OT/@SystemType:ICS-Komponenten (BSI INF.11)",
      "description": "In einigen Fällen werden industrielle Steuerungssysteme über Netzwerkzugriff administriert.",
      "impact": "Wenn der Fernzugriff auf @SystemType:OT/@SystemType:ICS-Komponenten nicht ausreichend gesichert ist, könnten Angreifer unbefugte Kontrolle erlangen, was zur Manipulation industrieller Prozesse führen kann,",
      "asvs": "BSI IT-Grundschutz Kompendium 2023: INF.11 Zugriff auf @SystemType:OT-Komponenten über Netze",
      "action": "Sicherung des administrativen Fernzugriffs auf @SystemType:OT/@SystemType:ICS",
      "mitigation": "Alle Fernzugriffe auf @SystemType:OT-Komponenten müssen über ein gesichertes, überwachtes Gateway (z. B. einen Bastion Host oder Jump Server) geleitet werden.",
      "check": "Sind alle administrativen Fernverbindungen zu @SystemType:OT-Systemen per VPN oder zumindest über ein stark authentifiziertes, verschlüsseltes Protokoll verschlüsselt? Wird eine Multi-Faktor-Authentifizierung erzwungen?",
      "detectionLogic": "Dieses Risiko wird für @SystemType:OT/@SystemType:ICS-Komponenten ausgelöst (modelliert als ",
      "riskAssessment": "Das Schadenausmaß wird durch die Verfügbarkeits- und Integritätsbewertung der @SystemType:OT-Komponente bestimmt, da eine Kompromittierung zu einer Störung physischer Prozesse führen kann.",
      "falsePositives": "Ein Risiko könnte gemeldet werden, wenn eine zwischengeschaltete Sicherheitskomponente (wie ein Cloud-Anbieter"
    },
    "inadequate-monitoring-of-@SystemType:ICS-it-infrastructure": {
      "title": "Ungenügende Überwachung der unterstützenden IT-Infrastruktur für industrielle Steuerungssysteme (@SystemType:ICS)",
      "description": "Eine Schlüsselfunktion von industriellen Steuerungssystemen ist die Überwachung des automatisierten Prozesses selbst (z. B. Füllstände, Temperaturen, Ventilpositionen).",
      "impact": "Die Nichtüberwachung der unterstützenden IT-Infrastruktur kann zu einer verzögerten Erkennung und Reaktion auf Sicherheitsvorfälle, Komponentenausfälle oder Leistungsabfälle führen.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.A6 ",
      "action": "Implementierung umfassender Überwachung und Protokollierung für die unterstützende @SystemType:ICS-Infrastruktur",
      "mitigation": "Implementieren Sie eine dedizierte Überwachungslösung, die alle kritischen IT-Komponenten abdeckt, die den industriellen Prozess unterstützen (z. B. Server, Datenbanken, Netzwerkgeräte, Anwendungen).",
      "check": "Sind alle IT-Assets, die die @SystemType:ICS-Umgebung unterstützen, an ein Überwachungssystem angeschlossen? Werden sicherheitsrelevante Ereignisse aktiv protokolliert und analysiert? Gibt es einen automatisierten Alarmmechanismus für kritische Ereignisse? Gibt es einen definierten und getesteten Prozess zur Reaktion auf Vorfälle, der mit diesen Alarmen verknüpft ist?",
      "detectionLogic": "Diese Regel prüft auf technische Assets, die als Teil eines industriellen Steuerungssystems identifiziert wurden (z. B. Assets vom Typ ",
      "riskAssessment": "Das Schadenausmaß leitet sich aus den Verfügbarkeits- und Integritätsanforderungen der nicht überwachten @SystemType:ICS-Komponente ab. Ein Mangel an Überwachung bei einer ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Überwachung durch ein externes System oder eine Plattformfunktion @SystemType:OT als dediziertes "
    },
    "unplanned-changes-in-@Environment:OT": {
      "title": "Ungeplante oder ungetestete Änderungen in @SystemType:OT-Umgebungen (BSI @SystemType:OT.1.A4)",
      "description": "Industrielle Steuerungssysteme (@SystemType:OT/@SystemType:ICS) haben oft sehr hohe Verfügbarkeitsanforderungen, da Störungen oder technische Ausfälle zu schweren Schäden und hohen Folgekosten führen können.",
      "impact": "Die unsachgemäße Prüfung und Verwaltung von Änderungen kann zu schweren Störungen, Systemausfällen, physischen Schäden und hohen Folgekosten führen, was sich hauptsächlich auf die Verfügbarkeit und Integrität des @SystemType:OT-Systems und der von ihm gesteuerten physischen Prozesse auswirkt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium, Baustein @SystemType:OT.1: Allgemeine @SystemType:OT-Komponenten, Anforderung @SystemType:OT.1.A4: Änderungs- und Patch-Management.",
      "action": "Implementierung eines formellen Änderungs- und Testmanagementprozesses für @SystemType:OT-Systeme",
      "mitigation": "Etablieren Sie einen strengen Änderungsmanagementprozess, der Planung, Risikobewertung, Koordination mit allen Stakeholdern und gründliche Tests in einer repräsentativen, nicht-produktiven Umgebung vor der Bereitstellung umfasst. Alle Änderungen, einschließlich Hersteller-Updates und Parameteranpassungen, müssen diesem Prozess folgen. Pflegen Sie Rollback-Pläne und stellen Sie sicher, dass Änderungen von autorisiertem und geschultem Personal durchgeführt werden.",
      "check": "Gibt es eine dokumentierte Änderungsmanagementrichtlinie für @SystemType:OT-Systeme? Werden alle Änderungen, einschließlich Patches und Konfigurationsanpassungen, vor der Bereitstellung in einer separaten, repräsentativen Umgebung getestet? Werden Änderungsaufzeichnungen, Testergebnisse und Rollback-Verfahren gepflegt?",
      "detectionLogic": "Dieses Risiko gilt für technische Assets, die als Teil einer Betriebstechnologie- (@SystemType:OT) Umgebung identifiziert wurden, insbesondere solche mit hohen Verfügbarkeits- oder Integritätsanforderungen. Die Regel identifiziert diese Assets über ein spezifisches Tag (`@SystemType:@SystemType:OT`). Das Risiko wird ausgelöst, da solche Umgebungen sehr empfindlich auf ungetestete Änderungen reagieren, was eine häufige verfahrenstechnische Schwäche ist, wenn nicht explizit entgegengewirkt wird.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn die Organisation einen robusten, streng durchgesetzten und auditierten Änderungs- und Testmanagementprozess speziell für ihre @SystemType:OT-Umgebung nachweisen kann."
    },
    "unsupported-components-in-@Environment:OT": {
      "title": "Nicht unterstützte Komponenten in der @SystemType:OT-Umgebung (BSI-basiert)",
      "description": "In Umgebungen der Betriebstechnologie (@SystemType:OT) werden oft Komponenten aus der Standard-Büro-IT verwendet.",
      "impact": "Die erfolgreiche Ausnutzung von Schwachstellen in nicht unterstützten Komponenten kann zu einem unbefugten Eindringen in kritische @SystemType:OT-Systeme führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, SYS.1.2 Server unter Windows, Anforderung SYS.1.2.A16 ",
      "action": "Implementierung des Lebenszyklusmanagements von Komponenten und Austausch/Isolierung nicht unterstützter Assets",
      "mitigation": "Führen Sie ein vollständiges Inventar aller Hardware- und Softwarekomponenten und verfolgen Sie deren Support-Lebenszyklusstatus.",
      "check": "Gibt es ein vollständiges und aktuelles Inventar aller Hardware- und Softwarekomponenten?",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das als `@Maintenance:Unmaintained` UND als Teil einer @SystemType:OT-Umgebung über das Tag `@SystemType:OT` identifiziert ist. Der @SystemType:OT-Domänenkontext kann direkt auf das Asset oder auf eine Vertrauensgrenze, die das Asset enthält, angewendet werden.",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung wird als hoch angesehen, da Schwachstellen in nicht unterstützten Produkten oft öffentlich bekannt sind und Exploit-Tools leicht verfügbar sind.",
      "falsePositives": "Ein False Positive kann auftreten, wenn eine nicht unterstützte Komponente vollständig luftisoliert ist und keine digitalen oder physischen Datenübertragungsschnittstellen hat, was im Modell möglicherweise nicht vollständig dargestellt ist. Eine solche Isolierung ist jedoch selten und schwer aufrechtzuerhalten, daher sollte das Risiko sorgfältig bewertet werden, bevor es abgewiesen wird."
    },
    "insecure-default-configuration-app4.4.a1": {
      "title": "Unsichere Standardkonfiguration von Komponenten (BSI APP.4.4.A1)",
      "description": "Die Standardkonfiguration von Komponenten ist oft auf korrekte Funktionalität und einfache Inbetriebnahme ausgelegt. Sicherheitsmechanismen spielen oft eine untergeordnete Rolle.",
      "impact": "Wenn ein Angreifer eine unsichere Standardkonfiguration erfolgreich ausnutzt, könnte er die Kontrolle über die Komponente erlangen. Dies kann zum Abfluss von unternehmenskritischen Informationen (Verlust der Vertraulichkeit),",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Kompendium 2023, Baustein APP.4.4",
      "action": "Implementierung und Durchsetzung sicherer Basiskonfigurationen (Härtung)",
      "mitigation": "Etablieren und erzwingen Sie dokumentierte Härtungsrichtlinien für alle Arten von Komponenten, bevor sie in die Produktion genommen werden. Dieser Prozess sollte umfassen:",
      "check": "Gibt es einen dokumentierten Härtungsprozess für Komponenten dieses Typs? Werden Standardanmeldeinformationen nachweislich geändert? Sind alle laufenden Dienste, Protokolle und offenen Ports notwendig und dokumentiert? Gibt es einen Prozess zur regelmäßigen Überprüfung der Konfiguration anhand der Basislinie?",
      "detectionLogic": "Dieses Risiko gilt für alle technischen Assets, die einfache Clients, eingebettete Komponenten (wie Bibliotheken) oder DevOps-spezifische Infrastruktur (die ihre eigenen Konfigurationsrisiken haben) sind und sich im Geltungsbereich befinden.",
      "riskAssessment": "Die Wahrscheinlichkeit dieses Risikos wird standardmäßig als hoch angesehen, da unsichere Konfigurationen ein sehr häufiger Angriffsvektor sind. Die Wahrscheinlichkeit steigt, wenn das Asset dem Internet ausgesetzt ist oder unauthentifizierte Kommunikationsverbindungen hat.",
      "falsePositives": "Dieses Risiko kann als False Positive angesehen werden, wenn die Organisation einen robusten, ausgereiften und konsequent angewendeten Härtungsprozess für alle Assets hat, auch wenn dies explizit im Modell markiert ist. Das Tag dient dazu, dies innerhalb des Bedrohungsmodells explizit zu bestätigen."
    },
    "inadequate-user-and-authorization-management": {
      "title": "Ungenügendes Benutzer- und Berechtigungsmanagement auf Komponenten (BSI-@SystemType:ICS-SEC-1)",
      "description": "Einige Komponenten, insbesondere solche mit eigenem Benutzer- und Berechtigungsmanagement, sind anfällig für betriebliche Schwächen.",
      "impact": "Wenn Unbefugte Zugriff auf Komponenten erhalten, kann dies zu einer schweren Kompromittierung von Vertraulichkeit, Integrität und Verfügbarkeit führen.",
      "asvs": "V4 Zugriffskontrolle",
      "action": "Implementierung und Durchsetzung eines strengen Benutzer- und Berechtigungsmanagements",
      "mitigation": "Stellen Sie sicher, dass jeder Benutzer ein einzigartiges, individuelles Konto hat; verbieten und verhindern Sie technisch die Verwendung von geteilten Konten.",
      "check": "Gibt es einen dokumentierten Prozess für das Benutzer-Lebenszyklusmanagement? Sind geteilte Konten verboten? Werden Zugriffsrechte regelmäßig auditiert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die wahrscheinlich ein eigenes Benutzermanagement haben, insbesondere wenn es sich um einfache Clients handelt.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn eine Komponente mit eigenem Benutzermanagement nicht in einen zentralen Identitätsprovider integriert ist und/oder auf Protokolle mit schwacher oder keiner Authentifizierung angewiesen ist.",
      "falsePositives": "Eine Komponente könnte ein robustes, gut gepflegtes lokales Benutzermanagementsystem haben, auch wenn das Modell dies nicht explizit angibt."
    },
    "inadequate-security-logging-on-@SystemType:ICS-components": {
      "title": "Ungenügende Sicherheitsprotokollierung auf @SystemType:ICS-Komponenten",
      "description": "Auf Komponenten von industriellen Steuerungssystemen (@SystemType:ICS) ist die Protokollierung oft auf prozessrelevante Ereignisse beschränkt, während für die Informationssicherheit entscheidende Daten nicht aufgezeichnet werden. Dieser Mangel erschwert die rechtzeitige Erkennung von Sicherheitsvorfällen und macht eine spätere Rekonstruktion für forensische Analysen oft unmöglich.",
      "impact": "Das Fehlen sicherheitsrelevanter Protokolle verhindert oder verzögert die Erkennung von Angriffen und Sicherheitsverletzungen erheblich. Nach einem Vorfall behindert der Datenmangel die Ursachenanalyse, was es unmöglich macht, den Angriffspfad zu verstehen, den vollen Umfang des Schadens zu bewerten oder wirksame Gegenmaßnahmen zur Verhinderung einer Wiederholung zu ergreifen. Dies kann dazu führen, dass längere Systemkompromittierungen, Datenmanipulationen oder Störungen physischer Prozesse unbemerkt bleiben.",
      "asvs": "BSI IT-Grundschutz KOMPENDIUM, Modul OPS.1.2.5: Protokollierung",
      "action": "Implementierung und Verbesserung der sicherheitsrelevanten Protokollierung auf @SystemType:ICS-Komponenten",
      "mitigation": "Stellen Sie sicher, dass @SystemType:ICS-Komponenten zusätzlich zu den prozessrelevanten auch sicherheitsrelevante Ereignisse protokollieren. Dazu gehören fehlgeschlagene Anmeldeversuche, Konfigurationsänderungen, administrative Aktionen, Anomalien bei Netzwerkverbindungen und Fehler. Die Protokolle sollten an ein zentrales, gesichertes Protokollmanagementsystem (wie ein SIEM) zur Korrelation, Analyse und Alarmierung gesendet werden. Die Protokollierungskonfiguration muss vor Manipulation geschützt sein. Zeitstempel sollten über alle Komponenten hinweg synchronisiert werden.",
      "check": "Werden Sicherheitsereignisse (z. B. Anmeldungen, Konfigurationsänderungen, Fehler) auf @SystemType:ICS-Komponenten protokolliert? Werden diese Protokolle zentral und geschützt gesammelt? Gibt es einen Prozess zur Überprüfung dieser Protokolle auf Anomalien?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die als @SystemType:ICS-Komponenten identifiziert wurden (entweder über das `@SystemType:ICS`-Tag oder die `IoTDevice`-Technologie) und denen explizite Indikatoren für eine ausreichende Sicherheitsprotokollierung fehlen (d. h. sie sind nicht mit `@SecurityLogging` oder `@SIEM-Connected` gekennzeichnet).",
      "riskAssessment": "Die Wahrscheinlichkeit wird für jede @SystemType:ICS-Komponente standardmäßig als hoch angesehen, da die Sicherheitsprotokollierung für viele dieser Systeme kein primäres Designmerkmal ist. Das Schadenausmaß steht in direktem Zusammenhang mit der Kritikalität der @SystemType:ICS-Komponente und dem von ihr gesteuerten physischen Prozess, mit einem Fokus auf Integrität und Verfügbarkeit. Eine Kompromittierung eines unternehmenskritischen Prozesscontrollers hat ein sehr hohes Schadenausmaß.",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn die @SystemType:ICS-Komponente über robuste, sicherheitsorientierte Protokollierungsfunktionen verfügt, die nicht im Modell widergespiegelt sind (z. B. das `@SecurityLogging`-Tag fehlt), oder wenn die Protokollierung von einem dedizierten, verbundenen Überwachungsgerät gehandhabt wird, das Teil des Modells ist und die @SystemType:ICS-Komponente schützt."
    },
    "@SystemType:ICS-manipulation-of-components-and-information": {
      "title": "Manipulation von @SystemType:ICS-Komponenten und Informationen (BSI CON.6)",
      "description": "Die vielfältigen Schnittstellen von Komponenten industrieller Steuerungssysteme (@SystemType:ICS) führen zu einem erhöhten Manipulationsrisiko für die IT-Systeme, Software und die von ihnen übertragenen Informationen. Abhängig von der Motivation und den Fähigkeiten der Angreifer kann dies lokale oder sogar standortübergreifende Auswirkungen haben. Des Weiteren können Status- und Alarmmeldungen oder andere Messwerte unterdrückt oder verändert werden.",
      "impact": "Manipulierte Messwerte können zu falschen Entscheidungen von @SystemType:ICS-Komponenten oder dem Bedienpersonal führen. Manipulierte Systeme können genutzt werden, um andere Systeme oder Standorte anzugreifen oder eine laufende Manipulation zu verschleiern. Dies bedroht direkt die Integrität und Verfügbarkeit des Produktionsprozesses und kann potenziell zu physischen Schäden, Produktionsausfällen und Sicherheitsrisiken führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.6 (Manipulation von Informationen) und stimmt mit industriellen Sicherheitsstandards wie IEC 62443 überein.",
      "action": "Sicherung von @SystemType:ICS-Schnittstellen und Validierung von Steuerdaten",
      "mitigation": "Alle Schnittstellen zu @SystemType:ICS-Komponenten müssen durch starke Authentifizierungs- und Autorisierungsmechanismen gesichert werden. Die Kommunikation über Netzwerkgrenzen hinweg sollte verschlüsselt sein. Alle eingehenden Daten, insbesondere Steuerbefehle, Messungen und Alarme (oft als @ICSControlData gekennzeichnet), müssen vor der Verarbeitung auf Integrität und Plausibilität geprüft werden. Implementieren Sie eine strikte Netzwerksegmentierung, um kritische Steuerungsnetzwerke (@SystemType:OT) von Unternehmensnetzwerken (IT) und dem Internet zu isolieren. Aktualisieren und patchen Sie @SystemType:ICS-Software und -Firmware regelmäßig, wo dies möglich ist.",
      "check": "Sind alle Kommunikationsverbindungen zu @SystemType:ICS-Komponenten authentifiziert und autorisiert? Werden Daten bei der Übertragung über Vertrauensgrenzen hinweg verschlüsselt? Werden kritische Steuerdaten-Assets vor der Verwendung validiert? Ist das @SystemType:ICS-Netzwerk ordnungsgemäß segmentiert?",
      "detectionLogic": "Diese Regel wird für technische Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn Schnittstellen ungeschützt sind, insbesondere wenn sie weniger vertrauenswürdigen Netzwerken ausgesetzt sind. Das Schadenausmaß steht in direktem Zusammenhang mit der Integritäts- und Verfügbarkeitsbewertung der @SystemType:ICS-Komponente und der von ihr verarbeiteten Daten. Die Manipulation einer ",
      "falsePositives": "Ein Risiko könnte ein False Positive sein, wenn kompensierende Kontrollen existieren, die nicht @SystemType:OT modelliert sind, wie z. B. ein physisches Überwachungssystem außerhalb des Bandes, das unplausible Werte oder Aktionen erkennen würde, oder wenn die Schnittstelle nur in einem physisch gesicherten und stark eingeschränkten Wartungsmodus zugänglich ist."
    },
    "insecure-@SystemType:ICS-@SystemType:OT-protocols": {
      "title": "Unsichere @SystemType:ICS/@SystemType:OT-Protokolle (BSI-basiert)",
      "description": "Protokolle, die in Umgebungen von industriellen Steuerungssystemen (@SystemType:ICS) und Betriebstechnologie (@SystemType:OT) verwendet werden, weisen oft keine angemessenen Sicherheitsmechanismen auf.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu einem Verlust der Vertraulichkeit (z. B. von Prozessparametern), der Integrität (z. B. Manipulation von Steuerbefehlen),",
      "asvs": "Abgeleitet von BSI-Empfehlungen für die @SystemType:ICS/@SystemType:OT-Sicherheit. Siehe BSI CS 132",
      "action": "Verwendung sicherer Kommunikationsprotokolle und Netzwerksegmentierung",
      "mitigation": "Verwenden Sie nach Möglichkeit Protokolle, die eine Ende-zu-Ende-Verschlüsselung, starke Authentifizierung und Nachrichtenintegritätsprüfungen bieten.",
      "check": "Überprüfen Sie die Protokolle, die für die Kommunikation mit und zwischen @SystemType:ICS/@SystemType:OT-Komponenten verwendet werden. Sind sie verschlüsselt? Gibt es eine gegenseitige Authentifizierung? Wird die Nachrichtenintegrität überprüft?",
      "detectionLogic": "Diese Regel prüft auf Kommunikationsverbindungen, die industrielle Steuerungssysteme (@SystemType:ICS) oder Betriebstechnologie- (@SystemType:OT) Geräte betreffen, die unsichere Protokolle verwenden.",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung wird als hoch angesehen, wenn ein unsicheres Protokoll ohne kompensierende Kontrollen verwendet wird, da die Schwachstelle für jeden im Netzwerksegment leicht zugänglich ist.",
      "falsePositives": "Ein Risiko könnte gemeldet werden, auch wenn das Netzwerk physisch isoliert und als sicher gilt."
    },
    "dos-against-@SystemType:ICS-components": {
      "title": "Denial-of-Service gegen @SystemType:ICS-Komponenten (BSI @SystemType:ICS-K.3)",
      "description": "Angreifer können den Betrieb von Komponenten industrieller Steuerungssysteme (@SystemType:ICS) durch Denial-of-Service (DoS)-Angriffe beeinträchtigen.",
      "impact": "Ein erfolgreicher DoS-Angriff auf eine @SystemType:ICS-Komponente kann diese unzugänglich machen, was kritische industrielle Prozesse stört oder zum Erliegen bringt. Dies beeinträchtigt direkt die Verfügbarkeit und kann sekundäre Auswirkungen auf die Integrität (z. B. beschädigte Produktionschargen) und sogar die Sicherheit haben.",
      "asvs": "BSI IT-Grundschutz @SystemType:ICS-K.3 Denial-of-Service",
      "action": "Implementierung von Netzwerksegmentierung und DoS-Resilienzmaßnahmen",
      "mitigation": "Schützen Sie @SystemType:ICS-Komponenten, indem Sie sie in einer segmentierten, kontrollierten Netzwerkzone platzieren, getrennt von der allgemeinen Unternehmens-IT und dem Internet. Verwenden Sie Firewalls und Intrusion-Detection/Prevention-Systeme (IDS/IPS), um den Datenverkehr zur @SystemType:ICS-Zone streng zu kontrollieren. Stellen Sie sicher, dass die Komponenten auf Ausfallsicherheit ausgelegt sind und über ausreichende Ressourcen verfügen, um die erwarteten Netzwerklasten zu bewältigen. Erwägen Sie die Verwendung von Protokollen und Geräten mit integrierten DoS-Schutzmechanismen. Haben Sie einen dokumentierten Plan zur Reaktion auf DoS-Ereignisse.",
      "check": "Sind @SystemType:ICS-Komponenten in einem dedizierten Netzwerksegment isoliert? Gibt es Firewalls oder andere Sicherheitsgateways, die das @SystemType:ICS-Netzwerk schützen? Wurden die Komponenten auf ihre Widerstandsfähigkeit gegenüber anormalen Verkehrsmustern geprüft?",
      "detectionLogic": "Diese Regel wird für technische Assets ausgelöst, die als @SystemType:ICS-Komponenten identifiziert wurden (entweder durch den Technologietyp `i@SystemType:OT-device` oder ein `@SystemType:ICS`-Tag) und eine hohe oder unternehmenskritische Verfügbarkeitsanforderung haben. Das Risiko wird ausgelöst, wenn diese Komponenten eingehende Kommunikationsverbindungen haben, was auf eine Netzwerkexposition hindeutet.",
      "riskAssessment": "Die Wahrscheinlichkeit eines DoS-Angriffs steigt mit der Komponente",
      "falsePositives": "Das Risiko könnte überbewertet sein, wenn die Komponente über robuste, spezialisierte DoS-Schutzmechanismen verfügt, die im Modell nicht erfasst sind, oder wenn die verbindenden Netzwerke sehr klein und stark kontrolliert sind. Es kann auch ein False Positive sein, wenn ein Asset als `i@SystemType:OT-device` modelliert ist, aber nicht in einer Echtzeit-Steuerungsfunktion verwendet wird."
    },
    "malware-on-@SystemType:ICS": {
      "title": "Schadsoftware auf industriellen Steuerungssystemen (@SystemType:ICS)",
      "description": "Die Bedrohung durch Schadsoftware wird für industrielle Steuerungssysteme immer gravierender.",
      "impact": "Eine Malware-Infektion auf einer @SystemType:ICS-Komponente kann zur Manipulation oder zum Ausfall industrieller Prozesse führen,",
      "asvs": "N/A (Bezogen auf ISA/IEC 62443-Standards für IACS-Sicherheit)",
      "action": "Segmentierung von Netzwerken und Kontrolle externer Schnittstellen",
      "mitigation": "Segmentieren Sie das @SystemType:ICS/@SystemType:OT-Netzwerk strikt von der Büro-IT und dem Internet mithilfe von Firewalls oder DMZs.",
      "check": "Sind @SystemType:ICS-Assets ordnungsgemäß in einer dedizierten Vertrauensgrenze isoliert? Sind alle eingehenden Verbindungen von weniger vertrauenswürdigen Netzwerken (Büro-IT, Internet)",
      "detectionLogic": "Diese Regel prüft technische Assets, die als `@SystemType:ICS-component` gekennzeichnet sind. Sie identifiziert dann potenzielle Malware-Infektionsvektoren durch die Analyse eingehender Kommunikationsverbindungen von:",
      "riskAssessment": "Das Schadenausmaß wird basierend auf der @SystemType:ICS-Komponente bewertet.",
      "falsePositives": "Das Modell erfasst möglicherweise nicht das Vorhandensein spezifischer Netzwerksicherheitskontrollen wie Next-Gen-Firewalls, Datendioden oder Intrusion-Detection-Systeme (IDS), die dieses Risiko mindern."
    },
    "industrial-espionage-via-@SystemType:ICS-data": {
      "title": "Industriespionage über @SystemType:ICS/I@SystemType:OT-Daten (BSI OPS.1.1.5)",
      "description": "@SystemType:ICS/I@SystemType:OT-Komponenten enthalten oder übertragen oft detaillierte Informationen über den geregelten oder überwachten Prozess.",
      "impact": "Wenn ein Angreifer Zugang zu sensiblen @SystemType:ICS/I@SystemType:OT-Daten erhält, kann dies zum Verlust von Wettbewerbsvorteilen und geistigem Eigentum führen.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5.A16 (Schutz der Vertraulichkeit bei der Datenübertragung) & A17 (Schutz der Vertraulichkeit bei gespeicherten Daten)",
      "action": "Verschlüsselung der Kommunikation und der Daten im Ruhezustand von @SystemType:ICS/I@SystemType:OT",
      "mitigation": "Alle Kommunikationen zu und von @SystemType:ICS/I@SystemType:OT-Komponenten, die sensible Daten übertragen, müssen mit starken, modernen Protokollen (z. B. MQTTS, OPC UA mit aktivierter Sicherheit, HTTPS) verschlüsselt werden.",
      "check": "Sind alle Kommunikationskanäle zu/von @SystemType:ICS/I@SystemType:OT-Geräten verschlüsselt? Sind sensible Konfigurations-/Prozessdaten auf dem Gerät verschlüsselt? Sind die Geräte im Netzwerk ordnungsgemäß isoliert?",
      "detectionLogic": "Diese Regel identifiziert @SystemType:ICS/I@SystemType:OT-Komponenten (Assets mit Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit der Ausnutzung ist erheblich erhöht, wenn die Komponente internetzugänglich ist oder über Vertrauensgrenzen hinweg ohne Verschlüsselung kommuniziert.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn kompensierende Kontrollen existieren, die für @SystemType:OT nicht modelliert sind, wie z. B. eine hardwarebasierte VPN-Appliance, die den gesamten Verkehr für ein Netzwerksegment verschlüsselt, oder wenn die Daten, trotz ihrer Klassifizierung, nicht als Geschäftsgeheimnis für @SystemType:OT gelten."
    },
    "manipulation-of-@SystemType:ICS-firmware-ics1-a5": {
      "title": "Manipulation von Firmware/Software auf einer @SystemType:ICS-Komponente (BSI @SystemType:ICS.1.A5)",
      "description": "Firmware und Anwendungssoftware auf Komponenten von industriellen Steuerungssystemen (@SystemType:ICS) können unrechtmäßig modifiziert werden. Dies kann über verschiedene Vektoren geschehen, darunter: ein kompromittiertes Programmiergerät, eine lokale Datenschnittstelle (z. B. USB), eine bestehende Netzwerkverbindung, ein manipuliertes Software-Update während der Übertragung oder eine kompromittierte Lieferkette, bei der die Komponente bereits mit bösartiger Firmware ankommt.",
      "impact": "Angreifer, die die Fähigkeit erlangen, Software oder Firmware zu modifizieren, können gesteuerte industrielle Prozesse verändern, verfälschen oder stören. Dies kann zu Geräteschäden, Produktionsverlusten, unsicheren Betriebsbedingungen und Denial of Service führen. Die primäre Auswirkung betrifft die Integrität und Verfügbarkeit der @SystemType:ICS-Komponente und des von ihr gesteuerten Prozesses.",
      "asvs": "BSI IT-Grundschutz: @SystemType:ICS.1 Allgemeine @SystemType:ICS-Komponente, Anforderung @SystemType:ICS.1.A5 Manipulation von Software und Firmware auf einer @SystemType:ICS-Komponente.",
      "action": "Implementierung von Integritätskontrollen für Firmware/Software und sicheren Update-Mechanismen",
      "mitigation": "Verwenden Sie digital signierte Firmware und Software, um Authentizität und Integrität zu gewährleisten. Implementieren Sie sichere Startmechanismen, um Software vor der Ausführung zu überprüfen. Alle Update-Kanäle, ob netzwerkbasiert oder lokal, müssen stark authentifiziert und verschlüsselt sein. Beschränken Sie den physischen und logischen Zugriff auf Programmier- und Verwaltungsschnittstellen. Überprüfen Sie die Lieferkette für alle Hardware- und Softwarekomponenten, um das Risiko von vor-kompromittierten Elementen zu reduzieren.",
      "check": "Ist die gesamte Firmware und Anwendungssoftware digital signiert? Ist Secure Boot aktiviert? Werden Software-Updates über einen sicheren, authentifizierten Kanal geliefert? Ist der Zugriff auf Verwaltungsschnittstellen (Netzwerk und physisch) streng kontrolliert und überwacht?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset des Technologietyps ",
      "riskAssessment": "Das Schadenausmaß leitet sich direkt aus den Bewertungen für **Integrität** und **Verfügbarkeit** der @SystemType:ICS-Komponente selbst ab, da eine Manipulation diese Eigenschaften direkt beeinflusst. Eine ",
      "falsePositives": "Das Modell ist sich möglicherweise nicht bewusst über Sicherheitskontrollen außerhalb des Bandes wie strenge physische Sicherheitsmaßnahmen, luftisolierte Update-Verfahren oder eine gründlich geprüfte Lieferkette, die dieses Risiko in der Praxis mindern könnten."
    }
  }
}
