{
  "meta": {
    "part": 5,
    "totalParts": 8,
    "risksInThisPart": 84,
    "totalRisks": 669,
    "instructions": [
      "TRANSLATION INSTRUCTIONS:",
      "1. Translate all text values from English to German",
      "2. Keep all JSON structure and keys unchanged",
      "3. Preserve any HTML tags, technical terms, and BSI references",
      "4. Keep risk IDs (keys) exactly as they are",
      "5. This is part 5 of 8 - translate only this file"
    ]
  },
  "sourceLanguage": "en",
  "targetLanguage": "de",
  "risks": {
    "inadequate-ventilation-bsi-inf-5-g3": {
      "title": "Ungenügende Belüftung oder Klimatisierung (BSI INF.5.G3)",
      "description": "Wenn ein Raum mit technischer Infrastruktur unzureichend belüftet ist oder dessen Klimaanlage (HVAC) ausfällt, kann die Umgebungstemperatur die Betriebsgrenzen der installierten Geräte überschreiten. Dies kann zu Überhitzung führen.",
      "impact": "Das Überschreiten des zulässigen Temperaturbereichs kann zu vorübergehendem Geräteausfall, Leistungsminderung, verkürzter Lebensdauer oder dauerhaften Hardwareschäden führen. Dies beeinträchtigt direkt die **Verfügbarkeit** der betroffenen technischen Assets und der davon abhängigen Geschäftsprozesse.",
      "asvs": "Nicht anwendbar, da es sich um ein physisches Umweltrisiko handelt. Der relevante BSI IT-Grundschutz-Baustein ist INF.5: Raum sowie Schrank für technische Infrastruktur.",
      "action": "Angemessene Umgebungskontrollen für physische Assets sicherstellen",
      "mitigation": "Stellen Sie sicher, dass Räume mit kritischer Infrastruktur über geeignete Klimaanlagen (HVAC) verfügen. Implementieren Sie eine Temperatur- und Feuchtigkeitsüberwachung mit Alarmfunktionen, um das Betriebspersonal über Anomalien zu informieren. Sorgen Sie für eine regelmäßige Wartung der HVAC-Systeme. Ziehen Sie für kritische Umgebungen redundante Klimageräte in Betracht. Stellen Sie für Assets in weniger kontrollierten Umgebungen eine ausreichende passive Belüftung und eine Platzierung entfernt von Wärmequellen sicher.",
      "check": "Ist der physische Standort des Assets mit einer Klimaanlage ausgestattet? Gibt es eine Umgebungsüberwachung (Temperatur, Luftfeuchtigkeit)? Gibt es Alarme für Zustände außerhalb der Grenzwerte? Gibt es einen Wartungsplan für das HVAC-System?",
      "detectionLogic": "Dieses Risiko wird für jedes in-scope technische Asset ausgelöst, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher für Assets in Umgebungen, die nicht als Rechenzentren konzipiert sind (z. B. Büroschränke, unkontrollierte Räume). Die Auswirkung ist direkt proportional zur ",
      "falsePositives": "Eine physische Maschine könnte sich in einem gut belüfteten, klimatisierten Raum befinden, auch wenn sie"
    },
    "fire-in-technical-infrastructure-room-inf5": {
      "title": "Brand im Technikraum oder -schrank (BSI INF.5, Abschnitt 2.4 \"Feuer\")",
      "description": "Ein Raum oder Schrank für technische Infrastruktur kann durch einen Brand schwer beschädigt oder vollständig zerstört werden, was zum Ausfall der davon abhängigen Geschäftsprozesse oder Fachaufgaben führt. ",
      "impact": "Ein Brand kann zur teilweisen oder vollständigen Zerstörung von technischen Assets führen, was längere Ausfallzeiten und den Ausfall abhängiger Geschäftsprozesse zur Folge hat. Dies beeinträchtigt direkt die Verfügbarkeit von Systemen und die Integrität von Daten, die beschädigt werden oder verloren gehen können. Im schlimmsten Fall kann die physische Zerstörung zu permanentem Datenverlust führen.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.5 (Raum sowie Schrank für technische Infrastruktur), insb. Abschnitt 2.4 \"Feuer\" und zugehörigen Anforderungen (z.B. INF.5.A13, INF.5.A25).",
      "action": "Physische Brandschutzmaßnahmen umsetzen",
      "mitigation": "Installieren Sie professionelle Brandmelder und eine Brandmeldeanlage, die mit einer ständig besetzten Stelle verbunden ist. Verwenden Sie ein geeignetes Feuerlöschsystem (z. B. Inertgas). ",
      "check": "Gibt es Brand-/Rauchmelder und eine Brandmeldeanlage? Ist ein geeignetes Feuerlöschsystem installiert? Sind Wände/Türen/Fenster feuer- und rauchbeständig? Ist das Rauchen verboten? Werden elektrische Anlagen regelmäßig überprüft? Sind Brandlasten minimiert?",
      "detectionLogic": "Wird für in-scope technische Assets ausgelöst, die (a) auf physischen Maschinen laufen oder (b) sich innerhalb einer On-Premises-Trust-Boundary befinden (z. B. Server-/Infrastrukturraum). ",
      "riskAssessment": "Die Auswirkung skaliert mit den Verfügbarkeits-/Integritätsanforderungen des Assets. Missionskritische Assets implizieren ",
      "falsePositives": "Ein Risiko kann gemeldet werden, wenn physische Brandschutzmaßnahmen vorhanden sind, aber nicht über das Tag `@Control:fire-protection-present` dokumentiert wurden. "
    },
    "flooding-in-infrastructure-room-con4": {
      "title": "Überschwemmung im Infrastrukturraum (BSI CON.4 / INF.2)",
      "description": "Eine Überschwemmung in einem Raum für technische Infrastruktur kann Wasserschäden an den dort betriebenen Komponenten sowie am Raum selbst verursachen. ",
      "impact": "Die primäre Auswirkung ist ein Verlust der Verfügbarkeit für die technischen Assets im betroffenen Raum durch physische Schäden, Kurzschlüsse oder nachfolgende Korrosion. ",
      "asvs": "BSI IT-Grundschutz INF.2: Gebäude, Anforderung INF.2.A11 Umgang mit Wassergefahren",
      "action": "Physische und Umgebungskontrollen gegen Wasserschäden umsetzen",
      "mitigation": "Infrastrukturräume sollten sich in Gebieten befinden, die nicht überflutungsgefährdet sind (z. B. nicht in Kellern in Hochwassergebieten). Installieren Sie Wassermelder, die mit einer Alarmanlage verbunden sind. ",
      "check": "Wird der Standort des Infrastrukturraums auf Hochwasserrisiko bewertet? Sind Wassermelder installiert? Werden wasserführende Leitungen vermieden oder gesichert? Wird die Gebäudewartung (z. B. Dach, Entwässerung) regelmäßig durchgeführt?",
      "detectionLogic": "Dieses Risiko wird für jedes physische oder virtuelle technische Asset ausgelöst, das sich innerhalb einer Trust Boundary befindet, die einen physischen Infrastrukturraum darstellt. ",
      "riskAssessment": "Die Auswirkung wird durch die höchsten Verfügbarkeits- und Integritätsanforderungen der technischen Assets im Raum bestimmt. Ein Raum, der missionskritische Systeme enthält, hat eine ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn "
    },
    "power-failure-in-infrastructure-room-inf2.g0.1": {
      "title": "Stromausfall im Infrastrukturraum (BSI INF.2 G 0.1)",
      "description": "Fällt die Stromversorgung eines Raumes mit technischer Infrastruktur aus, sind in der Regel mehrere elektrische Komponenten betroffen. ",
      "impact": "Ein Stromausfall beeinträchtigt in erster Linie die Verfügbarkeit aller Systeme im betroffenen physischen Bereich, was zu Unterbrechungen von Geschäftsprozessen führt. ",
      "asvs": "BSI IT-Grundschutz INF.2 Rechenzentrum sowie Server- und Technikraum, Gefährdung G 0.1 Ausfall der Stromversorgung",
      "action": "Redundante Stromversorgung und Umgebungskontrollen sicherstellen",
      "mitigation": "Implementieren Sie einen mehrschichtigen Ansatz für die Stromredundanz. Eine unterbrechungsfreie Stromversorgung (USV) sollte verwendet werden, um kurzfristige Ausfälle zu überbrücken und eine saubere Stromversorgung zu gewährleisten. ",
      "check": "Gibt es eine USV, die die Assets im Raum schützt? Gibt es eine langfristige Stromredundanzlösung wie einen Generator? Sind auch die Umgebungskontrollen (z. B. Kühlung) an eine redundante Stromversorgung angeschlossen? Werden diese Systeme regelmäßig getestet?",
      "detectionLogic": "Dieses Risiko wird für jede Trust Boundary ausgelöst, die einen physischen Standort darstellt (wie ein On-Premise-Netzwerk oder ein dedizierter Hoster), der technische Assets enthält, aber nicht explizit als mit Maßnahmen zur Stromredundanz (wie einer USV oder einem Generator) versehen gekennzeichnet ist.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Stromausfalls wird als ",
      "falsePositives": "Das Modell spiegelt möglicherweise nicht die physische Realität genau wider. Eine Trust Boundary könnte eine logische Gruppierung sein anstatt eines einzelnen physischen Raums mit einer Stromquelle. Außerdem könnten Schutzmaßnahmen existieren, die aber nicht mit den angegebenen Tags im Modell dokumentiert sind."
    },
    "overvoltage-from-indirect-lightning-inf2": {
      "title": "Überspannung durch indirekten Blitzeinschlag (BSI INF.2)",
      "description": "Zusätzlich zu den Auswirkungen eines direkten Blitzeinschlags können durch die induktive Wirkung eines indirekten Blitzes auch Überspannungsspitzen in mehreren hundert Metern Entfernung vom Einschlagpunkt auftreten. ",
      "impact": "Ein Überspannungsereignis kann zu Fehlfunktionen oder zum vollständigen Ausfall von physischer Hardware führen. Dies beeinträchtigt direkt die Verfügbarkeit der betroffenen Assets und aller Dienste, Anwendungen oder Daten, die sie hosten oder bereitstellen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.2 (Rechenzentrum), Gefährdung G 0.4 (Überspannung) und Anforderung INF.2.A21 (Einsatz von Überspannungsschutzeinrichtungen).",
      "action": "Ein mehrstufiges Überspannungsschutzkonzept implementieren und warten",
      "mitigation": "Ein umfassendes Überspannungsschutzkonzept sollte implementiert werden. Dies beinhaltet die Installation geeigneter Überspannungsschutzgeräte (SPDs) am Gebäude",
      "check": "Gibt es ein dokumentiertes und umgesetztes Überspannungsschutzkonzept für alle Einrichtungen, die physische IT-Assets beherbergen? Sind geeignete SPDs an kritischen Punkten installiert (Gebäudeeingang, Verteiler, in der Nähe von Geräten)? ",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets des Maschinentyps ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn ein umfassendes, hochmodernes Überspannungsschutzsystem existiert, das aber nicht im Modell mit dem Tag `@SurgeProtection` dokumentiert wurde. "
    },
    "electromagnetic-interference": {
      "title": "Elektromagnetische Störungen (EMI)",
      "description": "Elektromagnetische Felder können von Störquellen wie Aufzugsmotoren, leistungsstarken Sendeanlagen oder Ableitungen von Blitzschutzanlagen emittiert werden. ",
      "impact": "Die erfolgreiche Ausnutzung dieser physischen Schwachstelle durch eine EMI-Quelle führt zur Fehlfunktion oder zum Ausfall der betroffenen Hardware. ",
      "asvs": "BSI IT-Grundschutz: INF.5 Raum für technische Infrastruktur",
      "action": "Abschirmung und physischer Schutz gegen EMI",
      "mitigation": "Schützen Sie empfindliche Hardware durch die Verwendung von abgeschirmten Racks, abgeschirmten Kabeln (z. B. STP anstelle von UTP) und stellen Sie eine ordnungsgemäße elektrische Erdung sicher. ",
      "check": "Überprüfen Sie die physische Platzierung der Hardware. Befinden sich empfindliche Assets in der Nähe potenzieller EMI-Quellen? Werden bei Bedarf abgeschirmte Racks, Gehäuse und Kabel verwendet? ",
      "detectionLogic": "Diese Regel wird für jedes in-scope technische Asset ausgelöst, das auf physischen, virtuellen oder containerisierten Maschinen läuft und mit `@EMI-Source-Nearby` getaggt ist. ",
      "riskAssessment": "Die Auswirkung dieses Risikos wird durch die **Verfügbarkeits**-Bewertung des betroffenen technischen Assets bestimmt. Eine höhere Verfügbarkeitsanforderung (z. B. ",
      "falsePositives": "Dieses Risiko basiert auf dem Modellierer"
    },
    "electrostatic-discharge-damage-inf-5-a8": {
      "title": "Schäden durch elektrostatische Entladung (ESD) (BSI INF.5 – Abschnitte 2.9 / A8)",
      "description": "Unkontrollierte elektrostatische Entladungen können Geräte mit empfindlichen elektronischen Bauteilen beschädigen oder zerstören, insbesondere in Räumen oder Schränken für technische Infrastruktur. Dies kann zu unzuverlässigem Betrieb oder zum vollständigen Ausfall der betroffenen Geräte führen.",
      "impact": "Schäden durch ESD beeinträchtigen die **Verfügbarkeit** von physischen technischen Assets. Dies kann Geschäftsprozesse stören, zu Datenverlust führen, wenn Assets während des Betriebs ausfallen, und erhebliche Kosten für den Hardware-Austausch verursachen.",
      "asvs": "BSI IT-Grundschutz Baustein INF.5: Raum sowie Schrank für technische Infrastruktur (Abschnitt 2.9 / Anforderung A8)",
      "action": "ESD-Schutzmaßnahmen in physischen Umgebungen umsetzen",
      "mitigation": "Implementieren Sie umfassende ESD-Schutzmaßnahmen in allen Bereichen, in denen physische Hardware untergebracht ist. Dazu gehören die Verwendung von leitfähigen/antistatischen Böden oder Matten, die Sicherstellung einer ordnungsgemäßen Erdung von Geräteracks, die Kontrolle der Umgebungsluftfeuchtigkeit und die Verwendung von antistatischen Handgelenkbändern und Werkzeugen beim Umgang mit empfindlichen Komponenten. Das gesamte Personal, das mit physischer Hardware arbeitet, muss in ESD-sicheren Verfahren geschult sein. Komponenten sollten in antistatischer Verpackung gelagert und transportiert werden.",
      "check": "Sind ESD-Schutzmaßnahmen (z. B. leitfähige/antistatische Böden, Handgelenkbänder, Feuchtigkeitskontrolle) in Räumen oder Schränken mit physischer Hardware vorhanden? Ist das Personal in ESD-Sicherheit geschult? Werden diese Maßnahmen regelmäßig überprüft?",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit der Verfügbarkeitsanforderung des physischen Assets und dessen Redundanz. Ein nicht-redundanter, missionskritischer physischer Server, der ein ESD-Ereignis erleidet, hat eine sehr hohe Auswirkung. Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn der physische Standort über umfassende, geprüfte ESD-Schutzmaßnahmen verfügt, die im Modell genau wiedergegeben werden. Es gilt möglicherweise auch nicht für Hardware, die speziell gegen ESD resistent ist."
    },
    "archive-room-environment-and-access-inf6": {
      "title": "Datenträgerarchiv: Umgebungs- & physische Kontrollen (BSI INF.6)",
      "description": "Datenträgerarchive beherbergen physische Speichermedien wie Festplatten in Servern/SAN/NAS und @Backup:Target-Bänder, können aber auch nicht-digitale Medien umfassen. ",
      "impact": "Kompromittierte Umgebungs- oder physische Kontrollen können Daten beschädigen (Integrität), Dienste unterbrechen (Verfügbarkeit) und – durch unbefugten Zugriff oder Diebstahl – Informationen preisgeben (Vertraulichkeit). ",
      "asvs": "N/A (Anwendungssicherheits-Scope). Dies betrifft physische/Umgebungskontrollen, die durch BSI IT-Grundschutz INF.6 und ISO/IEC 27001:2022 (z. B. Anhang A.7/A.8) abgedeckt sind.",
      "action": "Das Datenträgerarchiv sicher und ordnungsgemäß betreiben.",
      "mitigation": "Geeignete Handfeuerlöscher bereitstellen und warten; den Zugang mit angemessenem mechanischem Widerstand (z. B. DIN EN 1627 RC2–RC3 je nach Bedarf) streng regeln und kontrollieren; vor Staub schützen und Rauchverbot durchsetzen; ",
      "check": "Gibt es einen ausgewiesenen Archivraum mit dokumentierter Zugangskontrolle und mechanischem Widerstand? Sind Feuerlöscher vorhanden und werden sie gewartet? Werden Richtlinien zum Schließen von Fenstern/Abschließen von Türen durchgesetzt? ",
      "detectionLogic": "Nähert sich INF.6 an, indem nicht-serverless Datenspeicher auf physischen, virtuellen oder Container-Maschinen gekennzeichnet werden. ",
      "riskAssessment": "Die Auswirkung leitet sich aus den Integritäts- und Verfügbarkeitsbewertungen des Datenspeichers ab; Langzeitarchive erhöhen die Mindestauswirkung. ",
      "falsePositives": "Kann ein False Positive sein, wenn der On-Premises-Standort ein zertifiziertes Rechenzentrum oder ein speziell gebautes Archiv mit dokumentierter Umgebungsüberwachung, Zugangskontrolle, Alarmanlage, versiegelten Fenstern/Türen und Leckerkennung ist. "
    },
    "unlocked-data-archive": {
      "title": "Unverschlossenes Datenarchiv (Fahrlässigkeit bei der physischen Sicherheit)",
      "description": "Wenn Mitarbeiter die Türen und Fenster eines Datenträgerarchivs nach dem Verlassen nicht schließen oder abschließen, können physische Datenträger oder andere Informationen gestohlen oder unbefugt eingesehen werden. ",
      "impact": "Diebstahl von oder unbefugter Zugriff auf physische Datenträger kann zu einer direkten Kompromittierung sensibler Informationen führen und deren Vertraulichkeit und Integrität verletzen. ",
      "asvs": "Abgeleitet aus BSI IT-Grundschutz Baustein INF.6 (Datenträgerarchiv), insbesondere Anforderungen INF.6.A2 (Zutrittsregelung und -kontrolle) und INF.6.A4 (Geschlossene Fenster und verschlossene Türen).",
      "action": "Verfahren zur physischen Zugangskontrolle durchsetzen und prüfen",
      "mitigation": "Implementieren Sie strenge physische Zugangskontrollen für das Datenarchiv, einschließlich protokollierter Zugriffe, sicherer Schlösser an allen Zugängen (Türen, Fenster) und möglicherweise Überwachungssysteme. ",
      "check": "Gibt es formale Verfahren zur Sicherung des Datenarchivs? Sind Türen und Fenster mit geeigneten, funktionierenden Schlössern ausgestattet? Wird der physische Zugang protokolliert und auf autorisiertes Personal beschränkt? Sind die Mitarbeiter in diesen Verfahren geschult? Werden regelmäßig physische Sicherheitsaudits durchgeführt?",
      "detectionLogic": "Dieses Risiko wird für jedes ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn das Modell kompensierende Kontrollen nicht erfasst, wie z. B. automatische Schließsysteme, 24/7 Sicherheitspersonal vor Ort oder wenn sich das Archiv in einer anderen, hochsicheren physischen Zone befindet (die als verschachtelte Trust Boundary modelliert werden sollte)."
    },
    "insufficient-physical-access-control": {
      "title": "Ungenügende physische Zugangskontrolle",
      "description": "Wenn physische Zugangskontrollen zu einem Datenträgerarchiv oder Rechenzentrum fehlen oder unzureichend sind, können unbefugte Personen die Räumlichkeiten betreten. ",
      "impact": "Unbefugter physischer Zugang kann zum Diebstahl von Hardware, Datenträgern oder sensiblen Dokumenten führen. Er kann auch zur Manipulation von Systemen und Daten oder zur Installation von bösartiger Hardware/Software führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein CON.3 (Physische und Umgebungssicherheit), Anforderung CON.3.A2 (Sicherung von Büros, Räumen und Einrichtungen) und CON.3.A10 (Zutrittsregelung).",
      "action": "Physische Zugangskontrollen implementieren und durchsetzen",
      "mitigation": "Implementieren Sie eine mehrschichtige physische Sicherheitsstrategie für alle Standorte, die kritische Assets beherbergen. Dazu gehören verschlossene Türen, Zugangskontrollsysteme (z. B. Schlüsselkarten, Biometrie), Besucherprotokollierung, Sicherheitspersonal und Überwachungssysteme. ",
      "check": "Sind alle Rechenzentren, Serverräume und Datenarchive durch wirksame physische Zugangskontrollen geschützt? Ist der Zugang nur auf autorisiertes Personal beschränkt? Gibt es einen Prozess zur Verwaltung und Überprüfung des physischen Zugangs?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope, physischen (nicht-virtuellen/container/serverless) technischen Assets vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Versuchs wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn robuste physische Kontrollen vorhanden sind, aber im Modell nicht über die "
    },
    "inadequate-physical-access-control-inf2.a5": {
      "title": "Unzureichende physische Zugangskontrolle (BSI INF.2.A5)",
      "description": "Wenn physische Zugangskontrollen fehlen oder unzureichend sind, können unbefugte Personen einen Büroraum oder ein Rechenzentrum betreten und sensible Daten stehlen, Geräte entwenden oder diese manipulieren. Dies kann die Verfügbarkeit, Vertraulichkeit oder Integrität von Geräten und Informationen gefährden. Selbst wenn kein unmittelbarer Schaden erkennbar ist, können Geschäftsabläufe gestört werden, beispielsweise durch die Notwendigkeit, zu untersuchen, wie ein solcher Vorfall möglich war und ob Schäden oder Manipulationen stattgefunden haben.",
      "impact": "Das Fehlen angemessener physischer Zugangskontrollen kann zu Diebstahl oder Manipulation von Hardware und Daten führen, was sich direkt auf die Vertraulichkeit, Integrität und Verfügbarkeit des Systems auswirkt. Dies kann zu Dienstunterbrechungen, Datenschutzverletzungen und erheblichem Untersuchungsaufwand führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein INF.2: Gebäude- und Flächenmanagement, Anforderung INF.2.A5 (Zutrittsregelung für Flächen).",
      "action": "Physische Zugangskontrollen implementieren und durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle physischen Standorte, die IT-Assets beherbergen (z. B. Rechenzentren, Serverräume, Büros mit Arbeitsplätzen), über angemessene Zugangskontrollen verfügen. Dazu gehören verschlossene Türen, elektronische Zugangskontrollsysteme (z. B. Schlüsselkarten), Empfangspersonal und eine dokumentierte Besucherrichtlinie. Zugriffsrechte sollten dem Prinzip der geringsten Rechte (Least Privilege) folgen. Die Wirksamkeit dieser Kontrollen sollte regelmäßig überprüft werden. Kennzeichnen Sie die On-Premises-Trust-Boundary oder das spezifische physische Asset mit ",
      "check": "Sind alle Zugangspunkte zu Bereichen mit physischen IT-Assets gesichert? Gibt es eine dokumentierte Besucher- und Zugangskontrollrichtlinie? Werden Zugangsprotokolle geführt und überprüft?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets des Maschinentyps ",
      "riskAssessment": "Die Wahrscheinlichkeit eines unbefugten Zugriffsversuchs wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn physische Zugangskontrollen vorhanden sind, aber im Modell nicht über das angegebene Tag dokumentiert wurden. Die Überprüfung erfordert eine physische Inspektion oder eine Überprüfung der Organisation"
    },
    "unfavorable-work-environment-inf5": {
      "title": "Ungünstige Arbeitsumgebung (BSI INF.7)",
      "description": "Ein nicht ergonomischer Büroarbeitsplatz oder eine ungünstige Arbeitsumgebung können Mitarbeiter daran hindern, störungsfrei zu arbeiten oder die bereitgestellte IT optimal zu nutzen. ",
      "impact": "Das Fehlen einer geeigneten Arbeitsumgebung kann zu menschlichen Fehlern führen, die zu Datenbeschädigung (Integrität) oder unsachgemäßer Systemnutzung (Verfügbarkeit) führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.7: Büroarbeitsplatz",
      "action": "Ergonomische und störungsfreie Arbeitsumgebung sicherstellen",
      "mitigation": "Arbeitsplätze für Personal sollten ergonomisch gestaltet sein und Umgebungsstörungen wie Lärm, hohes Verkehrsaufkommen und schlechte Beleuchtung/Belüftung minimieren. ",
      "check": "Sind die Arbeitsplätze so gestaltet, dass Störungen durch Lärm und Verkehr minimiert werden? Gibt es eine angemessene und geeignete Beleuchtung und Belüftung für die IT-Nutzung? ",
      "detectionLogic": "Dies ist ein physisches/organisatorisches Risiko. Es wird für technische Assets ausgelöst, die wahrscheinlich von Menschen in einer On-Premises-Büroumgebung genutzt werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko hängt stark von den tatsächlichen physischen Bedingungen des Arbeitsplatzes ab, die allein aus dem Modell nicht bestimmt werden können. "
    },
    "uncontrolled-physical-access-by-visitors": {
      "title": "Unkontrollierter physischer Zugang durch Besucher oder externes Personal (BSI INF.2)",
      "description": "In Büroumgebungen könnten Besucher, Reinigungspersonal oder anderes externes Personal unkontrollierten Zugang zu internen Bereichen erlangen. ",
      "impact": "Wenn unkontrollierter physischer Zugang stattfindet, kann dies zur Kompromittierung der Vertraulichkeit (Informationspreisgabe), Integrität (Daten- oder Systemmanipulation) und Verfügbarkeit (Diebstahl, Beschädigung, DoS) von Assets führen, die sich auf dem Firmengelände befinden. Dies kann zu Datenschutzverletzungen, Störungen von Geschäftsprozessen und finanziellen Verlusten führen.",
      "asvs": "BSI IT-Grundschutz INF.2.A12 (Regelung der Anwesenheit von externen Personen)",
      "action": "Besucher- und Fremdpersonal-Management-Richtlinie implementieren und durchsetzen",
      "mitigation": "Legen Sie klare Regeln für alle Nicht-Mitarbeiter fest, die das Gelände betreten. Dazu gehören die Führung eines Besucherprotokolls, die Durchsetzung einer Begleitpflicht für alle Besucher in sensiblen Bereichen und die Bereitstellung von Ausweisen. ",
      "check": "Gibt es eine formale Richtlinie für den Umgang mit Besuchern und externem Personal? Müssen sich Besucher anmelden und begleitet werden? Sind die Mitarbeiter in Clean-Desk- und Bildschirmsperr-Richtlinien geschult? Werden regelmäßige Kontrollen durchgeführt, um die Einhaltung sicherzustellen?",
      "detectionLogic": "Dieses Risiko wird für alle technischen Assets ausgelöst, die sich innerhalb einer Trust Boundary vom Typ ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist prozedural und umgebungsbedingt. Eine Organisation könnte ausgezeichnete physische Sicherheitskontrollen haben (z. B. verschlossene Serverräume, strenge Begleitrichtlinien), die im Bedrohungsmodell nicht sichtbar sind. "
    },
    "physical-manipulation-or-destruction": {
      "title": "Physische Manipulation oder Zerstörung von IT-Systemen und Datenträgern (BSI INF.2)",
      "description": "Angreifer können aus verschiedenen Gründen versuchen, IT-Systeme, Zubehör und andere Datenträger zu manipulieren oder zu zerstören. Die Wirksamkeit solcher Angriffe steigt mit verzögerter Erkennung, dem Täter",
      "impact": "Die Folgen können unbefugter Zugriff auf sensible Daten (z. B. durch gestohlene Festplatten), Zerstörung von Datenträgern oder ganzen IT-Systemen sowie erhebliche Betriebsausfälle und Prozesseinschränkungen sein.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.2 (Physische und Umgebungssicherheit), insbesondere in Bezug auf Gefährdungen wie T 0.14 ",
      "action": "Physische und Umgebungssicherheitskontrollen implementieren",
      "mitigation": "Schützen Sie IT-Systeme und Datenträger durch physische Zugangskontrollen (z. B. verschlossene Räume, Racks), Umgebungskontrollen (z. B. Feuerlöschsysteme), Überwachung und sichere Entsorgungsverfahren für Medien. Stellen Sie sicher, dass die Integrität von Hard- und Software überwacht wird. Implementieren und testen Sie regelmäßig Backup- und Wiederherstellungsstrategien, um den Dienst nach Zerstörung oder Manipulation wiederherzustellen.",
      "check": "Befinden sich sensible IT-Systeme und Datenträger in physisch gesicherten Bereichen mit kontrolliertem Zugang? Gibt es Verfahren für ein sicheres Hardware-Lebenszyklusmanagement, einschließlich der Entsorgung? Sind regelmäßige, getestete Backups für alle kritischen Systeme verfügbar?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets ausgelöst, die nicht serverless sind (d. h. vom Maschinentyp ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei direkt zugänglichen physischen Maschinen höher. Die Auswirkung leitet sich direkt aus den Verfügbarkeits-, Integritäts- und Vertraulichkeitsbewertungen des technischen Assets und der darauf gespeicherten oder verarbeiteten Daten ab. Die Zerstörung eines missionskritischen Systems hat eine ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage des logischen Maschinentyps generiert. Es kann die tatsächlichen physischen Sicherheitsmaßnahmen, die in der Bereitstellungsumgebung implementiert sind (z. B. ein hochsicheres Rechenzentrum), nicht berücksichtigen. Daher muss das Risiko gegen die tatsächliche Sicherheitslage validiert werden."
    },
    "theft-of-it-equipment-inf5": {
      "title": "Diebstahl von IT-Ausrüstung (BSI INF.5)",
      "description": "Da IT-Geräte immer portabler werden, ist es einfacher, sie zu stehlen. Der Diebstahl von Datenträgern, IT-Systemen oder Zubehör verursacht Kosten für Ersatz und Wiederherstellung der Betriebsfähigkeit. ",
      "impact": "Die primäre Auswirkung von Diebstahl ist das Potenzial für eine schwerwiegende Verletzung der Vertraulichkeit, wenn die Daten auf dem Gerät unverschlüsselt sind. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.5 (Schutz vor unbefugtem Zugang) und der Gefährdung G 0.14 (Diebstahl von Geräten, Speichermedien oder Dokumenten).",
      "action": "Physische Sicherheitskontrollen implementieren und Verschlüsselung von Daten im Ruhezustand durchsetzen",
      "mitigation": "Sichern Sie alle IT-Geräte physisch, insbesondere tragbare Geräte wie Laptops und Mobiltelefone (z. B. mit Kabelschlössern, verschlossenen Schränken). ",
      "check": "Sind alle IT-Assets, insbesondere tragbare, physisch gesichert, wenn sie unbeaufsichtigt sind? Sind Serverräume und sensible Bereiche zugangskontrolliert? ",
      "detectionLogic": "Diese Regel prüft auf technische Assets, bei denen es sich um physische Geräte oder Client-Geräte (wie Laptops, mobile Geräte) handelt und denen eine Verschlüsselung von Daten im Ruhezustand fehlt. ",
      "riskAssessment": "Die Auswirkung dieses Risikos steht in direktem Zusammenhang mit den Vertraulichkeits- und Verfügbarkeitsanforderungen der auf dem gestohlenen Gerät gespeicherten Daten. ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle physischen Sicherheitskontrollen. Ein Asset könnte als gefährdet eingestuft werden, aber in Wirklichkeit in einer hochsicheren, zugangskontrollierten Umgebung stehen, was die Wahrscheinlichkeit eines Diebstahls verringert. "
    },
    "improper-cabling-inf7": {
      "title": "Unsachgemäße Verkabelung / Stolpergefahr (BSI INF.7)",
      "description": "Kabel für Strom- und Datennetze könnten quer durch Räume und Gehwege verlegt werden, insbesondere wenn Steckdosen ungünstig platziert sind. ",
      "impact": "Wenn dieses Risiko eintritt, kann IT-Ausrüstung physisch beschädigt werden, was zu einem Verlust der Verfügbarkeit führt. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein INF.7 (Büroarbeitsplatz), insbesondere Anforderung INF.7.A3 (Fliegende Verkabelung), ",
      "action": "Ordnungsgemäßes Kabelmanagement für Büroarbeitsplätze umsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Strom- und Datenkabel ordnungsgemäß verlegt sind. Verwenden Sie Kabelkanäle, Leerrohre oder Kabelbrücken, um Kabel zu schützen, die über Böden verlaufen. ",
      "check": "Verlaufen Kabel quer über Gehwege in Bereichen mit physischen IT-Assets? Werden Kabelmanagement-Lösungen wie Kanäle, Brücken oder Trassen verwendet? ",
      "detectionLogic": "Dies ist ein physisches Risiko, das für On-Premises-Umgebungen gilt. Die Regel wird für jedes technische Asset ausgelöst, das explizit als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn "
    },
    "insufficient-telework-regulations": {
      "title": "Ungenügende Regelungen für Home-Office / Telearbeit (BSI INF.8)",
      "description": "Da sich ein Home-Office außerhalb der Organisation befindet",
      "impact": "Das Versäumnis, klare Sicherheitsrichtlinien für Telearbeit festzulegen und durchzusetzen, kann die Vertraulichkeit, Integrität und Verfügbarkeit von Informationen gefährden. ",
      "asvs": "BSI IT-Grundschutz INF.8: Häuslicher Arbeitsplatz",
      "action": "Klare Sicherheitsrichtlinien für Home-Office / Telearbeit festlegen und durchsetzen",
      "mitigation": "Entwickeln, dokumentieren und setzen Sie eine umfassende Sicherheitsrichtlinie für alle Telearbeitskräfte durch. Diese Richtlinie sollte Folgendes abdecken: sicheren Fernzugriff (z. B. obligatorisches VPN), Umgang mit und Speicherung von physischen und digitalen sensiblen Daten zu Hause, physische Sicherheit des Arbeitsplatzes (abschließbarer Raum/Behälter), Nutzung von privaten vs. firmeneigenen Geräten, sicherer Transfer/Transport und Entsorgung von Dokumenten und Medien sowie definierte Verfahren für IT-Support und Incident Response. ",
      "check": "Gibt es eine formale, dokumentierte Sicherheitsrichtlinie für Home-Offices? Erhalten Mitarbeiter Schulungen zu dieser Richtlinie? Sind Verfahren für den Fernsupport, den sicheren Transport und die Entsorgung von Informationen sowie die Reaktion auf Vorfälle klar definiert und werden sie bei Änderungen der Haushaltsbedingungen überprüft?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das ein Client-System darstellt (z. B. Desktop, mobile App, Browser), das dem Internet zugewandt ist und über eine Trust Boundary mit internen, nicht dem Internet zugewandten Assets kommuniziert. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Organisation über starke, durchgesetzte Telearbeitsrichtlinien verfügt, die nicht im Bedrohungsmodell abgebildet sind. Das Modell identifiziert das technische Potenzial für das Risiko; seine tatsächliche Existenz hängt von organisatorischen Kontrollen ab."
    },
    "unauthorized-physical-access-home-office-con.3.a15": {
      "title": "Unbefugter physischer Zugang zum Home-Office (BSI CON.3.A15)",
      "description": "Räume in einem Home-Office, in denen sensible Informationen gespeichert/verarbeitet oder empfindliche Geräte aufbewahrt werden, werden zu schutzbedürftigen Bereichen. ",
      "impact": "Unbefugter physischer Zugang kann zu Diebstahl von Geräten, direktem Zugriff auf ungesperrte Sitzungen, Shoulder Surfing oder der Installation von bösartiger Hardware/Software führen, ",
      "asvs": "BSI IT-Grundschutz Baustein CON.3 (Physische Umgebungssicherheit), Anforderung CON.3.A15 (Physischer Zugang zu Telearbeits- und mobilen Arbeitsbereichen). Dies ist ein physisches Sicherheitsrisiko und wird nicht direkt von OWASP ASVS abgedeckt.",
      "action": "Physische Sicherheitsmaßnahmen für Home-Office-Umgebungen implementieren und durchsetzen",
      "mitigation": "Definieren und setzen Sie physische Sicherheitsrichtlinien für Home-Offices durch. Dies umfasst die sichere Aufbewahrung von Geräten und Dokumenten (z. B. verschlossene Schränke), ",
      "check": "Gibt es definierte Richtlinien für die physische Sicherheit in Home-Offices? Werden Mitarbeiter in diesen Richtlinien geschult? Werden technische Maßnahmen wie Festplattenverschlüsselung und automatische Bildschirmsperren auf für Telearbeit genutzten Assets durchgesetzt?",
      "detectionLogic": "Dieses Risiko wird für jedes in-scope technische Asset ausgelöst, das explizit mit `@Location:HomeOffice` getaggt ist und Daten mit mindestens `Restricted` Vertraulichkeit oder `Important` Integrität/Verfügbarkeit verarbeitet oder speichert.",
      "riskAssessment": "Die Wahrscheinlichkeit wird aufgrund der von Natur aus weniger kontrollierten Umgebung eines Zuhauses im Vergleich zu einem Unternehmensbüro als `Likely` angesehen. ",
      "falsePositives": "Dieses Risiko kann nur dann als False Positive betrachtet werden, wenn das mit `@Location:HomeOffice` getaggte Asset in einem dedizierten, professionell gesicherten und abschließbaren Raum mit Kontrollen verwendet wird, die einer Unternehmensumgebung entsprechen. Dieser Status erfordert eine explizite Begründung und Nachweise."
    },
    "unsuitable-telework-environment-con3.g1": {
      "title": "Ungeeignete Telearbeitsumgebung (BSI CON.3.G1)",
      "description": "Eine nicht ergonomische oder störende Home-Office-Umgebung (z. B. durch Lärm, Unterbrechungen durch Familienmitglieder, schlechte Beleuchtung oder Belüftung) kann ungestörtes Arbeiten verhindern, die optimale Nutzung von IT-Ausstattung behindern, zu Fehlern führen und den Schutz von Daten verringern. Die Vertraulichkeit kann auch durch Shoulder Surfing oder mitgehörte Gespräche in nicht privaten Räumen gefährdet sein.",
      "impact": "Dies kann zu reduzierter Produktivität, erhöhter menschlicher Fehlerquote und kompromittierter Datenintegrität führen, da Mitarbeiter Fehler machen oder Sicherheitsprozeduren nicht korrekt befolgen. Auch die Vertraulichkeit kann kompromittiert werden, was zu Datenschutzverletzungen, Nichteinhaltung gesetzlicher oder vertraglicher Anforderungen und nachfolgenden finanziellen oder Reputationsschäden führen kann.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.3 (Telearbeit), Gefährdung CON.3.G1 (Ungeeignete Bedingungen am Telearbeitsplatz).",
      "action": "Sicherheitsrichtlinien für Telearbeit etablieren und durchsetzen",
      "mitigation": "Definieren und setzen Sie klare Richtlinien für Telearbeitsumgebungen durch, einschließlich Anforderungen an einen privaten, störungsfreien Arbeitsbereich, insbesondere bei der Verarbeitung sensibler Daten. Stellen Sie ergonomische Richtlinien und Sicherheits-Best-Practices für Home-Offices bereit (z. B. Verwendung von Blickschutzfolien, sichere Dokumentenaufbewahrung, Regeln für Smart-Home-Geräte). Schärfen Sie das Bewusstsein der Mitarbeiter für die Risiken der Arbeit in öffentlichen oder gemeinsam genutzten Räumen. Stellen Sie bei Bedarf notwendige Ausrüstung wie Blickschutzfolien oder geräuschunterdrückende Kopfhörer zur Verfügung.",
      "check": "Gibt es klare, kommunizierte Richtlinien für die Telearbeit? Adressieren diese Richtlinien die Umgebungssicherheit (Privatsphäre, Ablenkungen)? Werden die Mitarbeiter in diesen Richtlinien geschult? Gibt es einen Prozess zur Bewertung oder Bestätigung der Eignung von Telearbeitsumgebungen für den Umgang mit sensiblen Informationen?",
      "detectionLogic": "Dieses Umweltrisiko ist schwer automatisch zu erkennen. Diese Regel wird für alle in-scope Client-Assets (z. B. Browser, Desktop, Mobile App) ausgelöst, die von Menschen verwendet werden, oder für jedes Asset, das explizit als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist umgebungsbedingt und hängt von einer Einzelperson ab"
    },
    "insecure-data-transport-to-home-office-con3": {
      "title": "Unsicherer Datentransport zum mobilen/Home-Office (BSI CON.3)",
      "description": "Wenn Dokumente, Datenträger oder Dateien zwischen der Institution und einem mobilen oder Home-Office transportiert werden, können diese Daten und Informationen verloren gehen. ",
      "impact": "Der Verlust von einzigartigen Datenoriginalen ohne Backup kann Geschäftsprozesse stören (Verfügbarkeit). Wenn unverschlüsselte Datenträger in die falschen Hände geraten, kann dies zu einem schwerwiegenden Verlust der Vertraulichkeit führen. ",
      "asvs": "BSI IT-Grundschutz CON.3 Mobiler Arbeitsplatz & CON.4 Datenträgermanagement",
      "action": "Sicheren physischen Transport und Speicherung von Daten auf mobilen Assets sicherstellen",
      "mitigation": "Stellen Sie sicher, dass alle mobilen Assets (Laptops, mobile Geräte), die für die Arbeit verwendet werden, eine vollständige Festplattenverschlüsselung aktiviert haben. ",
      "check": "Gibt es eine definierte Richtlinie für mobile Arbeit und Datentransport? Müssen mobile Assets wie Laptops eine vollständige Festplattenverschlüsselung aktiviert haben? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die typisch für mobile oder Remote-Arbeit sind (z. B. ",
      "riskAssessment": "Die Auswirkung dieses Risikos steht in direktem Zusammenhang mit den Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen der auf dem mobilen Asset gespeicherten Daten. ",
      "falsePositives": "Das Modell könnte ein "
    },
    "improper-disposal-of-media-at-home-office": {
      "title": "Unsachgemäße Entsorgung von Medien im Home-Office (basierend auf BSI)",
      "description": "Wenn es nicht möglich ist, Datenträger und Dokumente im Home-Office ordnungsgemäß zu entsorgen, ",
      "impact": "Die unsachgemäße Entsorgung von Medien, die sensible Informationen enthalten, kann zu schweren Verletzungen der Vertraulichkeit und Integrität führen. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Baustein CON.6 ",
      "action": "Sichere Verfahren zur Medienentsorgung für Remote-Arbeit etablieren und durchsetzen",
      "mitigation": "Implementieren Sie eine klare Richtlinie für die sichere Entsorgung aller Medien (Papierdokumente, USB-Sticks, Festplatten, CDs/DVDs usw.). ",
      "check": "Gibt es eine dokumentierte Richtlinie zur Medienentsorgung in Home-Offices? Werden den Mitarbeitern die notwendigen Werkzeuge (z. B. Aktenvernichter) zur Verfügung gestellt? ",
      "detectionLogic": "Dieses Risiko wird für technische Assets identifiziert, die als in einer Home-Office-Umgebung verwendet getaggt sind (z. B. über ein `@Location:HomeOffice`-Tag), ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn keine formalen Entsorgungsverfahren für Remote-Arbeit existieren. Die Auswirkung steht in direktem Zusammenhang mit dem ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Organisation starke, durchgesetzte Remote-Arbeitsrichtlinien für die Medienentsorgung hat, die nicht "
    },
    "physical-tampering-or-destruction-at-home-office": {
      "title": "Physische Manipulation oder Zerstörung im Home-Office",
      "description": "IT-Geräte, Zubehör, Informationen und Software, die in einem Home-Office verwendet werden, können leichter manipuliert oder zerstört werden als innerhalb der Institution.",
      "impact": "Wenn IT-Geräte, Zubehör, Informationen oder Software manipuliert oder zerstört werden, kann die Arbeitsfähigkeit der Mitarbeiter im Home-Office erheblich eingeschränkt sein (Verfügbarkeit). ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein CON.3: Nutzung mobiler Geräte. Obwohl es keine perfekte Eins-zu-eins-Übereinstimmung ist, sind die Prinzipien der Sicherung von Geräten außerhalb einer kontrollierten Unternehmensumgebung sehr relevant.",
      "action": "Physische Sicherheitsrichtlinien für Home-Office-Umgebungen implementieren und durchsetzen",
      "mitigation": "Legen Sie klare und durchsetzbare Sicherheitsrichtlinien für Home-Offices fest. Dies sollte Richtlinien für die sichere Aufbewahrung von Geräten und Dokumenten bei Nichtgebrauch (z. B. in abschließbaren Schränken), obligatorische Bildschirmsperren und das Bewusstsein für Shoulder Surfing umfassen. ",
      "check": "Gibt es definierte Richtlinien für die physische Sicherheit in Home-Offices? Werden Mitarbeiter in diesen Richtlinien geschult? Ist die vollständige Festplattenverschlüsselung auf allen mobilen und Home-Office-Geräten aktiviert und durchgesetzt?",
      "detectionLogic": "Dieses Risiko gilt für jedes technische Asset, das in einer weniger kontrollierten physischen Umgebung wie einem Home-Office verwendet wird. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage des deklarierten Standorts des Assets generiert. Es kann die tatsächlichen physischen Sicherheitsmaßnahmen, die von einem einzelnen Mitarbeiter in seinem spezifischen Home-Office umgesetzt werden, nicht bewerten. "
    },
    "physical-theft-of-it-from-home-office": {
      "title": "Physischer Diebstahl von unverschlüsselter IT-Ausrüstung im Home-Office (BSI-Kontext)",
      "description": "Home-Office-Umgebungen sind typischerweise weniger physisch gesichert als Unternehmensbüros, die oft Maßnahmen wie Zugangskontrollsysteme und Wachpersonal haben. Dies erhöht das Risiko von Einbrüchen und dem Diebstahl von firmeneigener IT-Ausrüstung. ",
      "impact": "Der Diebstahl eines unverschlüsselten Geräts kann die Vertraulichkeit und Verfügbarkeit direkt beeinträchtigen. Angreifer könnten auf sensible Unternehmens- oder Kundendaten, Geschäftsgeheimnisse und persönliche Informationen zugreifen. Diese Informationen könnten an Wettbewerber verkauft, zur Erpressung verwendet oder öffentlich gemacht werden, was zu erheblichen finanziellen Verlusten, Reputationsschäden und rechtlichen oder regulatorischen Strafen führen kann.",
      "asvs": "BSI IT-Grundschutz Kompendium Referenz: CON.1 Mobile device management; CON.3 Cryptographic methods. Dieses Szenario spiegelt gängige Risiken im Zusammenhang mit Telearbeit wider, die in BSI-Publikationen beschrieben werden.",
      "action": "Vollständige Festplattenverschlüsselung und starke Authentifizierung auf allen im Home-Office verwendeten Geräten aktivieren",
      "mitigation": "Alle IT-Geräte, die außerhalb gesicherter Unternehmensräume, insbesondere in Home-Offices, verwendet werden, MÜSSEN durch eine vollständige Festplattenverschlüsselung (z. B. BitLocker, FileVault) geschützt sein. ",
      "check": "Ist das technische Asset mit vollständiger Festplattenverschlüsselung geschützt? Wird eine starke Authentifizierung erzwungen? Gibt es ein dokumentiertes Verfahren und eine technische Möglichkeit, ein gestohlenes Gerät aus der Ferne zu löschen?",
      "detectionLogic": "Diese Regel identifiziert Client-Systeme (Laptops, Desktops), die in einer Home-Office-Umgebung verwendet werden (getaggt mit ",
      "riskAssessment": "Obwohl gezielter Diebstahl schwer zu modellieren ist, ist opportunistischer Diebstahl immer möglich. Die Wahrscheinlichkeit wird daher als ",
      "falsePositives": "Dies kann ein False Positive sein, wenn das Asset, obwohl unverschlüsselt, nachweislich niemals sensible Daten speichert oder verarbeitet (d. h. nur öffentliche Informationen). Dies ist jedoch selten und riskant für jedes Unternehmens-Asset."
    },
    "insufficiently-regulated-mobile-work": {
      "title": "Ungenügend geregelte mobile Arbeit (basierend auf BSI)",
      "description": "Wenn mobile Arbeit nicht oder nur unzureichend geregelt ist, kann die Institution finanzielle und andere Schäden erleiden. ",
      "impact": "Die unzureichende Sicherung mobiler Arbeit und des Fernzugriffs kann zur Kompromittierung vertraulicher Daten führen, ",
      "asvs": "BSI IT-Grundschutz CON.3 Mobiles Arbeiten",
      "action": "Eine sichere Richtlinie für mobiles Arbeiten definieren und durchsetzen",
      "mitigation": "Legen Sie eine klare Richtlinie für mobiles und Remote-Arbeiten fest, die obligatorische technische Schutzmaßnahmen spezifiziert. ",
      "check": "Gibt es eine dokumentierte Richtlinie für mobiles Arbeiten? Schreibt sie die Verwendung von VPNs oder anderer verschlüsselter Kommunikation für den Zugriff auf sensible Daten vor? ",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen ausgelöst, die von einem Client-Asset stammen, das wahrscheinlich für mobiles Arbeiten verwendet wird ",
      "riskAssessment": "Die Auswirkung wird durch die Vertraulichkeitsstufe der übertragenen Daten bestimmt. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn andere kompensierende Kontrollen existieren, die nicht modelliert sind, "
    },
    "physical-environmental-threats-mobile-devices-sys2-3": {
      "title": "Physische und umgebungsbedingte Bedrohungen für mobile Geräte (BSI SYS.2.3)",
      "description": "Da mobile Endgeräte (Laptops, Tablets, Smartphones) in sehr unterschiedlichen und oft unkontrollierten Umgebungen verwendet werden, sind sie vielen Bedrohungen ausgesetzt. ",
      "impact": "Die erfolgreiche Ausnutzung dieser Bedrohungen kann sich direkt auf die Verfügbarkeit des Geräts (bei Beschädigung oder Verlust), die Integrität seiner Daten und der Systeme, mit denen es verbunden ist (bei Infektion mit Malware), und die Vertraulichkeit seiner gespeicherten Informationen (bei Verlust oder Diebstahl) auswirken. ",
      "asvs": "BSI IT-Grundschutz SYS.2.3 Clients unter besonderen Einsatzbedingungen",
      "action": "Physische und technische Schutzmaßnahmen für mobile Geräte implementieren",
      "mitigation": "Eine Kombination aus physischen, technischen und organisatorischen Kontrollen ist erforderlich. Verwenden Sie Schutzhüllen und schulen Sie Benutzer im sicheren Transport und Umgang. ",
      "check": "Sind mobile Geräte physisch geschützt (z. B. mit Hüllen)? Ist die vollständige Festplattenverschlüsselung auf allen mobilen Clients erzwungen? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Client-Gerät identifiziert wird (z. B. `mobile-app`, `desktop`/`laptop`). ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Exposition ist bei tragbaren Geräten von Natur aus hoch. Die Auswirkung skaliert mit der CIA-Bewertung des Geräts und der von ihm verarbeiteten oder gespeicherten Daten. ",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn ein Gerät, obwohl technisch ein "
    },
    "manipulation-or-destruction-of-mobile-systems-con3": {
      "title": "Manipulation oder Zerstörung von mobilen IT-Systemen (BSI CON.3.G18)",
      "description": "IT-Systeme, Zubehör, Informationen und Software, die im mobilen Kontext verwendet werden, können leichter manipuliert oder zerstört werden als jene auf dem Gelände der Institution.",
      "impact": "Wenn IT-Systeme, Zubehör, Informationen oder Software manipuliert oder zerstört werden, kann ein Mitarbeiter",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.3 ",
      "action": "Physische und technische Sicherheitsmaßnahmen für mobile Geräte umsetzen",
      "mitigation": "Verwenden Sie physisch robuste Geräte. Implementieren Sie technische Schutzmaßnahmen wie vollständige Festplattenverschlüsselung (z. B. BitLocker, FileVault), starke Authentifizierung (Passwörter, Biometrie) und Fernlöschfunktionen. Mitarbeiter sollten in Situationsbewusstsein geschult werden, um Geräte in öffentlichen Räumen zu schützen. Verwenden Sie sichere Tragetaschen. Wenn sie unbeaufsichtigt sind, sollten Geräte sicher aufbewahrt werden (z. B. in einem verschlossenen Raum oder Safe).",
      "check": "Sind mobile Geräte physisch geschützt? Ist die vollständige Festplattenverschlüsselung erzwungen? Ist eine starke Authentifizierung erforderlich? Ist eine Fernlöschlösung vorhanden? Werden Mitarbeiter darin geschult, ihre Geräte außerhalb des Büros zu sichern?",
      "detectionLogic": "Dieses Risiko gilt für jedes technische Asset, das als Client-System identifiziert wird, das in einem mobilen Kontext verwendet wird. Das Tool identifiziert diese Assets anhand ihres Technologietyps (z. B. MobileApp, Desktop, ClientSystem, IoTDevice). Das Risiko wird ausgelöst, da diese Geräte naturgemäß außerhalb des primären physischen Sicherheitsperimeters der Organisation betrieben werden.",
      "riskAssessment": "Die Wahrscheinlichkeit ist höher für Geräte, die häufig an öffentlichen oder ungesicherten Orten verwendet werden. Die Auswirkung steht in direktem Zusammenhang mit den Integritäts- und Verfügbarkeitsanforderungen des Geräts selbst und der von ihm verarbeiteten Daten. Manipulation oder Zerstörung eines Geräts mit missionskritischen Daten oder Funktionen hat eine ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn ein Gerät, obwohl technisch "
    },
    "delayed-information-flow-due-to-mobile-work": {
      "title": "Verzögerter Informationsfluss durch mobile Arbeit (BSI INF.9)",
      "description": "Mobile Mitarbeiter haben oft flexible Arbeitszeiten und können auf Reisen schwer erreichbar sein, was den Informationsfluss erheblich verzögern kann. ",
      "impact": "Die vorübergehend eingeschränkte Erreichbarkeit von Mitarbeitern kann die Verfügbarkeit wichtiger Informationen stark einschränken und Geschäftsprozesse beeinträchtigen, die auf rechtzeitige Entscheidungen oder Datenzugriff angewiesen sind. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium INF.9 Mobiler Arbeitsplatz. Dies ist ein organisatorisches Prozessrisiko im Zusammenhang mit der Verfügbarkeit und lässt sich nicht direkt einer spezifischen ASVS-Anforderung zuordnen.",
      "action": "Klare Kommunikationsprotokolle und SLAs für mobile Arbeit festlegen",
      "mitigation": "Definieren Sie klare Erwartungen und Service Level Agreements (SLAs) für die Reaktionszeiten von mobilen Mitarbeitern. ",
      "check": "Gibt es definierte Richtlinien für die Kommunikation bei mobiler Arbeit? Gibt es SLAs für Reaktionszeiten? Gibt es Eskalationsverfahren oder Vertretungsregeln für zeitkritische Aufgaben, die mobilen Mitarbeitern zugewiesen sind?",
      "detectionLogic": "Dieses organisatorische Risiko wird für jedes in-scope technische Asset ausgelöst, das getaggt ist ",
      "riskAssessment": "Die Wahrscheinlichkeit ist situativ, wird aber als wahrscheinlich angenommen, wenn keine spezifischen Kommunikations-SLAs für mobile Arbeit vorhanden sind. ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn die Organisation über wirksame, kompensierende Kontrollen verfügt (z. B. strenge SLAs, automatisierte Eskalation, robuste Vertretungsregelungen), die im technischen Modell nicht erfasst sind."
    },
    "insecure-transport-of-data-to-mobile-workplaces": {
      "title": "Unsicherer Transport von Daten oder Medien zu mobilen Arbeitsplätzen (BSI CON.6)",
      "description": "Wenn Dokumente, Datenträger oder Dateien zwischen einer Institution und mobilen Arbeitsplätzen transportiert werden, ",
      "impact": "Die Folgen eines unsicheren Transports können schwerwiegend sein und zu finanziellem Schaden führen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.6 (Transport von IKT-Komponenten und Datenträgern), spezifische Gefährdung ",
      "action": "Sichere Datentransportkanäle und -protokolle gewährleisten",
      "mitigation": "Alle Datentransporte zu mobilen oder externen Clients müssen über verschlüsselte und authentifizierte Kanäle erfolgen. ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen, die Trust Boundaries zu Client-Assets überschreiten. ",
      "detectionLogic": "Dieses Risiko wird durch Kommunikationsverbindungen ausgelöst, die Daten von innerhalb einer Trust Boundary zu einem technischen Client-Asset (z. B. mobile App, Browser, Desktop) außerhalb davon übertragen. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn Daten über ein unverschlüsseltes Protokoll gesendet werden. Die Auswirkung wird durch die höchste Vertraulichkeits-, Integritäts- und Verfügbarkeitsbewertung der übertragenen Daten-Assets bestimmt. ",
      "falsePositives": "Ein Risiko könnte als False Positive gekennzeichnet werden, wenn kompensierende, modellierte Kontrollen vorhanden sind, "
    },
    "improper-disposal-of-media-con4": {
      "title": "Unsachgemäße Entsorgung von Datenträgern an mobilen Arbeitsplätzen (BSI CON.4)",
      "description": "Wenn es nicht möglich ist, Datenträger (z. B. Ausdrucke, Notizen, alte USB-Sticks) an einem mobilen Arbeitsplatz ordnungsgemäß zu entsorgen, landen sie oft im normalen Haus- oder öffentlichen Müll oder werden in Hotels oder Zügen zurückgelassen. ",
      "impact": "Die Folgen einer unsachgemäßen Entsorgung reichen von Wissens- und Vertraulichkeitsverlust bis hin zu existenziellen Bedrohungen für die Institution, beispielsweise wenn wichtige Verträge nicht zustande kommen oder Partnerschaften aufgrund des Informationslecks scheitern. ",
      "asvs": "BSI IT-Grundschutz CON.4: Vernichtung und Entsorgung, insbesondere Anforderung CON.4.A5 (Geeignete Entsorgung von schützenswerten Informationen). Bezieht sich auch auf SYS.3.3 (Mobiler Arbeitsplatz).",
      "action": "Sichere Entsorgungsverfahren für mobile Arbeitsplätze implementieren und durchsetzen",
      "mitigation": "Legen Sie klare, kommunizierte Verfahren für die sichere Entsorgung aller sensiblen Informationen, sowohl digital als auch physisch, für mobile und Remote-Mitarbeiter fest. ",
      "check": "Gibt es klare, dokumentierte Richtlinien für die Entsorgung von Dokumenten und Datenträgern von mobilen Arbeitsplätzen? ",
      "detectionLogic": "Ein Risiko für jedes technische Asset auslösen, das: (1) ein mobiler Arbeitsplatz ist (hat die ",
      "riskAssessment": "Wahrscheinlichkeit: ",
      "falsePositives": "Kann ein False Positive sein, wenn die Organisation die sichere Entsorgung für mobile/entfernte Standorte durchsetzt und prüft (z. B. vorgeschriebene Vernichtung bei Rückkehr ins Büro, zertifizierte Aktenvernichtungsdienste, verschlossene Entsorgungsbehälter, Schulungen zum Thema mit Bestätigung)."
    },
    "unauthorized-access-mobile-workplace-con3": {
      "title": "Unbefugter Informationszugriff am mobilen Arbeitsplatz (BSI INF.9)",
      "description": "An einem mobilen Arbeitsplatz können unbefugte Dritte leichter auf vertrauliche Informationen zugreifen, die auf Geräten gespeichert sind (z. B. Festplatten, Wechselmedien), oder Kommunikationsverbindungen abhören, insbesondere wenn sie professionell handeln. Dies kann schwerwiegende Folgen für die gesamte Institution haben.",
      "impact": "Eine unbefugte Preisgabe von Informationen (Verlust der Vertraulichkeit) kann zu rechtlichen oder vertraglichen Verstößen, Wettbewerbsnachteilen und erheblichen finanziellen oder Reputationsschäden führen.",
      "asvs": "BSI IT-Grundschutz INF.9 Mobiler Arbeitsplatz",
      "action": "Datenschutzmaßnahmen für mobile Arbeitsplätze implementieren",
      "mitigation": "Schützen Sie Daten im Ruhezustand auf mobilen Geräten durch starke, vollständige Festplatten- oder dateibasierte Verschlüsselung (z. B. BitLocker, FileVault, LUKS). Schützen Sie Daten während der Übertragung, indem Sie ausschließlich verschlüsselte Kommunikationsprotokolle (z. B. HTTPS, WSS, FTPS) und/oder ein obligatorisches VPN für alle Verbindungen in Unternehmens- oder Cloud-Netzwerke verwenden. Setzen Sie Richtlinien bezüglich der Verwendung von Wechselmedien und des Benutzerbewusstseins für physische Sicherheit durch.",
      "check": "Sind mobile Geräte",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die als mobile oder Client-Arbeitsplätze fungieren (z. B. Mobile App, Desktop Client, IoT-Gerät). Sie prüft dann auf zwei Bedingungen: 1. Die Speicherung sensibler Daten auf dem Gerät, ohne dass die Verschlüsselung auf Asset-Ebene aktiviert ist. 2. Die Verwendung unverschlüsselter Kommunikationsprotokolle zur Übertragung sensibler Daten vom oder zum Gerät.",
      "riskAssessment": "Die Auswirkung des Risikos wird durch die Vertraulichkeit der gefährdeten Daten (gespeichert oder übertragen) bestimmt. Die Wahrscheinlichkeit wird als hoch angesehen, wenn Schutzmaßnahmen wie Verschlüsselung fehlen. Die Gesamtschwere ergibt sich aus dieser Kombination.",
      "falsePositives": "Ein Risiko kann ein False Positive sein, wenn andere kompensierende Kontrollen existieren, die nicht in Threagile modelliert sind, wie z. B. eine Betriebssystem-Richtlinie, die den gesamten Speicher transparent verschlüsselt, oder wenn ein Gerät ausschließlich in einem physisch sicheren, vertrauenswürdigen Netzwerk verwendet wird."
    },
    "physical-loss-or-theft-of-mobile-workstation": {
      "title": "Physischer Verlust oder Diebstahl einer mobilen Arbeitsstation (BSI CON.3.A1)",
      "description": "Mobile Arbeitsstationen sind physisch nicht so gut gesichert wie Arbeitsstationen innerhalb eines Unternehmens oder einer Behörde.",
      "impact": "Zusätzlich zum materiellen Schaden durch den unmittelbaren Verlust des mobilen IT-Systems können weitere finanzielle Schäden entstehen, wenn sensible Daten wie E-Mails, Besprechungsnotizen, Adressen oder andere Dokumente preisgegeben werden. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium 2023, Baustein CON.3: Mobiler Arbeitsplatz, Anforderung CON.3.A1 Diebstahl oder Verlust von mobilen Endgeräten.",
      "action": "Physische und technische Schutzmaßnahmen für mobile Geräte implementieren",
      "mitigation": "Um das Risiko der Datenpreisgabe durch verlorene oder gestohlene Geräte zu mindern, müssen alle mobilen Arbeitsstationen eine vollständige Festplattenverschlüsselung (FDE) verwenden. ",
      "check": "Werden alle mobilen Geräte (Laptops, Tablets, Smartphones) unter einem MDM verwaltet? Ist die vollständige Festplattenverschlüsselung auf allen mobilen Geräten erzwungen? ",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets ausgelöst, die als physische Client-Geräte identifiziert werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass ein mobiles Gerät verloren geht oder gestohlen wird, wird als ",
      "falsePositives": "Ein technisches Asset könnte gekennzeichnet werden, das, obwohl es technisch ein mobiles Gerät ist (z. B. ein Laptop), ausschließlich an einem physisch sicheren, statischen Ort verwendet wird (z. B. permanent in einem sicheren Büro angedockt). "
    },
    "unclear-security-roles-and-responsibilities": {
      "title": "Unklare Sicherheitsrollen und -verantwortlichkeiten (BSI ORP.1)",
      "description": "Wenn Rollen und Verantwortlichkeiten im Sicherheitsprozess nicht klar definiert sind, können viele Mitarbeiter ihre Verantwortung für die Informationssicherheit vernachlässigen oder leugnen und diese oft auf höhere Managementebenen abschieben. Infolgedessen werden notwendige Sicherheitsmaßnahmen nicht umgesetzt, da sie fast immer zusätzlichen Aufwand im üblichen Arbeitsablauf bedeuten.",
      "impact": "Das Versäumnis, Sicherheitsmaßnahmen aufgrund unklarer Verantwortlichkeiten umzusetzen, schafft Schwachstellen. Dies kann zur Kompromittierung der Vertraulichkeit, Integrität oder Verfügbarkeit kritischer Assets führen, Geschäftsprozesse stören und zu Sicherheitsvorfällen und Datenschutzverletzungen führen.",
      "asvs": "BSI IT-Grundschutz ORP.1: Informationssicherheitsorganisation (insbesondere ORP.1.A1 Aufbau einer Informationssicherheitsorganisation und ORP.1.A2 Festlegung von Rollen und Verantwortlichkeiten)",
      "action": "Sicherheitsrollen und -verantwortlichkeiten klar definieren und kommunizieren",
      "mitigation": "Etablieren Sie eine formale Informationssicherheitsorganisation mit klar definierten Rollen (z. B. CISO, ISB, Asset-Owner, technische Administratoren). Dokumentieren Sie die spezifischen Verantwortlichkeiten für jede Rolle in Bezug auf die Informationssicherheit. Stellen Sie sicher, dass diese Rollen und Verantwortlichkeiten allen relevanten Mitarbeitern wirksam kommuniziert und in die standardmäßigen Betriebsabläufe integriert werden. Weisen Sie allen kritischen technischen Assets klare Eigentümer zu.",
      "check": "Gibt es eine dokumentierte Sicherheitsorganisation? Sind Rollen und Verantwortlichkeiten für die Informationssicherheit klar definiert, zugewiesen und kommuniziert? Haben alle kritischen technischen Assets einen benannten Eigentümer oder verantwortlichen Administrator?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das durch einen Proxy innerhalb des technischen Modells erkannt werden kann. Die Regel prüft auf hochwertige technische Assets (basierend auf ihrer CIA-Bewertung), denen keine klar zugewiesene verantwortliche Rolle fehlt (d. h. die nicht mit einem ",
      "riskAssessment": "Die Auswirkung wird durch die CIA-Anforderungen des technischen Assets bestimmt, für das die Verantwortlichkeiten unklar sind. Ein hochwertiges Asset ohne klaren Eigentümer stellt ein erhebliches Risiko dar. Die Wahrscheinlichkeit wird als hoch angesehen, da die Vernachlässigung von Sicherheitspflichten eine häufige Folge unklarer Verantwortlichkeiten ist.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn Rollen außerhalb des Bedrohungsmodells verwaltet werden."
    },
    "lack-of-management-support-for-security-orp1.a1": {
      "title": "Fehlende Unterstützung des Managements für Informationssicherheit (BSI ORP.1.A1)",
      "description": "Wenn Sicherheitsbeauftragte keine uneingeschränkte Unterstützung von der Institution erhalten",
      "impact": "Ein Mangel an Unterstützung durch das Management untergräbt den gesamten Informationssicherheitsprozess. Notwendige Sicherheitskontrollen können unterfinanziert, umgangen oder ignoriert werden, was zu einer schwachen Sicherheitslage führt. Dies erhöht die Wahrscheinlichkeit von Sicherheitsvorfällen, die potenziell die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) aller Assets gefährden und zu Datenschutzverletzungen, Betriebsstörungen, finanziellen Verlusten und Reputationsschäden führen können.",
      "asvs": "BSI IT-Grundschutz Kompendium: ORP.1.A1 Managementverantwortung für Informationssicherheit",
      "action": "Klares Engagement des Managements für Informationssicherheit etablieren und demonstrieren",
      "mitigation": "Das Management muss die Informationssicherheitsstrategie sichtbar und aktiv unterstützen. Dies umfasst die Zuweisung ausreichender Ressourcen (Budget, Personal), die Genehmigung von Sicherheitsrichtlinien, die Stärkung von Sicherheitsrollen (wie des CISO oder @Role:ITSecurityOfficer) und die Rechenschaftspflicht aller Mitarbeiter für die Sicherheit. Management",
      "check": "Gibt es eine dokumentierte Informationssicherheitsrichtlinie, die vom Management genehmigt wurde? Sind Sicherheitsrollen klar definiert, befugt und mit Ressourcen ausgestattet? Überprüft das Management regelmäßig den Stand der Informationssicherheit? Ist Sicherheit ein Thema in Management-Meetings?",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das aus einer potenziellen Diskrepanz zwischen Management- und Sicherheitsfunktionen entsteht. Diese Regel wird ausgelöst, wenn das Bedrohungsmodell Assets enthält, die sowohl mit einer Managementrolle (",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist eine Schlussfolgerung, die auf dem Vorhandensein von Rollen im Modell basiert. Das tatsächliche Maß an Managementunterstützung ist ein organisatorischer Faktor, der nicht vollständig aus einem technischen Modell bestimmt werden kann. Das Risiko sollte durch die Überprüfung interner Richtlinien, Sitzungsprotokolle und der effektiven Macht des Sicherheitsteams innerhalb der Organisation validiert werden."
    },
    "isms1-unsupported-security-management": {
      "title": "ISMS.1 – Nicht unterstütztes Sicherheitsmanagement",
      "description": "Das Sicherheitsmanagement (ISMS) existiert zwar auf dem Papier, ist jedoch organisatorisch nicht verankert: Rollen sind unklar, Ressourcen fehlen, die Leitlinie ist unbekannt und Sicherheitsziele werden nicht gesteuert. Dadurch werden Vorgaben ignoriert und Sicherheitsmaßnahmen bleiben Stückwerk.",
      "impact": "Fehlende Verantwortung und Ressourcen im ISMS führen zu lückenhaften Kontrollen, verspäteter Umsetzung und unkoordiniertem Incident Response. Die Folge sind erhöhte Risiken für Vertraulichkeit, Integrität und Verfügbarkeit (CIA) in besonders geschäftskritischen Assets – mit längeren Ausfällen, größerem Schaden und regulatorischen Konsequenzen.",
      "asvs": "Abgeleitet aus BSI IT-Grundschutz Kompendium 2023/2024, Baustein ISMS.1 (Sicherheitsmanagement), u. a. A1–A13 (Leitung, Leitlinie, Organisation, Sicherheitskonzept, Berichte).",
      "action": "ISMS sichtbar verankern: Leitung übernimmt Verantwortung, benennt Rollen, gibt Leitlinie frei, priorisiert Maßnahmen und stellt Budget/Personal bereit.",
      "mitigation": "Leitlinie beschließen und veröffentlichen, Sicherheitsziele & -strategie festlegen (mit Geltungsbereich), ISB benennen und ausstatten, Organisationsstruktur & Kommunikationswege definieren, Sicherheitskonzept(e) erstellen und pflegen, Management-Reporting etablieren, Revisionen/Wirksamkeitsprüfungen planen und dokumentieren.",
      "check": "Existiert eine freigegebene Leitlinie? Sind ISB und Rollen benannt und vertreten? Gibt es budgetierte Ressourcen & Zeit? Werden Management-Berichte erstellt (mind. jährlich) und Entscheidungen revisionssicher dokumentiert? Sind Sicherheitsmaßnahmen geplant, priorisiert, umgesetzt und überprüft?",
      "detectionLogic": "Heuristik (modellbasiert): Markiere technische Assets mit hoher Kritikalität (hohe CIA-Werte). Indizien: keine oder sehr wenige organisatorische Tags (z. B. „policy:missing“, „owner:unknown“), fehlende Zuordnung zu Sicherheitskonzepten/Leitlinien, sehr hohe Schutzbedarfe der verarbeiteten Daten (StrictlyConfidential/MissionCritical) bei zugleich fehlender Out-of-Scope-Markierung. Ergebnis: Hinweis auf mögliches fehlendes Management-Support und Ressourcenmangel.",
      "riskAssessment": "Wahrscheinlichkeit standardmäßig „Likely“, um eine organisatorische Prüfung anzustoßen. Die Auswirkung orientiert sich an den höchsten CIA-Einstufungen des betroffenen Assets und seiner Daten; bei Mission-Critical wird „Very High“ angesetzt.",
      "falsePositives": "Kein Befund, wenn Leitung sichtbar Verantwortung trägt, Rollen & Vertretungen geregelt sind, Ressourcen nachweislich ausreichen (Budget/Personen/Zeiten), Management-Berichte vorliegen und Sicherheitsmaßnahmen nach Plan umgesetzt/überprüft werden."
    },
    "inadequate-management-reporting-and-oversight": {
      "title": "Unzureichendes Management-Reporting und Aufsicht",
      "description": "Wenn das Management nicht ausreichend über den Sicherheitsstatus aller Geschäftsprozesse, IT-Systeme und Anwendungen sowie über bestehende Mängel informiert wird, ",
      "impact": "Dies kann zu einem Ungleichgewicht führen, bei dem einige Bereiche übermäßig geschützt sind, während andere schwere Schwachstellen aufweisen. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.1 (Informationssicherheitsorganisation), insbesondere Anforderung ORP.1.A4 (Verantwortung für die Informationssicherheit).",
      "action": "Klare Prozesse für Sicherheits-Reporting und Aufsicht etablieren",
      "mitigation": "Implementieren Sie ein regelmäßiges, klares und umfassendes Sicherheits-Reporting an das Management. Dieses Reporting sollte die aktuelle Sicherheitslage, identifizierte Risiken, den Status von Vorfällen und die Wirksamkeit von Sicherheitskontrollen abdecken. ",
      "check": "Gibt es einen formalen Prozess zur Meldung des Sicherheitsstatus an das Management? Überprüft das Management diese Informationen regelmäßig? Werden Entscheidungen über Sicherheitsressourcen und -prioritäten dokumentiert und basieren sie auf diesem Reporting?",
      "detectionLogic": "Dies ist ein übergeordnetes organisatorisches Risiko. Es wird für missionskritische Assets oder wichtige Sicherheitskontrollen ausgelöst, unter der Annahme, dass ein Mangel an Managementaufsicht aufgrund falsch zugewiesener Ressourcen oder Fehlkonfigurationen zu deren Kompromittierung führen könnte. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch und dient als Anstoß zur Überprüfung. Eine Organisation könnte ausgezeichnete Aufsichts- und Reporting-Prozesse haben, die im technischen Bedrohungsmodell nicht sichtbar sind. "
    },
    "lack-of-cooperation-due-to-unclear-strategy-bsi": {
      "title": "Mangelnde Kooperation aufgrund unklarer Sicherheitsstrategie (BSI-basiert)",
      "description": "Um ein konsistentes und angemessenes Sicherheitsniveau zu erreichen, müssen verschiedene Verantwortungsbereiche innerhalb einer Institution zusammenarbeiten. Ein Mangel an strategischen Leitlinien und unklare Ziele können jedoch zu unterschiedlichen Interpretationen der Bedeutung von Informationssicherheit führen. Infolgedessen kann die notwendige Zusammenarbeit ausbleiben, weil die Aufgabe der ",
      "impact": "Das Versäumnis, in Sicherheitsfragen zusammenzuarbeiten, führt dazu, dass Sicherheitsmaßnahmen nicht oder nur inkonsistent umgesetzt werden. Dies kann ausnutzbare Schwachstellen schaffen, die Vertraulichkeit, Integrität und Verfügbarkeit (CIA) des gesamten Systems gefährden und zu Geschäftsunterbrechungen, Datenschutzverletzungen und Nichteinhaltung von Vorschriften führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein ORP.1 (Informationssicherheitsorganisation), insbesondere Anforderung ORP.1.A1 ",
      "action": "Eine klare Informationssicherheitsstrategie etablieren, kommunizieren und die Zusammenarbeit fördern",
      "mitigation": "Das Management muss eine umfassende Informationssicherheitsstrategie und -richtlinie definieren, dokumentieren und aktiv kommunizieren. Dies umfasst klare Ziele, definierte Rollen und Verantwortlichkeiten sowie Prozesse, die die abteilungsübergreifende Zusammenarbeit bei Sicherheitsthemen fördern und erfordern. Die Strategie",
      "check": "Gibt es eine dokumentierte und kommunizierte Informationssicherheitsstrategie und -richtlinie? Sind die Sicherheitsziele klar und werden sie in verschiedenen Abteilungen verstanden? Gibt es etablierte Prozesse für die abteilungsübergreifende Zusammenarbeit in Sicherheitsfragen?",
      "detectionLogic": "Dies ist ein übergeordnetes organisatorisches Risiko, das für das gesamte System gilt. Es wird einmal generiert und an das kritischste technische Asset angehängt (basierend auf seiner relativen Angreiferattraktivität - RAA), um den Punkt des höchsten potenziellen Schadens durch dieses strategische Versäumnis darzustellen. Das Vorhandensein dieses Risikos deutet auf eine grundlegende Schwäche hin, die alle Komponenten betrifft, nicht nur die, an die es",
      "riskAssessment": "Die Wahrscheinlichkeit ist HOCH, wenn eine klare Sicherheitsstrategie fehlt oder nicht effektiv kommuniziert wird. Die Auswirkung steht in direktem Zusammenhang mit der allgemeinen Geschäftskritikalität des Systems. Ein Mangel an Strategie für ein missionskritisches System hat eine SEHR HOHE Auswirkung, da wesentliche Kontrollen fehlen können.",
      "falsePositives": "Dieses Risiko ist von Natur aus organisatorisch und seine Existenz kann nicht allein durch das technische Modell bestätigt werden. Das Modell identifiziert es als potenzielles grundlegendes Risiko. Die Überprüfung erfordert die Prüfung organisatorischer Dokumente (Strategie, Richtlinien) und die Befragung von Schlüsselpersonal, um den Stand der abteilungsübergreifenden Zusammenarbeit in Sicherheitsfragen zu bewerten."
    },
    "outdated-security-concept-due-to-missing-review": {
      "title": "Veraltetes Sicherheitskonzept aufgrund fehlender Überprüfungsprozesse (BSI-konform)",
      "description": "Neue Geschäftsprozesse, Anwendungen und IT-Systeme sowie neue Bedrohungen beeinflussen ständig den Zustand der Informationssicherheit. ",
      "impact": "Ein veraltetes Sicherheitskonzept bedeutet, dass die Sicherheitsmaßnahmen nicht mehr für das sich entwickelnde System oder die aktuelle Bedrohungslandschaft angemessen sind. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz-Kompendium (2023), Baustein ORP.4 (Kontinuierlicher Verbesserungsprozess), insbesondere Anforderung ORP.4.A5 (Überprüfung der Wirksamkeit der Informationssicherheit).",
      "action": "Einen regelmäßigen Prozess zur Sicherheitsüberprüfung und Bedrohungswahrnehmung etablieren",
      "mitigation": "Implementieren Sie einen formalen, wiederkehrenden Prozess zur Überprüfung und Aktualisierung des Informationssicherheitskonzepts. Dieser Prozess sollte Folgendes umfassen: ",
      "check": "Gibt es einen dokumentierten Prozess zur regelmäßigen Überprüfung des Informationssicherheitskonzepts? Wann fand die letzte Überprüfung dieses Systems statt?",
      "detectionLogic": "Dieses organisatorische Risiko wird für technische Assets ausgelöst, die sich im Laufe der Zeit weiterentwickeln und dadurch anfällig für ein veraltetes Sicherheitskonzept werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn ein Überprüfungsprozess mangelhaft oder nicht vorhanden ist, da sich Systeme und Bedrohungen ständig weiterentwickeln. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn für das identifizierte Asset ein robuster, kontinuierlicher Prozess zur Sicherheitsüberprüfung und -verbesserung besteht, "
    },
    "violation-of-legal-or-contractual-requirements": {
      "title": "Gesetzliche oder vertragliche Nichteinhaltung",
      "description": "Unzureichend gesicherte Informationen, Prozesse und IT-Systeme können Verstöße gegen Gesetze (z. B. DSGVO, NIS2), Branchenstandards (z. B. PCI DSS, HIPAA, SOC 2/ISO 27001) oder Vertragsklauseln (z. B. AVVs, SLAs) auslösen. Mangelndes Bewusstsein für geltende nationale/internationale Vorschriften und vertragliche Verpflichtungen erhöht dieses Risiko erheblich.",
      "impact": "Die Nichteinhaltung kann zu Bußgeldern und Sanktionen, behördlichen Maßnahmen, Verlust von Zertifizierungen/Testaten, Vertragsstrafen oder -kündigungen, Rechtsstreitigkeiten, obligatorischen Offenlegungen und erheblichem Reputationsschaden führen.",
      "asvs": "BSI IT-Grundschutz: ISMS.1 (Sicherheitsmanagement) — Gefährdung 2.7; verwandt: DER.1 (Compliance).",
      "action": "Compliance über Assets und Lieferanten hinweg etablieren und kontinuierlich überprüfen (Richtlinie → Kontrolle → Nachweis → Audit).",
      "mitigation": "Identifizieren Sie alle anwendbaren rechtlichen, regulatorischen und vertraglichen Anforderungen; ordnen Sie diese konkreten Kontrollen mit Eigentümern und Nachweisen zu; pflegen Sie Dateninventare und Verarbeitungszwecke; setzen Sie Sicherheitsverpflichtungen Dritter durch (AVVs/SLAs, Prüfungsrecht); implementieren Sie ein Änderungsmanagement für regulatorische Aktualisierungen; und führen Sie regelmäßige interne/externe Audits durch.",
      "check": "Gibt es ein aktuelles Verzeichnis der anwendbaren Gesetze/Standards/Verträge? Sind diese implementierten Kontrollen und Nachweisen zugeordnet? Sind Verantwortlichkeiten und Überprüfungszyklen definiert? Sind AVVs/SLAs mit Lieferanten vorhanden und werden sie geprüft? Wird die Compliance nach System- oder Umfangänderungen neu validiert?",
      "detectionLogic": "Wird für technische Assets ausgelöst, die wahrscheinlich rechtlichen/vertraglichen Verpflichtungen unterliegen, wenn EINE der folgenden Bedingungen zutrifft: (1) Das Asset trägt ein @Compliance-Basis-Tag (z. B. @Compliance:GDPR/PCI-DSS). (2) Das Asset verarbeitet oder speichert hochsensible oder missionskritische Daten (Vertraulichkeit „Strictly-Confidential“ ODER Integrität/Verfügbarkeit „Mission-Critical“). (3) Das Asset kommuniziert (eingehend oder ausgehend) mit einer externen Entität, was vertragliche Bedingungen mit Partnern/Lieferanten impliziert.",
      "riskAssessment": "Die Wahrscheinlichkeit wird standardmäßig als „Wahrscheinlich“ eingestuft, da die kontinuierliche Demonstration der Compliance eine ständige Herausforderung darstellt. Die Auswirkung skaliert mit den höchsten CIA-Bewertungen des Assets: „Wichtig“ → „Mittel“, „Kritisch“ → „Hoch“, „Missionskritisch/Streng vertraulich“ → „Sehr hoch“. Die Wahrscheinlichkeit einer Datenschutzverletzung wird auf „Wahrscheinlich“ erhöht, wenn die Auswirkung „Hoch“ oder höher ist.",
      "falsePositives": "Kann ein False Positive sein, wenn ein auditierbares Compliance-Programm das Asset vollständig abdeckt (klare Kontrollzuordnung, Eigentümer, Nachweise und wiederkehrende Audits). Überprüfen und dokumentieren Sie die Begründung, wenn das Risiko akzeptiert oder herabgestuft wird."
    },
    "chain-of-events-leading-to-major-incident": {
      "title": "Ereigniskette, die zu einem schwerwiegenden Vorfall führt (BSI)",
      "description": "Sicherheitsvorfälle können aus einer Kette kleinerer Ursachen oder unglücklicher Umstände entstehen und zu großen Schäden führen. Eine Kompromittierung eines Systems kann es einem Angreifer ermöglichen, sich lateral zu bewegen und nachfolgende, kritischere Systeme zu kompromittieren. Dieses Risiko identifiziert potenzielle architektonische Angriffspfade von weniger vertrauenswürdigen Umgebungen (wie dem Internet) zu hochwertigen Assets über ein oder mehrere Zwischensysteme.",
      "impact": "Die erfolgreiche Ausnutzung einer solchen Angriffskette kann zu schweren Störungen von Geschäftsprozessen, erheblichen Datenschutzverletzungen, die die Vertraulichkeit und Integrität beeinträchtigen, dem Verlust der Systemverfügbarkeit, erheblichem Reputationsschaden und der Verletzung gesetzlicher oder vertraglicher Verpflichtungen führen.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz Baustein DER.1 (Sicherheitsvorfallsmanagement), der die Notwendigkeit behandelt, sich auf komplexe Sicherheitsvorfälle vorzubereiten und diese zu bewältigen. Das Risiko selbst stellt ein potenzielles Versagen der Tiefenverteidigung dar, einem zentralen Architekturprinzip.",
      "action": "Tiefenverteidigung und Netzwerksegmentierung implementieren",
      "mitigation": "Architektieren Sie das System so, dass Angriffspfade minimiert und laterale Bewegungen verhindert werden. Verwenden Sie starke Trust Boundaries (z. B. Firewalls, Netzwerkrichtlinien, Sicherheitsgruppen), um kritische Assets von weniger vertrauenswürdigen Umgebungen zu isolieren. Härten Sie alle Systeme in der Kette, nicht nur den anfänglichen Einstiegspunkt. Implementieren Sie eine robuste Überwachung und Alarmierung, um anomales Verhalten an jedem Punkt in der Kette zu erkennen und eine frühzeitige Intervention zu ermöglichen.",
      "check": "Sind kritische Assets von internetzugänglichen Systemen durch mindestens eine Sicherheitsgrenze getrennt? Ist die laterale Bewegung zwischen Assets in derselben Vertrauenszone eingeschränkt? Gibt es eine Überwachung auf mehrstufige Angriffsmuster?",
      "detectionLogic": "Diese Regel erkennt potenzielle Angriffspfade (Kommunikationsketten) von internetexponierten Assets zu internen Assets mit hohen Vertraulichkeits-, Integritäts- oder Verfügbarkeitsbewertungen. Ein Risiko wird generiert, wenn ein hochwertiges Asset vom Internet aus über ein oder mehrere zwischengeschaltete technische Assets erreichbar ist, was ein kaskadierendes Risiko darstellt.",
      "riskAssessment": "Die Wahrscheinlichkeit wird basierend auf der Existenz eines solchen architektonischen Pfades bewertet. Die Auswirkung wird durch die CIA-Bewertung des endgültigen, hochwertigen Assets in der Kette bestimmt. Ein kürzerer, weniger segmentierter Pfad stellt ein höheres Risiko dar als ein mehrschichtiger. Die Auswirkung steht in direktem Zusammenhang mit dem Geschäftswert des kompromittierten Ziels.",
      "falsePositives": "Die Regel könnte Standard-N-Tier-Architekturen kennzeichnen. Ein False Positive kann geltend gemacht werden, wenn die zwischengeschalteten Kommunikationsverbindungen stark gesichert sind (z. B. mit Anwendungs-Firewalls, strengen API-Verträgen und feingranularer Autorisierung), sodass eine laterale Bewegung als undurchführbar angesehen wird."
    },
    "inadequate-security-management-orp1": {
      "title": "Unzureichendes Sicherheitsmanagement (BSI ORP.1)",
      "description": "Unzureichendes Sicherheitsmanagement kann dazu führen, dass falsche Prioritäten gesetzt werden und Sicherheitsinvestitionen nicht in den Bereichen getätigt werden, die den größten Nutzen bringen. Dies kann dazu führen, dass in teure Technologien investiert wird, ohne grundlegende organisatorische Regeln (wie klare Verantwortlichkeiten) zu haben, oder dass man sich auf weniger kritische Bereiche konzentriert, während geschäftswesentliche Systeme vernachlässigt werden. Diese Fehlausrichtung schafft erhebliche, unadressierte Risiken trotz Sicherheitsausgaben.",
      "impact": "Falsch ausgerichtete Sicherheitsprioritäten können zu schweren Sicherheitsvorfällen führen. Ressourcen können für unwirksame Kontrollen verschwendet werden, während kritische Schwachstellen in geschäftswesentlichen Prozessen ungemindert bleiben. Dies kann die Vertraulichkeit, Integrität und Verfügbarkeit von Schlüssel-Assets gefährden, Kernfunktionen des Geschäfts stören und zu erheblichen finanziellen und Reputationsschäden führen.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium 2023: ORP.1 Informationssicherheitsorganisation.",
      "action": "Ein ganzheitliches Informationssicherheits-Managementsystem (ISMS) etablieren und aufrechterhalten",
      "mitigation": "Implementieren Sie ein umfassendes Informationssicherheits-Managementsystem (ISMS), um einen ganzheitlichen und koordinierten Ansatz zur Sicherheit zu gewährleisten. Das ISMS sollte die Sicherheitsprioritäten an den Geschäftszielen ausrichten, Rollen und Verantwortlichkeiten klären, regelmäßige Risikobewertungen durchführen, um kritische Bereiche zu identifizieren, und eine ausgewogene und effiziente Zuweisung von Sicherheitsressourcen sicherstellen. Die Strategie sollte dokumentiert, kommuniziert und regelmäßig vom Management überprüft werden.",
      "check": "Gibt es ein dokumentiertes ISMS? Sind Sicherheitsprioritäten und -investitionen nachweislich mit der Geschäftskritikalität und Risikobewertungen verknüpft? Gibt es einen formalen Prozess zur Koordination von Sicherheitsmaßnahmen und Produktauswahlen in der gesamten Organisation?",
      "detectionLogic": "Dies ist ein übergeordnetes organisatorisches Risiko. Es kann nicht allein aus einem technischen Modell eindeutig identifiziert werden. Diese Regel generiert ein einziges, modellweites Risiko, wenn das System beliebige in-scope technische Assets enthält. Das Risiko wird am kritischsten gefundenen Asset verankert und dient als konkretes Beispiel dafür, was auf dem Spiel steht, wenn das Sicherheitsmanagement unzureichend ist.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn ein ausgereiftes und effektives ISMS vorhanden ist, das die Sicherheitsinvestitionen nachweislich an den Geschäftsrisiken ausrichtet. Um dies zu überprüfen, müssen organisatorische Dokumente wie die Sicherheitsstrategie, Risikobewertungsberichte und Protokolle der Managementbewertung geprüft werden."
    },
    "inadequate-communication-link-performance": {
      "title": "Ungenügende Leistung der Kommunikationsverbindung (basierend auf BSI-Gefährdung)",
      "description": "Wenn Kommunikationsverbindungen unzureichend dimensioniert sind oder ihre Leistung aufgrund eines technischen Fehlers oder eines Denial-of-Service (DoS)-Angriffs beeinträchtigt wird, können Clients nur eingeschränkt mit Servern kommunizieren, was die Zugriffszeiten erheblich erhöht.",
      "impact": "Dienste, die von der betroffenen Verbindung abhängen, können nur teilweise verfügbar oder vollständig unbrauchbar werden. Für die Institution relevante Informationen sind möglicherweise nicht mehr zugänglich. In schweren Fällen kann dies zum Stillstand wesentlicher Geschäftsprozesse oder ganzer Produktionslinien führen, was zu erheblichen Betriebsstörungen führt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein CON.1 (Redundante Kommunikationsverbindungen), der Maßnahmen zur Verhinderung von Verfügbarkeitsverlusten durch Verbindungsausfälle beschreibt.",
      "action": "Ausreichende Kapazität und Redundanz für Kommunikationsverbindungen sicherstellen",
      "mitigation": "Stellen Sie sicher, dass Kommunikationsverbindungen so dimensioniert sind, dass sie Spitzenlasten bewältigen können und über ausreichende Kapazität verfügen. Implementieren Sie redundante Kommunikationspfade für alle kritischen Verbindungen, um einzelne Ausfallpunkte zu mindern. Verwenden Sie für internetzugängliche Verbindungen DoS-Schutzdienste. Überwachen Sie die Auslastung und Leistung der Verbindungen, um Engpässe proaktiv zu identifizieren und zu beheben. Implementieren Sie Quality of Service (QoS)-Mechanismen, um kritischen Datenverkehr zu priorisieren.",
      "check": "Werden Kommunikationsverbindungen auf Auslastung und Leistung überwacht? Sind kritische Kommunikationspfade redundant? Gibt es eine DoS-Schutzstrategie für internetzugängliche Verbindungen? Wurde eine Lastanalyse durchgeführt, um eine ausreichende Kapazität sicherzustellen?",
      "detectionLogic": "Dieses Risiko wird für Kommunikationsverbindungen ausgelöst, die Daten mit hohen oder missionskritischen Verfügbarkeitsanforderungen übertragen, insbesondere solche, die Trust Boundaries überschreiten oder eine Verbindung zum Internet herstellen. Das Risiko wird nicht ausgelöst, wenn die Verbindung mit dem ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Verbindungen zum Internet oder über große Trust Boundaries hinweg höher, da sie externen Bedrohungen und Konkurrenzsituationen stärker ausgesetzt sind. Die Auswirkung wird direkt durch die Verfügbarkeitsanforderungen der technischen Assets und Daten-Assets bestimmt, die auf die Kommunikationsverbindung angewiesen sind. Ein Ausfall einer Verbindung, die von einem missionskritischen System verwendet wird, hat eine ",
      "falsePositives": "Das Modell erfasst möglicherweise nicht alle Formen der Netzwerkredundanz (z. B. dynamische Routing-Protokolle, mehrere physische Verbindungen, die zu einer logischen Verbindung aggregiert sind). Das Risiko könnte gemeldet werden, auch wenn die zugrunde liegende Infrastruktur widerstandsfähig ist, diese Widerstandsfähigkeit aber nicht im Modell ausgedrückt wird. Eine manuelle Überprüfung der Netzwerkarchitektur ist zur Bestätigung erforderlich."
    },
    "insufficient-gateway-protection": {
      "title": "Ungenügender Gateway-Schutz (BSI-Stil)",
      "description": "Wenn ein internes Netzwerk mit dem Internet verbunden ist und der Eingangspunkt unzureichend geschützt ist (z. B. weil keine dedizierte Firewall, WAF oder Reverse-Proxy verwendet wird), können Angreifer aus dem Internet direkt auf interne Systeme zugreifen. Dies ermöglicht ihnen potenziell den Zugriff auf, das Kopieren oder Manipulieren sensibler Informationen im internen Netzwerk, wobei die Perimeterschutzmaßnahmen umgangen werden.",
      "impact": "Ein unzureichender Gateway-Schutz kann zu unbefugtem Zugriff auf interne Assets führen, was zum Verlust der Vertraulichkeit und Integrität der verarbeiteten oder gespeicherten Daten führt. Dies kann zu schweren Datenschutzverletzungen, Systemkompromittierungen und weiteren lateralen Bewegungen im Netzwerk führen.",
      "asvs": "V1.1.2: Sicherheitsarchitektur",
      "action": "Gateway-Sicherheitskontrollen durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen von einer internetzugänglichen Komponente zu einer internen Komponente durch eine dedizierte Netzwerksicherheitskontrolle verlaufen. Dies kann ein Reverse-Proxy, eine Web Application Firewall (WAF), ein Intrusion Prevention System (IPS) oder ein dediziertes API-Gateway sein. Das interne Asset sollte nicht direkt dem Datenverkehr aus dem Internet ausgesetzt sein.",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen, die eine Trust Boundary vom Internet in ein internes Netzwerk überschreiten. Überprüfen Sie, ob das Ziel jeder solchen Verbindung ein technisches Asset ist, das als Gateway-Sicherheitskontrolle (wie eine WAF oder ein Reverse-Proxy) ausgewiesen ist.",
      "detectionLogic": "Diese Regel iteriert durch alle Kommunikationsverbindungen. Sie identifiziert Risiken, bei denen ein technisches Asset als ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, da ein direkter Angriffspfad vom Internet zu einem internen, nicht gehärteten System besteht. Die Auswirkung wird durch die maximale Vertraulichkeit und Integrität der Daten-Assets bestimmt, die über die ungeschützte Verbindung übertragen werden. Eine direkte Verbindung, die ",
      "falsePositives": "Dies könnte ein False Positive sein, wenn eine kompensierende Kontrolle existiert, die nicht modelliert ist, wie zum Beispiel ein Cloud-Anbieter"
    },
    "insecure-network-topology-net1.1": {
      "title": "Unsichere Netzwerktopologie (BSI NET.1.1)",
      "description": "Wenn ein Netzwerk unsachgemäß aufgebaut oder falsch erweitert wird, können unsichere Netzwerktopologien oder -konfigurationen entstehen. ",
      "impact": "Eine unsichere Netzwerktopologie erhöht das Risiko der lateralen Bewegung für einen Angreifer, der einen ersten Halt gefunden hat, erheblich. ",
      "asvs": "BSI IT-Grundschutz NET.1.1 (Netzwerkarchitektur und -design)",
      "action": "Sichere Netzwerksegmentierung und -überwachung implementieren",
      "mitigation": "Entwerfen und implementieren Sie eine segmentierte Netzwerkarchitektur (z. B. unter Verwendung verschachtelter Trust Boundaries im Modell zur Darstellung von DMZs, ",
      "check": "Überprüfen Sie das Bedrohungsmodell",
      "detectionLogic": "Diese Regel inspiziert netzwerkartige Trust Boundaries. Sie löst ein Risiko aus, wenn eine Grenze eine ",
      "riskAssessment": "Die Auswirkung wird durch die höchste CIA-Bewertung eines Assets innerhalb der unsicheren Netzwerkgrenze bestimmt. ",
      "falsePositives": "Ein Modell könnte ein Netzwerk zu stark vereinfachen, das in Wirklichkeit durch eine zugrunde liegende Infrastruktur, die im Modell nicht vollständig detailliert ist, ordnungsgemäß segmentiert ist. "
    },
    "compromise-of-network-management-solution": {
      "title": "Kompromittierung der Netzwerkmanagement-Lösung (BSI NET.1.2)",
      "description": "Wenn ein Angriff erfolgreich auf Netzwerkmanagement-Lösungen zugreift, zum Beispiel durch ungepatchte Sicherheitslücken oder unzureichende Netzwerk-Trennung, können alle verbundenen Netzwerkkomponenten gesteuert und neu konfiguriert werden. Dies kann zum Zugriff auf sensible Informationen, zur Umleitung von Netzwerkverkehr oder sogar zur nachhaltigen Störung des gesamten Netzwerks führen.",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, alle verbundenen Netzwerkkomponenten zu steuern und neu zu konfigurieren. Dies kann zu unbefugtem Zugriff auf sensible Informationen (Verletzung der Vertraulichkeit), zur Umleitung oder Manipulation von Netzwerkverkehr (Verletzung der Integrität) und zur nachhaltigen Störung des gesamten Netzwerks (Verletzung der Verfügbarkeit / Denial of Service) führen.",
      "asvs": "BSI NET.1.2 (Schutz des Netzwerkmanagements), OWASP ASVS V4.0.3 - 1.1.2 (Sichere Netzwerkarchitektur), OWASP Top 10 2021: A05-Sicherheitsfehlkonfiguration",
      "action": "Netzwerkmanagement-Lösungen härten und isolieren",
      "mitigation": "Netzwerkmanagement-Lösungen müssen konzeptionell als hochkritische Assets behandelt werden. Sie sollten gemäß den Best Practices gehärtet werden, einschließlich regelmäßigem Patchen und Schwachstellenmanagement. Der Zugriff muss streng kontrolliert werden, unter Verwendung von Multi-Faktor-Authentifizierung und dem Prinzip der geringsten Rechte. Entscheidend ist, dass die Management-Lösung und ihr Datenverkehr in einem dedizierten, eingeschränkten Netzwerksegment (Management-VLAN/VPN) getrennt von Produktions- und Benutzernetzwerken isoliert werden. Alle Zugriffe auf die und von der Management-Lösung sollten protokolliert und auf Anomalien überwacht werden.",
      "check": "Läuft die Netzwerkmanagement-Lösung in einem dedizierten, isolierten Netzwerksegment? Ist der Zugriff streng auf autorisierte Administratoren über sichere Kanäle beschränkt? Ist das System gehärtet und wird es konsistent gepatcht? Werden alle administrativen Aktionen protokolliert und überwacht?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die als Netzwerk- oder Systemmanagement-Lösungen fungieren, basierend auf ihrem Technologietyp (z. B. Monitoring, ContainerPlatform, ServiceMesh, WAF, LoadBalancer, etc.). Ein Risiko wird ausgelöst, wenn eine solche Lösung ausgehende Kommunikationsverbindungen zur Verwaltung anderer Assets hat, da sie einen zentralen Kontrollpunkt darstellt. Das Risiko wird als höher angesehen, wenn das Management-Asset weniger vertrauenswürdigen Umgebungen (z. B. dem Internet) ausgesetzt ist oder einen breiten Kontrollumfang hat.",
      "riskAssessment": "Die Auswirkung wird auf der Grundlage der höchsten Vertraulichkeit, Integrität und Verfügbarkeit aller von der Lösung verwalteten technischen Assets berechnet. Eine Kompromittierung eines Systems, das missionskritische Assets verwaltet, hat eine ",
      "falsePositives": "Ein Risiko kann ein False Positive sein, wenn das identifizierte Asset nicht zu Verwaltungszwecken verwendet wird oder wenn starke, nicht modellierte kompensierende Kontrollen wie ein physisch getrenntes Management-Netzwerk oder strenge hostbasierte Firewalls vorhanden sind."
    },
    "compromise-of-network-component": {
      "title": "Kompromittierung einer Netzwerkkomponente (BSI-Stil)",
      "description": "Basierend auf einer BSI-ähnlichen Bedrohung: Wenn es einem Angreifer gelingt, auf eine einzelne Netzwerkkomponente (wie einen Load Balancer, Reverse Proxy oder Gateway) zuzugreifen, kann die Komponente gesteuert und manipuliert werden. Der gesamte darüber geleitete Datenverkehr kann kompromittiert (abgehört oder manipuliert) werden. Darüber hinaus kann die kompromittierte Komponente als Sprungbrett für weitere Angriffe und ein tieferes Eindringen in das Netzwerk genutzt werden.",
      "impact": "Eine erfolgreiche Ausnutzung führt zum Verlust der Vertraulichkeit und Integrität für den gesamten Datenverkehr, der durch die Komponente fließt. Es ermöglicht Man-in-the-Middle-Angriffe, Session Hijacking und kann laterale Bewegungen erleichtern, wodurch die Reichweite eines Angreifers erheblich erweitert wird.",
      "asvs": "V14.2 Netzwerk- und Plattformkonfiguration",
      "action": "Netzwerkkomponenten härten und Datenverkehr überwachen",
      "mitigation": "Wenden Sie Sicherheits-Härtungs-Baselines auf alle Netzwerkkomponenten an. Ändern Sie Standard-Anmeldeinformationen sofort. Halten Sie Firmware und Software gepatcht und auf dem neuesten Stand. Implementieren Sie eine starke, mehrstufige Authentifizierung für Verwaltungsschnittstellen. Beschränken Sie den Zugriff auf Verwaltungsschnittstellen auf ein dediziertes, gesichertes Verwaltungsnetzwerk. Verwenden Sie Netzwerksegmentierung, um den Explosionsradius zu begrenzen. Überwachen Sie den Datenverkehr und die Komponentenprotokolle auf anomale Aktivitäten.",
      "check": "Sind die Standard-Anmeldeinformationen für Netzwerkgeräte geändert? Werden alle Komponenten-Software und Firmware regelmäßig gepatcht? Ist der Zugriff auf Verwaltungsschnittstellen eingeschränkt (z. B. über Firewall-Regeln, Jump-Hosts)? Wird eine mehrstufige Authentifizierung für den administrativen Zugriff verwendet? Wird der Netzwerkverkehr zu und von der Komponente auf Anzeichen einer Kompromittierung überwacht?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope technischen Assets ausgelöst, die als Netzwerkinfrastrukturkomponenten fungieren, wie z. B. Load Balancer, Reverse Proxies, Gateways und Service Meshes. Die Schwere wird durch die Sensitivität der durch die Komponente fließenden Daten und ihre Exposition gegenüber dem Internet bestimmt.",
      "riskAssessment": "Die Auswirkung wird auf der Grundlage der höchsten Vertraulichkeit und Integrität von Daten-Assets auf allen verbundenen Kommunikationsverbindungen berechnet. Eine höhere Auswirkung wird zugewiesen, wenn die Daten vertraulich oder kritisch sind. Die Wahrscheinlichkeit wird als höher angesehen für Komponenten, die direkt dem Internet ausgesetzt sind, da sie zugänglichere Ziele für Angreifer sind.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn umfangreiche Härtungsmaßnahmen vorhanden sind (z. B. Hardware-Sicherheitsmodule, geschützte Out-of-Band-Management-Netzwerke), die jedoch nicht im Modell dargestellt sind."
    },
    "unprotected-network-management-communication": {
      "title": "Ungeschützte Netzwerkmanagement-Kommunikation",
      "description": "Wenn die Kommunikation des Netzwerkmanagements abgehört und manipuliert wird, können aktive Netzwerkkomponenten fehlkonfiguriert oder kontrolliert werden. ",
      "impact": "Ein Angreifer, der diese Schwachstelle ausnutzt, kann Anmeldeinformationen abfangen, den Netzwerkverkehr manipulieren, kritische Netzwerkkomponenten neu konfigurieren, um den Dienst zu stören (Denial of Service), oder tiefer in die Infrastruktur eindringen (Rechteausweitung).",
      "asvs": "V14.2.1 (ASVS 4.0.3) / 13.2.1 (ASVS 5.0): Daten während der Übertragung werden mit einem sicheren Protokoll verschlüsselt und authentifiziert.",
      "action": "Netzwerkmanagement-Verkehr verschlüsseln",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, die für Management, Überwachung oder andere DevOps-Zwecke verwendet werden, starke, verschlüsselte Protokolle (z. B. SSH, HTTPS, LDAPS, FTPS, WSS, SNMPv3) nutzen. ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen mit einem ",
      "detectionLogic": "Diese Regel wird für jede Kommunikationsverbindung ausgelöst, die mit `usage: devops` gekennzeichnet ist, kein verschlüsseltes Protokoll verwendet und nicht explizit durch ein VPN geschützt ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, insbesondere für Verbindungen, die Trust Boundaries überschreiten. Die Auswirkung wird durch die Kritikalität (CIA-Bewertungen) des verwalteten Ziel-Assets bestimmt. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Verbindung durch andere, nicht modellierte kompensierende Kontrollen geschützt ist, wie z. B. ein physisch isoliertes und gesichertes Verwaltungsnetzwerk, das als vollständig vertrauenswürdig gilt."
    },
    "insufficient-time-synchronization-ops1-1-5": {
      "title": "Ungenügende Zeitsynchronisation (BSI OPS.1.1.5.A14)",
      "description": "Wenn die Systemzeit von Komponenten – insbesondere derer, die für Infrastrukturmanagement und Sicherheitsüberwachung verwendet werden – nicht synchronisiert ist, wird die Korrelation von Protokolldaten aus verschiedenen Quellen schwierig oder unmöglich. Inkonsistente Zeitstempel können zu einer falschen Ereignisanalyse führen und die Reaktion auf Vorfälle sowie forensische Untersuchungen behindern.",
      "impact": "Die Unfähigkeit, Ereignisse systemübergreifend zu korrelieren, behindert die Reaktion auf Vorfälle, die Fehlerbehebung und die forensische Analyse. Sicherheitsvorfälle, Datenexfiltration oder koordinierte Angriffe könnten unentdeckt bleiben oder fehlinterpretiert werden, was zu einer längeren Systemkompromittierung, verzögerter Behebung und der Unfähigkeit führt, zuverlässig nachzuweisen, was passiert ist.",
      "asvs": "BSI IT-Grundschutz-Kompendium: OPS.1.1.5.A14 Zeit-Synchronisation",
      "action": "Zeitsynchronisation über NTP implementieren und durchsetzen",
      "mitigation": "Alle relevanten Systeme sollten so konfiguriert sein, dass sie ihre Zeit mit einer zuverlässigen und konsistenten Zeitquelle synchronisieren (z. B. mit NTP - Network Time Protocol). Verwenden Sie interne, gestaffelte NTP-Server für On-Premises-Netzwerke und vom Anbieter verwaltete Zeitdienste in der Cloud. Stellen Sie sicher, dass Firewall-Regeln den NTP-Verkehr zwischen Clients und Servern zulassen. Überwachen Sie regelmäßig den Zeitsynchronisationsstatus aller kritischen Komponenten. Verwenden Sie die ",
      "check": "Sind alle technischen Assets so konfiguriert, dass sie eine zentrale, zuverlässige Zeitquelle (NTP) verwenden? Wird der Zeitsynchronisationsstatus überwacht? Können Protokolleinträge von verschiedenen Systemen zuverlässig anhand des Zeitstempels korreliert werden?",
      "detectionLogic": "Dieses Risiko wird für alle in-scope, serverseitigen oder infrastrukturbezogenen technischen Assets ausgelöst, die nicht die ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Zeitsynchronisation auf einer darunterliegenden Schicht implementiert und verwaltet wird (z. B. durch den Cloud-Anbieter oder über Betriebssystem-Deployment-Images), aber nicht explizit im Modell getaggt ist. Um diesen Befund zu beheben, wenden Sie die "
    },
    "@Network:WLAN-interference-or-jamming-bsi-net3.2": {
      "title": "@Network:WLAN-Interferenz oder -Störung (Jamming) (BSI NET.3.2)",
      "description": "In drahtlosen Netzwerken wird Information mittels elektromagnetischer Funkwellen übertragen. ",
      "impact": "Die Störung oder der vollständige Ausfall der drahtlosen Kommunikation führt zu einem Verlust der Verfügbarkeit für das @Network:WLAN und alle davon abhängigen Assets oder Geschäftsprozesse. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium Baustein NET.3.2 Wireless LAN.",
      "action": "Sichere @Network:WLAN-Konfiguration und -Überwachung",
      "mitigation": "Um unbeabsichtigte Interferenzen zu mindern, führen Sie Standortvermessungen durch, um die Kanalzuweisung und die Platzierung von Access Points zu planen, um überlappende Frequenzen mit anderen leistungsstarken Quellen zu vermeiden. ",
      "check": "Gibt es ein WIPS, um Jamming und andere drahtlose Angriffe zu erkennen? Sind Protected Management Frames (802.11w) im @Network:WLAN aktiviert? ",
      "detectionLogic": "Dieses Risiko wird für jede Kommunikationsverbindung ausgelöst, die explizit als drahtlose Verbindung getaggt ist (z. B. mit dem Tag `@Network:WLAN`). ",
      "riskAssessment": "Die Wahrscheinlichkeit unbeabsichtigter Interferenzen wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn das @Network:WLAN in einer speziell abgeschirmten Umgebung (z. B. einem Faradayschen Käfig) betrieben wird oder wenn hochspezialisierte, militärische Anti-Jamming-Technologie verwendet wird, "
    },
    "@Network:WLAN-hardware-damage-bsi-con-3": {
      "title": "Hardwareschaden an @Network:WLAN-Komponenten (BSI CON.3)",
      "description": "Hardwareschäden können den drahtlosen Verkehr stören, und im schlimmsten Fall kann das @Network:WLAN komplett ausfallen. ",
      "impact": "Physische Schäden an @Network:WLAN-Komponenten beeinträchtigen hauptsächlich die Verfügbarkeit, was zu Dienstunterbrechungen oder vollständigem Ausfall führt. ",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium CON.3: Wireless LAN (@Network:WLAN)",
      "action": "Exponierte @Network:WLAN-Hardware physisch schützen",
      "mitigation": "@Network:WLAN-Komponenten an exponierten Standorten (im Freien, in öffentlichen Bereichen) sollten in physisch sicheren, wetterfesten und vandalensicheren Gehäusen installiert werden. ",
      "check": "Sind @Network:WLAN-Geräte an exponierten Standorten durch geeignete Gehäuse physisch geschützt? Gibt es Schutz vor Umwelteinflüssen wie Wetter und Blitzschlag? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset identifiziert, das explizit als `@Network:WLAN-Component` markiert ist und zusätzlich als an einem exponierten Standort mit `@PhysicalLocation:Outdoor` getaggt ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit eines Schadens wird als hoch angesehen für jede Komponente, die als im Freien befindlich getaggt ist, da dies die explizite Schwachstellenbedingung ist. ",
      "falsePositives": "Ein technisches Asset könnte als im Freien befindlich getaggt sein, aber in einem hochbelastbaren, vandalensicheren und wetterfesten Gehäuse installiert sein. "
    },
    "stolen-@Network:WLAN-access-point": {
      "title": "Diebstahl eines @Network:WLAN Access Points (BSI NET.3.2.A4)",
      "description": "Wenn ein @Network:WLAN Access Point (AP) in einem ungesicherten, öffentlich zugänglichen Bereich installiert ist, kann er physisch gestohlen werden. ",
      "impact": "Das Extrahieren von Anmeldeinformationen aus einem gestohlenen AP ermöglicht einem Angreifer unbefugten Zugriff auf das drahtlose Netzwerk. ",
      "asvs": "BSI IT-Grundschutz NET.3.2 Wireless LAN, Gefährdung NET.3.2.A4 Diebstahl eines Access Points.",
      "action": "Physische Installation von Access Points sichern",
      "mitigation": "Sichern Sie alle @Network:WLAN Access Points physisch, insbesondere solche in öffentlichen oder halböffentlichen Bereichen, mit diebstahlsicheren Gehäusen, Sicherheitskabeln oder durch Installation an verdeckten Orten (z. B. über einer Decke). ",
      "check": "Sind @Network:WLAN Access Points in öffentlichen Bereichen physisch gegen Diebstahl gesichert? Sind auf den APs gespeicherte sensible Anmeldeinformationen auf ein Minimum beschränkt und geschützt? Gibt es einen dokumentierten Prozess für die Außerbetriebnahme und Entsorgung von Netzwerkhardware?",
      "detectionLogic": "Dieses Risiko wird für jedes `technical_asset` vom Typ `physical` ausgelöst, das sowohl mit `@component:@Network:WLAN-access-point` als auch mit `@location:public-area` getaggt ist. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn sich ein physischer AP in einem öffentlichen Bereich ohne modellierte kompensierende Kontrollen befindet. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn sich das Asset zwar als in einem `@location:public-area` befindlich getaggt ist, aber in Wirklichkeit in einem verschlossenen Schrank, hinter einer permanent verschlossenen Tür oder anderweitig physisch gesichert ist, was im Bedrohungsmodell nicht erfasst ist. Das Modell abstrahiert die physische Sicherheit in ein einfaches Standort-Tag."
    },
    "inadequate-@Network:WLAN-planning": {
      "title": "Unzureichende @Network:WLAN-Planung (basierend auf BSI NET.2.1)",
      "description": "Fehler bei der Planung von Informationstechnologie-Einsätzen erweisen sich oft als besonders schwerwiegend, da sie leicht weit verbreitete Sicherheitslücken schaffen können. ",
      "impact": "Eine schlechte @Network:WLAN-Planung kann zur Kompromittierung der Datenvertraulichkeit durch Abhören von unverschlüsseltem oder schwach verschlüsseltem Verkehr führen. ",
      "asvs": "BSI IT-Grundschutz NET.2.1 @Network:WLAN-Betrieb (siehe auch NET.2.2 @Network:WLAN-Nutzung)",
      "action": "Ein umfassendes @Network:WLAN-Sicherheits- und Bereitstellungskonzept entwickeln und umsetzen",
      "mitigation": "Vor der Bereitstellung sollte ein formales @Network:WLAN-Konzept erstellt werden. Dieses Konzept muss die Verwendung starker, hochmoderner Verschlüsselungs- und Authentifizierungsprotokolle (z. B. WPA3 mit einem starken Pre-Shared Key oder vorzugsweise WPA3-Enterprise mit 802.1X/EAP-TLS) festlegen. ",
      "check": "Gibt es einen dokumentierten @Network:WLAN-Sicherheits- und Bereitstellungsplan? Schreibt er eine starke Verschlüsselung (WPA2/WPA3) vor und verbietet veraltete Protokolle? ",
      "detectionLogic": "Diese Regel löst Risiken für jede Kommunikationsverbindung aus, die als `@Network:WLAN-transport` getaggt ist und kein verschlüsseltes Anwendungsschichtprotokoll (wie HTTPS, FTPS usw.) verwendet. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als hoch angesehen, wenn sensible Daten ohne Verschlüsselung auf Anwendungsebene über ein @Network:WLAN übertragen werden, da ein Angreifer nur Zugriff auf das drahtlose Medium erlangen muss. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn der zugrunde liegende @Network:WLAN-Transport durch im Modell nicht sichtbare Mechanismen, wie z. B. WPA3-Enterprise mit obligatorischem EAP-TLS und robuster Netzwerksegmentierung, streng gesichert ist. "
    },
    "unauthorized-wlan-access-point": {
      "title": "Unbefugter WLAN Access Point mit dem internen Netzwerk verbunden",
      "description": "Wenn ein Mitarbeiter einen nicht autorisierten oder unsicher konfigurierten drahtlosen Zugangspunkt mit einem internen Netzwerksegment verbindet, kann dies zu schwerwiegenden Sicherheitsproblemen führen. ",
      "impact": "Ein nicht autorisierter Zugangspunkt kompromittiert den Netzwerkperimeter und setzt interne Systeme und Daten unbefugtem Zugriff aus. ",
      "asvs": "V13.1.2: Überprüfen Sie, ob interne Netzwerksegmente, die sensible Daten enthalten, durch Firewalls und logische Zugriffskontrollen von anderen Netzwerksegmenten getrennt sind.",
      "action": "Netzwerkzugangskontrolle implementieren und nicht autorisierte Hardware verbieten",
      "mitigation": "Implementieren Sie technische Kontrollen wie IEEE 802.1X Network Access Control (NAC) an allen Netzwerk-Switch-Ports, um zu verhindern, dass nicht autorisierte Geräte Netzwerkzugriff erhalten. ",
      "check": "Sind Netzwerkzugangskontrollen (wie 802.1X) an allen für Benutzer zugänglichen Netzwerk-Ports implementiert? Gibt es regelmäßige, automatisierte Scans nach nicht autorisierten drahtlosen Zugangspunkten? Gibt es eine klare, kommunizierte Richtlinie gegen das Anschließen nicht autorisierter Geräte?",
      "detectionLogic": "Dieses Risiko wird durch die Erkennung direkter Kommunikationsverbindungen von Assets in nicht vertrauenswürdigen oder internetzugänglichen Zonen zu Assets in vertrauenswürdigen, internen Netzwerkgrenzen identifiziert, ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Diese Regel könnte ein False Positive auslösen, wenn das Modell legitimerweise eine direkte, hochprivilegierte Verbindung über Netzwerkgrenzen hinweg darstellt (z. B. einen sicheren administrativen Tunnel), der nicht explizit als typischer Perimeterservice modelliert ist. "
    },
    "insufficient-authentication-mechanisms": {
      "title": "Schwache oder fehlende Authentifizierungsmechanismen",
      "description": "Wenn Authentifizierungsmethoden und -mechanismen für Kommunikationsverbindungen fehlen oder unzureichend sind, ",
      "impact": "Die Ausnutzung schwacher oder fehlender Authentifizierung kann zu unbefugtem Zugriff, Datenschutzverletzungen und Session-Hijacking führen. ",
      "asvs": "V4.2 (Authentifizierung), V7.1 (Netzwerk)",
      "action": "Starke, verschlüsselte Authentifizierung durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle Kommunikationsverbindungen, insbesondere solche, die Trust Boundaries überschreiten oder sensible Daten transportieren, ",
      "check": "Überprüfen Sie alle Kommunikationsverbindungen im Modell. Haben welche die Authentifizierung auf ",
      "detectionLogic": "Diese Regel prüft alle Kommunikationsverbindungen. Sie löst ein Risiko aus, wenn eine Verbindung die Authentifizierung auf ",
      "riskAssessment": "Die Auswirkung wird durch die höchste Vertraulichkeit und Integrität der über die Verbindung übertragenen Daten-Assets bestimmt. ",
      "falsePositives": "Ein Risiko kann ein False Positive sein, wenn andere kompensierende Kontrollen existieren, die nicht modelliert sind, wie z. B. physische Netzwerkisolation oder ein Service Mesh, das transparent mTLS hinzufügt. In solchen Fällen sollte das Risiko mit Begründung akzeptiert oder durch Modellierung der kompensierenden Kontrolle gemindert werden."
    },
    "insecure-@Network:WLAN-configuration": {
      "title": "Unsichere @Network:WLAN-Konfiguration",
      "description": "Access Points und andere @Network:WLAN-Komponenten (z. B. @Network:WLAN-Controller) bieten eine Vielzahl von Konfigurationseinstellungen, insbesondere in Bezug auf Sicherheitsfunktionen. ",
      "impact": "Fehlkonfigurationen von @Network:WLAN-Komponenten können zu unverschlüsselter Datenübertragung führen, was es Angreifern ermöglicht, sensible Informationen abzufangen (Verletzung der Vertraulichkeit), ",
      "asvs": "V14.2.1: Überprüfen Sie, dass alle Netzwerkverbindungen authentifizierte Verschlüsselung (z. B. TLS) verwenden.",
      "action": "@Network:WLAN-Komponenten sicher konfigurieren und verschlüsselte Kommunikation durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle @Network:WLAN-Komponenten so konfiguriert sind, dass sie starke, moderne Sicherheitsprotokolle wie WPA3 oder WPA2 mit AES-Verschlüsselung verwenden. Deaktivieren Sie veraltete Protokolle wie WEP, WPA und Funktionen wie WPS (Wi-Fi Protected Setup). ",
      "check": "Sind alle @Network:WLAN-Komponenten für die Verwendung von WPA3/WPA2-AES konfiguriert? Sind schwache Protokolle und WPS deaktiviert? ",
      "detectionLogic": "Diese Regel wird für jedes technische Asset ausgelöst, das als ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als hoch angesehen für unverschlüsselten @Network:WLAN-Verkehr, da Sniffing-Tools weit verbreitet sind. Die Auswirkung hängt direkt von der Sensitivität (Vertraulichkeit und Integrität) der über die unsichere Verbindung übertragenen Daten-Assets ab. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn das @Network:WLAN in einer physisch gesicherten, isolierten Umgebung ohne unbefugten Zugriff eingesetzt wird, "
    },
    "weak-@Network:WLAN-security": {
      "title": "Schwache @Network:WLAN-Verschlüsselung / Klartextverkehr",
      "description": "@Network:WLAN-Komponenten sind im Auslieferungszustand oft mit wenigen oder keinen aktivierten Sicherheitsmechanismen konfiguriert. ",
      "impact": "Wenn für ein @Network:WLAN schwache oder keine Verschlüsselung verwendet wird, kann ein Angreifer den Datenverkehr (einschließlich Anmeldeinformationen und Sitzungs-Cookies) abhören, was zur Preisgabe sensibler Informationen und potenzieller Kontoübernahme führt.",
      "asvs": "ASVS V14.2.1 & V9.1: Kommunikation während der Übertragung mit starken, peer-authentifizierten Protokollen verschlüsseln; veraltete/schwache Chiffrensuiten und Protokolle deaktivieren.",
      "action": "Starke WLAN-Verschlüsselung erzwingen und Klartextprotokolle eliminieren",
      "mitigation": "Stellen Sie sicher, dass alle @Network:WLAN-Komponenten WPA3 oder mindestens WPA2-Enterprise (802.1X) mit starken EAP-Methoden erzwingen; vermeiden Sie WPA2-PSK, es sei denn, Sie verwenden lange, eindeutige Passphrasen. ",
      "check": "Ist das @Network:WLAN für WPA3 oder WPA2-Enterprise (802.1X) konfiguriert? Sind WEP und WPA/TKIP deaktiviert? Wenn PSK verwendet wird, ist es eindeutig und ≥20 Zeichen lang? Ist WPS deaktiviert? ",
      "detectionLogic": "Wird ausgelöst, wenn ein mit `@Network:WLAN` getaggtes technisches Asset an einer Kommunikationsverbindung teilnimmt, deren `protocol` von der `isProtocolEncrypted`-Prüfung der Plattform als Klartext bewertet wird. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei Klartext-WLAN-Verkehr sehr hoch, da passives Abhören trivial ist. Die Auswirkung skaliert mit der höchsten Vertraulichkeit der auf der betroffenen Verbindung beobachteten Daten: ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn das scheinbare Klartextprotokoll vollständig in einem modellierten sicheren Tunnel gekapselt ist (z. B. wenn ein VPN-Verbindungsprotokoll explizit auf der Verbindung dargestellt wird)."
    },
    "eavesdropping-on-insecure-@Network:WLAN": {
      "title": "Abhören unsicherer @Network:WLAN-Kommunikation (BSI NET.2.1)",
      "description": "Da die drahtlose Kommunikation (@Network:WLAN) ein gemeinsam genutztes Medium ist, können darüber übertragene Daten abgefangen und aufgezeichnet werden. Wenn diese Daten nicht oder nur unzureichend verschlüsselt sind, kann die Nutzlast gelesen werden. Darüber hinaus erstrecken sich die Funkwellen von drahtlosen Netzwerken oft über die physischen Grenzen eines",
      "impact": "Wenn sensible Daten unverschlüsselt über ein drahtloses Netzwerk übertragen werden, kann ein Angreifer sie abfangen und lesen, was zu einer Verletzung der Vertraulichkeit führt. Dies kann Benutzeranmeldeinformationen, persönliche Daten, Sitzungsinformationen oder Geschäftsgeheimnisse preisgeben und zu Identitätsdiebstahl, finanziellen Verlusten oder weiteren Systemkompromittierungen führen.",
      "asvs": "V11.1.1: Überprüfen Sie, ob die gesamte Kommunikation zwischen Komponenten während der Übertragung verschlüsselt ist.",
      "action": "Starke Ende-zu-Ende-Verschlüsselung für alle @Network:WLAN-Kommunikationen und WPA3 im WLAN selbst durchsetzen.",
      "mitigation": "Alle Kommunikationsverbindungen, die ein drahtloses Netzwerk durchqueren, müssen ein Protokoll verwenden, das eine starke Ende-zu-Ende-Verschlüsselung bietet (z. B. HTTPS, WSS, JDBC-verschlüsselt, FTPS, SFTP). Für die @Network:WLAN-Infrastruktur selbst verwenden Sie starke Sicherheitsprotokolle wie WPA3 mit robuster Authentifizierung. Vermeiden Sie die Verwendung veralteter oder gebrochener Protokolle wie WEP. Wenn ein Anwendungsprotokoll von Natur aus unverschlüsselt ist, muss es durch eine sichere Schicht wie ein VPN getunnelt werden, wenn es ein drahtloses Netzwerk durchqueren muss. Die Verwendung eines VPN kann durch Setzen des Flags `vpn: true` auf der Kommunikationsverbindung modelliert werden.",
      "check": "Überprüfen Sie alle als ",
      "detectionLogic": "Diese Regel sucht nach Kommunikationsverbindungen, die explizit mit `@Network:WLAN` getaggt sind. Für jede solche Verbindung prüft sie `isProtocolEncrypted(link.protocol)` und das `link.vpn`-Flag. Wenn das Protokoll nicht verschlüsselt ist und die Verbindung kein VPN durchquert, wird ein Risiko generiert. Verbindungen, die verschlüsselte Anwendungsprotokolle (z. B. HTTPS/WSS/JDBC-verschlüsselt/FTPS/SFTP) verwenden oder explizit mit `vpn: true` modelliert sind, werden ignoriert. Die Auswirkung wird basierend auf `link.getHighestConfidentiality()` skaliert und der Risikotitel benennt die Quell- und Ziel-Assets.",
      "riskAssessment": "Die Wahrscheinlichkeit ist sehr hoch, wenn ein unverschlüsseltes Protokoll über ein @Network:WLAN verwendet wird, da Abhörwerkzeuge weit verbreitet und effektiv sind. Die Auswirkung hängt direkt von der Sensibilität (Vertraulichkeit) der übertragenen Daten-Assets ab. Die Übertragung von ",
      "falsePositives": "Ein False Positive kann auftreten, wenn das Modell eine Verbindung fälschlicherweise als `@Network:WLAN` taggt, obwohl sie vollständig in einem kabelgebundenen Netzwerk verläuft, oder wenn die Verschlüsselung durch einen nicht modellierten Out-of-Band-Tunnel bereitgestellt wird (z. B. ein Site-to-Site-VPN, das nicht auf der Verbindung dargestellt ist). Dieses Risiko wird als gemindert betrachtet, wenn die Verbindung mit dem `vpn: true`-Flag modelliert ist, auch wenn das Anwendungsprotokoll unverschlüsselt ist."
    },
    "rogue-access-point-net-2-1": {
      "title": "Kommunikation über bösartigen/Evil-Twin Access Point (BSI NET.2.1)",
      "description": "Ein Angreifer kann einen Teil einer drahtlosen Netzwerkinfrastruktur nachahmen, indem er einen bösartigen Access Point (ein ",
      "impact": "Eine erfolgreiche Ausnutzung kann Anmeldeinformationen, Sitzungstoken und sensible Nutzdaten offenlegen (Vertraulichkeit) und die Manipulation während der Übertragung oder ",
      "asvs": "BSI IT-Grundschutz NET.2.1 — WLAN-Betrieb",
      "action": "Starke drahtlose Sicherheit und sichere Kommunikationskanäle implementieren",
      "mitigation": "Erzwingen Sie ein sicheres VPN für alle Verbindungen, die von Clients in potenziell nicht vertrauenswürdigen Netzwerken ausgehen, um den Datenverkehr Ende-zu-Ende zu schützen. ",
      "check": "Überprüfen Sie von Clients ausgehende Kommunikationsverbindungen: Wird ein VPN in nicht vertrauenswürdigen Netzwerken erzwungen? Überprüfen Sie bei verwalteten WLANs WPA3 oder WPA2-Enterprise ",
      "detectionLogic": "Kennzeichnet Kommunikationsverbindungen, die von technischen Client-Assets (z. B. Mobile App, Laptop, IoT-Gerät) ausgehen, bei denen die Verbindung nicht ",
      "riskAssessment": "Die Wahrscheinlichkeit ist bei mobilen/roaming Clients hoch. Die Auswirkung skaliert mit den Vertraulichkeits-/Integritätsanforderungen der über die Verbindung übertragenen Daten. ",
      "falsePositives": "Kann ein False Positive sein für ausschließlich kabelgebundene Umgebungen oder wenn kompensierende Kontrollen (z. B. immer aktives Unternehmens-VPN mit Geräte-"
    },
    "unprotected-access-point-backend-connection": {
      "title": "Physisch zugänglicher AP mit unverschlüsseltem kabelgebundenem Backhaul",
      "description": "Wenn ein drahtloser Access Point (AP) an einem Ort installiert ist, an dem unbefugte Personen physisch darauf zugreifen können, kann ein Angreifer das kabelgebundene Backhaul (z. B. Ethernet) zwischen dem AP und der Switching-Infrastruktur anzapfen oder ein Gerät einfügen. Dies ermöglicht passives Sniffing oder aktive MitM-Angriffe auf den gesamten Datenverkehr, der den AP durchläuft, unabhängig von der WLAN-Luftschnittstellenverschlüsselung (WPA2/WPA3).",
      "impact": "Führt zur Offenlegung und potenziellen Manipulation von Daten, die den AP durchlaufen, und umgeht die WLAN-Verschlüsselung. Die Auswirkung skaliert mit der höchsten Vertraulichkeit der Daten auf der betroffenen Verbindung; sensible Daten können zu schweren oder kritischen Auswirkungen führen.",
      "asvs": "V14.1.1 Netzwerkarchitekturdesign und -segmentierung",
      "action": "Physische Platzierung sichern und den kabelgebundenen Backhaul des AP verschlüsseln",
      "mitigation": "Installieren Sie Access Points an physisch sicheren oder manipulationssicheren Orten (verschlossene Räume/Decken/Gehäuse). Verschlüsseln Sie das kabelgebundene Backhaul (z. B. IEEE 802.1AE MACsec am Switchport oder Tunneling des AP-Verkehrs über IPsec/VPN zu einem Controller). Erzwingen Sie Port-Sicherheit/802.1X am Switchport, deaktivieren Sie ungenutzte Ports und stellen Sie sicher, dass der Verwaltungszugriff sichere Kanäle (SSH/TLS) verwendet.",
      "check": "Sind irgendwelche Access Points öffentlich zugänglich (Flure, Lobbys, Außenbereiche)? Ist der kabelgebundene Uplink vom AP zum Switch verschlüsselt (z. B. MACsec oder VPN)? Erzwingen Switchports 802.1X/Port-Sicherheit und sind APs so montiert, dass sie Manipulation/Diebstahl abschrecken?",
      "detectionLogic": "Kennzeichnet technische Assets, die als Access Points modelliert sind (Technologie ",
      "riskAssessment": "Wahrscheinlichkeit ist ",
      "falsePositives": "Kann ein False Positive sein, wenn kompensierende Kontrollen vorhanden sind, aber nicht im Modell dargestellt werden – z. B. MACsec am Switchport aktiviert (eine Layer-2-Kontrolle, die normalerweise nicht als Protokoll modelliert wird), Backhaul-VPN-Tunneling oder kontinuierliche physische Überwachung und Manipulationserkennung."
    },
    "improper-ad-forest-security-boundary": {
      "title": "Unsachgemäße AD-Forest-Sicherheitsgrenze",
      "description": "In Active Directory Domain Services (AD DS) ist der Forest die ultimative Sicherheitsgrenze, nicht die Domäne. ",
      "impact": "Eine vollständige Kompromittierung eines AD-Forests gibt einem Angreifer die Kontrolle über alle Objekte, die zu allen enthaltenen Domänen gehören, einschließlich aller Benutzerkonten, Administratorkonten und Computerkonten. ",
      "asvs": "V1.4.1: Überprüfen Sie, ob eine angemessene Funktionstrennung und das Prinzip der geringsten Rechte zwischen Komponenten, Diensten und Anwendungen bestehen.",
      "action": "Segmentierung auf Forest-Ebene für Hochsicherheitszonen implementieren",
      "mitigation": "Für Umgebungen, die eine echte Sicherheitsisolation erfordern (z. B. die Trennung von Produktion und Entwicklung), verwenden Sie separate, nicht vertrauende AD-Forests. ",
      "check": "Überprüfen Sie die AD-Topologie. Sind unterschiedliche Sicherheitszonen (wie Produktion, Staging, Entwicklung) durch Domänen innerhalb desselben Forests getrennt? ",
      "detectionLogic": "Diese Regel identifiziert Trust Boundaries, die als `@AD:Forest` getaggt sind und mehr als eine verschachtelte Trust Boundary enthalten, die als `@AD:Domain` getaggt ist. ",
      "riskAssessment": "Die Auswirkung einer Forest-Kompromittierung ist fast immer ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn der Multi-Domain-Forest für einen einzigen, einheitlichen Sicherheitskontext vorgesehen ist und ein robustes, gut gepflegtes administratives Tiering-Modell strikt durchgesetzt wird. "
    },
    "active-directory-compromise-via-ntdsdit": {
      "title": "Kompromittierung von Active Directory durch Diebstahl von ntds.dit",
      "description": "Eine Kernkomponente von Active Directory, die ntds.dit-Datenbank, enthält Passwort-Hashes für alle Domänenbenutzer und wird auf jedem beschreibbaren Domänencontroller (RWDC) repliziert. Angreifer, die Zugriff auf diese Datei erhalten, sei es von einem laufenden System oder einem unsicheren @Backup:Target, können Anmeldeinformationen extrahieren. Dieses Risiko wird erheblich verstärkt, wenn Domänencontroller virtualisiert sind und einen physischen Host mit weniger sicheren Systemen teilen, da eine Kompromittierung des Hosts oder seiner Administratorkonten einen direkten Weg zu den virtuellen DC-Dateien bieten kann.",
      "impact": "Eine erfolgreiche Ausnutzung führt zur vollständigen Kompromittierung der Active Directory-Domäne und potenziell des gesamten Forests. Angreifer können administrative Konten erstellen, auf jedes mit der Domäne verbundene System zugreifen, sensible Daten entschlüsseln und vollständige Persistenz erreichen. Dies stellt ein kritisches Versagen der Vertraulichkeit, Integrität und Verfügbarkeit dar.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz APP.2.2 ",
      "action": "Domänencontroller isolieren und härten",
      "mitigation": "Sichern Sie alle Domänencontroller physisch und logisch. Verwenden Sie dedizierte, gehärtete Virtualisierungshosts für virtualisierte DCs oder stellen Sie eine strikte Netzwerk- und administrative Trennung von anderen VMs sicher. Implementieren Sie sichere @Backup:Target-Verfahren mit verschlüsseltem, zugriffsgesteuertem Speicher für @Backup:Target-Dateien. Beschränken und überwachen Sie den administrativen Zugriff auf die Domänencontroller und ihre Virtualisierungshosts streng.",
      "check": "Laufen Domänencontroller auf dedizierten physischen oder virtuellen Hosts? Sind sie bei Virtualisierung von anderen, weniger kritischen VMs isoliert? Werden die Administratorkonten des Virtualisierungshosts streng kontrolliert und überwacht? Ist der @Backup:Target-Prozess für DCs dokumentiert, sicher und getestet?",
      "detectionLogic": "Identifiziert technische Assets, die als LDAP-Identitätsspeicher konfiguriert sind (typischerweise Active Directory-Domänencontroller). Das Risiko ist erhöht, wenn diese kritischen Assets virtualisiert sind und auf einer gemeinsam genutzten Laufzeitumgebung neben anderen, potenziell weniger sicheren, technischen Assets laufen.",
      "riskAssessment": "Die Auswirkung wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die gemeinsam genutzte Virtualisierungsumgebung kompensierende Kontrollen aufweist, die im Modell sichtbar sind, wie z. B. erweiterte Hypervisor-Sicherheit, Mikrosegmentierung und strikte administrative Trennung zwischen dem DC und anderen VMs."
    },
    "cached-privileged-credentials": {
      "title": "Privilegierte Anmeldeinformationen auf Nicht-PAW-Systemen zwischengespeichert (BSI APP.2.2)",
      "description": "Wenn sich hochprivilegierte Domänenkonten (z. B. Domain-Admins) an Standardservern oder -clients anmelden, können ihre Anmeldeinformationen auf diesen Systemen zwischengespeichert werden (z. B. im LSASS-Speicher). Die Kompromittierung eines solchen Systems ermöglicht den Diebstahl von Anmeldeinformationen und eine schnelle Rechteausweitung in der gesamten Domäne/dem Forest.",
      "impact": "Die Kompromittierung eines Nicht-PAW-Systems, das privilegierte Anmeldeinformationen zwischengespeichert hat, kann durch laterale Bewegung und Identitätsdiebstahl zu einer vollständigen Kompromittierung der Domäne und potenziell des Forests führen.",
      "asvs": "MITRE ATT&CK: T1003.001 (OS Credential Dumping: LSASS Memory); Verwandt: T1550 (Use of Stolen Credentials)",
      "action": "Nur-PAW-Anmeldung für Tier-0-Rollen und ein striktes gestuftes Admin-Modell durchsetzen; JIT/JEA-Administration und Remote-Workflows bevorzugen, die keine Anmeldeinformationen auf Standard-Hosts preisgeben.",
      "mitigation": "Verbieten Sie die Verwendung hochprivilegierter Konten auf allen anderen als dedizierten, gehärteten Tier-0-Hosts (Domänencontroller und Privileged Access Workstations). Implementieren Sie ein gestuftes Zugriffsmodell, bei dem administrative Konten für eine Stufe nicht auf vertrauensärmeren Stufen verwendet werden können. Verwenden Sie separate Admin- und Alltags-Konten. Fordern Sie PAWs für die gesamte Domänenadministration. Aktivieren Sie Windows Defender Credential Guard und LSA-Schutz (RunAsPPL) auf Endgeräten. Bevorzugen Sie Remote Credential Guard/PowerShell Just-Enough-Administration, um Anmeldeinformationen auf Zielen zu vermeiden.",
      "check": "Sind privilegierte Domänenanmeldungen technisch auf PAWs/DCs beschränkt? Ist ein gestuftes Zugriffsmodell (Tier-0/1/2) dokumentiert und durchgesetzt? Werden PAWs gefordert und überprüft? Sind Credential Guard und LSA-Schutz aktiviert? Sind JIT/JEA-Prozesse vorhanden, um dauerhafte hochprivilegierte Sitzungen zu vermeiden?",
      "detectionLogic": "Markiert, wenn eine Kommunikationsverbindung explizit als hochprivilegierte Domänenanmeldung getaggt ist (z. B. ",
      "riskAssessment": "Die Auswirkung ist standardmäßig „Sehr hoch“ aufgrund der potenziellen Übernahme der Identitätsinfrastruktur. Die Wahrscheinlichkeit ist bei Client-Quellen (Benutzer surfen/mailen) höher und bei gehärteten Servern niedriger. Die Schwere wird aus diesen Faktoren berechnet.",
      "falsePositives": "Kann ein False Positive sein, wenn die Quelle tatsächlich eine gehärtete PAW ist, aber nicht als "
    },
    "uncontrolled-domain-join": {
      "title": "Unkontrollierter Beitritt zur Domäne durch authentifizierte Benutzer",
      "description": "In der Standardkonfiguration von Active Directory Domain Services (AD DS) ist es jedem authentifizierten Benutzer erlaubt, bis zu zehn IT-Systeme der Domäne beizutreten, auch ohne administrative Privilegien innerhalb von AD DS zu besitzen. ",
      "impact": "Diese Fehlkonfiguration kann von einem Angreifer mit Standard-Benutzeranmeldeinformationen ausgenutzt werden, um Privilegien innerhalb der Domäne zu eskalieren. Durch das Hinzufügen einer kompromittierten Maschine zur Domäne kann der Angreifer potenziell Anmeldeinformationen abfangen, sich lateral bewegen und Zugang zu sensiblen Ressourcen erhalten, was letztendlich die gesamte Domäne kompromittiert. Es untergräbt auch die IT-Governance, indem es nicht konforme oder nicht verwaltete Systeme in das vertrauenswürdige Netzwerk lässt.",
      "asvs": "CIS Microsoft Windows Server Benchmark: 2.2.1 Sicherstellen ",
      "action": "Berechtigungen für den Domänenbeitritt einschränken",
      "mitigation": "Setzen Sie das Active Directory-Attribut `ms-DS-MachineAccountQuota` für die Domäne auf 0. Dies verhindert, dass nicht-administrative Benutzer Computerkonten hinzufügen. ",
      "check": "Überprüfen Sie, ob das Attribut `ms-DS-MachineAccountQuota` in AD DS auf 0 gesetzt ist. Überprüfen Sie die ",
      "detectionLogic": "Dieses Risiko wird für jedes in-scope technische Asset ausgelöst, das als LDAP-basierter Identitätsspeicher identifiziert wird, was typischerweise einen Active Directory Domain Controller darstellt. ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn der `ms-DS-MachineAccountQuota` manuell auf 0 gesetzt und die entsprechenden Benutzerrechte eingeschränkt wurden, was allein durch das Bedrohungsmodell nicht überprüft werden kann und eine manuelle Bestätigung erfordert."
    },
    "improper-trust-relationship-evaluation": {
      "title": "Unsachgemäße Bewertung von Vertrauensstellungen (BSI APP.2.2.A6)",
      "description": "Vertrauensstellungen zwischen Domänen und Forests (dargestellt als separate Netzwerk-Trust-Boundaries) ermöglichen Konten aus einer Boundary den Zugriff auf Ressourcen in einer anderen. ",
      "impact": "Ein Angreifer könnte eine schwache oder falsch konfigurierte Vertrauensstellung ausnutzen, um von einer Umgebung mit niedrigerer Sicherheit in eine mit höherer Sicherheit zu eskalieren. ",
      "asvs": "BSI IT-Grundschutz APP.2.2.A6: Sichere Konfiguration von Vertrauensstellungen",
      "action": "Vertrauensstellungen überprüfen und sichern",
      "mitigation": "Alle Vertrauensstellungen (d. h. Kommunikationsverbindungen, die Netzwerkgrenzen zwischen Identitätssystemen überschreiten) müssen regelmäßig auf ihre geschäftliche Notwendigkeit überprüft werden. ",
      "check": "Sind alle Kommunikationsverbindungen, die netzwerkebene Trust Boundaries zwischen identitätsbezogenen Assets überschreiten, notwendig? Ist die SID-Filterung für sie aktiviert? Wird bei Bedarf selektive Authentifizierung verwendet?",
      "detectionLogic": "Diese Regel identifiziert Kommunikationsverbindungen zwischen identitätsbezogenen technischen Assets (wie LDAP-Servern oder Identity Providern), die netzwerkebene Trust Boundaries überschreiten. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko wird als Anstoß für eine architektonische Überprüfung ausgelöst. Eine Vertrauensstellung könnte vollständig sicher und außerhalb des Modells dokumentiert sein. "
    },
    "outdated-ad-ds-functional-level-bsi": {
      "title": "Veraltete Active Directory-Funktionsebenen",
      "description": "Jede neue Generation von Windows Server bis einschließlich Windows Server 2016 hat zusätzliche Sicherheitsfunktionen und Verbesserungen für Active Directory Domain Services (AD DS) in Form von Domänen- und Forest-Funktionsebenen eingeführt. ",
      "impact": "Das Versäumnis, moderne Sicherheitsfunktionen in Active Directory zu verwenden, kann zu einer Kompromittierung der gesamten Domäne oder des Forests führen. Dies gefährdet die Vertraulichkeit, Integrität und Verfügbarkeit aller verwalteten Informationen (wie Benutzeranmeldeinformationen, Gruppenrichtlinien und Zugriffsrechte) und kann weitreichende Angriffe zur Rechteausweitung ermöglichen.",
      "asvs": "BSI IT-Grundschutz CON.3.A11 Verwendung einer aktuellen Version des Verzeichnisdienstes",
      "action": "Domänencontroller aktualisieren und Funktionsebenen anheben",
      "mitigation": "Alle Domänencontroller (DCs) sollten auf eine aktuelle, unterstützte Version von Windows Server migriert werden. Nachdem alle DCs aktualisiert wurden, müssen die Domänen- und Forest-Funktionsebenen auf die höchstmögliche Ebene angehoben werden. ",
      "check": "Laufen alle Domänencontroller auf einer aktuellen, unterstützten Version von Windows Server? Wurden die Domänen- und Forest-Funktionsebenen auf die höchste von allen DCs unterstützte Ebene angehoben? Sind moderne AD-Sicherheitsfunktionen aktiviert und konfiguriert?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Domänencontroller darstellen (Technologie `identity-store-ldap` oder `ldap-server`), die mit einer veralteten Windows Server-Version getaggt sind (z. B. `os:windows-server-2016` oder älter). Das Vorhandensein eines solchen Tags deutet darauf hin, dass das System nicht von den neuesten Active Directory-Sicherheitsverbesserungen profitieren kann.",
      "riskAssessment": "Die Auswirkung wird als sehr hoch angesehen, wenn das Asset mit hohen oder kritischen CIA-Werten bewertet wird, da die Kompromittierung eines Domänencontrollers typischerweise die gesamte von ihm verwaltete Umgebung kompromittiert. Die Wahrscheinlichkeit wird als wahrscheinlich angesehen, da Exploits gegen ältere AD-Versionen und -Konfigurationen gut dokumentiert und weithin bekannt sind.",
      "falsePositives": "Das Risiko könnte durch umfangreiche kompensierende Kontrollen gemindert werden, die im Modell nicht sichtbar sind, wie z. B. fortschrittliche Endpunkterkennung und -reaktion (EDR) auf den Domänencontrollern, strikte Netzwerksegmentierung der Verwaltungsinfrastruktur oder spezialisierte AD-Überwachungstools. Das zugrunde liegende Risiko fehlender integrierter Sicherheitsfunktionen bleibt jedoch bestehen."
    },
    "unnecessary-services-on-domain-controller": {
      "title": "Unnötige Dienste auf einem Domänencontroller",
      "description": "Das Ausführen zusätzlicher Dienste auf einem Domänencontroller (DC) neben den Identitätsdiensten (wie Active Directory) erhöht die Angriffsfläche dieser hochkritischen Komponente. ",
      "impact": "Wenn dieses Risiko ausgenutzt wird, könnte ein Angreifer die Kontrolle über das zentrale Identitäts- und Authentifizierungssystem erlangen, was zu einem vollständigen Verlust der Vertraulichkeit, Integrität und Verfügbarkeit für alle verbundenen Systeme und Daten führt. Dies stellt einen katastrophalen Sicherheitsvorfall dar.",
      "asvs": "Abgeleitet aus dem BSI IT-Grundschutz Kompendium, Baustein DIR.1: Verzeichnisdienste, insbesondere dem Prinzip der Minimierung der Angriffsfläche kritischer Infrastruktur.",
      "action": "Domänencontroller-Dienste isolieren",
      "mitigation": "Domänencontroller müssen als hochsensible, dedizierte Systeme behandelt werden. Installieren Sie keine Software oder Dienste, die nicht für das Funktionieren des Verzeichnisdienstes selbst unerlässlich sind. ",
      "check": "Überprüfen Sie alle als `IdentityStoreLDAP` modellierten technischen Assets. Befinden sie sich in einer `SharedRuntime`, die andere, nicht-identitätsbezogene technische Assets enthält? Wenn ja, ist dieses Risiko vorhanden.",
      "detectionLogic": "Diese Regel durchläuft alle `SharedRuntime`-Komponenten im Modell. Sie kennzeichnet jede Laufzeitumgebung, die ein technisches Asset der Technologie `IdentityStoreLDAP` (das einen DC darstellt) neben anderen nicht-identitätsbezogenen technischen Assets enthält. ",
      "riskAssessment": "Die Auswirkung der Kompromittierung eines Domänencontrollers wird durchweg als `VeryHigh` bewertet. Die Wahrscheinlichkeit einer Ausnutzung wird durch das Vorhandensein jedes zusätzlichen Dienstes erhöht, da jeder seine eigenen potenziellen Schwachstellen mit sich bringt. ",
      "falsePositives": "Die Regel könnte ein False Positive auslösen, wenn ein Dienst, der für den Betrieb oder die Überwachung des Verzeichnisdienstes wesentlich ist (z. B. ein spezifischer, gehärteter Sicherheitsagent), als separates technisches Asset innerhalb derselben Laufzeitumgebung modelliert wird. Diese Fälle sollten überprüft und können mit entsprechender Begründung akzeptiert werden."
    },
    "excessive-rights-delegation": {
      "title": "Übermäßige Rechtevergabe aufgrund unsystematischer Planung (BSI-basiert)",
      "description": "Wenn die Erstellung organisationsspezifischer Gruppen und die Delegation von Rechten an diese Gruppen oder einzelne Benutzerobjekte nicht systematisch geplant und umgesetzt werden, wird die Delegation schwer kontrollierbar. Dies kann weitaus mehr Zugriff gewähren als beabsichtigt, was von Dritten missbraucht werden kann. Ein Mangel an regelmäßiger Überprüfung der Zugriffsrechte für Gruppen und einzelne Benutzerobjekte kann das Problem weiter verschärfen. Ähnlich, wenn standardmäßige, hochprivilegierte Gruppen (z. B. ",
      "impact": "Die Vergabe übermäßiger Berechtigungen verstößt gegen das Prinzip der geringsten Rechte (Least Privilege). Dies kann zu unbefugtem Zugriff, Datenmanipulation, Informationspreisgabe oder Rechteausweitung durch böswillige Akteure oder durch versehentlichen Missbrauch durch legitime Benutzer führen. Dies bedroht direkt die Vertraulichkeit, Integrität und Verfügbarkeit aller vom kompromittierten Identitätssystem verwalteten Assets.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.4 (Identitäts- und Zugriffsmanagement), insbesondere Anforderungen wie ORP.4.A5 (Beantragung von Berechtigungen), ORP.4.A6 (Vergabe von Berechtigungen) und ORP.4.A19 (Rezertifizierung von Berechtigungen).",
      "action": "Systematische Zugriffskontrolle und regelmäßige Überprüfung implementieren",
      "mitigation": "Etablieren Sie einen formalen Prozess für die Beantragung, Genehmigung und Vergabe von Zugriffsrechten basierend auf dem Prinzip der geringsten Rechte. Vermeiden Sie die Delegation von Berechtigungen von breiten, mächtigen Standardgruppen (wie ",
      "check": "Gibt es einen dokumentierten Prozess für das Zugriffsrechtemanagement? Werden Zugriffsrechte regelmäßig überprüft (Rezertifizierung)? Wird die Verwendung übermäßig permissiver Standardgruppen für die Delegation vermieden? Basieren Rollen und Berechtigungen auf dem ",
      "detectionLogic": "Dieses Risiko wird erkannt, indem zentrale Identitätsmanagement-Assets (wie Identity Provider, LDAP-Server oder Identity Stores) identifiziert und auf eingehende Kommunikation von Assets geprüft werden, die mit Rollen verbunden sind, die typischerweise keine breiten administrativen Rechte haben sollten, wie z. B. ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als hoch angesehen, wenn IAM-Komponenten von Rollen wie ",
      "falsePositives": "Das Modell kann nicht zwischen einer ordnungsgemäß konfigurierten, am Prinzip der geringsten Rechte ausgerichteten Delegation und einer übermäßig permissiven unterscheiden. Dieses Risiko kennzeichnet ein potenziell gefährliches Architekturmuster. Die Bestätigung erfordert eine manuelle Überprüfung der tatsächlich im Ziel-Identitätsmanagementsystem konfigurierten Berechtigungen."
    },
    "legacy-authentication-in-ad-ds": {
      "title": "Unsichere Legacy-Authentifizierung in AD DS",
      "description": "Legacy-Authentifizierungsmechanismen in Active Directory Domain Services (AD DS), wie LAN Manager (LM) und NT LAN Manager (NTLM) v1, sind unsicher. Angreifer können sie unter bestimmten Bedingungen ausnutzen, um Privilegien zu erlangen und zu missbrauchen, ohne die Klartextpasswörter zu kennen, was potenziell zur Kompromittierung von Teilen der Domäne, der gesamten Domäne oder sogar des AD-Forests führen kann.",
      "impact": "Eine erfolgreiche Ausnutzung kann zu einer vollständigen Kompromittierung der Active Directory-Domäne führen und Angreifern hochrangige Privilegien gewähren. Dies ermöglicht ihnen, auf sensible Daten zuzugreifen, diese zu ändern oder zu löschen, betrügerische Konten zu erstellen und Sicherheitskontrollen in der gesamten an Active Directory angeschlossenen Netzwerkinfrastruktur zu deaktivieren.",
      "asvs": "BSI IT-Grundschutz APP.2.2.A9 (Schutz der Authentifizierung bei der Nutzung von AD DS)",
      "action": "Legacy-Authentifizierungsprotokolle deaktivieren",
      "mitigation": "Konfigurieren Sie Active Directory und alle verbundenen Systeme so, dass sie unsichere Legacy-Authentifizierungsprotokolle wie LM und NTLMv1 ablehnen. Erzwingen Sie die Verwendung moderner, sicherer Protokolle wie Kerberos oder NTLMv2. Verwalten Sie dies über Gruppenrichtlinienobjekte (GPOs), die auf Domänencontrollern sowie Mitgliedsservern und Arbeitsstationen angewendet werden. Audit-Protokolle sollten auf Legacy-Authentifizierungsversuche überwacht werden.",
      "check": "Gibt es Gruppenrichtlinien, die die LM- und NTLMv1-Authentifizierung explizit blockieren? Werden Audit-Protokolle auf Legacy-Authentifizierungsversuche überprüft? Wurde bei allen Clients und Diensten überprüft, ob sie moderne Authentifizierungsprotokolle unterstützen?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die Active Directory Domain Services darstellen (z. B. Technologien `identity-store-ldap`, `ldap-server`), die explizit als solche mit Legacy-Authentifizierung getaggt sind (z. B. über das `@LegacyAuth:used`-Tag).",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung ist hoch, da bekannte Werkzeuge existieren, um Pass-the-Hash- und andere verwandte Angriffe gegen diese schwachen Protokolle durchzuführen. Die Auswirkung wird als sehr hoch angesehen, da sie zu einer vollständigen Kompromittierung der Domäne führen kann, was typischerweise eine vollständige Kompromittierung der gesamten IT-Infrastruktur bedeutet.",
      "falsePositives": "Das Risiko kann ein False Positive sein, wenn kompensierende Kontrollen (wie strikte Netzwerksegmentierung und -überwachung) vorhanden sind, die eine Ausnutzung wirksam verhindern, obwohl die Deaktivierung der Protokolle die empfohlene primäre Minderung ist. Das Risiko hängt direkt von der Genauigkeit des `@LegacyAuth:used`-Tags ab."
    },
    "excessive-privileges-for-service-accounts": {
      "title": "Übermäßige Berechtigungen für Dienstkonten (basierend auf BSI APP.2.2)",
      "description": "Anwendungsdienstkonten erhalten manchmal die Rechte hochprivilegierter Gruppen (z. B. Domänenadministratoren) zur Vereinfachung der Bereitstellung oder des Testens, obwohl für den normalen Betrieb deutlich weniger Rechte erforderlich sind. Ein erhebliches Risiko entsteht, wenn diese Dienstkonten schwache Passwörter verwenden oder ihre Anmeldeinformationen kompromittiert werden. Selbst Konten, die nicht direkt in einer privilegierten Gruppe sind, können umfangreiche administrative Berechtigungen für viele Systeme erhalten, was ähnlich mächtige Rechte gewährt. Angreifer können diese überprivilegierten Konten missbrauchen, um sich lateral in der IT-Umgebung zu bewegen und ihre Privilegien zu eskalieren.",
      "impact": "Die Kompromittierung eines überprivilegierten Dienstkontos ermöglicht einem Angreifer, weitreichende Kontrolle über verbundene Systeme zu erlangen. Dies kann für laterale Bewegungen, den Zugriff auf oder die Manipulation kritischer Daten, die Bereitstellung von Ransomware oder die Erlangung einer vollständigen Domänenkompromittierung genutzt werden, was zu schwerwiegenden Auswirkungen auf Vertraulichkeit, Integrität und Verfügbarkeit führt.",
      "asvs": "BSI IT-Grundschutz APP.2.2 Active Directory Domain Services; OWASP Top 10 2021: A04: Unsicheres Design (Prinzip der geringsten Rechte)",
      "action": "Das Prinzip der geringsten Rechte (PoLP) auf alle Dienstkonten anwenden",
      "mitigation": "Stellen Sie sicher, dass alle Dienstkonten mit dem minimalen Satz an Berechtigungen laufen, die für ihre Funktion notwendig sind. Vermeiden Sie die Verwendung von Domänenadministrator- oder gleichwertigen hochprivilegierten Konten für Anwendungsdienste. Erstellen Sie stattdessen dedizierte, unprivilegierte Konten für jeden Dienst. Die Anmeldeinformationen für diese Konten sollten stark, einzigartig und sicher verwaltet werden, vorzugsweise durch einen automatisierten Tresor oder eine Geheimnisverwaltungslösung. Überprüfen Sie regelmäßig die Berechtigungen aller Dienstkonten.",
      "check": "Sind irgendwelche Dienstkonten Mitglieder von hochprivilegierten Gruppen wie ",
      "detectionLogic": "Diese Regel wird ausgelöst, wenn ein technisches Asset einen ",
      "riskAssessment": "Die Auswirkung wird durch die Sensitivität des Ziel-Assets bestimmt, auf das mit den hohen Privilegien zugegriffen werden kann. Wenn das Ziel ",
      "falsePositives": "Kann auftreten, wenn die hohe Berechtigungsstufe dokumentiert, formal als Risiko akzeptiert und für den Dienst absolut notwendig ist"
    },
    "reuse-of-local-credentials-on-shared-runtime": {
      "title": "Wiederverwendung lokaler Anmeldeinformationen auf mehreren Systemen (BSI-Stil)",
      "description": "Auch wenn ein IT-System einer Domäne beigetreten ist, können lokale Konten weiterhin für die Anmeldung verwendet werden. Wenn identische lokale Anmeldeinformationen – insbesondere für integrierte Administratorkonten – auf mehreren IT-Systemen verwendet werden (z. B. aufgrund eines gemeinsamen Basis-Images oder Bereitstellungsskripts), ermöglicht die Kompromittierung eines Systems einem Angreifer, sich bei den anderen mit denselben Anmeldeinformationen anzumelden.",
      "impact": "Dies erleichtert die laterale Bewegung erheblich und ermöglicht es einem Angreifer, sich in der gesamten Infrastruktur auszubreiten. Es erhöht das Risiko erheblich, dass ein Angreifer auf einem der Systeme hochprivilegierte Domänenanmeldeinformationen findet und missbraucht, was potenziell zur Kompromittierung der gesamten Domäne und ihres übergeordneten Forests führen kann.",
      "asvs": "BSI IT-Grundschutz: APP.2.2 Active Directory Domain Services; SYS.1.2.2 Windows Client Hardening. MITRE ATT&CK T1078 (Valid Accounts) & T1550.002 (Use Alternate Authentication Material: Pass the Hash).",
      "action": "Einzigartige lokale Administratorpasswörter sicherstellen",
      "mitigation": "Verwenden Sie eine zentralisierte Lösung wie Microsoft LAPS (Local Administrator Password Solution), um lokale Administratorpasswörter auf allen domänenangehörigen Systemen automatisch zu verwalten und zu randomisieren. Vermeiden Sie die Wiederverwendung von lokalen Kontopasswörtern über Systeme hinweg. Deaktivieren oder benennen Sie das integrierte lokale Administratorkonto nach Möglichkeit um und beschränken Sie seine Fähigkeit zur Remote-Anmeldung. Wenn dies implementiert ist, taggen Sie die relevanten ",
      "check": "Sind lokale Administratorpasswörter auf jedem System einzigartig? Ist ein Werkzeug wie LAPS bereitgestellt und korrekt konfiguriert? Gibt es eine Überwachung von Anmeldeereignissen mit lokalen Administratorkonten?",
      "detectionLogic": "Dieses Risiko wird für jede ",
      "riskAssessment": "Wahrscheinlichkeit wird als ",
      "falsePositives": "Ein False Positive kann auftreten, wenn die Systeme innerhalb der gemeinsam genutzten Laufzeitumgebung nachweislich über eindeutige lokale Anmeldeinformationen verfügen, obwohl sie Teil eines gemeinsamen Build-Prozesses sind. Um diesen Befund zu unterdrücken, taggen Sie die "
    },
    "insecure-password-storage-in-ad-ds": {
      "title": "Unsichere Passwortspeicherung in Active Directory Domain Services (AD DS)",
      "description": "Active Directory Domain Services (AD DS) speichert Passwortdarstellungen für die Abwärtskompatibilität (NTLM) unter Verwendung einer schwachen, ungesalzenen MD4-Hash-Funktion. ",
      "impact": "Eine erfolgreiche Ausnutzung ermöglicht es einem Angreifer, Benutzer- und Dienstkonten zu kompromittieren. Dies kann zu weit verbreitetem unbefugtem Zugriff, Rechteausweitung bis hin zum Domänenadministrator, Datenschutzverletzungen und einer vollständigen Kompromittierung der Windows-Domäne und aller verbundenen Systeme führen.",
      "asvs": "BSI TR-02102-1 (Kryptographische Mechanismen: Empfehlungen und Schlüssellängen); BSI IT-Grundschutz APP.2.2 (Active Directory Domain Services)",
      "action": "Domänencontroller und Passwortsicherheit härten",
      "mitigation": "Beschränken und überwachen Sie den administrativen Zugriff auf alle Domänencontroller (DCs) strikt. Implementieren Sie starke physische und Netzwerksicherheitskontrollen für DCs. ",
      "check": "Werden Domänencontroller als die wertvollsten Assets mit maximalen Sicherheitskontrollen behandelt? Ist der administrative Zugriff (insbesondere Domänenadministratoren) streng kontrolliert, minimiert und überwacht? ",
      "detectionLogic": "Dieses Risiko wird für jede ",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als ",
      "falsePositives": "Ein technisches Asset könnte fälschlicherweise als beschreibbarer AD DS-Domänencontroller identifiziert werden. Das Risiko könnte durch kompensierende Kontrollen (wie erweiterte Bedrohungserkennung und Zugriffskontrolle), die im Modell nicht sichtbar sind, als gemindert betrachtet werden."
    },
    "improper-@Network:WLAN-usage": {
      "title": "Unsachgemäße @Network:WLAN-Nutzung durch Benutzer (basierend auf BSI)",
      "description": "Wenn Benutzer nicht ausreichend über die Regeln zur korrekten Nutzung von WLANs informiert sind, können sie diese nicht einhalten. ",
      "impact": "Das Verbinden mit nicht vertrauenswürdigen Netzwerken ohne angemessene Schutzmaßnahmen kann zum Abhören sensibler Daten, Man-in-the-Middle-Angriffen, ",
      "asvs": "V6.2.1",
      "action": "Verschlüsselte Kommunikation und Benutzerbewusstsein durchsetzen",
      "mitigation": "Alle Kommunikationen von Client-Geräten sollten eine Verschlüsselung auf Transportebene (z. B. TLS) erzwingen. ",
      "check": "Sind alle Kommunikationsverbindungen von Client-Geräten standardmäßig verschlüsselt? Gibt es eine Richtlinie, die die Nutzung von VPN in nicht vertrauenswürdigen Netzwerken vorschreibt? ",
      "detectionLogic": "Dieses Risiko wird für Client-Systeme (z. B. mobile Apps, Browser, Desktop-Clients) ausgelöst, die dem Internet ausgesetzt sind ",
      "riskAssessment": "Die Auswirkung steht in direktem Zusammenhang mit den Vertraulichkeits- und Integritätsanforderungen der übertragenen Daten-Assets. ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die "
    },
    "negligent-disregard-of-security-measures": {
      "title": "Fahrlässige Missachtung von Sicherheitsmaßnahmen (BSI-Stil)",
      "description": "Aufgrund von Fahrlässigkeit und mangelnder Kontrolle setzen Einzelpersonen empfohlene oder vorgeschriebene Sicherheitsmaßnahmen manchmal nicht oder nur teilweise um. Dies kann dazu führen, dass Sicherheitskontrollen umgangen und Schwachstellen geschaffen werden.",
      "impact": "Wenn Sicherheitsrichtlinien auf Client-Geräten missachtet werden, kann dies zu schweren Sicherheitsvorfällen führen. Beispielsweise könnte die Verwendung eines Clients im nicht autorisierten Ad-hoc-WLAN-Modus Angreifern ermöglichen, sich direkt mit dem Gerät zu verbinden und Netzwerk-Firewalls zu umgehen. Dies könnte zu unbefugtem Zugriff auf vertrauliche Daten, Malware-Injektion oder Systemmanipulation führen und die Vertraulichkeit, Integrität und Verfügbarkeit des Assets und aller Daten, auf die es zugreifen kann, gefährden.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.2 (Konformität), insbesondere Anforderung ORP.2.A5 ",
      "action": "Sicherheitsrichtlinien durch technische Kontrollen durchsetzen",
      "mitigation": "Stellen Sie sicher, dass Sicherheitsrichtlinien nicht nur definiert, sondern auch durch technische Kontrollen durchgesetzt werden, wo immer möglich (z. B. Deaktivierung von Ad-hoc-WLAN, USB-Port-Zugriff oder nicht autorisierte Softwareinstallation über Endpunkt-Management-Lösungen wie MDM oder GPO). Implementieren Sie regelmäßige automatisierte Konformitätsprüfungen und Audits, um zu überprüfen, ob die Konfigurationen den Richtlinien entsprechen. Verwenden Sie Überwachungs- und Endpunkterkennungs- und -reaktionslösungen (EDR), um Richtlinienverstöße in Echtzeit zu erkennen und zu melden. Fördern Sie eine Sicherheitskultur, in der die Einhaltung verstanden und geschätzt wird.",
      "check": "Werden Sicherheitsrichtlinien für Client-Geräte technisch durchgesetzt? Gibt es regelmäßige Konformitätsprüfungen? Gibt es eine Überwachung auf Richtlinienverstöße? Hat die Organisation einen Prozess, um die Nichteinhaltung auf Endgeräten aktiv anzugehen?",
      "detectionLogic": "Dieses Risiko wird für in-scope technische Client-Assets (z. B. Desktops, mobile Apps, IoT-Geräte) ausgelöst, die sensible Daten (Restricted/Important oder höher) verarbeiten. Solche Geräte sind anfällig für benutzerinduzierte Fehlkonfigurationen, wenn sie nicht streng kontrolliert werden, was das Umgehen von Sicherheitsmaßnahmen ermöglicht.",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn die Organisation über starke, zentral verwaltete Endpunktsicherheitskontrollen (z. B. MDM, EDR, obligatorische GPOs) verfügt, die Benutzer daran hindern, sicherheitskritische Einstellungen zu ändern, auch wenn dies nicht explizit mit einem spezifischen Tag modelliert ist."
    },
    "unencrypted-@Network:WLAN-communication-net-2-2": {
      "title": "Unverschlüsselte Kommunikation über drahtlose Netzwerke (BSI NET.2.2)",
      "description": "Drahtlose Netzwerke (@Network:WLAN) sind ein gemeinsam genutztes Medium, was es unbefugten Parteien leicht macht, Datenverkehr abzufangen und aufzuzeichnen. ",
      "impact": "Das Abhören unverschlüsselter drahtloser Kommunikation kann zur Kompromittierung sensibler Informationen führen, einschließlich Anmeldeinformationen, persönlichen Daten und Geschäftsgeheimnissen. ",
      "asvs": "V4.0.3-9.1.1 (Überprüfen Sie, ob alle Kommunikationen zu oder zwischen Komponenten, die sensible Daten enthalten, während der Übertragung verschlüsselt sind)",
      "action": "Starke Verschlüsselung für alle drahtlosen Kommunikationen durchsetzen",
      "mitigation": "Stellen Sie sicher, dass alle drahtlosen Kommunikationsverbindungen Protokolle verwenden, die eine starke Ende-zu-Ende-Verschlüsselung bieten (z. B. HTTPS, WSS, SSH, jedes Protokoll, das TLS verwendet). ",
      "check": "Überprüfen Sie alle als ",
      "detectionLogic": "Diese Regel prüft auf jede Kommunikationsverbindung, die explizit als ",
      "riskAssessment": "Die Wahrscheinlichkeit, dass ein Angreifer ein unverschlüsseltes drahtloses Netzwerk abhört, wird als sehr hoch angesehen. ",
      "falsePositives": "Eine Kommunikationsverbindung könnte fälschlicherweise als "
    },
    "mac-address-tracking-over-wlan": {
      "title": "Erstellung von Bewegungsprofilen durch MAC-Adressen-Tracking über WLAN",
      "description": "In IEEE 802.11-basierten WLANs wird die MAC-Adresse eines Geräts mit jedem Datenframe übertragen. Da diese Adresse auf Schicht 2 unverschlüsselt gesendet wird, können Angreifer im selben Netzwerk sie erfassen. Dies kann zur Erstellung von Bewegungsprofilen mobiler Benutzer verwendet werden, zum Beispiel, wenn sie sich mit verschiedenen öffentlichen Hotspots verbinden. Dieses Risiko leitet sich von BSI IT-Grundschutz-Konzepten zur WLAN-Sicherheit ab.",
      "impact": "Ein Angreifer kann die physische Anwesenheit und Bewegung von Benutzern über verschiedene Standorte hinweg verfolgen, an denen sie WLAN nutzen, was zu einem erheblichen Verlust der Privatsphäre führt. Dies kann Lebensmuster (Zuhause, Arbeit, Reisen) aufdecken, die für Social Engineering, Stalking oder andere böswillige Aktivitäten genutzt werden könnten. Dies beeinträchtigt die Vertraulichkeit des Benutzers",
      "asvs": "Dies ist ein Problem des Netzwerkprotokolls der Schicht 2, das nicht direkt von OWASP ASVS oder MASVS abgedeckt wird, die sich auf höhere Anwendungsschichten konzentrieren. Es bezieht sich jedoch auf das umfassendere Prinzip des Schutzes von Daten während der Übertragung. Der relevanteste BSI-Kontext ist NET.2.2 WLAN-Nutzung, mit zugehörigen Anleitungen in NET.2.1 WLAN-Betrieb und SYS.3.2 Mobile Device Management.",
      "action": "MAC-Adressen-Randomisierung auf Client-Geräten durchsetzen",
      "mitigation": "Stellen Sie bei allen mobilen Client-Assets (Laptops, Mobiltelefone usw.) sicher, dass das Betriebssystem",
      "check": "Sind Client-Geräte, die sich mit externen oder öffentlichen Netzwerken verbinden, so konfiguriert, dass sie die MAC-Adressen-Randomisierung verwenden? Gibt es eine durchsetzbare Richtlinie (z. B. über MDM) oder ein Benutzerschulungsprogramm, um sicherzustellen, dass diese Einstellung aktiv ist?",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das als Client-Gerät identifiziert wird (z. B. Technologie ",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko kann als False Positive betrachtet werden, wenn bestätigt werden kann, dass das Client-Gerät ausschließlich vertrauenswürdige Netzwerke (z. B. Mobilfunkdaten oder ein Unternehmensnetzwerk mit obligatorischem VPN) verwendet und sich niemals mit Drittanbieter- oder öffentlichen WLANs verbindet. Es kann auch gemindert werden, wenn die MAC-Randomisierung auf dem Gerät nachweislich erzwungen wird."
    },
    "rogue-access-point": {
      "title": "Bösartiger Access Point (BSI NET.2.2)",
      "description": "Angreifer können einen Teil einer drahtlosen Netzwerkinfrastruktur nachahmen, indem sie ihren eigenen Access Point (AP) mit einem passend gewählten @Network:WLAN-Namen (SSID) in der Nähe eines @Network:WLAN-Clients installieren. Dieser gefälschte AP wird als ",
      "impact": "Wenn sich Clients mit einem bösartigen Access Point verbinden, kann ein Angreifer alle übertragenen Daten abfangen, lesen und ändern (Man-in-the-Middle). Dies kann zur Kompromittierung von Anmeldeinformationen, Sitzungstoken und sensiblen Daten führen und somit die Vertraulichkeit und Integrität verletzen. Der Angreifer könnte den Benutzer auch auf bösartige Websites umleiten oder den Zugang zu legitimen Diensten blockieren, was die Verfügbarkeit beeinträchtigt.",
      "asvs": "BSI IT-Grundschutz NET.2.2 WLAN-Nutzung",
      "action": "Starke gegenseitige Authentifizierung und Verwendung verschlüsselter Tunnel (VPN) durchsetzen",
      "mitigation": "Verwenden Sie eine starke unternehmensweite Authentifizierung für drahtlose Netzwerke, wie WPA2/WPA3-Enterprise mit 802.1X, die eine gegenseitige Authentifizierung über Client- und Serverzertifikate ermöglicht. Konfigurieren Sie Client-Geräte so, dass sie sich nicht automatisch mit unbekannten oder offenen Wi-Fi-Netzwerken verbinden und nur bestimmten, gesicherten SSIDs vertrauen. Für alle Verbindungen über nicht vertrauenswürdige oder öffentliche Netzwerke sollte der gesamte Datenverkehr durch einen vertrauenswürdigen VPN-Tunnel geleitet werden. Schulen Sie Benutzer über die Risiken der Verbindung mit nicht vertrauenswürdigem öffentlichem WLAN.",
      "check": "Wird eine gegenseitige Authentifizierung (z. B. über Client-Zertifikate) für die Kommunikationsverbindung erzwungen? Verbindet sich das Client-Gerät mit potenziell nicht vertrauenswürdigen Netzwerken (z. B. öffentlichen Hotspots)? Wird ein VPN zum Schutz der Daten während der Übertragung verwendet?",
      "detectionLogic": "Dieses Risiko wird für Client-Assets (z. B. mobile Apps, Desktop-Clients, IoT-Geräte) ausgelöst, die über eine Netzwerkverbindung ohne starke gegenseitige Authentifizierung (d. h. ohne Verwendung von Client-Zertifikaten) kommunizieren. Das Risiko wird als höher angesehen, wenn der Client explizit in einer öffentlichen Umgebung modelliert ist, mit dem Internet verbunden ist oder eine mobile Technologie darstellt. Die Verwendung eines VPN wird als vollständige Minderung für den Aspekt der Datenübertragung dieses Risikos betrachtet.",
      "riskAssessment": "Die Wahrscheinlichkeit ist hoch, wenn ein Client-Asset über ein Netzwerk ohne starke gegenseitige Authentifizierung wie Client-Zertifikate eine Verbindung herstellt. Die Wahrscheinlichkeit steigt, wenn der Client mobil ist oder explizit in einer nicht vertrauenswürdigen Umgebung platziert ist (wie im Internet oder als mit öffentlichem WLAN verbunden getaggt). Die Auswirkung wird durch die höchste Vertraulichkeit und Integrität der über die anfällige Verbindung übertragenen Daten-Assets bestimmt.",
      "falsePositives": "Dieses Risiko kann ein False Positive sein, wenn der modellierte Kommunikationspfad, obwohl er keine Client-Zertifikat-Authentifizierung aufweist, bekanntermaßen ausschließlich über ein physisch gesichertes, privates, kabelgebundenes Netzwerk betrieben wird, bei dem die Bedrohung durch einen bösartigen AP vernachlässigbar ist. Das Modell selbst unterscheidet nicht zwischen kabelgebundenen und drahtlosen Verbindungen, daher hebt dieses Risiko eine potenzielle Schwäche in jedem nicht-lokalen Kommunikationskanal hervor, der nicht"
    },
    "unclear-it-administration-responsibilities": {
      "title": "Unklare Verantwortlichkeiten in der IT-Administration",
      "description": "Die Administration von IT-Systemen umfasst vielfältige Aufgaben über verschiedene Komponenten und Bereiche hinweg. ",
      "impact": "Ein Mangel an klar definierten administrativen Verantwortlichkeiten kann alle drei Schutzziele der Informationssicherheit direkt gefährden. ",
      "asvs": "BSI IT-Grundschutz OPS.1.1.2 Administration von IT-Systemen",
      "action": "Administratorrollen und -verantwortlichkeiten klar definieren und dokumentieren",
      "mitigation": "Erstellen Sie ein umfassendes Konzept für die Administration von IT-Systemen. ",
      "check": "Gibt es ein dokumentiertes Konzept für die IT-Administration? Sind die Verantwortlichkeiten für alle administrativen Aufgaben klar zugewiesen? ",
      "detectionLogic": "Dieses Risiko wird durch die Analyse des Umfangs und der Verteilung administrativer Rollen innerhalb des Modells identifiziert. ",
      "riskAssessment": "Die Auswirkung wird durch die höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen der Assets bestimmt, auf die ein Administrator zugreifen kann. ",
      "falsePositives": "Das Modell kann den organisatorischen Kontext nicht vollständig verstehen. "
    },
    "human-error-in-administration-g3.3": {
      "title": "Menschliches Versagen in der IT-Administration (BSI G 3.3)",
      "description": "Menschliches Versagen kann nie vollständig ausgeschlossen werden und kann in der IT-Administration weitreichende Folgen haben. Die leistungsstarken Werkzeuge, die für die Administration verwendet werden, ermöglichen umfangreiche Änderungen an IT-Komponenten mit minimalem Aufwand. Je nach Fehler können alle Informationssicherheitsziele (Vertraulichkeit, Integrität und Verfügbarkeit) ernsthaft gefährdet werden. Fehler sind besonders wahrscheinlich beim Multitasking – zum Beispiel, wenn verschiedene Eingabefenster oder Konsolenausgaben verwechselt werden – was zu unbeabsichtigten Operationen auf kritischen Systemen führt.",
      "impact": "Ein administrativer Fehler kann die Vertraulichkeit, Integrität oder Verfügbarkeit betroffener IT-Komponenten direkt gefährden. Dies kann zu Systemausfällen (Denial-of-Service), Datenbeschädigung oder -verlust (Integritätsverletzungen) oder unbefugter Datenpreisgabe (Vertraulichkeitsverletzungen) führen, was zu erheblichen Betriebsstörungen und Geschäftsschäden führt.",
      "asvs": "Abgeleitet von der BSI IT-Grundschutz-Gefährdung G 3.3 ",
      "action": "Robuste Change-Management-, Automatisierungs- und Betriebsverfahren implementieren",
      "mitigation": "Verwenden Sie die ",
      "check": "Gibt es einen formalen Change-Management-Prozess? Werden kritische Änderungen von einer zweiten Person überprüft (Vier-Augen-Prinzip)? Werden administrative Aktionen protokolliert und überprüft? Verwenden Administratoren gehärtete, dedizierte Umgebungen für ihre Aufgaben? Werden Konfigurationsänderungen nach Möglichkeit über automatisierte, getestete Pipelines bereitgestellt?",
      "detectionLogic": "Dieses organisatorische Risiko wird auf technische Assets angewendet, die typischerweise von Administratoren verwaltet werden und für das System kritisch sind.",
      "riskAssessment": "Die Wahrscheinlichkeit eines Fehlers ist hoch, wenn manuelle Änderungen häufig sind und prozedurale Kontrollen wie das Vier-Augen-Prinzip oder automatisierte Bereitstellungspipelines fehlen. Die Auswirkung steht in direktem Zusammenhang mit der CIA-Bewertung des Assets und der von ihm verarbeiteten oder gespeicherten Daten. Ein Fehler bei einer missionskritischen Datenbank ist weitaus schwerwiegender als bei einem nicht-produktiven Testserver.",
      "falsePositives": "Das Modell kann die Existenz oder Wirksamkeit organisatorischer Verfahren wie das Vier-Augen-Prinzip, die Qualität der Administratorschulung oder die Robustheit eines Change-Management-Prozesses nicht überprüfen. Dieses Risiko sollte durch Überprüfung der Organisation validiert werden."
    },
    "disruption-by-authorized-administration": {
      "title": "Störung durch autorisierte IT-Administration",
      "description": "Auch wenn IT-Administrationsaktivitäten fehlerfrei durchgeführt werden, können sie die Institution dennoch stören.",
      "impact": "Das Nichteinhalten ordnungsgemäßer administrativer Verfahren (wie Wartungsfenster) oder unvorhergesehene Folgen administrativer Änderungen können die Verfügbarkeit kritischer Systeme und Geschäftsprozesse direkt beeinträchtigen. Dies kann zu Dienstausfällen, finanziellen Verlusten und reduzierter Betriebskapazität führen. In einigen Fällen können fehlerhafte Änderungen auch die Datenintegrität beeinträchtigen oder zukünftige Wartungs- und Wiederherstellungsbemühungen behindern.",
      "asvs": "BSI IT-Grundschutz OPS.1.1.5 Regelkonforme Administration & OPS.1.1.3 Patch- und Änderungsmanagement",
      "action": "Strenge Änderungsmanagement- und Administrationsverfahren etablieren und durchsetzen",
      "mitigation": "Implementieren Sie einen formalen Änderungsmanagementprozess für alle administrativen Aktivitäten. Definieren, kommunizieren und erzwingen Sie strenge Wartungsfenster für Produktionssysteme. ",
      "check": "Gibt es einen formalen Änderungsmanagementprozess? Sind Wartungsfenster definiert und werden sie durchgesetzt? Werden administrative Änderungen vor der Bereitstellung in der Produktion getestet? Gibt es dokumentierte Rollback-Verfahren?",
      "detectionLogic": "Dieses Risiko wird für technische Assets ausgelöst, die wahrscheinlich häufigen und kritischen administrativen Aufgaben unterliegen. Dies wird durch die Identifizierung von Assets bestimmt, die: ",
      "riskAssessment": "Die Auswirkung leitet sich direkt aus der Verfügbarkeitsanforderung des technischen Assets ab. Ein ",
      "falsePositives": "Dieses Risiko beschreibt ein potenzielles Versagen in einem organisatorischen Prozess (Änderungsmanagement). Ein Modell kann die Qualität einer Organisation nicht überprüfen."
    },
    "insufficient-documentation-ops1.1.a7": {
      "title": "Ungenügende Dokumentation (BSI OPS.1.1.A7)",
      "description": "Die Dokumentation kann unzureichend sein, wenn Informationen über IT-Komponenten (z. B. Konfigurationen oder Zugriffsrechte) nicht oder unvollständig erfasst werden. ",
      "impact": "Ungenügende Dokumentation kann zu Fehlkonfigurationen oder allgemein fehlerhafter IT-Administration führen, was alle Informationssicherheitsziele (Vertraulichkeit, Integrität, Verfügbarkeit) erheblich gefährden kann. ",
      "asvs": "BSI IT-Grundschutz Baustein OPS.1.1.A7 (Dokumentation des IT-Betriebs)",
      "action": "Umfassende Systemdokumentation erstellen und pflegen",
      "mitigation": "Implementieren Sie einen formalen Prozess zur Erstellung und Pflege der Dokumentation für alle kritischen IT-Systeme, einschließlich Konfigurationsdetails, Netzwerkdiagrammen, Zugriffskontrolllisten und Betriebsverfahren. ",
      "check": "Gibt es einen dokumentierten Prozess für die Systemdokumentation? Ist die Dokumentation für kritische Systeme vollständig, korrekt und aktuell? Ist die Dokumentation für autorisiertes Personal, insbesondere im Notfall, leicht zugänglich?",
      "detectionLogic": "Dieses organisatorische Risiko wird für technische Assets ausgelöst, die kundenspezifisch entwickelt wurden (wo die Dokumentation oft vernachlässigt wird) oder eine hohe Verfügbarkeitsanforderung haben (wo ein Mangel an Dokumentation die Reaktion auf Vorfälle und die Wiederherstellungszeiten erheblich beeinträchtigt).",
      "riskAssessment": "Die Wahrscheinlichkeit wird als ",
      "falsePositives": "Dieses Risiko basiert auf Heuristiken (kundenspezifisch entwickelt, hohe Verfügbarkeit) und kann ein False Positive sein, wenn eine Organisation trotz dieser Indikatoren außergewöhnlich disziplinierte Dokumentationspraktiken hat. Die Überprüfung erfordert die Prüfung der tatsächlichen Dokumentationsprozesse und -qualität."
    },
    "excessive-administrative-permissions-orp4": {
      "title": "Übermäßige administrative Berechtigungen (BSI ORP.4)",
      "description": "Übermäßig weitreichende administrative Berechtigungen können für Sabotage oder Informationsbeschaffung ausgenutzt werden, was dann als Ausgangspunkt für weitere Angriffe dienen kann. ",
      "impact": "Der Missbrauch übermäßiger administrativer Rechte oder des beibehaltenen Zugriffs durch ehemalige Administratoren kann zu Systemsabotage, Datendiebstahl, unbefugten Konfigurationsänderungen und einer weitreichenden Kompromittierung der IT-Landschaft führen, was sich direkt auf Vertraulichkeit, Integrität und Verfügbarkeit auswirkt.",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.4 (Identitäts- und Zugriffsmanagement), insbesondere Anforderungen wie ORP.4.A6 (Vergabe von Zugriffsrechten) und ORP.4.A17 (Schutz von privilegierten Konten).",
      "action": "Das Prinzip der geringsten Rechte (PoLP) und ein robustes Identitätslebenszyklus-Management durchsetzen",
      "mitigation": "Setzen Sie das Prinzip der geringsten Rechte für alle administrativen Konten strikt durch und gewähren Sie nur die minimalen Berechtigungen, die für die zugewiesenen Aufgaben erforderlich sind. ",
      "check": "Werden administrative Berechtigungen regelmäßig überprüft? Wird das Prinzip der geringsten Rechte nachweislich durchgesetzt? ",
      "detectionLogic": "Dieses Risiko wird für jedes technische Asset ausgelöst, das eine administrative Funktion darstellt (identifiziert durch ",
      "riskAssessment": "Die Auswirkung dieses Risikos ist direkt proportional zu den höchsten Vertraulichkeits-, Integritäts- und Verfügbarkeitsanforderungen aller vom administrativen Baustein verwalteten Assets. ",
      "falsePositives": "Das Modell identifiziert korrekt eine administrative Funktion. Ein False Positive kann auftreten, wenn in der Realität die Berechtigungen bereits streng nach PoLP begrenzt sind und robuste Offboarding-Prozesse vorhanden sind. Dies kann nicht allein durch das Modell überprüft werden und erfordert eine organisatorische Bewertung."
    },
    "insufficiently-secured-administrative-access": {
      "title": "Ungenügend gesicherter administrativer Zugang",
      "description": "Administrative Zugangspunkte können sensible Informationen wie Systemdokumentationen oder Konfigurationen von IT-Systemen preisgeben. ",
      "impact": "Über den anfänglichen Verlust der Vertraulichkeit hinaus kann ein kompromittierter administrativer Zugang genutzt werden, um Systeme und Daten zu manipulieren oder um weitere, umfangreichere Angriffe zu starten, ",
      "asvs": "Abgeleitet von BSI IT-Grundschutz-Prinzipien. Dies steht im Einklang mit den OWASP ASVS V2 (Authentifizierungs-Verifikationsanforderungen), insbesondere V2.2.1 (MFA für hochwertige Konten) und V7 (Zugriffskontrolle).",
      "action": "Administrative Zugangskanäle sichern",
      "mitigation": "Stellen Sie sicher, dass alle für administrative Zwecke genutzten Kommunikationsverbindungen robust gesichert sind. Dies umfasst die Verwendung stark verschlüsselter Protokolle (z. B. HTTPS, SSH, RDP mit TLS), ",
      "check": "Verwenden alle administrativen Kommunikationsverbindungen verschlüsselte Protokolle? Erzwingen sie eine starke Authentifizierung (idealerweise MFA)? Sind sie durch Netzwerkkontrollen wie VPNs oder IP-Filter geschützt, wenn sie Netzwerkgrenzen überschreiten? Ist die Autorisierung nach dem Prinzip der geringsten Rechte beschränkt?",
      "detectionLogic": "Diese Regel inspiziert alle Kommunikationsverbindungen, die als administrativ identifiziert wurden (entweder durch ",
      "riskAssessment": "Die Wahrscheinlichkeit wird durch die spezifischen gefundenen Schwächen bestimmt; ein Mangel an Verschlüsselung oder Authentifizierung wird als sehr wahrscheinlich ausgenutzt angesehen. ",
      "falsePositives": "Eine Verbindung könnte durch kompensierende Kontrollen, die nicht im Modell erfasst sind, als sicher angesehen werden, wie z. B. durch ein physisch isoliertes und gesichertes Netzwerksegment."
    },
    "insufficient-redundancy-of-admin-knowledge-bsi": {
      "title": "Ungenügende Redundanz des Administratorwissens (BSI-abgeleitet)",
      "description": "Wenn das notwendige Wissen für die IT-Administration nicht redundant beim Personal vorhanden ist, ",
      "impact": "Die primäre Auswirkung betrifft die Verfügbarkeit von IT-Systemen, da Ausfälle nicht rechtzeitig behoben werden können. ",
      "asvs": "BSI IT-Grundschutz: ORP.2.A5 (Regelungen zur Vertretung), CON.1.A11 (Definition von Vertretungsregeln), NET.3.1.A9 (Betriebsdokumentationen), NET.3.1.A22 (Notfallvorsorge).",
      "action": "Vertretungsregeln für Administratoren festlegen und dokumentieren; überprüfen, ob Vertreter ohne den primären Administrator handeln können.",
      "mitigation": "Definieren und dokumentieren Sie klare Vertretungsregeln für alle administrativen Rollen. Stellen Sie sicher, dass designierte Vertreter ",
      "check": "Sind primäre und stellvertretende Administratoren für alle kritischen Systeme (insb. Router/Switches) definiert? Gibt es aktuelle Dokumentationen für alle administrativen Verfahren? ",
      "detectionLogic": "Wird für jedes in-scope technische Asset ausgelöst, das mit einer administrativen Rolle getaggt ist (siehe SupportedTags) ",
      "riskAssessment": "Die Auswirkung leitet sich von den Verfügbarkeits- und Integritätsanforderungen des Assets ab: missionskritisch impliziert sehr hohe Auswirkungen. ",
      "falsePositives": "Ein Risiko kann als False Positive gekennzeichnet werden, wenn robuste, unternehmensweite Vertretungsrichtlinien vorhanden sind, aber nicht explizit "
    },
    "staff-shortage-administrators": {
      "title": "Personalmangel bei Administratoren",
      "description": "Ein Mangel an administrativem Personal, sei es durch unzureichende Planung, Überlastung oder externe Faktoren wie eine Pandemie, kann verhindern, dass notwendige administrative Aufgaben rechtzeitig erledigt werden. ",
      "impact": "Wenn administrative Aufgaben aufgrund von Personalmangel vernachlässigt oder falsch ausgeführt werden, können kritische Sicherheitslücken ungepatcht bleiben, Fehlkonfigurationen auftreten und die Systemverfügbarkeit beeinträchtigt werden. ",
      "asvs": "Abgeleitet vom BSI IT-Grundschutz-Baustein ORP.2 (Personal), insbesondere ORP.2.A1 (Personalbedarfsanalyse) und ORP.2.A5 (Vertretungsregelungen).",
      "action": "Ausreichende Personalbesetzung, Cross-Training und Notfallplanung für Administratoren sicherstellen",
      "mitigation": "Implementieren Sie eine robuste Personal- und Ressourcenplanung für administrative Rollen, um eine angemessene Personalbesetzung sicherzustellen. ",
      "check": "Gibt es einen dokumentierten Prozess zur Personalkapazitätsplanung für die IT-Administration? Sind Vertretungsregeln für kritische Administratoren definiert, dokumentiert und getestet? ",
      "detectionLogic": "Dies ist ein organisatorisches Risiko, das schwer automatisch zu erkennen ist. Sein potenzieller Einfluss kann jedoch durch die Identifizierung der kritischen technischen Assets, die von Administratoren verwaltet werden, hervorgehoben werden. ",
      "riskAssessment": "Die Wahrscheinlichkeit ist HOCH, wenn ein Personalmangel ein bekanntes organisatorisches Problem ist oder wenn es keine formale Kapazitätsplanung oder Vertretungsregeln gibt. ",
      "falsePositives": "Dieses Risiko wird auf der Grundlage des Vorhandenseins eines administrativen Rollen-Tags auf einem technischen Asset ausgelöst. Es überprüft nicht die tatsächliche Personalstärke des verantwortlichen Teams. "
    },
    "inadequately-secured-admin-tools-bsi": {
      "title": "Ungenügend gesicherte Administrationswerkzeuge (BSI)",
      "description": "Administrationswerkzeuge gewähren weitreichenden Zugriff auf eine Institution",
      "impact": "Wenn ein Angreifer Zugang zu einem unzureichend gesicherten Administrationswerkzeug oder einer Arbeitsstation erlangt, kann er weitreichende Privilegien erhalten. Diese Privilegien können für verschiedene Angriffe missbraucht werden, was die Vertraulichkeit, Integrität und Verfügbarkeit aller verwalteten Systeme gefährdet. Dies kann zu Datenschutzverletzungen, systemweiter Kompromittierung und erheblicher Störung des Geschäftsbetriebs führen.",
      "asvs": "Abgeleitet von BSI IT-Grundschutz-Prinzipien wie Netzwerktrennung (NET.1.1) und sichere Administration (bezogen auf SYS.1.2, SYS.1.3). Das Kernkonzept ist die Verwendung einer dedizierten, gehärteten Umgebung für privilegierten Zugriff (z. B. eine Privileged Access Workstation - PAW). @BSI_ID: SYS.1.6.A5 (Beispiel: Secure Administrative Workstation).",
      "action": "Administrative Umgebungen isolieren",
      "mitigation": "Stellen Sie eine strikte Trennung zwischen administrativen und nicht-administrativen Umgebungen sicher. Verwenden Sie dedizierte und gehärtete administrative Arbeitsstationen (Privileged Access Workstations - PAWs) oder sichere virtuelle Umgebungen für alle administrativen Aufgaben. Diese administrativen Umgebungen dürfen nicht für allgemeine Aktivitäten wie E-Mail, Webbrowsing oder die Verwendung von Bürosoftware genutzt werden. Erzwingen Sie Multi-Faktor-Authentifizierung, starke Zugriffskontrollen und eine umfassende Protokollierung für alle Zugriffe auf und von administrativen Werkzeugen und Arbeitsstationen.",
      "check": "Werden administrative Aufgaben von dedizierten, gehärteten Systemen aus durchgeführt, die vom allgemeinen Benutzernetzwerk isoliert sind? Werden die für die Administration verwendeten Werkzeuge (z. B. SSH-Clients, RDP-Clients) auch für nicht-administrative Aufgaben auf derselben Maschine verwendet? Gibt es eine Richtlinie für Privileged Access Workstations (PAWs)?",
      "detectionLogic": "Diese Regel identifiziert technische Assets, die für administrative Zwecke verwendet werden (z. B. unter Verwendung von SSH oder anderen DevOps-Protokollen zur Verwaltung von Backend-Systemen), während sie gleichzeitig für allgemeine, nicht-administrative Zwecke verwendet werden (z. B. als Desktop/Browser oder mit Verbindungen zum Internet). Diese fehlende Trennung schafft ein erhebliches Risiko.",
      "riskAssessment": "Die Wahrscheinlichkeit einer Ausnutzung wird als hoch angesehen, da Allzweck-Arbeitsstationen häufig von Malware angegriffen werden. Die Auswirkung wird durch die höchste Sensitivität (CIA-Bewertung) der von der unsicheren Arbeitsstation aus verwalteten Systeme bestimmt. Eine Kompromittierung der Arbeitsstation kann zu einer vollständigen Kompromittierung aller verwalteten Systeme führen.",
      "falsePositives": "Ein Modell könnte eine einzelne "
    }
  }
}
